{"scores":{"Spring '14":{"course_score":{"overall":"3.30","workload":"2.70","difficulty":"3.30","recommendation":"3.30","enrollment":"156","response rate":"82.69","QCourseOverall":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"9","2s":"22","3s":"42","4s":"39","5s":"17"},"QDifficulty":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"3","2s":"18","3s":"55","4s":"40","5s":"11"},"QWorkload":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"3","2s":"57","3s":"45","4s":"17","5s":"5"}},"instructor_scores":[{"number":"PHYSCI 11","cat_num":"24022","course_id":"543","year":"2013","term":"2","id":"2ae95f610c94885f8c640e9e2ee6cf30","first":" Lu","last":"Wang","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.50"},{"number":"PHYSCI 11","cat_num":"24022","course_id":"543","year":"2013","term":"2","id":"5f54e8708840989bc525ae860c6bd6a8","first":" James G.","last":"Anderson","InstructorOverall":"2.90","EffectiveLecturesorPresentations":"2.50","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.30"},{"number":"PHYSCI 11","cat_num":"24022","course_id":"543","year":"2013","term":"2","id":"6752a1cf1553e62728467d662882ff7e","first":" Gregory","last":"Tucci","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.40"},{"number":"PHYSCI 11","cat_num":"24022","course_id":"543","year":"2013","term":"2","id":"f369191bcf9b551997d9f04f2eaee95c","first":" Sirinya","last":"Matchacheep","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"3.50","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Spring '13":{"course_score":{"overall":"3.46","workload":"2.40","difficulty":"3.19","recommendation":"3.60","enrollment":"270","response rate":"92.59","QCourseOverall":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"9","2s":"22","3s":"42","4s":"39","5s":"17"},"QDifficulty":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"3","2s":"18","3s":"55","4s":"40","5s":"11"},"QWorkload":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"3","2s":"57","3s":"45","4s":"17","5s":"5"}},"instructor_scores":[{"number":"PHYSCI 11","cat_num":"24022","course_id":"543","year":"2012","term":"2","id":"5f54e8708840989bc525ae860c6bd6a8","first":" James G.","last":"Anderson","InstructorOverall":"3.02","EffectiveLecturesorPresentations":"2.56","AccessibleOutsideClass":"3.97","GeneratesEnthusiasm":"3.78","FacilitatesDiscussionEncouragesParticipation":"3.49","GivesUsefulFeedback":"3.52","ReturnsAssignmentsinTimelyFashion":"3.62"},{"number":"PHYSCI 11","cat_num":"24022","course_id":"543","year":"2012","term":"2","id":"6752a1cf1553e62728467d662882ff7e","first":" Gregory","last":"Tucci","InstructorOverall":"4.52","EffectiveLecturesorPresentations":"4.64","AccessibleOutsideClass":"4.48","GeneratesEnthusiasm":"4.51","FacilitatesDiscussionEncouragesParticipation":"4.23","GivesUsefulFeedback":"4.24","ReturnsAssignmentsinTimelyFashion":"4.24"}]},"Spring '12":{"course_score":{"overall":"3.85","workload":"2.27","difficulty":"2.90","recommendation":"4.03","enrollment":"112","response rate":"91.96","QCourseOverall":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"9","2s":"22","3s":"42","4s":"39","5s":"17"},"QDifficulty":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"3","2s":"18","3s":"55","4s":"40","5s":"11"},"QWorkload":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"3","2s":"57","3s":"45","4s":"17","5s":"5"}},"instructor_scores":[{"number":"PHYSCI 11","cat_num":"24022","course_id":"543","year":"2011","term":"2","id":"5f54e8708840989bc525ae860c6bd6a8","first":"James G.","last":"Anderson","InstructorOverall":"3.65","EffectiveLecturesorPresentations":"3.10","AccessibleOutsideClass":"4.43","GeneratesEnthusiasm":"4.24","FacilitatesDiscussionEncouragesParticipation":"4.02","GivesUsefulFeedback":"3.82","ReturnsAssignmentsinTimelyFashion":"4.29"},{"number":"PHYSCI 11","cat_num":"24022","course_id":"543","year":"2011","term":"2","id":"6752a1cf1553e62728467d662882ff7e","first":"Gregory","last":"Tucci","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.78","AccessibleOutsideClass":"4.74","GeneratesEnthusiasm":"4.68","FacilitatesDiscussionEncouragesParticipation":"4.53","GivesUsefulFeedback":"4.56","ReturnsAssignmentsinTimelyFashion":"4.62"}]}},"comments":{"Spring '12":{"comments":["This course is a great alternative to PS1. The teaching is much better (both lecturers and TFs), and the class was enjoyable and laid back. The exams are fair and the material interesting and worth-knowing. The weaving together of the material with global contexts was very nice and made us see how what we were learning was applicable outside of Harvard. Overall, great job to all of the people involved in this course! My only suggestion is to form study groups because the problem sets range from easy to very time-consuming. And get Katherine as a TF - she is amazing!","This class requires very little work, but that also means you don't learn too much. Problem sets aren't always directly related to lectures, and the textbook is sometimes hard to follow. This is a good class to take for those not too interested in physical science, but not for those who want to delve deeper.","Class could be hard at times, but the whole teaching staff seems to genuinely want everyone to do well and is willing to do whatever it takes to make that happen. Exams were pretty tough.","Great class with awesome professors who are willing to put in as much time as needed to help students learn. Also, they manage to make the physics\/chem interesting.","The lectures aren't very useful, so going to section is crucial. The labs are fun but also informative. The book isn't always helpful; Wikipedia does a better job of explaining most of the topics more clearly. Tucci's lectures are more informative, so you'll definitely want to go when he's teaching.","I don't think this is a class for science people. It places much more emphasis on facts for politicians, social scientists and so on, rather than doing actual science. A lot of equations are just given without proof. It also deals a lot with number instead of equations.","Definitely take this class instead of PS1! Everyone I know had a much better experience in PS11 than in PS1! The class just felt a lot more personal because of the class size. Furthermore, it was so much more interesting to learn about science in the context of real life problems. Professor Tucci is just an amazing lecturer, and Professor Anderson is hilarious. They both came across as really dedicated and they were open to criticism throughout the entire semester. They improved lots of things within the few weeks of class, and I have no doubt they will continue to strive to improve this class in the future. This was the first year this course was given so, understandably, things did not go as smoothly as they do in classes that have been given several years.","PS 11 was wonderful. It put all material we learned into a more real-world context, and I got a much broader understanding of how the universe works. It's advertised as more difficult than PS 1, which it probably is, but it's made easier by the quality teaching, the awesome material, and the more laid-back attitude. But, prepare to be challenged.","Like many in this class, I was deciding between taking PS 1 and PS 11. Thank god I chose PS 11. I spent the whole semester hearing kids complain about how poorly taught and annoying and unfair and blah blah blah PS 1 was. In the mean time, I felt like I understood the material in PS 11 very well (which is really the same material). So for me, there is no comparison between the two courses. Tucci and Anderson are great lecturers and people. You won't regret taking this class.","This is probably as good a class as you'll find for fulfilling your physical chemistry requirement for either your major or pre-med. It's easily much better than PS1 (both as far as grading and teaching goes), so unless you really love organometallics (Chem 40), this is the class for you. It's not perfect (it could have been much better organized), but it's interesting, the professors are entertaining and friendly, and overall it's a painless way to fulfill your requirements.","It was a bit rough around the edges, probably just because it was the first time the class was taught","I cannot think of one reason not to take this class. Even if you aren't a science concentrator I would take this class. This class also gives you the same credit that you get from PS1 and they meet at the same time so you have to decide between one or the other. TAKE PS 11 over PS 1. If you ask about the difference between the two classes it does not seem significant at all but besides the difference that the professors will tell you in whatever advising sessions you go to the difference is that PS 11 is a much better course. The professors are better, the class size is better, the environment is better, and the material is presented in a more interesting way than in PS 1.","This was a really interesting course that was made so much better by how clearly Professor Anderson and Professor Tucci were invested in their students' learning. They are both so helpful and friendly--use their office hours!","This course is excellent--taught by really kind, supportive professors who care that their students do well. You will always have help if you ask for it and the material is more interesting than your typical PS1 class.","This class will teach you about the fundamentals of chemistry and how they relate to concepts in physics, but it will also allow you to engage those fundamental concepts with the frontiers of modern energy development and consumption.","I would recommend this class in the future even though my experience with it wasn't fantastic.  I think next year will be MUCH better than this year because many of the kinks will have been solved.  The class is taught by great and committed professors who care very much about the quality of teaching.  Unfortunately, the class was quite disorganized and the materials were not great.  However, the material that the class attempts to cover is very interesting and is a great alternative to the generic PS1.  I would recommend this class, hoping that some serious changes are enacted.","PS 11 was great! The material was taught as case studies with real-world applications. The two professors are a great balance. Tucci makes the material clear and Anderson applies physics and chemistry to interesting political and scientific problems. The teaching staff overall was very committed to making the experience positive for every student. My TF was very poor, but there were always other people to go to. It would have been helpful to have the Sunday night help sessions for p sets, which were tough, but overall I would highly recommend this course over larger, less personal pre-med courses.","If you can get through the course organization and bureaucracy, you will get a pretty good introduction to chemistry and how it relates to global energy issues.","The course did not seem very well put together this year, but I know that the professors will take feedback very seriously to improve the course, so I would expect next year's version of the course will be better.","This is a fantastic class!  TAKE THIS INSTEAD OF PS1.  The professors (Tucci and Anderson) are fantastic professors who care about you, want to meet you, get to know you, mentor you, and write you recommendation letters!  :D  This is a very well taught course, does not feel like the usual pre-med weeder class...","Great professors, very fair exams.","This semester was PS11's first time being offered, so there were some bumps along the way, though it was a pretty good class overall. I felt that many of the lectures involved Dr. Anderson going over complicated derivations of different quantum mechanics equations that, while interesting, were ultimately not useful at all. And because so much time was going over that (and facts and figures about the current state of the energy industry), we didn't cover the actual problem-solving concepts as well. Both Dr. Anderson and Dr. Tucci are super-dedicated to helping the students, so I think that next year the course material will improve.","Psets are frustrating because they don't go over everything in lecture.\r\nTucci is a great lecturer but Anderson sidetracks a lot.\r\nThe instructors advertise the course as a special class that will open your eyes to the global state of everything.  However, their idea of doing this tends to revolve around memorizing global consumption numbers.  I think it has a lot of potential, but I wouldn't take it until some changes have been made in organization.","I took it in it's first year.  It had a few kinks, like some problem sets had questions that did not follow class material, and we spent too long at the very beginning of the course discussing why the course solved flaws in academia.  But overall, I'm glad I took it in lieu of PS1.","Sometimes hard to keep up with disorganization and difficult with unrelated tangents.","Have fun!","Wastes a lot of time teaching things that are cool but are not intro chemistry (global energy stuff, specific case studies and applications). I am coming out of this course with much less knowledge of chemistry than I would have liked. I had a hard time focusing on the class when I knew that 90% of lecture would not be spent on the actual material that we needed to know for the homework, the tests, and future classes, ie the stuff that is usually in a freshman chemistry class. I did enjoy the other stuff we learned, but wish I could have had a different experience in an intro chemistry class.","This class is much better than PS1","I really enjoyed this course, but be aware that it takes a lot of time out of your week. The psets took very long to complete, and the readings were time intensive as well.","Some parts of this class feel like a waste of time, but the problem sets and exams are extremely manageable and the labs are cool","I decided to switch out of PS1 after the first week to this course.  Best decision I could've made.  The instructors are so helpful and receptive to student needs.  Plus having a take home final was a gift!  The teaching staff was just so supportive.  From what I have heard it may be a little more challenging than PS1, but the course in general makes it so worth it!  I feel like I came out of the class knowing more than just chemistry and physics... I came out with a better understanding about the social, political, and global frameworks surrounding energy consumption.","You cover a lot of material. True. But you don't cover it well, and nothing is rigorously treated. The class is new so there's still a lot of kinks to be worked out. The topics covered don't seem to be linked very well. Because of this, there's really not much to long term take away from the course.","Dr. Tucci is great and goes over material very well with a good balance of concept vs examples. Dr. Anderson however spends too much time going over energy\/concepts","It gets much harder about a month in.","I would definitely take this course if you have to choose between this and PS1, but I would not take this course if you aren't required to take one of the two.","This class is an excellent continuation of a foundation in chemistry following LPSA. The concepts are difficult, but explained so that they are easily understood. You do not need an extensive background in chemistry, although it does help. Professor Anderson is fantastic, and you will be very fortunate to take a course from him.","Admittedly, PS11 is a new class, so maybe things will change next year. That said, I found PS11 extremely unhelpful and I'm probably going to spend this summer learning all the material on my own. Lectures tend to be disproportionately focused on mathematical derivations of formulas -- information which will never help on a single graded question -- and discussion of global applications. The global application questions are always simple calculations that require only basic math skills to solve, so half of the lecture is extremely difficult to understand and unhelpful while the other half is inordinately easy and unhelpful.\r\nOn the positive side, labs are fairly interesting (and graded easily) and section was really helpful -- Corey was a great TF. But labs don't teach you anything you need to know in the rest of the class, so section is really the only place you're learning stuff that will affect your grade. And it's hard to learn the material yourself, as the text is pretty dry and you have to wade through lots of unhelpful material to find the few helpful sections.\r\nIf you do take the class, my strongest advice would be to go to section and office hours -- in particular, talking to my TF after section was incredibly useful and the best thing I did all year.\r\nPS -- Professor Tucci's lectures are really really good, and a perfect mix of clear concepts and problem-solving application. But they're really rare; though Tucci is amazing, Anderson teaches most of the course.","The professors and teaching staff REALLY want you to learn the material and to have a good introduction to science, they care a lot about the class. Lecture is more about the applications of the science you learn in section, the readings and the psets. Take home midterms and finals!!! PS1 may be a tiny bit easier, but this is better taught and a better choice, and you will probably do better in it.","DO NOT TAKE PS1. This class is FAR better in terms of what you will learn from it. Also the professors have a way of calming your stresses about grades in this course. You will have the wonderful opportunity to learn from case studies about real world energy problems and solutions. Jim and Gregg are a wonderfully dynamic duo and care so so much about the class and their students. I had such a great experience in this class and I hope others will too!","For me it was very badly taught (except for Tucci, he's a boss). It's easy if you took Chem AP, otherwise it'll be difficult because they don't teach very well.","Way better than ps 11..... 85% is an a. Take home final.  Great tfs. Great professors. Office hours are good, small class.","This class was great at connecting the material to real world applications.  The actual material was occasionally presented in a convoluted manner and psets and tests often included poorly written questions and material that was not fully covered.  However, the periphery information was really interesting (eg how solar cells work, how fuel cells work, global energy data).  In another year or so as this course because more organized it could really turn out to be a gem.","Make sure you have some sort of physics background. It doesn't say on the course website that a physics background is necessary, but it definitely helps.","If you remember a lot of AP chem, this class will be a breeze.","So, you're probably asking yourself: \"PS1 or PS11\"? Well, I've got an answer for you: PS11. Here's the deal: as a sophomore in the course, all of my friends had gone through PS1 last year and thought it was okay...and it is okay--just okay. They learn things at a reasonable pace and don't go very in depth, BUT the grading curve is as hard as any. This means you work really hard, understand EVERYTHING, because it isn't so hard to understand, and still do poorly grade-wise. PS11 is the exact opposite: the material was way over my head, half the time I never felt like I could get through a pset or practice problems, and I struggled more learning this than I ever have here at Harvard (Chemistry\/Physics is NOT my strongest suite), BUT the professors really love teaching you the material and they LOVE the material itself, so they WANT you to learn and do well. In the end, I learned more in PS11 than in any other class, and even though it was very very difficult for me, in the end I was virtually tutoring friends in Ps1 and ended up with such an amazing foundation in chemistry and physics. Take Ps11, because even though it is harder, it is better-taught and more rewarding in the end. Also, it's a new course, so it will only get better!","It's basically an intro Chem class and the stuff they teach isn't too hard to grasp. However, I feel that Prof. Anderson's lectures overloaded the course with way too many \"globally relevant\" facts that I was often so busy cramming\/looking up that I didn't really have time to sit back and observe their significance. He was enthusiastic though. Prof. Tucci is an excellent lecturer, and his lectures usually contain the really concrete pure-Chem information.","If you need to take PS1, take this class instead! You will learn the same material, but in a smaller class and with a focus on climate change and global energy. You will not only learn about chemistry, but also leave the class able to explain why electric cars are better than gasoline-powered cars even if they are not powered by renewable energy, or why a heat pump is more efficient than burning gas for heat, or which countries control the world's fossil fuel reserves. Jim Anderson's passion about global energy is contagious, and Tucci is a really great professor as well. The dynamic between them is really funny. This is not a very hard class, and if you put the effort in you will be rewarded with a good grade.","Pretty manageable class. Basically a more advance form of AP Chem with way more emphasis on Quantum Mechanics (Which I liked). The application of these principles was particularly enlightening.","this class is still working out the kinks.  we were behind schedule all the time, the textbook is too long, and the textbook is written at a higher level than what is expected in class. the bright side of this is that tests and assignments are easy","This class is fairly easy and very well-taught. Definitely take PS11 over PS1. It fulfills the same requirements and all my friends who took PS1 wished they had taken PS11 by the end of the year.","It's a great course for those who're looking to take more chemistry. It's the fundamentals to everything. Best for freshmen who've done AP chem and AP physics. Do take it if you're looking into Chem17\/20 or Chem161\/Physics143a.","The professors are hilarious and engaging, but Anderson can be hard to follow.  The assignments are great, and the lectures are online.  It's a much more interesting class than one that just teaches the material--this one teaches the material and integrates it into a global viewpoint.","The class is pretty fun and you will find yourself learning quite a bit about how chemistry and  physics is actually used in the world around us. Jim and Greg have great philosophies on teaching and so you will find the class is not terribly difficult but rather meant to engage students and get them to actually care to learn the material rather than learn it simply for an exam.","I really enjoyed this class and think that it will only improve with time. The material we cover is quite interesting and it is great how we are able to apply it to real world problems.","This a great class to take if you want to understand the applications of chemistry.","it's not much work","This is a great class if you're interested in knowing the science behind going green.  It also does a great job at exposing the costs of our current environmental policies.","This class has a lot of potential, but since we were the first year, they still have to work a lot of the kinks out. Make sure you learn how to solve problems in section. The lectures are usually really bad for conceptual knowledge - try to read through the textbook on schedule, even though it's pretty dense.","the material is really interesting, but the course rambles forward in a sort of random way","When faced with the decision to take PS1 or PS11, here are the reasons you should take PS11:\r\n-Tucci and Anderson are super nice, accessible, and genuinely want you to learn the material\r\n-The class is smaller, so you will feel more comfortable answering questions. \r\n-The class also has a cool-sounding environmental focus. This turns out to detract somewhat because Professor Anderson tends to break out from discussing quantum mechanics or acids and bases and instead chooses to have you calculate the ration of US fuel consumption to Chinese fuel consumption\r\n-The class has a slightly wider margin for an A \/ A-\r\n-There is no need to buy a textbook AND Tucci and Anderson wrote the textbook for the class\r\n-The class meets all the same requirements as PS1 and runs through the same syllabus.\r\n-The final is take home (that's a plus \/ minus though)","It is worth a try.","A great alternative to PS1.  It fulfills the same requirement and is a lot less stressful!  Also, if you are afraid that you won't be learning the same level of chemistry as PS1'ers, don't be.  I know from friends who took PS1 that we learned al the same material.","This was the first year of the course, so there were bound to be some bumps. But just judging on this first year; Professor Tucci is fantastic. He gives great lectures, is enthusiastic, and fits a lot of information into one hour. Professor Anderson is very knowledgeable and quite cool, but he is not a good teacher. We spent most off is classes going over concepts from the previous classes, and we were always rushing to get through the important topics in the lsat 5 minutes of class. The case studies and applicability of what we learn is worthwhile, and then pedagogy behind the course (emphasis on learning, not testing) is how it should be.","Great course and professors!","Really awesome, maybe a little harder than PS1 but the two take home exams we got made it less stressful and guaranteed a good grade.  Take it over PS1, better professors and a lot more interesting","TAKE HOME FINAL AND MIDTERM Enough said. Th PSets arent bad either.","The professors in this class are so understanding of the fact that you probably have a ton of work to do aside from this one, which made the class much easier to bear despite the difficulty of the material. If you're looking for a painless way to satisfy a chem requirement, take this class!!","If you didn't take AP Chem or AP Physics in high school, stay away from this course - take PS1 instead. I made the foolish mistake of doing so, and it killed me. Certainly, I enjoyed the curriculum, but it was extremely difficult to keep up and learn at the rate that everyone else was acquiring information, as I had a lot of catching up to do.","Get the psets done as soon as possible, just in case you have questions.","Professors Anderson and Tucci are the most passionate people about their subject that you could find. Because it was the first year offering this course, it was a bit disorganized, but I think this will fix itself in the future, because the professors are so open to suggestions, which is fantastic. I was really glad to see application of principles to real-life phenomena in energy (which is Professor Anderson's specialty), because it's so relevant today, but the means by which the professors approached this was sometimes frustrating - memorizing statistics, etc. Then again, I do think that internalizing those statistics has given me a sense of scale regarding this field. I do recommend this class over something like PS 1, because its relatively limited size (100 vs. 300+) and enthusiastic professors mean that the experience is less frustrating than it could otherwise be, and I only expect this course to get better over time.","Great alternative to PS1. Tucci and Anderson have been the best science professors I have had at Harvard. The entire teaching staff works to make the class as fair and accessible as possible."]},"Spring '13":{"comments":["Take PS1 instead.","Awesome class. Tucci and Anderson are great, and I had an awesome TF. Some of the quantum for the class was confusing but for the most part, as long as you work hard, you'll be fine.","I would recommend it over PS1. But beware that just because the final is a take-home, does not mean it isn't difficult. I was told that it would take 8-16 hours, but it probably took closer to 20 especially if you want to check your answers.","PS10 might be a more interesting class if you've already taken AP Chemistry; it's actually a pretty easy class if you have, and it focuses a bit too much on the application side of things rather than actually learning straight up chemistry.","You will spend weeks learning about the Carnot cycle and exit the class unable to explain what a Carnot cycle is.","I honestly don't know whether this class or PS1 is a better option for satisfying a general chemistry requirement, but I had some issues with this class overall.  The lectures were generally not very useful or interesting, problems sets were often really hard, and the whole \"globally relevant calculations\" aspect of this course, while a good idea in theory, was poorly implemented.  This class goes into significantly greater detail on certain topics such as quantum mechanics and theories of bonding than PS1, so be prepared for that if you take this class.  PS11 also seems to have a much more generous curve than PS1, so that is a consideration as well when you're deciding which one to take.","For pre-med requirements, I needed to take either PS11 or PS1, and it seems as though the PS11 staff are really trying to help you do well, and they make it relatively easy on you (lots of A's).  That said, the lectures were not the most interesting, and Anderson is not very good at explaining\/covering relevant topics in lecture.  Tucci was great though.","PS11 overall was a solid course and from what I have heard a good alternative to PS1. It is a very doable class, especially if you take advantage of office hours when you do not understand material and for help on psets. Before exams just make sure to do all the practice problems. Also, they say the take home final exam will only take 6 hours, but it really required much more time to complete this so be prepared and keep your schedule open during the time you have to work on it.","The applications are interesting, but the class was very poorly organized. Lectures got behind schedule and didn't always cover everything they needed to, chapters were posted late, and answers on the practice tests were sometimes wrong.","I really hated this class. I took it because Greg Tucci taught part of it (and he was great, as always), however, the connections to \"Real World\" concepts were really confusing, and Professor Anderson DOESN'T MAKE ANY SENSE. When he lectures, many people just don't attend class, or spend the class period looking up concepts and teaching themselves the material instead. I'm sure Anderson is a smart guy, he just cannot teach. I would NOT recommend this class-- stick to PS1.","Take this class, don't be worried, Your chem knowledge will be solidified.","I think I would've preferred PS 1 - I hear there's more structure in that course. By the time I wanted to, it was too late, as their first midterm is relatively soon.","PS11 is the alternative to PS1 for many students. It is still a difficult course. The problem sets are challenging and the global calculations involve a type of thinking that most classes do not teach. The book is very good and is written just for this course.","It's a little unconventional but great at the same time.","You will learn, the three midterms aren't bad, the take-home final can take more time than expected, but the resources provided will allow you to learn much without the pressures that come with the other science classes here. That said, you still have to work to do well, and working with others for the psets is definitely advisable.","This course would have been better if the textbook readings were more focused and less lengthy. The material itself is not too difficult as long as you can keep up with the course, the readings, and the lectures. However sometimes lectures can be unfocused as well. While it's nice to have a take home final, it does take more effort since the final is very long.","I am very glad that I took Physical Sciences 11 instead of PS1.  I found it quite pleasant and refreshing to take a freshman introductory science course that did not have the overt goal of weeding out premed students.  Lecture, section, and problem-solving section were all effective; problems sets do not take an inordinate amount of time to complete, so you can gain a more thorough understanding of the material and have time to focus on your other courses; and, most importantly, exams are fair: they test your knowledge of what has been taught in class.  Pre-lab assignments gave a good understanding of what would happen in lab, so most labs ran smoothly (although some labs did not align with lecture and section material).  I think having taken honors and\/or AP chemistry in high school was important for this course, but do not feel that you can't succeed without that experience.  Overall, PS11 was one of the best courses (and certainly the best science course) of my freshman year.","You need to have taken AP chem","The course is a lot of work, but you learn a lot of information","If you've taken AP Chem, this class won't be too hard and has some good new concepts to offer you. The global calculations felt sort of random in the context of the material, and while I think this is a great idea, this should be improved upon in future years. The teaching staff, overall, is great; Professor Anderson is very hard to understand and lectures on material that flew WAY over everyone's head. The final exam was WAY too long; honestly, if you think you are going to have a very busy reading week, it may be worth considering this class twice.","PS11 is probably the most painless way to fulfill the inorganic chemistry requirement for pre-med. The class is very straightforward, and general chemistry concepts are consciously applied to real global issues. The material can be interesting at times and dry at others, but overall the class was informative and insightful.","If you have taken AP Chem, this course (and any other intro Chem course at Harvard) will probably be fairly easy for you. Don't let this affect your performance! Go to lecture, crush all your psets and exams, and walk away with that solid A.","Great pre-med class to take to fulfill chemistry. The professors were a lot of fun, and the material is interesting and informative. They teach it well, and you definitely have an opportunity to succeed.","This course is a great alternative to PS1. Labs go pretty quickly. Lectures are entertaining as Anderson and Tucci are both incredibly personable and intelligent. TFs can make a difference in how much work you have to do outside of the course so be sure to try to get a good TF.","Having chemistry at the AP level will greatly benefit students in this course. While most chemistry topics were covered clearly and explained well in Professor Tucci's lectures, some complicated topics--boning theories, for instance-were \"skimmed\" over and not fully explained to those who had never seem them before. \r\nThe course is solid, and doe not require that much outside work. The material is a bit dry, however, and the integration with global energy or other problems or innovations was not as exciting or relevant or even easy to understand as the course initially indicated.","Although it's not that well organized, this course definitely seems better than PS1. Tucci is awesome and so are the TFs and overall it's not too painful of a premed requirement.","You need to learn how to do problems and go to every section","Take PS1 unless you are genuinely interested in the globally relevant aspects of this course or are very strong in chemistry.","This class was really large this year compared to last year and I think they struggled a bit with organization.  Great teaching staff.  Professor Anderson and Tucci are fantastic!  Labs usually didn't take 3 hours.  Take advantage of office hours.  Meet with your TFs.","Take home final; from what I've heard, a much better class than PS1 so for those who need to take one of the two, PS11 should be the way to go. Anderson and Tucci are also great!","The course is easy to follow. Neither the material nor the work load are overwhelming. Sometimes the lectures get off track, and there's more focus on global energy issues than the foundational material. If you're considering taking the MCAT, though, the course covers everything you need.","Class is really fascinating but moves very fast and lectures are sometimes difficult to follow. However, the essentials of what you need to know for exams are covered well in section, so use lecture to probe big questions (the \"global\" part of the class). Really puts chemistry and physics in perspective of how they can be used in the real world. Good way to fulfill SPU requirement!","You should come in with a chem background and find a good study group!","Ask questions, take advantage of office hours.  The problems are probably more important than the readings, but you should still know the theory. Also, \"control F\" will save you if the readings are still online next year.","This has been by far my favorite class at Harvard! Professors, lectures, and all materials are engaging and exciting!","Only take this course if you have to for a pre-med requirement. I like the idea of the class, but the execution was not the same.","The idea behind the class is fantastic: mixing chemistry and some physics to understand how they really are one in the same and that together they can be used to solve large application problems from environmental issues to energy. However, lectures aren't always very organized and effective because they sometimes focus on the global piece and on derivations of equations and ideas more than how to use them (section because very useful in learning how to actually use everything); this is more with the physics based parts but the chemistry based parts of the class are extremely well taught. Also, exams aren't usually very difficult but if they do a take home again, this year it took SO long so do not wait until the last day to start it.","It's great! They really try hard to make you do well and help resources are everywhere.","This course is good, but take it with the purpose of taking it because you like the way it is taught. They use case studies and real world applications throughout the entire course. Because of Q scores last year I think a lot of people who were not interested in the actual course material took it and it ruined the feel of the class and how people viewed it. For engineering or applied sciences people this is the course to take! Beware that the lectures sometimes do not prepare you for the task at hand and reading the book is nearly necessary!","It's cool to learn about modern applications in addition to getting a solid foundation in chem.","Need to work hard because psets don't match with conceptual understanding at all.","Take this class. Professor Tucci and Anderson are amazing.","Take this class before Orgo! Take this class over PS1!!! You will be so happy that you chose this class for so many reasons. Anderson and Tucci are great! Go to office hours, just for the experience and because there is no way you won't do well if you do! This class makes quantum mechanics seem easy! The staff make it so easy to learn such difficult material. This class is an awesome intro to chem and great way to fulfill a concentration\/pre-med requirement.","This class is great because it has a global component (i.e. climate change, energy, etc.) So you will learn a lot about how the chemistry dictates these processes. Nice twist and unique from PS 1.","Be prepared to learn about a great deal of material in section as opposed to lectures.","This class is great. I took it as a medical school and concentration requirement. I ended up learning a great deal about the application of physics to alternative energy and the future wellbeing of the planet.","Just stay on top of the material from by reading the summary in the textbooks and going to the problem solving sessions. Reach out to your TF if you need help.","While I would certainly recommend this course over PS1; however, students with a desire to get more out of the course than just their pre-med requirement fulfilled might want to take Chem40, or another chemistry course, as this course was disorganized and taught in such a way that it encouraged short term learning over deep understanding.\r\nWhile the course wasn't overly difficult, it was frustrating at times.","This class is interesting, but it can be difficult to figure out what material you are going to be tested on. The book can be a little confusing, as it is not a general chemistry textbook, but written specifically for this class. Lecture was generally helpful, though Professor Tucci's lectures were generally more clear than Professor Anderson's. Both professors are very nice and approachable.","This is a very interesting class, but it can get pretty tough.  The grading is very fair, and they give you many chances to get your grade up.","This class covers very interesting material, but if you're looking for engaging lectures or useful explanations, think twice.","If you have taken AP or IB chemistry and\/or organic chemistry, expect the majority of this class to be review. If you're looking for an easier chem class to take to fill in your semester or want to breeze through a premed requirement, then this is the class for you. If you want to challenge yourself to learn new concepts or theory in chemistry, I'd recommend trying to skip into a higher class.","James Anderson is a pretty boring lecturer and you won't learn much from him. Greg Tucci is effective. Not much too this course. Labs are boring. Plug and chug problems. Not a great course.","Be prepared to have very little resources available to learn the material in this class.  Lectures are terrible, after the first week of Professor Anderson lecturing we were already over a week behind and I remember a lecture on \"electrochemistry\" where we just went over everything from the first week of class again.  The textbook is very difficult to understand and learn from and there is an extremely limited amount of practice problems.  My saving grace was section, however I know many people that had terrible TFs and did not even have that resource.  Unless you already know the material that you will learn, don't take this class.","Lectures definitely need improving, DEFINITELY...however, on all other counts, the course is definitely doable and also one of the very few FAIR Harvard pre-med requirements.","Kids take this class just cause the grading was easy. If you are taking it because you think it will be more advanced or go into greater depth than PS1, you're mistaken.","This class doesn't require AP chemistry as a prerequisite.  As long as you go to lecture, section, and problem solving lectures you will be able to understand the material.  Labs tend to be fun and never take the full three hours allotted for them.","Anderson loves to ramble but Tucci is a god walking amongst mere mortals. Take your pick honestly. It's a good course and it's difficult material in some respects so may be hard to grasp at times.","Great introduction to chemistry! I highly recommend it. If you have an AP Chem background, you are almost guaranteed an A if you do the required work.","To do well in this course, do the work, take your time on the psets, and go to office hours to get help with some of the concepts that you don't understand. Doing all of this will really help ensure that you will do fine.","From what I have heard, it is a better class than PS1 and will give you a little extra knowledge without being too much more difficult than PS1.","Take this over ps1. Take home final and next year it will be due during finals period to give mire","Lectures are pretty unhelpful, book is terribly written, rely on google and section to learn material","Take PS11 over PS1! It's much more applicable and Tucci is amazing. The midterms aren't bad at all and the take home final is a blessing.","You don't have to spend too much time but be prepared to struggle on at least  one or two concepts despite AP Chem","I was debating between this class and PS1, and I could not figure out a good way to tell the difference. I still don't know what PS1 is like, but DEFINITELY TAKE IT OVER THIS CLASS.","The grading scale is very good, and it is a chill way to fulfill a pre-med requirement. Take-home final!!","This class is fantastic!  It has been one of my favorite classes at Harvard!  Professor Tucci is amazing!  Anytime you have an opportunity to take a class from him, I highly recommend it!  Learning the material can be a struggle at first but the faculty does a fantastic job on making sure it becomes concrete.  You will leave this class with a solid foundation in chemistry.  The best thing I liked about this class was the depth in which Quantum Mechanics was explored.  This class goes a lot more in depth behind the concepts and theories that are briefly addressed in AP Chemistry.  For me personally, chemistry made a lot more sense after this course because I began to understand the actual mechanisms behind and purpose for certain equations and ideas in chemistry.  Overall, fantastic course!","Pretty good general chemistry course. Make sure to take it seriously all the way through till the end of the semester","It is a refreshing style of teaching chemistry, the faculty and fellows are very wonderful, understanding, caring, and fair people. And you will come out more knowledgable about the connections between chemistry and very pertinent topics in other aspects of the US and world. You will also leave the class wanting to by a Tesla Model S.","This is a very good class. Though sometimes lecture theory material will go over your head, it turns out that the only material you need to know for tests is what you go over in problem sets and section problems, so you know exactly what you need to practice.","Until this course is improved, I think you may be better served taking PS 1 instead. It seems fine at first, but once they get into the actual material lectures become a pain and psets irritating. Labs are generally fine as they usually allow for all work to be done in the 3 hour time-span.","The class requires a fair amount of time, and sometimes feels tedious or irrelevant. However, you can do well if you study for the midterms, and the take-home final certainly helps. Some of the lecture material is interesting for a global perspective, Anderson's experiments are always fun, and Greg Tucci is fantastic.","james anderson blows shit up","Read the textbook, as painful as that is","Tucci is a fantastic lecturer; take the course so you can learn from him. The final is take home, but don't let that delude you into thinking that it's going to be easy. Overall, if you have a great TF this couse can be enjoyable and it's not too difficult, especially if you have taken AP Chem. For pre-meds, definitely take this course over PS1.","In this course an 85 is an A. Very helpful.","PS1 and PS11 seem to switching back and forth as far as which one is better. For '13-'14 school year, shop PS1 I think it's going to be a lot better. Not a great class. If you've taken AP Chem and LPSA this class is very easy but still frustrating because they don't teach what is on the psets sometimes. \r\n\r\nALSO DONT TAKE WITH CHEM 27. Or else you will have all 3 midterms for both classes on the same days!!","This class was the biggest waste of time in my life. Material was an insult to my knowledge as everything was basically covered in AP Chemistry. Teachers were nice but also clueless. Everything about this class sucked.","The course is not very well structures and Prof. Anderson's lectures are unhelpful and redundant. The practical application of course material is very interesting and helpful, however. Prof. Tucci is a great lecturer! There was a major blunder with the take-home exam, which left me somewhat disappointed overall with the accountability and commitment of course staff and professors.","pretty painless way to fulfill chemistry premed requirement","This class is not well taught and not curved. If you want to do well, you better already know the material or be willing to go to office hours a lot. If you have another option, do it. This class sucks.","If you have to take PS1, PS10, or PS11, take PS11. It will be the least painful and it is not curved so you won't have to worry about competing with all of the crazy freshman pre-meds.","It is a REALLY interesting class, but readings are so long. Lectures are not particularly helpful, unless Tucci is teaching.","This course does a great job defining the relevance of basic chemistry and physics, on macroscopic and microscopic scales, to current global issues in energy efficiency, global warming, etc. Tucci give AWESOME, clear lectures. Anderson provides the global backdrop for the material. An interesting class overall.","the most stress-free premed class you'll ever take; don't miss out","Take it over PS1. The beginning is going to make you think you chose the wrong one, but stick with it. Once Tucci lectures, you're going to be happy.","If you're not a fan of chem, I wouldn't take it, but it's a great intro course and a much better alternative to PS1.","This class is great. Tucci is an awesome lecturer, and the material was all very relevant. The PSETs are challenging, and the take home test was more difficult than I thought it would be. If you are choosing between this and PS 1, it is really a toss up. This course is more globally relevant whereas PS 1 hammers down the fundamentals.","This class was terrible. I loved chemistry and physics in high school but I hated this class. It's poorly structured and will leave you with gaps in your general chemistry knowledge. (What chemistry class doesn't cover kinetics?) While easy to get through and very possible to get an A, it is not a good class to take if you actually want to learn chemistry. If you have the option to get out of this class, take it. If you have to take this class for pre-med requirements, good luck and get ready for a rough semester.","The Global Calculations part of this course, which is touted as what makes it unique from PS1, is actually the least organized component. I would honestly choose PS1 if you think you can best the PS1 curve. The 85 is an A- for PS11 just isn't worth the struggle of irrelevant problem sets, etc.","To be honest, I don't know what to say yet because in the next few weeks literally 50% of my grade will be determined. Based on how I've done so far I would say it has been harder since I didn't take AP chemistry but I heard people complain about PS1 but I think they curve while this class doesn't. I would say talk to people who know what they got in the class after the semester is over and ask if they got the grade they deserved. I did super well on the first midterm and just ok on the second one. So we'll see how the last midterm and final are.","Take this course, you will love it. It is very easy. Do not take this course if you are an annoying Pre-med, because you will ruin it for kids who are the course out of interest.","This class is very education on both a technical and a global scale.","This class is interesting in that it addresses very in depth chemistry topics that other classes glaze over, like the dynamics of why some atoms prefer a molecular state while others remain as free atoms. I would be prepared to be confused after lecture often, and that section and reading the textbook are really the only way you're going to gain full understanding. Tucci is fantastic, but Anderson's lectures might leave you more confused for a while than before the lecture.","It's what you'd expect from a chemistry class. It's not always straightforward, but give it the time it deserves and you'll get the questions right.","If you took AP Chemistry, this class is good to take.","Although this is primarily a chemistry class, students should understand that this is a relatively demanding course that requires an open mind, familiarity with current events, and a sharp eye to see and fully understand connections between various global calculations and concepts. Though and AP level background in chemistry would definitely be helpful, this course still requires 100% effort throughout the term.","Go to section and do the psets and you'll be perfectly fine for all the tests.","Try to find a team of people to take the course with, so you can collaborate on psets etc. It's useful to have other people to talk to about the course material without having to reach out to teachers all the time. \r\nIt's not as difficult as I originally thought it would be.","the most unorganized class ever. The worst lectures I've ever experienced. Terrible readings.","PS11 and PS1 satisfy most of the same requirements for concentrations and pre-med. This class is very much revolved around \"modern chemistry\" which is really nice because you learn so much about the actual applications of the concepts in addition to understanding the concepts themselves. If you've taken AP Chemistry or the equivalent, this class goes much more in depth and you'll understand better the reasons behind certain concepts you learned only superficially in high school. The professors are also great. They are really passionate about the material and are entertaining lecturers. The class is basically set up for you to do well and as long as you put in the effort to do the problem sets and study for the exams, you'll be able to do well.","This class is an awesome alternative to PS1, which I heard is not that great. The psets for this class are manageable, the tests are predictable, and the labs are relevant and do not happen every week. Anderson can get a little confusing with all the calculations but Tucci is extremely clear in all his lectures. The only difficulty was the take-home, which took over 6 hours to finish.","Not a bad choice; better than PS11. Assignments are totally reasonable and the exams are not impossible by any means. The take home final is a blessing though don't underestimate it.","This is a great course and Dr. Tucci is definitely an amazing professor. Dr. Anderson is one of the sweetest professors at Harvard; however, he can be a little hard to understand at times. The PSETs definitely require some group work, but overall a great course.","If you haven't taken AP chem, DO NOT TAKE THIS COURSE. Take PS1. Don't let the take home final fool you, it was HORRIBLE. The cuoff for an A is an 85, which is good. The material is interesting and you learn a lot, but honestly the course could use some serious improvement. Disorganized\/illegible lecture slides, bad textbook. Psets\/tests are fair. \r\n\r\nHonestly I learned a lot but it was a badly taught course. I don't regret taking it, but if I had to do it again, I would take PS1.","Dr. Tucci is great.","This course is EXCELLENT! Don't listen to the people who have complained a lot about this course. The professors and TFs are very generous in terms of grades. The materials we cover in class and psets may be confusing at first, but the midterms and final are very reflective of the problems we have done, and they make sure that similar problem types are covered before the tests. So as long as you review the section problems, psets, and problem solving sessions, you should be all set for the tests. Cruise along!","Only take it if your chemistry is really strong.","In this course, you cover a number of topics from the macroscopic level, looking at different types of engines and other thermodynamic systems, to the microscopic level, looking at the formation of bonds in molecules. The course also utilizes a number of case studies to supplement the material covered in class. The case studies are definitely interesting, but are not greatly emphasized in the course. The textbook is also a great resource if you are having trouble with the material and I do not feel that enough people took advantage of it.","If you've taken Orgo this class is very easy and gives you some good global perspective that doesn't make it completely tedious. I'd suggest taking higher level classes though.","It's socially relevant and relates scientific knowledge to our world in a way that means something to everyone, particularly given the climatic challenges we now face. Whether you are a pre-med or not (personally I am not one), this is a course that is worth-taking and","there is plenty of grades that go into this, so don't freak out about one assignment!","This class is pretty bad. Lectures are disorganized, slow, tedious, and not really related to the Psets. The idea of the class, an integrated approach to chemistry that involves real world examples, is an excellent one. The execution is terrible. Anderson is not a good lecturer, and is unable to effectively communicate information in a 50 minute class. However, it is pretty easy.","this class still has a few kinks (problem sets were pretty difficult, and problem solving lectures are extremely, painfully slow) but overall I HIGHLY recommend this course. The professors are wonderful, accessible, and engaging; they really care about your success in the class. DEFINITELY go to office hours with the professors. They are extremely caring will take as much time out of their schedule as you need to help you succeed in the course. Lectures are interesting, the labs aren't bad, and you learn a ton of interesting material. Also the professors are very open to critiques of the class, textbook, etc, so if you have a problem with the course talk to the profs about it rather than stewing in bitterness.","PS11 does a satisfactory job trying to link the concepts of physical chemistry with their place in the world.  Tucci is an good lecturer, and the course is not overburdensome if students expect to spend the bulk of their time on the course independently learning material.  It is held back by its focus on 'global questions' and case studies which fail to engage students with academic rigor on the problems of global energy and climate change; this element of the course quickly becomes an exercise in rote memorization and figure-hunting within the textbook.  Lab does not contribute meaningfully to the course material.  Ultimately, PS11 highlights the need for a well-organized and engaging course for students looking for more rigor than PS1, but shy of Chem 40, for filling inorganic or physical chemistry concentration requirements.","It's a pretty solid pre-med class, and would be a good one for freshman to take as one of their first ones in college.  The two hours provided for the midterms, which were supposed to be designed to take an hour, helped reduce stress during them a lot, and the take home final did allow for open notes and being able to do it at your own pace to some extent.  The global questions that are used to try and make the material more relevant to day to day life are a pretty interesting feature and definitely make the class feel more than just a pre-med stepping stone.  However, the quantum mechanics part of the course dragged on a little bit, so be wary of that.  I would also look at it with a little hesitation though  because despite being a pretty good class, three midterms and a final could be seen as a bit much if you aren't taking it because you have to.","This course is not difficult for any science concentrator, but it is pretty boring. If it isn't a requirement I'd find something more interesting.","PS 11 is an alternative to PS1, and although last year's Q-Guide clearly seemed to suggest that PS11 is much better\/easier\/etc than PS1, from what I saw this year with my friends, this is less clear now. I really like the idea behind PS11. The course is supposed to start out from the \"larger\" concepts and move in to quantum mechanics. I also liked the global questions component of the class, although I think the incorporation of these could have been much better. Sections were REALLY helpful, I definitely recommend Mykyta's sections.","I don't have much to go on, but I can't imagine that PS1 is a better option...","THe workload is manageable but some parts of the course are not well-taught.","Do the p-sets and practice problems rather than read the book.","Best part of this course is energy and applications focus. It was great to engage in constant discussion of alternative energy and world energy consumption from a scientific point of view. It is not just theoretical but real life. \r\n\r\nYou learn chemistry but more importantly, you learn about relevant applications.\r\n\r\nThis class also did not curve or focus on grades, which is refreshing.","Prepare yourself to learn how your behaviour affects the entire world.","There are a lot of positive aspects of this course. The professors are very passionate and inspiring. The material can be very interesting, and section is very useful. However, the treatment of globally relevant applications is not well done. It sounds like a really neat aspect of the course but in practice is actually really tedious.","The content is really worth it. If you actually learn what they want you to learn and don't just learn the core concepts, it's totally worth it.","Unless the course becomes more organized and structured, this class is one to avoid.  It does have rather easy homework assignments but it just is a waste of a class block.","REading is necessary; DON'T BE LATE TO LAB; This class goes at a moderate pace, and is manageable.","This was a great class.  It was well taught and had a great staff.  It really got you to think about real problems.  However, the first day was the best day of class.  Not to say that it all went downhill, but it is not as fun as the first day.  Also it is surprisingly easy.","Take this class for a good basic understanding of science in today's world, but not as a gateway to a serious hard science.","Tucci and Anderson are great professors and genuinely care about their students and the material they're teaching. However the class can be frustrating when it seems like lectures focus on very different things than the psets cover, and labs are a waste of time (but that's how i feel about most labs in intro classes).","Know other students who are taking the course who can be helpful resources to you if you do not understand the material","It's not too difficult of a course. The psets are really manageable and the tests are similar to the practice exams.","After spending 8 hours in lecture, lab, and section, it is hard to force yourself to want to read the text book.  The book is actually really helpful though, so I would recommend that.  The take home final was really hard and i think that the course was a lot harder this year in general than it was the first year it was taught.","if you have to take either ps11 or ps1, take ps11. honestly it's just better. I wouldn't consider myself a chem allstar in the slightest, but I've managed well in this class (and the tfs and professors are really, really willing to help you understand the material)","Future PS 11er: This course seems like a nice alternative to PS 1. Am I right? Take home final exam. Not as 'life-sciencey.' Topics overall seem more interesting. I mean hey learn about the causes and consequences of global warming? Global energy crisis? Seems pretty legitimate. And I agree with you. PS 11 does seem more appealing than PS 1. But, here's the thing. Unfortunately it is not taught in the most effective manner. Half of the lectures are interesting and easy to follow, while the other half of the lectures are confusing at best. For that reason, I would strongly discourage you from taking this class, which I feel is a shame because this class has such potential to be great.","Great teaching staff and if you put in the work, you will succeed!","This is a challenging course, but the faculty is fantastic. They are committed to helping students understand the subject material. Be prepared to work hard. It is important that students have a strong interest in physics and chemistry and are prepared to think on a new level about how these concepts relate to global issues.","As long as you go to class and section, you'll be fine. Go to the problem solving lectures and actually read the book if you definitely want to be good. The class is not difficult, and you've most likely seen the material before. The lecturers are pretty good (Tucci is awesome, Anderson is slow and verbose, but you've gotta love him). They are both enthusiastic and really want you to understand\/be able to apply what you learn to everyday life. The labs are fine and the tests\/p-sets and fair. From what I hear it's a lot better than PS1. I had essentially no chem experience in high school and had only taken LPSA a year prior, and I didn't have too much trouble.","This is a great course if they can hammer out some of the kinks. much better than PS 1.","The class is interesting but sometimes hard to follow. It is difficult to figure out where the information for the case studies is, and lecture can make the material seem more complicated than it is. My suggestion is to watch the PSL's and go to section, because these resources are what helped me pass the class.","You should attend the office hours and prepare to spend a lot of time understanding the material if you do not have a strong background in chemistry. The tests are reasonable but the topics can be difficult to understand as the lectures do not cover everything and sometimes are not very helpful.","Definitely take this class over PS1!  The grading scheme is much better in this course (everyone with a grade over an 85 gets an A) and Jim and Gregg are legitimately the kindest professors you will meet here at Harvard.  The lectures can seem to wander sometimes, especially when Jim is teaching about the case studies, but most of the lectures, especially those in the second half of the course, are very interesting and the material will be taught to you in a different light than when you've been taught it before.  The midterms are generally not too bad, and the psets will take a few hours every week (don't start the night before they're due!), but the amount of work per week isn't exceedingly bad.  The final exam is take-home, which in part was nice because we were allowed to use our notes, but it was extremely long, taking me and many of the people I talked to afterwards upwards of 9 hours to complete. That said, it may be shorter in future years, so definitely don't take this class because of that...ultimately it is a WONDERFUL class that I am so glad I took.","This course is a new course and on its way to being an amazing course. There are still some kinks in the class but this course definitely provides a unique perspective on physical sciences. Take this course over PS1 if you've had AP Chem before. Professors and TF's were extremely available outside of class for questions or just to talk.","This class is probably better than PS1. Tucci and Anderson are both really eager to help, and they want students to do well. That's one of the reasons the final is take-home (so nice!). It's a good class, which will definitely overlap with some AP chem, meaning it isn't too stressful. The hardest part for me was the quantum mechanics stuff, but if you're familiar with that the class will be a breeze.","The final take home exam was ridiculously long and tedious.  The rest of the midterms were fairly easy, and overall, the course was graded fairly.  Labs were easy, although sometimes not the most informative\/educational.  I think a lot of how the course goes depends on who your TF is - their review of the lectures can be really helpful.  Its definitely more physics-y than PS1, so be forewarned that the discussion of boning and electron shells gets somewhat mathy.","Lectures were the least useful things ever and on top of that the book is really bad. Be prepared to learn by yourself or ask a crap ton of questions.","Take home final; manageable work; better than ps1 apparently","Make sure that you do the readings.  Everything will make so much more sense if you can take the time to go through the online textbook.","PS11 was such a unique and cool course! You will learn a lot about chemistry, especially the real world modern applications of science. The instructors really love this course and care about the students and are so willing to help anybody who needs any special instruction. I highly recommend this course to students who are considering a degree in the natural sciences.","Anderson does a ton of unnecessary repetition and gets behind on his material. Tucci then catches him up but must do so quickly in such a way that our understanding of the material is ephemeral. Use all the helpful resources they give you to get through this class.","If you must take a general chem course, this is not a bad option. Relatively painless with an interesting focus on global energy and the environment. However, lectures and readings sometimes seemed like a waste of time.","it's a great physical sciences class to take! lots of application, and very interesting","Take it if Anderson isn't teaching anymore. Still take it if he is (especially over PS1), but know that his lectures will be rambling and you'll have to learn the stuff in section.","This class was very well organized, and you learn a lot from all parts of the course, but in particular reading the textbook and going to section were really helpful. I really liked the applications and relevance to the energy problems of today; this was a great introduction to basic chemistry with the context of energy.","Not too time-intensive and appropriate for fulfilling several requirements.","Think carefully as you choose between PS1 and PS11. Both are great, but serve two different types of people. PS11 has many advantages, but you need to be prepared to put up with new-course growing pains and unclarity. However, this is made up for with your relationship with Jim Anderson, who will write you a letter of recommendation simply for being in the course, and the take-home at the end, which is better than having a real-life final IMO. Ps1 is not new at all so they have a lot of these things worked out and the course operates like a well-oiled machine.","It's still a little rough around the edges, but it's a great course. It's not just an alternative to PS 1--you really learn about sustainable development, renewable energy, and climate change issues. You leave the course a more educated citizen.","This class made learning chemistry awesome. Tucci and Anderson are great teachers and really care about teaching. There is no curve to the class, but that means that the tests are very fair. No trickery and no nonsense. Everyone is capable of getting a 100. Seriously. If you're worried about not taking AP Chem in high school, don't be - I didn't and did just fine. Don't even think about the others, take this one.","The course is very fair and the professors are incredibly enthusiastic. The material is clearly presented and easy to comprehend.","If you are deciding between taking PS 1 and PS 11, take this course. It is better taught, the material is better, and the real world applications are phenomenal.","Wait until teaching staff grows to sufficiently address the needs of the student body. \r\nTips on how to survive this course: you may skip lectures, but make sure to watch problem solving sessions! Go to TF office hours for p-sets. You may want to look over p-sets as soon as they are released, but wait until section to actually start working on them (necessary formulas are all listed out during section). Go to Dr. Tucci's and Dr. Anderson's office hours for fun talks about the materials in general. They are super friendly and engaging (though they prefer not to talk about p-set-ish stuff then.)\r\nAlso, Dr. Tucci is an awesome lecturer, but Dr. Anderson had some bad days (especially when trying to teach us about wavefunctions - I am still confused about how important those mathematical formulas actually are!). I hope his lectures improve in the future.","I was very excited to take this course having really enjoyed LPSA the previous semester. I was disappointed. While I enjoyed and learned from Tucci's lectures, Anderson, who lectures for the majority of the course, did not present the course material in an effective way.","Take this class if you have a strong chemistry\/physics background. Don't be fooled-it counts for chemistry but is strongly physics-based. It's great when Tucci's teaching but TERRIBLE when Anderson's teaching it (literally don't go to the last few lectures if you don't have to). He is really, extremely nice and I'm sure he's extremely knowledgeable about global issues but he doesn't really get how to lecture effectively. Take with caution. \r\nThe take-home final sounds nice, but it's actually quite difficult.","I really enjoyed this class.  It was taught really well and the applications were a lot more interesting than I thought they would be.  I would definitely take this over PS1 if you're deciding between the two.","This class is a great way to complete a pre-med requirement; you'll learn about the concepts as well as a number of real-world applications. There are reading quizzes and the chapters can be pretty long, but you don't need to know every single detail. Make sure to read the case studies though, as it won't be fun to have to go through them for problem set answers or rush through them when studying for a test.","The take home exam was very difficult, don't underestimate.","Just keep up with the work and you'll be fine. All concepts are not explained in their entirety, so identifying your problem areas early is key."]},"Spring '14":{"comments":["I was debating between PS11 and PS1, from what I have heard of ps1 I think ps11 is a much better course.","Don't take it. Take PS1 instead of PS11, which teaches more material in the better way. I honestly don't even know why there is a PS11. I was tricked into thinking PS11 would be more challenging, because of its higher number.","It is an amazing class! You learn so much! It was my favorite class this semester and the instructors are all so awesome.","ugh just take PS1","Bear through Anderson's lectures and you will be okay.","If you want to apply chemistry to globally relevant topics, then this might be the class for you. However, you definitely should have an interest in the global applications of the topics because that is a major focus of the course. It is a lot of work, so it will be a much more enjoyable experience if you are legitimately interested in the subject matter. The teaching staff is definitely very passionate about the material and they genuinely want to help you do well, so be sure to take advantage of office hours and the problem solving lectures if you are having trouble with a concept.","If you like cut and dry calculations, you may enjoy this class. However, the lectures are very dull and not engaging at all, especially when Prof. Anderson lectures; his lectures tend to go off on tangents which leave everyone confused. The textbook is no help at all. That said, the exams and problem sets are extremely easy, and it doesn't seem very difficult to do well in the class.","PS11 is branded as the alternative to PS1 for both pre-med students and other science and engineering concentrators given its supposed real-world case studies and different progression through topics.  However, this \"alternative\" proved to be a nightmarish way to get through a general chemistry pre-med requirement.  Professor Anderson, who lectures for the majority of the semester, is brilliant, but is not a good teacher.  His lectures wandered through case studies that, while they may be interesting to read independent of the course, detracted from learning actual chemistry concepts.  On the other hand, Professors Tucci and Matchacheep were captivating and good lecturers.  Regarding assignments, problem sets and exams were fair in terms of expectation and grading.  However, there was a real lack of attention to detail paid to writing the problem sets.  Oftentimes, an email would be sent mid-week explaining an error in a question and expecting students to revise their work.  One time, this severely negatively impacted me as I had already submitted the problem set and had to re-complete an entire problem to re-submit.  The preceptor Dr. Wang appears to care a lot about the students in the course, but it doesn't manifest itself in her actions.\r\n\r\nOverall, I would not recommend PS11.","Great class, the teaching staff is AMAZING!","If you take AP Chemistry, the class should be relatively easy if you aren't too careless on exams and homework. However, that being said, Professor Anderson really likes to include applications to real life, global energy, and other \"global problems.\" I suppose if you enjoy learning about this stuff and doing dimensional analysis and looking up case studies from the textbook, you'll really enjoy the class. Personally, I am more interested in the theoretical aspects of chemistry and did not enjoy these concepts. Lectures can also sometimes be difficult to follow depending on who's teaching, but knowing how to solve the problems from problem sets should be mostly sufficient.","If you are interested in learning chemistry, but don't want to take the plunge with Chem 20, I would say this is the course for you. I don't know very much about PS1, but was happy with this class.","The work is super manageable, and you'll learn a few more things than you learned in your high school chemistry course. You also learn a bit about energy and its relevance, but if you're not interested in that you might find it a bit boring or irrelevant.","The core teaching staff is great. They make it possible to get through this course and learn the material well with or without the chemistry background.","Anderson's lectures are hard to follow, and the global calculations are annoying, but really talk to your TF to reinforce information. Tucci is also available all the time to help you.","I chose PS11 over PS1 because I heard that PS11 applied concepts more closely to the real world. I liked these applications. They helped me understand the material better. It was more similar to the way I had learned science in high school. I also liked the take-home exam. It was not unreasonably long, and it gave me a chance to think carefully about my responses and check over my answers.","If Professor Anderson is still teaching, do yourself a favor and don't take this course. I feel like I didn't really learn anything from the class. Material that I had seen before in AP Chem was just made more confusing by his lectures, and material that I hadn't seen before was just confusing.","Even though this is a classic pre-med requirement, its still very interesting and the professors are great.  Most of all, it is graded fairly and your input will equal the output","If you are interested in chemistry and have a strong background, then this could be a good course for you however, I would still be hesitant to recommend it. The lectures are not very effective in teaching the material so the problem sets and exams can be pretty tough. If you don't have a strong chemistry background, I would not recommend you take this course.","Lots of annoying work, but probably better than PS1 because of how it is applied to the world, making it less about the mechanics of chemistry and more about the applications of chemistry to real world issues.","If you have a real interest in science and its role in major issues of the world, this is a great course for giving you a very broad, shallow understanding.","Although the teaching staff were very nice and accommodating, the heavy emphasis on hunting through the textbook for figures and numbers that students realistically won't remember after the course made this class feel like it a huge waste of time. And although Professor Anderson is very enthusiastic about the topic, I honestly learned almost nothing from his lectures. Only Lu's weekly reviews were quite well structured and informative. I took this class thinking that using PS1 to count for inorganic chem would be a cop out as I came in with a good chem and physics background and I am a junior, but looking back, I regret it as PS11 was one of my most unpleasant experiences this semester to put it mildly.","Prof. Anderson, though he seems knowledgeable, was not effective at making lectures engaging. Oftentimes I wasn't too sure what he was talking about in lecture. Somewhat monotone. And used a somewhat complex vocabulary that didn't communicate that well with an audience struggling to learn his material.","Overall it's a good class. The lectures aren't always very useful, but the psets are much more helpful in prepping for the exams. Also, the global calculations can be pretty annoying, but it's something you probably just have to put up with.\r\nThe psets are much harder some weeks than others, and you never really know when that's going to be the case, so I recommend at least looking at it before Thursday night so you know when to start working on it.","I would definitely recommend this course over the other option PS1. Though it may be a bit more difficult for someone who had very little chemistry background it was definitely doable!","Take this course over PS1.  Don't let the first week scare you.  I took LPSa before this class, and still got an A.  So did the homies (and they're not so bright).","Try not to take it if Anderson is still teaching it. Honestly, it was difficult to understand his rants and really the 50 global questions were a total waste of time.","This course is more difficult than your standard introductory chemistry course. The psets also require a lot of time to complete as well, but they are manageable to do. This being a large lecture course, the lectures are a bit dry except for when Tucci lectures. The course also emphasizes a set of global calculations that I found to be poorly integrated into lectures and the course material. Also note that there are 3 midterms for this course in addition to a final. And even though the final is a take home final you should not underestimate it because it takes a long to time to complete and the questions are just as hard as regular midterm questions. But I would still recommend this course for people who feel comfortable in chemistry because it is still possible to do well in this course.","This course is okay. I don't consider myself a strong science person but I was able to do fairly well with some pain along the way. Problem sets are pretty long and definitely require some office hours and collaboration. There are three exams (one on the last week of classes) which cause some anxiety but don't end up being that bad, especially because the professors allow you to bring a review sheet with you. I did not hear of very many good TFs in this class, but the preceptor, Lu, is so sweet. Anderson's lectures are rough--he rambles a lot and does problems without showing calculations so it's hard to know where his values come from. As the year goes on you will pay less and less attention. Tucci is really enthusiastic and better. Professor Matchacheep is so sweet! Nevertheless most of the lectures to me were a blur but through psets, labs, and Lu's reviews I was able to figure things out. There were only six labs total and the ones toward the end were pretty short and not painful. I also found them effective and beneficial in understanding some of the material. The textbook reading is really long and confusing to follow at times but, again, you will be able to get by without having to feel like you really read and understood it all.","You really can't go wrong with this course, so take it! I have never taken a class that was able to tackle modern and global challenges like this class. When we solve a chemistry problem, we aren't just making up obscure facts that don't mean anything; rather, we would solve chemically how Cambridge treats its water or how the Harvard science center conserves energy through the revolving doors. There is a huge level of applicability to this class, and it has made me really interested in climate change and energy resource management. I feel like I can apply the concepts that I learned in this class to solve questions of global perspective. \r\n\r\nThe only frustrating aspect of this course was that it was a little heavy toward the end of the week. Psets are due Friday, you often don't learn all necessary material until Wednesday's lecture, and section is on Thursday, so it is kind of a mad dash to finish the psets on Thursday night. They aren't overly hard, just keep in mind when choosing your classes not to take too many classes with psets due Friday. \r\n\r\nThe teaching staff is pretty great overall. Professor Anderson can sometimes go off on tangents and get a little too excited about derivations, but it is an honor to work with such a famous name in climate science and atmospheric chemistry. And Dr. Wang and Professor Tucci do a wonderful job of setting up this class so that it is enjoyable for the students.","Some of the lectures are a bit boring and the global calculations will seem annoying. But stick with it and you will probably do fine.","This class literally disillusioned me regarding my relationship with science, and I will proceed from PS11 with caution and with a tightly-clutched hope that other science courses will not be this way. Though I feel like I struggled this semester, I feel like the material covered was basic and that I learned nothing new, and that my struggles revolved entirely around useless grunt work.","Very interesting with a lot of real world application","Anderson is not the best lecturer and this class requires you to put in a lot of time. Not sure if it was worth it in the end.","If you have taken AP chem you'll be fine. The take home final may seem like it's an incentive to take this class, but it has a third midterm exam on the last day of classes. Also, the class gets impossibly boring after add-drop. Be careful what you are getting yourself into. One plus is that 85% is an A-\/A so you have a bit of wiggle room.","If you're a pre-med who wants to learn chemistry for the MCAT, I wouldn't recommend this course. This course required us to apply a lot of chemistry globally, not necessarily at the molecular level. Nevertheless, you work hard, you get good grades.","When Anderson lectures, I hope you already knew the material. Lu's review sessions are great and lab is fun. Don't take PS11 unless you have to.","Take this class if you'd like to learn some chemistry.","I would like to give future students an insight to this terrible class with a letter that I will not send to the professor whom I trusted who encouraged me to take it:\r\n\r\nDear Dr. Tucci,\r\n\r\nI didn't mention this during any of our meetings and I don't think I will even when I walk past your office in the future, but I'd just like to say that I am angry with you. I am disappointed that you, perhaps in order to prevent insulting your mentor and co-worker, encouraged me to take PS11 though you knew the awful quality of Anderson's teaching, the textbook, and the course in general, and most importantly, my background in chemistry. After all, you were the one who taught me in LPSA, a class that \"assumes no prior knowledge of chemistry,\" which was also a lie (so I guess one can say shame on me for letting you fool me twice). I was an eager freshman who looked to your advice, naively trusting his enthusiastic chemistry professor. I'd like you to think twice before letting the same sad fate happen to your future students. I cannot say that I gained anything from PS11 other than the fact that Anderson is a terrible person and you cannot be trusted. During the two times during the entire semester that you taught (once right before the 5 week mark so as not to lose students to PS1 and the second several weeks ago when we were very much demoralized by your lack of response to the fact that Anderson was getting us absolutely nowhere), I hope you noticed how students no longer saw you as a professor passionate about chemistry but one who would passively sit through the confusing lectures and despite our pitifully confused expressions did not lift a finger to stop Anderson's atrocities. I have been told repeatedly not to base the chemistry at Harvard from my experience in PS11, but it's hard, you see, because you are the Chemistry Concentration Advisor who recommended to me a class that resulted in tearful nights, tortuous \"lectures,\" and endless hours of frustration. Please show your students some decency and get rid of this class.","I came into this class with high expectations - it had received high Q scores before, and I was excited to explore the real world applications of chemistry concepts as advertised. However, I found most of the lectures to be far from engaging and the material to be 90% a rehash of AP Chemistry, though taught with less clarity and more busy work, with reading quizzes on two separate websites, clicker questions, and labs on top of psets. Greg Tucci was a fantastic lecturer and my TF was absolutely amazing, but Tucci lectures less than half of the time. The labs were also almost all repeats of AP Chemistry (and sometimes triple repeats after LS1a too). Furthermore, on midterms and the final, we were responsible for knowing 50 globally \"relevant\" calculations that used data from random sources to calculate the efficiency of cars, for example, or the solar power potential of the US, which seemed interesting at first but ultimately turned into wild goose chases for the correct numbers and failed to impact me long-term on real world approximations about these energy concepts. Overall, for people who enjoyed AP Chem, the course was easy but unfulfilling, and for people without lots of previous chemistry background, the course was confusingly taught and stressful throughout the semester (three midterms and a take-home final).","This class is a lot of work, but you definitely learn a lot. There is a lot of reading, but lectures are good and interesting.","great course!","The course was great. Period. I truly enjoyed the implications of what we learned. We weren't merely learning science for science's sake. We learned so that we can solve world issues.","The teaching staff is really supportive! I think if you want a challenge, you should take this course, and the teaching staff will be willing to help along the way.","Consider taking PS1, the midterms sound much easier.","The problem sets are long.","Interesting class, not too much work, good teaching staff and lectures.","It's a very good class. It can be difficult at times, but the class is structured in a way to ensure that you will do well. Professors are more concerned with you learning well than getting a good grade.","I am now more confident in my chemistry background, and maybe even more confident in my global energy demand background.  (Sometimes there was unnecessary time spent doing global calculations.)","PS11 was a solid physical chemistry course that most will take as a requirement. The material is basically a rehash of AP Chemistry with some depth added to it. Lectures and the textbook are honestly useless if Anderson are teaching because he tends to ramble on and make absolutely no sense. The other lecturers are okay, but most of your learning will happen in section or the problem sessions (which are run by Lu and are great). PS1 or PS11? Honestly, it's up to you although a lot of people who do start off in PS11 end up dropping back to PS1 though the material is pretty much the same.","PS11 does a good job of teaching you foundational chemistry. If you took AP Chem, you may find yourself relearning a lot of concepts you already know, but there is also a lot of material that you haven't learned yet. The teaching staff is very accessible and helpful.","Sometimes not as advertise, globally useful though","This class is exceptionally well-run.","While the reputation is that it is similar to AP Chemistry, some parts are but some parts aren't. Be ware of the global calculations.","I started out in PS1 and switched to PS11, which I feel overall was a good decision.  I feel like I learned the concepts more in depth than my peers in PS1, and was able to more easily apply them to real world issues.  Make sure to stay on top of lectures and start problem sets early because they are quite difficult.  Also, the best part of this course is most definitely the teaching staff who are more than willing to help you! Use them!! Lu Wang especially is an amazing instructor and will clear up any questions you may have.","Might as well take ps1","PS 11 covers a lot of really good material, but is not an easy class. Great for learning more about the many intricacies of chemistry and physics and the relationship between the two.","A great class. Make sure to keep all your notes, psets, and labs, because they help to study from for midterms and the final.","Its great but tough.","Find a different general chemistry course if you have taken AP chemistry. The global calculations seem interesting but are really a matter of simple math and can be explored on one's own. The class is arranged in a bureaucratic, frustrating manner.","The lecturers were good and try to incorporate a more global view, although that pursuit is not very successfully. The material and global view are pretty separate, and for a pre-med especially PS1 may be better.","PS1 is probably easier and teaches you just as much of what you need to know so take it since it is less work and better professors.","The class is a bit unorganized at first, but it gets progressively better through the semester. The professors are all engaged and clearly care about the students- Anderson maybe isn't the best lecturer every, but it's clear he wants you to do well (also his lectures always have the most fun demonstrations). The take home final is a huge plus because it's so much less stressful, and the grading system is such that an 85 is an A-, so you can worry less about your grade and focus more on actually learning- you do learn a lot. Overall, it is an interesting and relatively painless course.","This class if very much a solid course. It will give you a nice foundation in chemistry without breaking your back.","While Anderson's rants can get very frustrating, this class really has character. If you just care about fulfilling a pre-med chem requirement, take PS1. If you want a slightly more in-depth understanding of the same basic chemistry concepts and are willing to put up with Anderson's annoying tangents about global energy issues, then take PS11.","I really enjoyed the material and lectures.","PS11 is not that great but it's much better than PS1 and if you need one of the two you're better off taking PS11. Lecture can be pretty boring at times, but it's good in the sense that the exams really reflect what you've seen in class; there's nothing on the tests that's harder than what you've done in PSETs or lab and oftentimes the problems are easier. Lu is an amazing preceptor and Dr. Tucci is awesome and they definitely make the course worthwhile.","Make sure to find a good pset group!  The questions can be very confusing sometimes but work it out with friends.  Midterms are always easier than psets, so don't freak out too much.  I will say having a good section TF can be very very helpful - mine didn't really teach that well so I ended up not going much if ever.  Anderson is really smart but unfortunately I think doesn't realize that most of what he's saying doesn't make sense to most people.  I didn't really get much out of lecture but the clicker grade is really important, so just go and do other stuff.  If Tucci or Matchacheep are lecturing, pay attention!  They make concepts very clear and understandable and its great.","DO NOT TAKE THIS CLASS. PS11 was a total waste of my time - I could have definitely gotten another Gen Ed out of the way and spent less time and gotten more out of it. The PSETS are sometimes so hard because Prof Anderson does not explain the material in the class well. You learn nothing from the Case Studies (they are absolutely pointless). Do not come into this class thinking that you will get an extension of the material learned in AP Chem because you won't and if you come into this class without having taken AP Chem, do not expect to learn the material well because they don't teach it. Prof Tucci is the only professor that generates real enthusiasm for the material being taught and the only one that actually cared about teaching the mechanics of chemistry. Prof Anderson is a brilliant person and his achievements are amazing, but Harvard really has to learn to differentiate between someone that is smart and someone that can TEACH.","Brace yourself... Jim Anderson is the worst lecturer I have ever had. This course has the potential to be good but it's destroyed by his horrible teaching and awful textbook (which he wrote). The psets and exams are manageable if you can get around all the stuff Anderson messes up for you and if they actually give you the information you need. That said, the other teaching staff members are good, so just rely on Tucci and you'll make it! Grading is fairly easy so it makes up a little for the horror that is Jim Anderson.","This was my least favorite Pre-Med class. I took it over PS1 thinking it would be better and more interesting because it has applications to real-world. However, this class was so poorly organized and bad at teaching students, that it made it a frustrating class all semester. \r\nI have taken AP Chem, LS1a, and Chem 17\/27, and taken the MCATs, and I was still confused by the basic chemistry they were trying to teach. It is not the chemistry that is hard, it is the way they want you to apply it to things. They are not clear about what they want on the PSets, and often the TFs were not able to help with problem set questions. The lectures are horrible and not helpful. Halfway through the week they would often remove a problem from the Pset because they realized that we were not prepared to do it (which was frustrating if you had already spent time trying to do the problem). The sections also did not help. \r\nFrom what I have heard from people about PS1, it is much more straightforward, and I think I really would have preferred it. \r\nSome of the applications we did were really cool, but not worth it to me because I was so frustrated with the class and the teaching staff. \r\nThe labs in this class were not bad, and in terms of Pre-Med labs, one of the best.","So here's the deal, if you have to take either this or PS1 for premed, take PS11. The lectures for PS11 are annoying, especially those by Anderson, and the textbook is terribly written. But at the end of the day, this class is way better. The exams are only 6 questions long, but you get two hours to do it. You'll find that the psets are doable in a couple hours on Thursday nights (due Friday), especially if you have a group of friends. The exams are way easier than they could be. And you get free points from clickers and from the reading quizzes (sounds annoying but you get two tries and they are super easy). The take home final is an absolute god send. Everyone I know got above a 96% on the take home final, and with the grading schemes that they offer, it is almost impossible to not get an A, especially with the cutoff for an A- being an 85. Take this class. You will do well. It is certainly annoying at times, but at the end of the day, it is way easier to do well in than PS1.","Take PS11! It's a great way to fulfill your chemistry requirements. The professors are awesome, the material is interesting, and you'll get to see Professor Anderson do all sorts of crazy experiments in class. The take home exam is a gift from the gods and the midterms are nothing to stress about as long as you make sure you understand everything on the problem sets.","Take it over PS 1. Fairly straightforward course, although lecture lagged behind material at times.","Take if required; be prepared for lots of work","Manage your time well.","This is a good class with a strong teaching staff. If you do the work, you can get the grade.","It's much better than PS1 for a number of reasons: I really liked the way the course was organized, it's not as difficult (though it is less straight-forwards), and the professors are great and really seem to care about how the students do. Also, Lecca is wonderful!","If you are interested in improving your foundational knowledge of basic chemistry topics I would recommend this course, but be warned that it is a good deal of work for the lower difficulty of material being taught.","I learned a decent amount of chemistry in this class, but I found the lectures very boring.","it is a lot of work. but if you do all the work you can succeed.","This course is a fair amount of work, but with the take home final it is quite within reason to get a good grade overall in the course. Also, you get a great foundation in chemistry and also get a good grip on how it applies to things like the global energy crisis.","Do not take this course if Professor Andersen is teaching it - take PS10 instead. Greg Tucci is awesome but Professory Andersen runs the show and is obsessed with stupid calculations and is a truly ineffective teacher.","You end up teaching a lot of the material to yourself, and spending an annoying amount of time on assignments. Even though this is typically a \"freshman class,\" it's strangely frustrating, especially if you didn't take AP Chem before, so the lectures aren't helpful. Lu's Problem Solving Reviews and office hours are life-savers, as are office hours after lecture...","While the choice between PS11 and PS1 is hard, I think that I would chose PS1 if I could go back and do it over again. I think that the globally relevant questions could be edited to make them more useful; however, too much time is wasted in PS11 with the globally relevant problems (which are pretty much just searching the textbook and lectures to copy down a calculation and then regurgitating it verbatim on the exam, it's mostly a waste of time and I didn't learn too much from it). \r\nMoreover, the take home final took a huge amount of time and I probably would have learned more if I had to study for a final exam. \r\nThe instructors for PS11 are great. Anderson is a wonderful teacher, but he is sometimes hard to follow in lecture. He is great in office hours. I would definitely recommend going to office hours from the very beginning of the semester until the end. The other instructors only teach a few of the lectures. Also, you definitely need to go to section and actually pay attention, because you'll learn most of what you need there. \r\nFinally, Lu Wang is amazing. Definitely get to know her and don't be afraid to ask her questions since she knows absolutely everything about PS11.","Take this class if Dr. Anderson is no longer the head lecturer but more of a course godfather of sorts. Take PS1 instead of the courses teaching system remains the same.","Some lectures are very difficult to follow, as is the textbook, but generally fine since problem sets, labs, and exams are straightforward. As a required class, it was ok.","if you want to learn about how chemistry and physics connect to global issues, you need to take this class.  It's also great to help you determine which fields of science actually spark your interest","This is a pretty easy, generally stress-free gen chem class. I'd highly recommend it. It's graded easily and the TFs are great.","Anderson's lectures are impossible to follow. He's super nice--awesome person! Just incorrigible. \r\nTucci is fantastic. He should teach the course. \r\nP-sets are not always on the info taught. \r\nHowever, not too hard to get a good grade if you go to office hours. Fantastic preceptor.","This class treats chemistry different from any other class I've taken, and I think it's great. You'll get to really see the world around you through chemical reactions and calculations. Don't get annoyed by dealing with real-world examples - enjoy the chance to see these real-world cases. This is a very cool class.","If youâ€™re deciding between PS 1 and 11, PS 11 is probably more interesting. Is is especially good if you have some background (I had taken AP in high school), but not unmanageable if you don't. The topics covered are more or less the same, but are more in depth and involve more physics concepts. Also, the the global calculations are pretty interesting, but it is sometimes unclear as to how they relate to the material presented in class. The lectures overall are pretty good, but a bit disjointed in moving from one day to the next. One day you will understand everything perfectly and the next you could be completely lost. Greg. Tucci is phenomenal and Sirinya is pretty good as well, but Jim Anderson doesnâ€™t really stop to explain what or why he is doing something, he just plows on with you along for the ride, which is actually not too bad once you get used to his lecturing style. Go to Luâ€™s problem solving lectures if you want all the material from the week nicely summarized and tied together. The fact that you can use a page of notes on each midterm and have a take-home final is live-saving. The labs arenâ€™t too bad, there are only six of them and usually they donâ€™t last the full three hours. Overall a pretty good class.","I think that PS11 was a very fair course and you really do learn the material well through lecture, section, and problem solving lectures. The integration of global calculations into the course was also super interesting and also helpful in learning to appreciate the material more. The expectations of the course from the students, however, was unclear at times.","Don't take this class if you want to actually learn concepts","It is a class where you will meet some of the most amazing and passionate staff of any course."]}},"mostRecentQ":{"overall":"3.30","workload":"2.70","difficulty":"3.30","recommendation":"3.30","enrollment":"156","response rate":"82.69","QCourseOverall":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"9","2s":"22","3s":"42","4s":"39","5s":"17"},"QDifficulty":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"3","2s":"18","3s":"55","4s":"40","5s":"11"},"QWorkload":{"number":"PHYSCI 11","course_id":"543","cat_num":"24022","1s":"3","2s":"57","3s":"45","4s":"17","5s":"5"}},"success":true}