{"scores":{"Spring '14":{"course_score":{"overall":"3.80","workload":"2.10","difficulty":"3.00","recommendation":"3.90","enrollment":"14","response rate":"78.57","QCourseOverall":{"number":"EXPOS 20.156","course_id":"1696","cat_num":"34715","1s":"0","2s":"1","3s":"2","4s":"5","5s":"2"},"QDifficulty":{"number":"EXPOS 20.156","course_id":"1696","cat_num":"34715","1s":"0","2s":"1","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"EXPOS 20.156","course_id":"1696","cat_num":"34715","1s":"2","2s":"6","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.156","cat_num":"34715","course_id":"1696","year":"2013","term":"2","id":"b3f1e176711ac6acc2566ece5ff622cf","first":" Kelsey","last":"McNiff","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.30"}]},"Spring '13":{"course_score":{"overall":"4.42","workload":"2.31","difficulty":"3.38","recommendation":"4.62","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.156","course_id":"1696","cat_num":"34715","1s":"0","2s":"1","3s":"2","4s":"5","5s":"2"},"QDifficulty":{"number":"EXPOS 20.156","course_id":"1696","cat_num":"34715","1s":"0","2s":"1","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"EXPOS 20.156","course_id":"1696","cat_num":"34715","1s":"2","2s":"6","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.156","cat_num":"34715","course_id":"1696","year":"2012","term":"2","id":"b3f1e176711ac6acc2566ece5ff622cf","first":" Kelsey","last":"McNiff","InstructorOverall":"4.75","EffectiveLecturesorPresentations":"4.85","AccessibleOutsideClass":"4.69","GeneratesEnthusiasm":"4.69","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Spring '13":{"comments":["Make sure to stay on top of your research. Make sure to have a clear focus going into your researching so that it makes it more easy to find sources.","It actually has interesting content with a lot of flexibility in terms of what you can write about. And the required reading is very minimal.","This is a great Expos class! Kelsey is so nice and helpful, and the topics covered are very interesting. While this course discusses political resistance and could benefit gov concentrators, the course definitely focuses more on history. The research paper at the end is fun, though!","If you don't like art or literature, you will hate this class, but if you like art\/lit and history you will love this class.","Take this course if you are serious about learning how to write. Kelsey is an awesome preceptor who puts a lot into helping her students succeed. She provides great comments on essays that are really effective\/helpful during the final stage of the revision process. And if you are stuck at any point, she will be willing to meet with you one on one and help you come up with ideas.","This class exposes students to interesting civil resistance movements and theories. The readings are reasonable, but it is necessary to plan ahead for this class for the readings, essays, and research.","Take this class to read and explore student protests that are the backbone of so many social justice causes and movements.","If you're lucky enough to get this class you'll be very happy you did. Kelsey is an outstanding professor, very supportive, very dedicated, and just so smart. She will give you very precise feedback and leave trails in her comments to lead you to what she thinks would be a good thesis or a good point to make in a particular situation. This course will teach you how to become a better writer, and you'll also learn A LOT about Harvard's history!","ALWAYS DO THE READING.","It's pretty easy to get engaged with the material and the subject matter"]},"Spring '14":{"comments":["Decently fun topics (apartheid & everyday resistance), \r\ngood sources (Tarrow and Scott), not-so-fun final paper (research paper do it yourself basically and choose a topic), \r\nmostly only RELEVANT readings (so no pointless 50 page reading ever, thank god it's not overwhelming), \r\nprobably less work\/time commitment than the average expos class while not being boring at all\r\nthough it wasn't my first choice, much better than what I expected","The overarching topic of this Expos course, \"Resistance,\" is extremely interesting for anyone, no matter what concentration they are thinking of pursuing.","This course was not very enjoyable. The essay topics were very dry, with the exception of the second essay. The subject matter of resistance presents many possibilities for interesting discussions and topics, but this course hardly lived up to it. In general, the writing assignments were too focused on the specific essay topics, and hardly any attention was given to how the techniques we were learning could be expanded and applied to writing in general.","Kelsey is wonderful, and is an extremely helpful preceptor, but only take this class if you are really interested in the topic, as some of the readings and essay topics can be boring. Its an enjoyable enough course, and its probably one of the better exposes, but again, make sure you are REALLY interested in resistance. You are given a lot of freedom for the last essay though, and if you pick a topic you like, it can be really fun.","The readings are great. Class often felt like it should be recommended but not mandatory. Kelsey is really nice one-on-one so get a chance to meet her. She cares about her students.","I would simply say to pick a topic you're interested in, and be ready to spend a semester focusing on the mechanics of your writing, but also enter into the experience with an open-mind -- Expos is a good opportunity to become a more effective communicator."]}},"mostRecentQ":{"overall":"3.80","workload":"2.10","difficulty":"3.00","recommendation":"3.90","enrollment":"14","response rate":"78.57","QCourseOverall":{"number":"EXPOS 20.156","course_id":"1696","cat_num":"34715","1s":"0","2s":"1","3s":"2","4s":"5","5s":"2"},"QDifficulty":{"number":"EXPOS 20.156","course_id":"1696","cat_num":"34715","1s":"0","2s":"1","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"EXPOS 20.156","course_id":"1696","cat_num":"34715","1s":"2","2s":"6","3s":"3","4s":"0","5s":"0"}},"success":true}