{"scores":{"Fall '13":{"course_score":{"overall":"4.10","workload":"4.10","difficulty":"4.00","recommendation":"4.20","enrollment":"57","response rate":"84.21","QCourseOverall":{"number":"COMPSCI 281","course_id":"1278","cat_num":"97848","1s":"0","2s":"3","3s":"5","4s":"23","5s":"17"},"QDifficulty":{"number":"COMPSCI 281","course_id":"1278","cat_num":"97848","1s":"0","2s":"2","3s":"11","4s":"17","5s":"17"},"QWorkload":{"number":"COMPSCI 281","course_id":"1278","cat_num":"97848","1s":"0","2s":"2","3s":"12","4s":"13","5s":"20"}},"instructor_scores":[{"number":"COMPSCI 281","cat_num":"97848","course_id":"1278","year":"2013","term":"1","id":"efe45dc30f2e22210fc16a9feda336be","first":" Ryan","last":"Adams","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Fall '11":{"course_score":{"overall":"4.44","workload":"3.48","difficulty":"3.89","recommendation":"4.70","enrollment":"36","response rate":"75.00","QCourseOverall":{"number":"COMPSCI 281","course_id":"1278","cat_num":"97848","1s":"0","2s":"3","3s":"5","4s":"23","5s":"17"},"QDifficulty":{"number":"COMPSCI 281","course_id":"1278","cat_num":"97848","1s":"0","2s":"2","3s":"11","4s":"17","5s":"17"},"QWorkload":{"number":"COMPSCI 281","course_id":"1278","cat_num":"97848","1s":"0","2s":"2","3s":"12","4s":"13","5s":"20"}},"instructor_scores":[{"number":"COMPSCI 281","cat_num":"97848","course_id":"1278","year":"2011","term":"1","id":"efe45dc30f2e22210fc16a9feda336be","first":"Ryan","last":"Adams","InstructorOverall":"4.52","EffectiveLecturesorPresentations":"4.41","AccessibleOutsideClass":"4.58","GeneratesEnthusiasm":"4.74","FacilitatesDiscussionEncouragesParticipation":"4.35","GivesUsefulFeedback":"4.32","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Fall '11":{"comments":["Machine learning has changed my view of looking at everyday problems. It is used very widely in any quantitative field of science and social science; one would not regret having taken this very applicable course.","This is a class that covers a lot of material and requires a good amount of work.","Great overview of the Bayesian approach to machine learning. Starts with basics and goes all the way up to the cutting edge. Lectures are clear and well-organized and problem sets are fun and practical.","The coding part can take up a fair amount of time.","Course focuses almost exclusively on probabilistic\/Bayesian techniques","Go to all the lectures.  Start on the assignments early because you'll invariably get stuck on a programming bug that will take you a disproportionate amount of time to fix.","This is a great course, but make sure you have a good background in probability and Bayesian statistics before taking this course.","I really learned a lot in this class.  The lecture is more about abstraction and high level description, which explains the ideas behind algorithms.  Then, the assignment asks you to work out the details.  I think the class is very well-balanced.","The material is very useful and the professor is very good.","This is a really fantastic course. The material is engaging and widely applicable and the professor is a leader in the field and so is very enthusiastic about the material. The course is not particularly demanding, so you will get out of it what you put in, but if you are excited about cutting edge techniques in machine learning, this is the course to take.","Great class, providing an hands-on approach to advanced machine learning and applied statistical analysis techniques.  Excellent professor, effective teaching style to illustrate difficult concepts.","Make sure you can dedicate a significant amount of time to this course's work and readings. I found that difficult with a full-time job.","If you want your mind blown about machine learning, this is the course to take. Bring all your brain tools with you and leave your grade-worrying at the door, and you'll have a ridiculously fun time discovering why those ML researchers are always so jolly. You'll leave the class wondering why you hadn't discovered the fantastic world of machine learning sooner.","The homeworks are fun and the topics are interesting. The lectures are somewhat biased but highly informative.","machine learning is fascinating, and ryan adams helps give you a great survey of what's being done"]},"Fall '13":{"comments":["I learned a great deal from this course -- particularly from the homeworks and from studying for the midterm. But people looking for nonparametric machine learning will be disappointed.","It's very difficult, but doable, if you have a typical CS background (not much exposure to stats).","This course covers an excellent range of Machine Learning concepts. Many of the code implementations are very difficult and require time consuming debugging. Overall, though, the course is excellent and provides an excellent set of tools for applying machine learning concepts to other research or work.","Fun, lots of interesting Bayesian methods, long and boring homework","it takes a lot of time to finish the assignments","This course will stretch you in a good way. Either be good and maths + programming or be good at programming + ML. The more mathematics you know, the better, but you can survive with a lower level than you'd think as long as you have helpful friends and work hard.","section was terrible, material was interesting, psets were a lot of figuring out stuff on your own barely talked about in class","Free up your schedule accordingly. You need lots of time to do the homework assignments and the readings\/videos. Also, the textbook by Murphy has many errors and only adds to the confusion.","This class is extremely difficult, and the workload is extremely demanding. It should probably not be one's first experience with Bayesian statistics. Class tended to be very theoretical, while assignments were much more applied. Prof. Adams is excellent and the course material was highly relevant and worthwhile.","Please do the reading for the class, as it really gives you the necessary background to understand lecture. The problem sets are awesome!","Take this course. It is probably one of the difficult courses, but I learnt so much from the class and homework. Machine Learning is useful in many of my other courses too, so the hard work pays off. The course is not easy, you are expected to put in a lot of efforts. If you didn't know Bayesian statistics, you should learn some basics before the course starts.","You'll work a lot, but it's a great class.\r\n\r\nYou should be comfortable with linear algebra and you MUST be able to code well and have a good handle on probabilities basics.","This course is great if you've already seen a bit of machine learning and have academic interest in it. For those with interest in just applying the methods, there is a lot of academic stuff that the applied student probably will not care about.","If you are wholeheartedly willing to put in the time, it will definitely be one of the most rewarding courses you will take.","This course is a challenging but highly effective way to quickly introduce yourself to a variety of Machine Learning techniques from the consistent perspective of describing uncertainty with Bayesian probability theory.","If you put in the work this class will be very rewarding.  Be sure to at least skim the optional readings - they can often be more informative and at the least will give you some valuable perspective on what you are learning.","The biweekly assignments are tough, so get started early and seek out the help of the TFs and your peers. Adams makes the course difficult but it's worth it if you want to get a deeper understanding of ML beyond CS 181!","CS281 is a great class, but it can become a nightmare if you make the wrong choice. I will try to help make the choice with my experience. In the rest of this \"review\" I will assume that you are new to machine learning: if you're not, and you want to learn more, CS281 is for you. Go ahead and take it, it will be worth it. Just prepare to work hard and make sure to brush up on bayesian probability since prof. Adams is *very* bayesian.\r\n\r\nLet's start with the prerequisites. Ideally you should (in order of importance):\r\n\r\n1. Have a very good knowledge of  probability, especially of bayesian probability.\r\n2. Be familiar with advanced linear algebra (norms, gradients...).\r\n3. Remember how to do math by hand (don't laugh: I took calculus about 100 years ago).\r\n5. Have some experience with Matlab.\r\n\r\nIf you don't fit this profile perfectly (as I, and many other people in the class, didn't) it doesn't mean that you shouldn't take the class, but it will be harder. Much harder. Especially if you lack 1 and 2.\r\n\r\nAlright, prerequisites aside, how is the class? \r\n\r\nThe lectures (2 per week) are great. Prof. Adams is a very good lecturer, he engages the students and manages to always give the intuition behind the technique he is explaining. The math can get hard to follow sometimes, especially if you are not too well versed in probability and\/or linear algebra, but it never gets out of control. There is also a weekly section, basically another lecture by the TAs, which are all very good (Dougal is awesome).\r\n\r\nIf you've come this far, you've probably guessed where the problem lies with this class... The assignments are HARD. Which is not a problem in itself: it is good to face challenging problems, especially in an advanced class like this one. The thing is, the gap between what you're given in class (an intuition of the techniques, and some of the math behind them) and and what you're required to do (solve several problems in Matlab, often by using specific and advanced techniques that require both code and manual work on the math) is huge. If you add on top of this that the reference textbook is very poor (Murphy's: avoid it and use Bishop's  when you can), the lectures go at a breakneck pace (over 300 pages covered in the first three weeks, and that's not including the optional materials), you can see why this class will require a lot of your time, and it can become unmanageable if you also have to get yourself up to speed on the prerequisites.\r\n\r\nSo is it worth it? If you are comfortable with the prerequisites I listed and your other classes for the semester are not too demanding, go for it. If you're not, but you are still interested in machine learning, you might want to consider this class' little brother, CS181. Just one final piece of advice: work in group on the assignments. You will learn much more, and you won't have to spend every other Friday night alone (yes, that's when the deadlines are).","For the undergrads taking the course, there are some good comments at http:\/\/qr.ae\/GVBpM.","Anyone interested in machine learning would benefit from this course. It is a thorough exposure to techniques that have been recently formulated, and the project component gives you the ability to carry out research level work.","This course will teach you how to rigorously handle uncertainty and stochasticity in data."]}},"mostRecentQ":{"overall":"4.10","workload":"4.10","difficulty":"4.00","recommendation":"4.20","enrollment":"57","response rate":"84.21","QCourseOverall":{"number":"COMPSCI 281","course_id":"1278","cat_num":"97848","1s":"0","2s":"3","3s":"5","4s":"23","5s":"17"},"QDifficulty":{"number":"COMPSCI 281","course_id":"1278","cat_num":"97848","1s":"0","2s":"2","3s":"11","4s":"17","5s":"17"},"QWorkload":{"number":"COMPSCI 281","course_id":"1278","cat_num":"97848","1s":"0","2s":"2","3s":"12","4s":"13","5s":"20"}},"success":true}