{"scores":{"Spring '13":{"course_score":{"overall":"4.75","workload":"2.00","difficulty":"3.00","recommendation":"4.75","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"HISTSCI 185","course_id":"2671","cat_num":"20399","1s":"0","2s":"0","3s":"0","4s":"2","5s":"6"},"QDifficulty":{"number":"HISTSCI 185","course_id":"2671","cat_num":"20399","1s":"0","2s":"0","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"HISTSCI 185","course_id":"2671","cat_num":"20399","1s":"2","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HISTSCI 185","cat_num":"20399","course_id":"2671","year":"2012","term":"2","id":"d103d0cf747f3d7dbdfded2e6bcaa894","first":" Alex","last":"Csiszar","InstructorOverall":"4.88","EffectiveLecturesorPresentations":"4.75","AccessibleOutsideClass":"4.88","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '11":{"course_score":{"overall":"4.45","workload":"2.36","difficulty":"2.45","recommendation":"4.50","enrollment":"27","response rate":"85.19","QCourseOverall":{"number":"HISTSCI 185","course_id":"2671","cat_num":"20399","1s":"0","2s":"0","3s":"0","4s":"2","5s":"6"},"QDifficulty":{"number":"HISTSCI 185","course_id":"2671","cat_num":"20399","1s":"0","2s":"0","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"HISTSCI 185","course_id":"2671","cat_num":"20399","1s":"2","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HISTSCI 185","cat_num":"20399","course_id":"2671","year":"2010","term":"2","id":"f932847b608b6570df01c145d5318873","first":"Hallam","last":"Stevens","InstructorOverall":"4.55","EffectiveLecturesorPresentations":"4.45","AccessibleOutsideClass":"4.37","GeneratesEnthusiasm":"4.68","FacilitatesDiscussionEncouragesParticipation":"4.52","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"4.64"}]}},"comments":{"Spring '11":{"comments":["Take the class if you like scifi and want to talk about scifi with other people who love scifi. Be prepared to analyse the scifi movement a little, but it's great fun.","This course is amazing. You'll definitely walk away with an appreciation for cyberpunk and science fiction and you'll learn a lot from your classmates. The readings are great, but if you're not a reader, set some time aside in the week to get them done (7-10hrs?).","This is an incredibly fun class that is very different in its approach and materials. The topic of cyberpunk is extremely interesting and fun to me, and the approach adopted in class - involving material that ranged from video games to short stories to journal articles to movies and second life(!) - makes the class exciting and dynamic. \r\n\r\nThe class is extremely chill and the assignments are really great and open - with lots of room for creativity and the development of your personal interests. I think that in the midst of many labs\/papers\/lectures where the class could get boring, a class like this one is both fun and refreshing. Great class!","This class made me fall in love with science fiction literature.  The discussions were very intriguing, especially with the way the professor probed the students with challenging questions that delved deep into the texts and weekly topics.  Both the professor and teaching fellow were passionate about the subject, which made everything very enjoyable.  With only two major assignments, you can't go wrong, especially if this is your first time getting exposed to hist of sci!","Excellent literary coverage of science fiction, and the non-book based media (movies, a video game, \"hypertexts\") also very interesting.","An amazing course, do whatever it takes to enlist!!!!","Go for the cool professor and the amazing reading list - but it's portrayed as way more scifi-oriented than I think it is.  If you're looking for a class to nerd out in, this might not be it.","this class was fun","You'll love the class, but probably hate a couple of the kids in the class that were extremely attracted to the science fiction curriculum just for the sake of talking about all the science fiction they've already read.","It's a fun time.  Do it!","Again, the class is all fun and games and creative projects and awesome and then they dump a real paper on you at the end. But your semester will be super fun.","BEST. COURSE. EVER."]},"Spring '13":{"comments":["A lot of fun, and incredibly useful in getting a grounded in the field. A perfect confluence of the history of science and the history of communications media, starting from early-modern scientific print and ending with twentieth-century databases. The readings are illuminating, and Prof. Csiszar provides excellent suggestions for further reading.","Though a course such as this is naturally more interesting to HistSci concentrators, the texts are applicable and relevant enough to intrigue a wide variety of students, especially those who wish to explore modern trends in communication.","This course was extremely stimulating and unlike any other course I've ever taken. Professor Csiszar's enthusiasm is contagious, and the class discussions were informative and interesting.","awesome discussions. take it!"]}},"mostRecentQ":{"overall":"4.75","workload":"2.00","difficulty":"3.00","recommendation":"4.75","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"HISTSCI 185","course_id":"2671","cat_num":"20399","1s":"0","2s":"0","3s":"0","4s":"2","5s":"6"},"QDifficulty":{"number":"HISTSCI 185","course_id":"2671","cat_num":"20399","1s":"0","2s":"0","3s":"8","4s":"0","5s":"0"},"QWorkload":{"number":"HISTSCI 185","course_id":"2671","cat_num":"20399","1s":"2","2s":"4","3s":"2","4s":"0","5s":"0"}},"success":true}