{"scores":{"Fall '14":{"course_score":{"overall":"4.70","workload":"4.50","difficulty":null,"recommendation":"4.80","enrollment":"96","response rate":"80.21","QCourseOverall":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"0","2s":"0","3s":"1","4s":"20","5s":"55"},"QDifficulty":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"1","2s":"12","3s":"66","4s":"7","5s":"0"},"QWorkload":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"9","2s":"48","3s":"7","4s":"0","5s":"1"}},"instructor_scores":[{"number":"US-WORLD 36","cat_num":"27723","course_id":"2083","year":"2014","term":"1","id":"ba73888cf8ecb167d52ed87b8f9cfb54","first":" Mihir A.","last":"Desai","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Fall '13":{"course_score":{"overall":"4.60","workload":"2.10","difficulty":"2.90","recommendation":"4.70","enrollment":"93","response rate":"92.47","QCourseOverall":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"0","2s":"0","3s":"1","4s":"20","5s":"55"},"QDifficulty":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"1","2s":"12","3s":"66","4s":"7","5s":"0"},"QWorkload":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"9","2s":"48","3s":"7","4s":"0","5s":"1"}},"instructor_scores":[{"number":"US-WORLD 36","cat_num":"27723","course_id":"2083","year":"2013","term":"1","id":"ba73888cf8ecb167d52ed87b8f9cfb54","first":" Mihir A.","last":"Desai","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.88","AccessibleOutsideClass":"4.16","GeneratesEnthusiasm":"4.77","FacilitatesDiscussionEncouragesParticipation":"4.88","GivesUsefulFeedback":"4.75","ReturnsAssignmentsinTimelyFashion":"4.31"}]},"Fall '11":{"course_score":{"overall":"4.16","workload":"2.26","difficulty":"3.02","recommendation":"4.30","enrollment":"93","response rate":"94.62","QCourseOverall":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"0","2s":"0","3s":"1","4s":"20","5s":"55"},"QDifficulty":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"1","2s":"12","3s":"66","4s":"7","5s":"0"},"QWorkload":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"9","2s":"48","3s":"7","4s":"0","5s":"1"}},"instructor_scores":[{"number":"US-WORLD 36","cat_num":"27723","course_id":"2083","year":"2011","term":"1","id":"ba73888cf8ecb167d52ed87b8f9cfb54","first":"Mihir A.","last":"Desai","InstructorOverall":"4.52","EffectiveLecturesorPresentations":"4.65","AccessibleOutsideClass":"3.46","GeneratesEnthusiasm":"4.65","FacilitatesDiscussionEncouragesParticipation":"4.66","GivesUsefulFeedback":"3.16","ReturnsAssignmentsinTimelyFashion":"3.57"}]}},"comments":{"Fall '11":{"comments":["start raising your hand early. don't be intimidated that other students know more than you -- half the time, they don't.","Great experience learning practical business materials with enthusiasm-generating professors.","This course was an important experience for me because it made me realize how in the business world there is no science behind anything, there is no right way of doing things, there is no path one should follow when dealing with a certain situation. This business class was the biggest wishy-washy course I've ever taken at Harvard, and it made me realize how funny it is that anyone can talk about business as if there was something to be talked about. It all came down to a bunch of elaborated commonsensical concepts, nothing more. If you wanna see why business is no intellectual enterprise, and why no one should really waste his time going to Business School, then take this class.","This class is fantastic. It teaches you how to put yourself in the shoes of the key decision maker in whatever business venture and forces you to begin to appreciate the complex environment within which they make decisions.","This is an amazing opportunity to take a class in a business-school format and to work with a real social enterprise and take your learning outside the classroom. Do it.","This is the type of course you never forget. The students around you will surely be leaders in innovation, and the cases studied and discussed will provide a basis for later courses and applications.","This class is an amazing way to learn more about businesses, innovation, and entrepreneurship. It's challenging and you have to keep up with the work, but it's incredibly rewarding. I've learned so much about the entrepreneurship space and every class leaves me inspired!","The lecture\/discussion\/material in this course was extremely stimulating. However, because there was no feedback provided and a seemingly arbitrary method of grading, I became completely jaded by this course. If the teachers could figure out a way to grade us, instead of placing us in \"participation\" groups which are complete BS, this course would have been good.","Take it.  I am so proud to be the first year of alumni.  I had a wonderful time, both for the case studies and the group project, which is now my Facebook profile pic.","I wouldn't recommend this class unless they change the lecture and grading.","Unless the grading structure, in particular the participation component, changes significantly, I would be very aware of the fact that you will be hearing more from your peers than from the professors. Also the final project, while great to have the opportunity to actually work in the real world with a company, was difficult to pull together because of the complications that arise when one has to work with a group.","be prepared to put in time and work for both case study preparation as well as the project, but if you have the time, definitely take it. a look at the HBS world","Really excellent class.  I learned more from each week's case study than I do in most semesters.  An amazing opportunity to work with business school professors.  Excellent preparation for the entrepreneurial world, or just business in general.  The professors were awesome - they didn't take any BS, and guided discussions in great directions.  Learned a lot from classmates, though it would sometimes take a while to get useful comments out of the class. There were guest professors almost every lecture, which was really interesting for exposure to many aspects of the university.  A pioneering course that represents all the great things that Harvard has to offer!  Don't miss your chance to take it.","Please take this class if you want to have a taste of the b-school format and learn about entrepreneurship and innovation. The only downside is that grading is very arbitrary and uninformative with participation 50% of the grade but you have no idea of how you are doing. In addition, too much attention was focussed on the case studies rather than the bigger theories that underlie the point of each one.","The case studies are great. The professors are engaging, and the material is pretty eye-opening. Discussion format is actually extremely effective. Only drawbacks are a lack of organization (first year of offering, after all), which meant that the final project was crammed into a VERY hectic last month. Grading was very confusing, which I suppose was only that worrisome for a sophomore or junior.","Only course where undergrads can get exposure to the real business world. every lecture is taught by a top-notch HBS professor, don't miss out.","This was a great course to take a look at the case study method that the business school uses and also a great way to better understand entrepreneurship in the US. The course had no section component to it, which made it difficult for the staff to assess our real participation in the class. Because our grade so heavily depended on participation, I don't know if it was graded fairly. However, I highly recommend it if it's offered again. The final project lets you get involved with a real business\/startup and get some experience doing some real work in the real world.","Its a phenomenal course. Very different from anything else you will take at Harvard. If you're considering business school, entrepreneurship or VC, definitely take it.","This class has the potential to be Harvard's greatest undergraduate class.  The lectures are the best that you'll ever experience at Harvard.  The case studies you read are fascinating and engaging.  The class discussions can be absolutely motivating, inspiring, and gripping.  I frequently left the class with great ideas and ready to start a new venture.  The format of the course and the overall experience will be unlike anything you have experienced at Harvard.  And it is actually applicable to real life, unlike most of the Harvard experience!  So refreshing.  Unfortunately be ready for logistical frustrations that really sour the experience.","Be prepared to put a lot of work into the cases. I never did, and I think it really hurt me. Also, researching the guest lecturers before class can give some really useful perspective. Overall, the daily work outside of class is very small--with the exception of the project. But the lectures are incredibly useful and really some of the more interesting I've had at Harvard. With regards to the project, be prepared to put in a lot of consistent work over the course of a month. It was by far one of the best opportunities I've had through a class here, but the stakes are high and it's definitely easy to lose track of your progress and fall behind.","best class ive taken at this place. ill give it to you straight: highly arbitrary marking, all star profs (absolute bosses), rewarding final project, minimal work levels (0-4 hours), surrounded by great people (although insecure people putting up their hands to say stupid stuff is unnerving), material is outstanding, lecturers brought in are great, atmosphere is unique and leaves a lasting impression. Phenomenal course that i'll probably miss. Definitely take if you can get in.","This was one of the best classes I've taken at Harvard. I learned so much each week and really enjoyed the case method in the class. I was so impressed with how much Professors Lassiter and Desai really cared about this course and the students.","Some of the classes\/cases were very interesting.  However, I would strongly caution students interested in this.  Students are often cold called and have to answer difficult, sometimes unfair questions in front of 90 of their peers and intimidating professors.  Because participation counts as 50% of our grade (and we are ranked), students are very competitive about trying to speak.  The professors are not sympathetic to college students' needs.  The final project was a pain.  While the cases are interesting, you don't learn a ton.  There's a lot of extra annoying work.  In total, think very hard about taking it even if you think it sounds perfect like I did!","Take this course if you're at all interested in learning about how to use organizations to make a difference in the world, whether through the private or public sectors. The case lectures are what made the course and despite certain critical deficiencies that the professors are aware of and thinking of how to remedy for future years (e..g minimal to no feedback, reaction notes for each lecture that didn't contribute to the class at all), I still give the class my highest recommendation. Really, the cases are that good. You're getting the people who authored these cases, talked to the person profiled in the case, coming to lecture you. Many of these people have repeatedly won teaching awards at HBS, where the average teaching quality is already measures higher than in FAS.","Don't be scared to participate.  It's a great class to learn more about entrepreneurs and the different challenges they face.","This class provides an excellent overview to many, many subjects and themes in the business world.","extremely interesting and very enjoyable","For real insight into how companies are built, this course offers a variety of perspectives: from the non-profit to the social for-profit endeavor, this course gives you a foundation to imagine, debate, and think about the things that impact you daily.","This is a fast-paced but amazing class - unlike any other class you will take as an undergraduate. You will learn about very relevant, real-world issues, and the class will definitely challenge your critical thinking and also push you beyond the traditional bounds of an undergraduate class. It is an exciting and well-taught class. One of the best I've taken at Harvard.","Poorly organized and nearly impossible to track your progress in. Nearly every participant is \"that annoying kid in section.\"","Using participation as a key component of grading led to arbitrariness and did not accurately assess effort as everyone aggressively tried to get a word in.  Course materials and project were terrific, though","This is a great and very unique class. Take it if you're interested in business or, in particular, entrepreneurship. The class is taught in the case method, which fosters excellent class discussion. The projects are sponsored by great companies and are very rewarding since you get to work with real companies on meaningful project related to their success. The course is a bit of a heavy lift and does take up a lot of time, but it's definitely worth it.","the grading is ambiguous so if you're likely to be nervous about your grade it might not be the best for you. but otherwise, an amazing class so if you don't care about grades, don't miss out!","Awesome Awesome Awesome. This class is so different from normal undergraduate classes. The professors are amazing and the case studies are interesting. Grading is not very transparent, but otherwise, great class.","While it was quite work intensive, this is the most rewarding class I have taken at Harvard. We learned about a variety of innovative and entrepreneurial ventures and many of the skills from this class are very practical and applicable to the real world. The case system creates a unique dynamic amongst the class and the project is really fun because you are working with a real company. Take this class if you get in!","Please do more of these classes !!!","AMAZING Class.","Don't get freaked out by the class participation component. Quality matters, not quantity","This is one of my favorite classes at Harvard. The professors are fantastic. Don't be afraid to participate in class discussions and take advantage of all the lecturers who come in to speak. Also, be very proactive with the class project if you want to get the most out of it.","material is awesome but grading seems arbitrary. make sure you make a good impression at the very beginning.","it's stressful and a lot of work if you prepare for each case study, but it's important to learn how to participate and contribute effectively","This is intellectually uninteresting.Skip it, wait for the real MBA, this is not worth it. The grading is arbitrary and not well structured. The different lecturers are good, but since you are graded on participation and participation depends on being \"called on\", to have varying lecturers only results in those with favorable seats receiving attention.","This class is completely unique. While there were several organizational and logistical problems with the class (as it was being offered for the first time by two business school professors who had never taught undergraduates before), it turned out to be an amazing experience. You will delve into several cases (one per class) and get a glimpse of what HBS is really like. Joe and Mihir are two of the most baller professors around and their lectures are fascinating. That said, there were some huge disconnects from class to class and not every speaker was as good as them. This class is also super easy (no tests, quizzes) only one final project, in class participation and 2 short reaction notes per week. If interested in entrepreneurship and\/or business school, this is a painless way to fulfill the US in the World gened.","Great class! I would recommend it to anyone who is interested in business or is thinking about it! All the professors are amazing. One of the best classes I've taken at Harvard","This was my favorite class thus far at Harvard. It is an awesome course and there is a goldmine of knowledge to get out of it.","Even though the professors say it's \"not a mini-MBA,\" it certainly felt like one to me, and I gained exposure to a variety of business topics. I also gained valuable career guidance. And the case study method is super fun - just don't take the class if you're not willing\/able to speak up and join in the discussion!","you are lucky if you get to be in this class. great material, taught me so much. excellent project component (I got lucky with a great group and great project). also, if things are a bit disorganized, run with it. you're entrepreneurial.","Awesome class. You learn much about business and entrepreneurship. It's an amazing chance to see HBS professors in action.","This class was amazing. I looked forward to going to lecture every week, hearing from amazing professors, and working on generally incredible case studies. You work on a final project with some amazing companies and organizations, and I really enjoyed preparing for class every week. I left the course feeling really confident in my knowledge of entrepreneurship and business, which is a huge success in my mind.","Amazingly fun course.  Read the cases, discuss with friends before class, and don't be afraid to speak up in class.  The final project is super fun too!  Definitely take this class!","SUCH A GOOD COURSE. Interesting cases and themes, extremely engaging, fascinating class discussions (that are productive and directed by great professors).  The project presents an opportunity to apply knowledge to a meaningful outside issue - and get outside the academic bubble.","This is a GREAT and unique class at Harvard. The professors you will meet are best of the best and they have a lot of insights beyond the academic materials offered at the college, namely how to apply your skills to the real world.","Grading is completely arbitrary. The business school way of teaching through case studies seem extremely attractive at first. Do not be fooled by this. It works well in HBS because MBA students actually have experience and contribute relevant comments to the discussion. Because participation is a relatively big portion of the overall grade, college students have incentive to raise their hands and say whatever pops up first in their heads. The discussion is constantly dominated by people who don't actually say anything. The head professors ask for feedback on the progress of the course but often respond in a very condescending way and is defensive of their way of teaching, even though it is fairly obvious that their way of teaching is not effective for college students, as mentioned before. The class is extremely disorganized. The syllabus changes multiple times and assignments are sometimes posted a day before class. Note that this review reflects the first time that this class is run. They might change the course next year.","Best class i've taken at harvard this far! Final project requires a lot of work though -- make sure to start early.","An interesting class, but not very transparent about grading. Project can be a lot of work, so start early.","The material and teachers are fantastic, but until they fix the grading system, I would not suggest this class to a friend.","Take this class","US&W36 is an intellectually stimulating class which teaches you practical skills and entrepreneurial concepts.","You'll learn a whole lot, but be ready to put in some work, especially towards the end of the semester.","You will learn so much about business, HBS professors, the HBS classroom, and entrepreneurship. This course is for anyone with even the smallest amount of desire or interest in starting your own business. Unlike other classes, you will actually learn in the classroom. The readings are extremely applicable, the Case Readings are enjoyable, and it is the only class that I have read 100% of the assigned readings for (just the HBS cases.)","This was the first class I have taken at Harvard that you had to actually prepare for ~2 hours before every class. The case method can be interesting, but the class itself lacks any common thread. If you aren't 100% confident that you can speak every class, be prepared to get a not-so-good grade.","Make sure that you're willing to push into the conversation being held.","I don't want to be an i-banker or consultant; I'm interested in social issues. I was never super into business, but my advice: take this class. It opens your mind to what it takes to successfully effect change, work in teams, build upon great ideas, etc. No business internship or extracurricular background? Me neither. If you just come in with an open mind and willingness to put yourself out there and discuss case studies in front of 90 people, you'll be fine. It helps a lot to talk about the case studies in small groups of classmates before the actual class so you learn from your peers and bounce your ideas off of each other before you present them to the entire class. You get more out of the class that way. It's intimidating and terrifying at first, but if you just get yourself to talk at least once a class, you build confidence. The people who waited forever to talk just built up their fear of talking so much that later, when everybody else had gotten more comfortable with talking thru practice, they were still remaining silent.\r\n\r\nApply for a final project you're genuinely interested in. I did, even though others seemed more legit (White House, Gates Foundation, etc)--and I got so much out of it and established a great relationship with my corporate sponsor that positioned me to get involved in social-issue-oriented start-ups and for internships I actually care about later.\r\n\r\nThis class is refreshing and allows you to study practical and applicable things. Definitely my favorite class of the semester, and I had an amazing and really fun bunch of classes this semester (including SLS20 with Gilbert). This course changed my life (corny as it is). It's taught me so many lessons about what it takes to bring an idea of yours and put it into action, gave me the credibility to get two startups to want me to join their team, and I definitely have the confidence to start my own entrepreneurship very soon.","The material you cover in this class is fascinating. But I quickly got frustrated with the \"over-eager\" mentality of other students who would talk just for the sake of it, and we often didn't engage with the material on a serious enough level. Also, try to pick a project group you know well, since it's a huge chunk of your grade and if you have different work ethics\/standards, it can be tough."]},"Fall '14":{"comments":["I thought the course was quite good as a whole. However, it is unfortunate that a TF is always keeping a running tally of how many times each individual has spoken. This led to a number of vocal individuals speaking extremely often with comments of absolutely 0 substance. There were some fantastic cases (case of unidentified industries) and some silly cases (google project oxygen). As a whole the class was interesting. The class is a gen ed so don't expect this to be a course on how to found your own company.","This is one of the best classes I have taken at Harvard. It is one of the only classes I feel actually taught me tangible skills and ways of thinking about real world business problems and opportunities. The case study method provided an effective and really quite amazing way to learn about particular areas within business and entrepreneurship, and I can honestly say that as a senior, I feel more prepared to go out into the world and start something of my own after taking this class.","You should absolutely take this class if you have any remote interest in entrepreneurship. I wouldn't say it necessarily changed my academic trajectory but it taught me many skills that are essential in the professional world, no matter what field.","This class was great.  It gives you basically a sampling of a bunch of different HBS professors, all of whom were outstanding.  The lectures were really the highlight.  I learned to think in a much more business-like \/ profit-oriented way than I used to.\n\nBe careful what you choose for your final project.  I ended up with a very early-stage startup, which made it pretty tough to figure out what to do.  An established business may be a better call.","Take this course! This course is extremely useful for all sorts of future ventures. It is very well-taught and a good introduction to the business school case method if you are interested in pursuing that path. Even if you are not that into finance or entrepreneurship, I still encourage you to take the class and to gain a deeper understanding about decision-making, finance, and the history of entrepreneurship.","For anyone with any interest in business whatsoever, this is the best class you'll be lucky enough to take at Harvard. Every lesson, like riding a unicorn, is its own unique magical experience that you'll tell your grandchildren one day. Half of the lectures end up being guest HBS professors coming and cramming in the best parts of their respective courses into your tiny unenlightened brain. The work load is ridiculously light - two classes a week with about 30 min to an hour of prep for each. Simultaneously the things you learn in this class are practical and invaluable in the world of consulting and business. Essentially, TAKE THIS CLASS.","This course conveys crucial knowledge in order to manage a business in today's world.","Assignments are kind of random and not well explained, but every class is a ton of fun and the professors make it worth the effort.","This is an incredible class and a rare opportunity to learn a great deal about the basics of business and entrepreneurship. A must-take for anyone interested in business.","The best class I have ever taken at Harvard. Take advantage of the incredible professors that are brought in. Invite them to dinner, invite professor Ager to dinner, and have a wild wild semester.","Best class I have ever taken at Harvard. The assignments can be a little bit open ended but otherwise an incredible class.","Take this class. Whether you have your own startup or have no plans of starting one, USW 36 will be the one class you have to take at Harvard. It's the best Gen-Ed class I've ever taken, and probably one of the best I ever will take. David and Mihir are amazing, and the guest professors they bring are leaders in their field. Nowhere else will you get this kind of opportunity unless you go to HBS! Just make sure to read the case and prepare, and you will have no regrets.","The participation requirement really kills the course. It could be very rewarding if people weren't trying to get their participation points and raising their hands for less than insightful comments. The TFs are not very helpful so it's mainly an independent course.","wonderfully perspective altering class!","One of the best classes I've taken at Harvard!","This class is amazing! This is a must-take class because it's something you can only take at Harvard. How often can you take a business school style class at HBS taught by actual HBS professors? The course covers seemingly every dimension of entrepreneurship, from strategy to venture capital to human capital management to self-awareness. The final project is also such a great learning experience -- although the experience depends on your project group, it can really be fulfilling and high-impact, since you're working on an actual business question for a company.","Hands down the best and my favorite class at Harvard. Case studies were relevant, professors were awesome. I actually did the work for this class - assignments and readings. It's totally doable. Each 10-12 page case study takes maybe 30 mins to 1.5 mins depending on how you slow you read and how much you effort you put into breaking the study down. Close and fast reading takes 45 mins max. That basic minimum per class will help you learn so much. It's a class worth taking. It will push you intellectually, realistically, and creatively.","Teaches you about some of the common pathways for entrepreneurs through case studies. You'll learn how businesses come to be, how they get financed and how they scale. Very useful for anyone considering entrepreneurship. Best of all, the lectures are extremely engaging. But you have to talk in class a lot and you might get cold-called. If you get stage fright, try sitting in the front so you can't really see anyone else!\n\nOverall, this was a great class. The professors will press you on you responses, but you'll learn a lot from them as well as your more experienced peers. A wonderful course-- I wish it could accommodate more students!\n\nThe biggest takeaway for me was to use preexisting resources as much as possible when creating a business!","I became more aware of process of entrepreneurship in America, as well as the moral decisions one must take in any leadership situation, especially those when one is heading an entrepreneurial venture. It encouraged innovation, and allowed me to view things with a lens that was able to adapt better to a changing world. It inculcated in me an ability to think quick on my feet. HIGHLY RECOMMEND","This class affords a very unique experience to undergraduates, as it's taught in HBS case study style. It really asks you to think critically about businesses and looking at them in ways you didn't before. If you're interested in entrepreneurship or business at all, I think it's a great class to take!","Amazing class! Definitely lottery and take the class if you can! learning from case studies is incredibly effective and such a fun way to learn. Also, we get to work with a real client for a final project which is a really fun and great learning experience. I'm a senior, and I probably learned the most from this course in all 7 semesters.","Great class! Mihir and David are fantastic, and you'll learn a lot pretty painlessly!","This class is one of the best I've taken at Harvard. Professor Ager and Professor Desai foster a welcoming environment in class, even if you're not comfortable participating in discussion. The final project was probably the most rewarding part of the class, and it made me realize just how much this case study course has taught me.","This course is one of the best and most practical courses at Harvard. You'll learn more about entrepreneurship than ever before. The professors (Professors Ager and Desai) are both amazing and truly invested in the course. All of the guest lecturers who come in always keep us excited!","One of the coolest and best classes offered to Harvard undergrads - you would be a fool not to lottery for this.","Totally worth your time, even as an elective. The professors are amazing.","This is one of the best courses taught at Harvard.  You will be able to experience the case study method and learn from top business professors.  The material was interesting, the class was engaging and you will learn skills that are actually helpful for your future and career.","This class taught me so much and indirectly got me working with a really cool startup. It was the launching pad I needed to get into the startup and business scene on campus. Take it if you can. It is not super hard and every class i extremely engaging.","TAKE THIS COURSE! It is the best course I have taken at Harvard. The professors are engaging and all the students are engaged too.","Take this class, but try to take another USW as well.  This course is a great introduction to entrepreneurial concepts and practices, but I don't feel like I learned much about the US as a whole, or the world for that matter.","This is an excellent class that I encourage you to take. We read a case each class which covered a broad range of topics, from balance sheets to leadership to social entrepreneurship. Assignments pushed us to think critically and to put ourselves in the shoes of entrepreneurs, CEOs, grant-makers, and other powerful decision makers. The instructors and guest lecturers were all fabulous, and the teaching staff was very invested in the students.","TAKE THIS CLASS EVEN IF YOU HAVE FULFILLED THE GEN ED. If you have any interest in entrepreneurship, you need to take this class. You will learn an insane amount. The business school case studies are terrific and a really engaging way to learn. The professors are incredible and outstanding--over the course of the semester you will be taught by 12+ of the top HBS professors. This class may also be the most practical class you take at Harvard. You'll do the same stuff that CEOs in training will in the executive education program, like a climbing Everest simulation. CEOs will come in to talk. TAKE THIS CLASS.","dont overestimate the time it will take to complete the final project","The case method is a fantastic way to learn - you will find yourself excited to go to class (and yes, even to prepare). Highly recommend for anyone interested in entrepreneurship or even business. Grading can feel a bit arbitrary (which can be stressful given how few assignments there are) but overall it's a very painless course that I really enjoyed taking.","A great class to learn about business, investment, social entrepreneurship and innovation in different industries and countries. Speak early on. The best part about this class are the discussions. . The portion on personal development makes this course a life class in addition to a business course, many lessons I'll carry with me going forward in life. The final project can be time consuming towards the end of the semester, but its a great way to learn about and work with a business in your field of interest.","Pretty good class, but you must enjoy the case method of teaching.","This class is awesome. You're rarely bored because each lecture is so different from the previous one, and so interactive. Assignments are really interesting, and challenging in the best way possible (writing up the case is a different type of skill, but it's not graded too harshly). The only thing is, don't take this class if you're really shy about speaking up, because that is definitely necessary for getting the full experience. Also don't be intimidated by the people who talk all the time, because eventually you'll see that they are really just blowing a lot of smoke. Definitely take this if you get lotteried in!","TAKE IT!!! Best class i have taken at Harvard. Introduces you to the world of business, entrepreneurship in a very practical way. Though the professors explicitly say this course in not an into to an MBA, I reckon it is. TAKE IT.","I loved this class! Every class was so dynamic and interesting, guest lecturers kept it alive and class participation ( which is an important part of the class) was enthusiastic and consistent. Keep up with course readings to be able to understand and contribute the most in each session. Thank you to the wonderful HBS staff for a great experience. Inspiring and I would love to take this class again!","prepare for class!","This class has changed my idea of what I want to do with life. The professors and guest lecturers are all passionate and engaging. This is the best class I've taken at Harvard. If you're on the fence about this class, take it. It is useful to anyone, no matter what you study.","This class taught me how businesses like Ryan Air and Zipcar work, which is super exciting. It also gave me an intro into finance. Take this course, even if you are not set on entrepreneurship (and are okay speaking in class discussions, because you need to participate at every class)!","Literally everything about this course was amazing. The case studies were incredibly engaging. The professors were some of the most inspiring and accomplished people I have ever met. And the final project was my favorite academic project of my life. This class has changed what I want to do with my life.","I highly recommend this course!! Take it if you can (and keep entering the lottery if you can't!)","This class is fantastic, it'll help teach you a lot about entrepreneurship and the discussion format and professors are just awesome.","Absolutely brilliant class. There's a reason why so many people lottery to get in.","This class is an exciting change of pace for undergrads. The teaching format is almost exclusively case discussions. Don't be afraid to be cold called.","This class is amazing. You have to take it! I wish I had taken it as a sophomore. My favorite class at Harvard by far!"]}},"mostRecentQ":{"overall":"4.70","workload":"4.50","difficulty":null,"recommendation":"4.80","enrollment":"96","response rate":"80.21","QCourseOverall":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"0","2s":"0","3s":"1","4s":"20","5s":"55"},"QDifficulty":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"1","2s":"12","3s":"66","4s":"7","5s":"0"},"QWorkload":{"number":"US-WORLD 36","course_id":"2083","cat_num":"27723","1s":"9","2s":"48","3s":"7","4s":"0","5s":"1"}},"success":true}