{"scores":{"Spring '13":{"course_score":{"overall":"3.93","workload":"2.60","difficulty":"3.36","recommendation":"4.13","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.167","course_id":"1701","cat_num":"38416","1s":"0","2s":"0","3s":"4","4s":"8","5s":"3"},"QDifficulty":{"number":"EXPOS 20.167","course_id":"1701","cat_num":"38416","1s":"1","2s":"0","3s":"8","4s":"3","5s":"2"},"QWorkload":{"number":"EXPOS 20.167","course_id":"1701","cat_num":"38416","1s":"2","2s":"5","3s":"5","4s":"3","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.167","cat_num":"38416","course_id":"1701","year":"2012","term":"2","id":"6f568441b593c47eed67e01bc36ce846","first":" Dwight","last":"Fee","InstructorOverall":"4.53","EffectiveLecturesorPresentations":"4.57","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.42","GivesUsefulFeedback":"4.58","ReturnsAssignmentsinTimelyFashion":"4.42"}]},"Spring '12":{"course_score":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.167","course_id":"1701","cat_num":"38416","1s":"0","2s":"0","3s":"4","4s":"8","5s":"3"},"QDifficulty":{"number":"EXPOS 20.167","course_id":"1701","cat_num":"38416","1s":"1","2s":"0","3s":"8","4s":"3","5s":"2"},"QWorkload":{"number":"EXPOS 20.167","course_id":"1701","cat_num":"38416","1s":"2","2s":"5","3s":"5","4s":"3","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.167","cat_num":"38416","course_id":"1701","year":"2011","term":"2","id":"6f568441b593c47eed67e01bc36ce846","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '12":{"comments":["This is a great course - relevant to the freshman experience and the changing world of relationships and friendships.  Dwight is a fantastic preceptor, great at engaging the class in discussion and bringing the topics back to our experiences.","Great class! I loved every second of it. Writing doesn't come naturally to me, so I'm really thankful that the preceptor made me feel comfortable asking questions and feedback to improve my writing.","Great course material, really nice teacher","\"Social Worlds of Friendship\" is a great course. The topic itself is very interesting, but the grading is somewhat difficult. The reading throughout the course was gradually assigned at a heavier amount with each paper.","Really interesting class, but not easily graded","This class is very enjoyable.  Dwight is an good teacher, who facilitates discussion.  The topic is interesting and easy to talk and write about for a semester.","Good course witha relaxed proctor who provides good feedback. Very reasonable.","This class is helpful. You don't really have a choice in taking it, so make the best of what you get.","Go into it with an open mind and a good attitude so you can absorb all the nuances of the course","Before taking Expos in the spring, I heard a lot of negative comments from people taking Expos in the fall, saying that Expos is really time-consuming, it's not a very interesting requirement, preceptors are hard graders and all kinds of things. But Social World of Friendship with Dwight Fee is completely the opposite of all those comments. At least in our Expos section, discussion is fun, writing is not a \"requirement\" but an interesting process and most all all, our preceptor is really wonderful. Highly recommended!","I haven't met anyone who is wildly enthusiastic about their expos class. It's required, though, so if the topic of friendship is something that interests you, by all means, put this on your list. If not, don't. That's really all I can say."]},"Spring '13":{"comments":["It is highly superficial, the subject is not intriguing for me","Everyone says that they don't like their expos class. This must be an exception. SWF was one of the best classes I took this semester; highly recommend it!","This is a good expos course that challenges you in your writing. Dr. Fee is AWESOME and really cares about all the students in his class.  You don't see kids complaining about their expos in Social Worlds compared with a lot of other classes.","Dr. Fee is such a great preceptor. But Expos overall needs some re-working.","If you're interested in the issues of friendships, take this class.","This is a painless expos class, Dwight is amazing and makes it as good as it can be.","From what I hear about Expos classes in general, this is probably one of the better ones out there. Section isn't amazing, but certainly is not terrible either. There's not a lot of debate\/discussion in section, which means there's not a lot of pressure to contribute, which makes the class pretty relaxed, and Dr. Fee is very, very nice. The topic is interesting (especially since friendship is such a key part of college) and the readings are good. So again, it's not a great class by any means, but for an Expos class, it's pretty darn good.","If you are interested in the topic of friendship (and have many things you want to say about it), this course is a great choice for EXPOS! I really enjoyed it, even though writing is often times painful for me. Professor Fee is great in his feedback and very flexible.","Dr. Fee is an amazing preceptor and if you're interested in the topic, this class will be completely painless! Dr. Fee is constructive but so kind. I actually really enjoyed writing the papers.","The topic is very interesting and engaging.","This is the best Expos class among all! The topics are really interesting and Dr.Fee is really helpful."]}},"mostRecentQ":{"overall":"3.93","workload":"2.60","difficulty":"3.36","recommendation":"4.13","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.167","course_id":"1701","cat_num":"38416","1s":"0","2s":"0","3s":"4","4s":"8","5s":"3"},"QDifficulty":{"number":"EXPOS 20.167","course_id":"1701","cat_num":"38416","1s":"1","2s":"0","3s":"8","4s":"3","5s":"2"},"QWorkload":{"number":"EXPOS 20.167","course_id":"1701","cat_num":"38416","1s":"2","2s":"5","3s":"5","4s":"3","5s":"0"}},"success":true}