{"scores":{"Fall '12":{"course_score":{"overall":"4.45","workload":"2.36","difficulty":"3.09","recommendation":"4.36","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"HIST 1911","course_id":"2454","cat_num":"72126","1s":"0","2s":"0","3s":"2","4s":"2","5s":"7"},"QDifficulty":{"number":"HIST 1911","course_id":"2454","cat_num":"72126","1s":"0","2s":"1","3s":"8","4s":"2","5s":"0"},"QWorkload":{"number":"HIST 1911","course_id":"2454","cat_num":"72126","1s":"0","2s":"9","3s":"1","4s":"0","5s":"1"}},"instructor_scores":[{"number":"HIST 1911","cat_num":"72126","course_id":"2454","year":"2012","term":"1","id":"e774867882d55040c69d786eeec30111","first":"David R.","last":"Armitage","InstructorOverall":"4.64","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.64","GeneratesEnthusiasm":"4.64","FacilitatesDiscussionEncouragesParticipation":"4.83","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '12":{"comments":["I would highly recommend this course as Prof. Armitage is fantastic. In addition, I took away a great knowledge about the pacific, probably more than originally expected. A warning-- if you're not a history concentrator, you may find the papers difficult to write.","This is a great class. Professor Armitage is awesome, and you lean an incredible amount by reading so many different histories of the Pacific.","Wonderful, wonderful course. For anyone who's interested in the Pacific, or more broadly, in the ways that the telling of history operates differently in different regions and cultural contexts.","Professor Armitage is a great professor and the subject is a field for great growth.","This is a good fifth class to take.  The workload is manageable and the professor is passionate about the material.  Our class size was around 8 undergraduates and 5 or so graduates.  It was a very interesting discussion every week.  I enjoyed making friends with a handful of my classmates the most.","This course has a lot going for it. It is on a massively important but often ignored taught by a brilliantly knowledgeable and kind professor. There are interesting bits in it forever. However, sometimes it seemed like too much time was spent on discussing trivialities in some of the drier readings.","It was exciting to work on a relatively new and growing field, and the conference associated with this course was a lot of fun.","This course is not only a great way to get to know the Pacific but also to extend your thinking about the practice (and the value) of oceanic history. Professor Armitage was very open about the opportunities and the potential limits, and so for anyone interested in looking through a different kind of lens, there is a tremendous amount of value here.","Great course on an emerging field in history. Professor Armitage is a fantastic professor."]}},"mostRecentQ":{"overall":"4.45","workload":"2.36","difficulty":"3.09","recommendation":"4.36","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"HIST 1911","course_id":"2454","cat_num":"72126","1s":"0","2s":"0","3s":"2","4s":"2","5s":"7"},"QDifficulty":{"number":"HIST 1911","course_id":"2454","cat_num":"72126","1s":"0","2s":"1","3s":"8","4s":"2","5s":"0"},"QWorkload":{"number":"HIST 1911","course_id":"2454","cat_num":"72126","1s":"0","2s":"9","3s":"1","4s":"0","5s":"1"}},"success":true}