{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"2.10","difficulty":"3.20","recommendation":"4.30","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"1","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"0","3s":"9","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"10","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.175","cat_num":"58933","course_id":"1708","year":"2013","term":"2","id":"48302705b35724980ea18e7aa77bd8f0","first":" Rebecca","last":"Summerhays","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"2.70"}]},"Spring '13":{"course_score":{"overall":"3.62","workload":"2.69","difficulty":"3.31","recommendation":"3.77","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"1","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"0","3s":"9","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"10","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.175","cat_num":"58933","course_id":"1708","year":"2012","term":"2","id":"48302705b35724980ea18e7aa77bd8f0","first":" Rebecca","last":"Summerhays","InstructorOverall":"4.15","EffectiveLecturesorPresentations":"4.08","AccessibleOutsideClass":"4.46","GeneratesEnthusiasm":"4.54","FacilitatesDiscussionEncouragesParticipation":"4.38","GivesUsefulFeedback":"4.46","ReturnsAssignmentsinTimelyFashion":"2.54"}]},"Spring '12":{"course_score":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"1","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"0","3s":"9","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"10","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.175","cat_num":"58933","course_id":"1708","year":"2011","term":"2","id":"48302705b35724980ea18e7aa77bd8f0","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '12":{"comments":["This Expos class is everything I could ever ask of an Expos class, and more.  The reading is minimal (Darwin, Lamarck, etc.) and the discussion in class was incredibly insightful and opened up new ways of thinking about these pieces.  I learned so much about how to write and think critically.  Rebecca is so nice and easy to talk to, and very receptive to new ideas.  She does an absolutely wonderful job of breaking down the writing process.  I thought I was a decent writer going into this class, but Expos has made me so much better. Also, there is SO much freedom on what to write for on each of the 3 papers, which was wonderful because you can always find something you're interested about (whereas my friends in other Expos sections were assigned specific prompts). TAKE THIS CLASS! Excellent.","Relatively interesting option for expos","Rebecca is a sweetheart. This class is very open ended. For example, we got to choose the topic for our last essay, as long as it had something to do with the body (so essentially we could write about almost anything.) It's very easy to incorporate the medical world into the material, so consider this course if you are interested in medicine.","Even if you're not premed, take this course.  Rebecca does an amazing job at taking your writing to a new level and making this whole process enjoyable.","It is still coming up so it is not that exciting. But the instructor is really nice!","Rebecca is an absolutely amazing preceptor who really knows how to teach writing.  Writing can seem like a really solitary and lonely task, but Rebecca really guided us through the process and made writing something more engaging and purposeful.  The things that we learned in expos will prove very useful in future writing courses!","If you have any interest in writing well, take this course.","Reading the body is a great Expos 20 class! Rebecca is great!","It is hard to come up with your own ideas. I would recommend just picking a topic as early as possible and going with it, even if it is not the best.","It's a really great experience and you learn about unique topics in interesting and thought-provoking ways."]},"Spring '13":{"comments":["This class is great for students who want to learn more about how the body is perceived in society. It does not have as much reading as other expos classes do and is a great class to improve one's writing skills.","Stay on top of your work, see Rebecca more than once with a draft and specific questions because she might not cover everything that isn't working in your paper before you hand in your final version.  The final paper is cool since you get to pick the topic.","This was a great Expos class. Rebecca is extremely sweet and helpful, and her feedback is always very detailed and constructive. In Unit 1 you look at a museum object and make a point about it; In Unit 2 you read Darwin, Lamarck, Malthus, Paley, and A.S. Byatt.\r\n\r\nThis said, the class is very skewed toward the humanities, so if you really don't like analysing art or literature, then you might want to look into an Expos class that focuses more on scientific writing. But definitely consider taking Rebecca's class: Low reading load that allows you to focus on your writing; A fantastic preceptor; Fair grading. Expos is not easy, but also not as dreadful as you might think. Put in effort, and you will do very well.","Great preceptor, great course.","Obviously Expos seems to have a negative connotation associated with it, but this class was actually very interesting.  I was a person who really disliked writing, but this class by far made it much more enjoyable because of the topics involved.","It was a great class. Full of energy and you learn a lot!","It was very relaxed and it helped me get better at writing in different styles.","The subject of your essays is generally of your own choosing.","Take this course if you are not a big fan of writing literary analyses. The assignments, though they touch on common writing techniques, are not altogether \"conventional.\" Our first assignment required us to closely analyze a medical instrument -- may not be everyone's cup of tea. A decent Expos choice if you are not a big fan of tons of reading.","This is something you have to get through.  If you put in your best work, you will without a doubt become a better writer.","Rebecca is a great teacher. She is always willing to meet to discuss papers and her meetings are very helpful. The material for this course was also manageable and interesting."]},"Spring '14":{"comments":["definitely not work intensive. not a class I necessarily looked forward going to, but a relatively painless way of getting through expos","Its a very interesting course that is not too overwhelming but definitely provides enough challenge for you to grow as a writer.","best expos out their. What really matters is the preceptor and Rebecca is the best!","This particular course is interesting because you are not extremely restricted to the course material for your essays. The course title is slightly misleading; the course focuses on embodiment and how there are different ways of looking at the body and its capabilities. There are many fewer readings in this course than in others, however, that leaves a lot of room for personal interpretation, which some students found intimidating.","You will see great meaning in elements of art and objects that you would have otherwise never even known existed.","Definitely consider this course! it's an expos class that flies under the radar, but that doesn't mean it isn't amazing! I'm so happy I got placed in this class.","Expos-you have to do it","Rebecca Summerhays is a fantastic preceptor. While the material may not seem interesting at first, she engages every member of the class with enthusiasm and ensures that your time spent in Expos is not wasted. I managed to enjoy my expos experience entirely because of the teaching in this course.","Rebecca is a truly kind and cool person, though the course got to be a little bit much at times.  Generally it was not very much work, save for a few terrible weeks.  I wish class time were spent more productively, or that more class discussion of interesting literature could occur.","I would say that this is a very good expos class. The instructor was super helpful in guiding us to improve our writing. Additionally, the structure of the class, progressing through the essays, was very well-thought out and the work was spread out well. The readings were short and sweet and discussed really interesting ideas about the body and evolution."]}},"mostRecentQ":{"overall":"4.20","workload":"2.10","difficulty":"3.20","recommendation":"4.30","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"1","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"0","3s":"9","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.175","course_id":"1708","cat_num":"58933","1s":"0","2s":"10","3s":"1","4s":"0","5s":"0"}},"success":true}