{"scores":{"Spring '14":{"course_score":{"overall":"3.50","workload":"2.50","difficulty":"3.30","recommendation":"3.70","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"0","2s":"2","3s":"3","4s":"7","5s":"1"},"QDifficulty":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"0","2s":"0","3s":"9","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"1","2s":"7","3s":"3","4s":"2","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.174","cat_num":"43826","course_id":"1707","year":"2013","term":"2","id":"48302705b35724980ea18e7aa77bd8f0","first":" Rebecca","last":"Summerhays","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"2.80"}]},"Spring '13":{"course_score":{"overall":"3.86","workload":"2.50","difficulty":"3.21","recommendation":"4.29","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"0","2s":"2","3s":"3","4s":"7","5s":"1"},"QDifficulty":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"0","2s":"0","3s":"9","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"1","2s":"7","3s":"3","4s":"2","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.174","cat_num":"43826","course_id":"1707","year":"2012","term":"2","id":"48302705b35724980ea18e7aa77bd8f0","first":" Rebecca","last":"Summerhays","InstructorOverall":"4.29","EffectiveLecturesorPresentations":"4.29","AccessibleOutsideClass":"4.36","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.44","GivesUsefulFeedback":"4.56","ReturnsAssignmentsinTimelyFashion":"2.78"}]},"Spring '12":{"course_score":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"0","2s":"2","3s":"3","4s":"7","5s":"1"},"QDifficulty":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"0","2s":"0","3s":"9","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"1","2s":"7","3s":"3","4s":"2","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.174","cat_num":"43826","course_id":"1707","year":"2011","term":"2","id":"48302705b35724980ea18e7aa77bd8f0","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '12":{"comments":["Interesting topics, light readings, and enthusiastic teaching.","Dr. Rebecca Summerhays is very friendly and loves to talk your ideas over with you as you develop your essay. She's also a fair grader. This expos class turned out to be a lot better than I thought it would be. I enjoyed our class discussions and was able to write about topics that caught my interest.","Very good expos class. I loved everything about it. It was hard, but all of them are. It will really challenge you but by the end you will have learned how to write 100times better","I can honestly say that I am one of very few of my friends that LOVED their expos. I think the papers push you to become a better writer, but they actually work. Plus, the subject matter is super interesting, and you're given a lot of freedom about what topics you want to pursue, so if you're ore science or more philosophical or religious or whatever, you can cater to your individual interests in your paper.","I had heard warnings from other students. Horror stories at every corner about Expos. They all said the same thing \"I hated Expos.\" I was ready for the worst and then I got Rebecca . #Winning.  She is such a beautiful person with a great mind. The first assignment is actually fun. The readings are so different from whatever you're doing now. She is so helpful with comments and office hours and random meals you might want to have with her. Just put this on your list and hope you get her.","Rebecca gives amazing feedback on every rough draft and revision essay.  She is excellent.  The course is really interesting.  I would recommend this Expos course too anyone interested in science or the different ways that the human body can be viewed in society.","It's a good course, but prepare for very vague essay assignments. Don't expect this to be as multi-disciplinary as it makes itself out to be. It's very interesting, nonetheless, and I recommend it!.","Rebecca is a really nice person and fair grader. We had less reading than most expos classes. I enjoyed that we had lots of freedom with the papers to explore whatever we found interesting as long as it related a little bit to the body.","This is a great way to learn how to be a better writer.","This is a great expos class and Rebecca is awesome, so sweet and intelligent!"]},"Spring '13":{"comments":["You will get great feedback, but this feedback sometimes takes a while to come back.  You'll learn how to be a great writer.","Your writing will be challenged but by the end of the course, you'll feel like a better writer. Choose this if you're legitimately interested in studying the human body.","This class was one of my favorite classes freshman year. Rebecca is a great professor and gives helpful feedback on assignments. She cares about the student's success and is available outside of class to discuss thesis statements, organization, and other aspects of the writing process. I thought the material also really interesting and we had the opportunity to study, discuss, and write about a wide variety of subjects all relating to the body. Before taking expos, I heard a lot of horror stories from my classmates about their classes and the program overall. However, this expos class was awesome and I would have taken it again even if it didn't satisfy a requirement. I feel adequately prepared for college writing.","This course, along with Expos 10, was really helpful in improving my writing and teaching me about different ways to approach writing big assignments. Although, it was challenging, and I feel a sense of accomplishment after turning in the final research paper (maybe because I'm a slow writer.) I think it's important to know that if you're at all interested in the body, this class is great because each unit focuses on the body, and there is a lot of freedom in choosing what you write about.","A very helpful and systematic introduction to disciplined writing. I feel prepared to be a better writer after this.","This is an interesting Expos that is low key but highly informative.","Rebecca is awesome, but it's still expos...","This Expos class was very interesting and does not require too much reading. Professor Summerhays is also a fantastic teacher of this course.","Be prepared to change your thesis a lot when writing.","Do all of the readings and you will do well","Take advantage of your paper conferences, they can be very helpful!"]},"Spring '14":{"comments":["Rebecca always comes to class ready to teach all her students and with a very good student. I think that from all the expos classes I could have taken, this was definitely the best choice. However, she is not quick with returning grades on essays and this can affect the writing process sometimes since you don't know what you did wrong on your last essay until after you have written your rough draft. However, she makes up for it by being generous with deadlines. Overall, she is really trying her best to teach something that is not really easy to teach and at the end of the day, it's Expos.","As far as Expos goes, this class is a fine choice if the subject generally interests you. Rebecca is really nice and she makes class pretty enjoyable. Takes a while to get assignments back, and feedback is decent but not amazing. Grading's not easy, but it never is for Expos. I honestly didn't learn too much, but this is more of an Expos problem as a whole.","I'd recommend with reservations based on their choosing of a section which will truly excite them. Then again, recommendations for expos aren't particularly needed because it's a mandatory course.","If you're interested in medicine and don't want to do a ton of reading, this is probably a good expos for you to take.","Reading The Body is a great expos section if you are interested in bodies. Rebecca is a fantastic teacher who really cares about her students' success. If you invest the effort she will support you in becoming the best writer you can be.","This class is great because of Rebecca; if you really listen to her comments, she can improve your writing immensely. I consider myself a pretty good writer, but I'll admit she has made me so much better and helped me see a lot of bad tendencies I have. The papers we have to write are kind of odd, but turn out to be fun and really will make you improve your writing skills.","Rebecca is a wonderful, highly effective teacher. The prompts are quite flexible and she gives great advice to really strengthen your writing.","It's a good course and it teaches you a lot, the subject just wasn't my favorite","Although expos is not my favorite class, I thoroughly enjoyed the class topic.","It promotes a very interesting way of thinking.","Rebecca is a wonderful woman. She is passionate about her work. You will receive very helpful feedback on your writing. That said, the class time itself is not all that exciting, and sometimes feedback on the final papers takes a long time to arrive."]}},"mostRecentQ":{"overall":"3.50","workload":"2.50","difficulty":"3.30","recommendation":"3.70","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"0","2s":"2","3s":"3","4s":"7","5s":"1"},"QDifficulty":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"0","2s":"0","3s":"9","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.174","course_id":"1707","cat_num":"43826","1s":"1","2s":"7","3s":"3","4s":"2","5s":"0"}},"success":true}