{"scores":{"Spring '13":{"course_score":{"overall":"4.15","workload":"2.46","difficulty":"3.31","recommendation":"4.62","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.168","course_id":"1702","cat_num":"53523","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":"EXPOS 20.168","course_id":"1702","cat_num":"53523","1s":"0","2s":"1","3s":"7","4s":"5","5s":"0"},"QWorkload":{"number":"EXPOS 20.168","course_id":"1702","cat_num":"53523","1s":"1","2s":"7","3s":"3","4s":"2","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.168","cat_num":"53523","course_id":"1702","year":"2012","term":"2","id":"6f568441b593c47eed67e01bc36ce846","first":" Dwight","last":"Fee","InstructorOverall":"4.46","EffectiveLecturesorPresentations":"4.25","AccessibleOutsideClass":"4.08","GeneratesEnthusiasm":"4.08","FacilitatesDiscussionEncouragesParticipation":"4.38","GivesUsefulFeedback":"4.31","ReturnsAssignmentsinTimelyFashion":"4.31"}]},"Spring '12":{"course_score":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"EXPOS 20.168","course_id":"1702","cat_num":"53523","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":"EXPOS 20.168","course_id":"1702","cat_num":"53523","1s":"0","2s":"1","3s":"7","4s":"5","5s":"0"},"QWorkload":{"number":"EXPOS 20.168","course_id":"1702","cat_num":"53523","1s":"1","2s":"7","3s":"3","4s":"2","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.168","cat_num":"53523","course_id":"1702","year":"2011","term":"2","id":"6f568441b593c47eed67e01bc36ce846","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '12":{"comments":["Dwight is a really chill preceptor, he's really understanding of everything, doesn't cause you any undue stress. He gives really good feedback, which is very helpful. The title is kinda weird and gets you strange looks when you say you're in \"social origins of friendship\", and yeah Unit I starts off \"what makes a good friend?\" but by the end you're talking about really interesting stuff like why there are racial boundaries to the formation of friendships and you do your own study. It's really interesting if you like these kinds of societal issues, and you can look at stuff from an institutional perspective--what laws can we have to better integrate communities & such, even as it's all brought from friendship.","Dwight is a very helpful and understanding preceptor who takes an interest in his students' learning processes and ensuring they get the most out of the class.  As far as Expos goes, this is best of what you are offered.","This class gives you a really in-depth and academic perspective on friendships of all natures. The preceptor gives great feedback on your work, and","low stress, Dwight is very nice and always available, class is not fascinating but it's good for expos requirement","It's expos. You need to take it. If you like sociology and Emerson this is for you. If you don't you'll be fine. Dwight is an awesome guy. I felt more like I was chatting with a friend than with a preceptor."]},"Spring '13":{"comments":["Dwight is very understanding and helpful.","Great class. Good Readings. Good teacher","I had heard awful things about Expos, but this class turned out to be one of my favorites.  The subject matter of friendship is perfect for college students: college life will influence your writing, and the insight you gain from your writing will influence your college life.  Dr. Fee is incredible!  Whether you're receiving feedback on a draft or simply picking his brain about a topic, he is an invaluable resource and extraordinary person.","This class is great about learning about friendships and has a very manageable workload.","This class covers a theme that is relevant to all students. The topic of friendships itself made writing each paper engaging and fun. Dwight is an incredible preceptor who is understanding and really wants each student to academically grow. Best expos class ever!","Dwight is great. He is just the definition of the expos philosophy and will take you from a mediocre thinker to a great articulator! The class runs smooth and timely. You may need to submit papers earlier than other Expos classes but you have more time to work on the moment important aspects of the writing process.","Dwight's great and many of the problems with this course (affinity groups, the curve, the lack of assistance we get on the final paper) are problems with expos in general as opposed to this course in particular. If there is no expos choice that seems especially appealing to you, take this one.","Usually, expos gets a very bad rep because everyone has to take it. However, Dwight makes it so interesting and fun. I learn different thinking and aspects of friendship I learned in the class in everyday life; it often times determines how I view my own friendships. Thus, Dwight actually teaches you the sociology and philosophy of friendship in addition to the writing skills. Also, Dwight is super accessible and he gives you good feedbacks on your assignments. Take this class.","For an Expos class, this is one of the best. Just know that the title of this course and the introductory description may be a bit misleading. It's not as exciting and current as you may expect. The material was more social science-y and certainly had an academic feel to it. Rarely did we have discussions about our own friendships very casually; they were always framed around our readings. Still, I learned a fair amount in the class about scholarly research on how our friendships have been changing through technology.","Dwight is a really great teacher.","Dr Fee is so chill! He listens to you, his conferences are so good, you discover the beauty of your own writing. Plus, he brings cookies and fruits to class!!! You will definitely love him. :)"]}},"mostRecentQ":{"overall":"4.15","workload":"2.46","difficulty":"3.31","recommendation":"4.62","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.168","course_id":"1702","cat_num":"53523","1s":"0","2s":"1","3s":"2","4s":"4","5s":"6"},"QDifficulty":{"number":"EXPOS 20.168","course_id":"1702","cat_num":"53523","1s":"0","2s":"1","3s":"7","4s":"5","5s":"0"},"QWorkload":{"number":"EXPOS 20.168","course_id":"1702","cat_num":"53523","1s":"1","2s":"7","3s":"3","4s":"2","5s":"0"}},"success":true}