{"scores":{"Spring '14":{"course_score":{"overall":"4.50","workload":"2.20","difficulty":"3.40","recommendation":"4.20","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"0","3s":"7","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"9","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.164","cat_num":"14403","course_id":"1699","year":"2013","term":"2","id":"cbc0608d6e56aa0c1b3281c16e205e4d","first":" Jonah M.","last":"Johnson","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '13":{"course_score":{"overall":"4.53","workload":"2.00","difficulty":"3.40","recommendation":"4.53","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"0","3s":"7","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"9","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.164","cat_num":"14403","course_id":"1699","year":"2012","term":"2","id":"cbc0608d6e56aa0c1b3281c16e205e4d","first":" Jonah M","last":"Johnson","InstructorOverall":"4.93","EffectiveLecturesorPresentations":"4.62","AccessibleOutsideClass":"4.73","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"4.71","GivesUsefulFeedback":"4.79","ReturnsAssignmentsinTimelyFashion":"4.71"}]},"Spring '12":{"course_score":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"0","3s":"7","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"9","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.164","cat_num":"14403","course_id":"1699","year":"2011","term":"2","id":"cbc0608d6e56aa0c1b3281c16e205e4d","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '12":{"comments":["Jonah is the best preceptor in the world. There's no way to write enough how amazing he is. Expos sucks in general, but Jonah managed to make me love this class. If you can get him for Expos, do it. You won't regret it.","The only reason I have put likely to recommend this course is because Jonah Johnson does give it is his all and try to make Expos 20 enjoyable. With that in mind, it is probably one of the better options. Yet, Expos 20, in general, is just a flawed course. The execution of the idea behind it is atrocious and that is something that Harvard should look into changing.","Jonah is the best.","This is an amazing Expos class! Expos will not be nearly as fun as many other classes but taking this one will make it as close to fun as possible! Jonah is a great preceptor, who really cares about his students and is willing to go that extra step to help you out. He crafts a great course and the material is really interesting. Expos will be painful at times but I truly enjoyed this class and would highly recommend this one!","Jonah is the most understanding man you will meet at Harvard.  He makes a genuine effort to get to know you as a person, and really works with you to help you develop the your writing.  I absolutely loved expos, and feel that I really grew as a writer.","Honestly, Jonah tries his best in the framework of an Expository Writing class, but the framework itself is crippling at best. I wish he would teach a more substantial literature class or something at Harvard. Given this, however, the material itself can be interesting and for an Expos class, it's enjoyable. Do make it a point to go to him for help regarding essays, though.","Though I was a bit worried when I started this course, I ended up liking this course very much. Jonah is such an encouraging preceptor that I gained confidence in my writing! I also think my writing has improved after the long revision process. Even if you are not a \"literature person,\" you should consider taking this course!","This section is probably the best in terms of course structure and preceptor feedback. The workload is not large at all except of course the three essays you have to write.","This is an incredible class.  If not for the great course material, take this class for Jonah Johnson.  He is honestly the best preceptor in existence... I actually found writing enjoyable.","Jonah is the best preceptor you could ask for!","You're probably dreading expos. Do yourself a favor and take this class. Jonah is sweet and hilarious, and coming to class will make your day. The reading isn't taxing, and the essay topics aren't confining--they allow you to explore anything that caught your interest. Tragedy and Everyday Life might sound depressing, but what's actually depressing is not having this class in your life"]},"Spring '13":{"comments":["Jonah is a fantastic teacher, the material is interesting, and you learn a lot about writing.","You will enjoy the class so much, and will actually learn a lot of stuff you thought you knew about writing. In addition to that, the subject at hand is very interesting, especially for the third unit where you pretty much pick any movie you want and write about it. It is a very flexible class, and the atmosphere is very chill. Take it !!","This is definitely the best Expos class that you can take. The preceptor, Jonah, is amazing, the reading is interesting (and actually fairly light, considering), and it's easy to develop unique and interesting paper topics. Out of all of my courses, this was the one I felt that I could be the most creative with, which was awesome. I actually didn't mind Expos as whole (I took Expos 10 as well, by the way), but taking this class probably guaranteed me a better experience as a whole. Jonah's feedback was really useful, the class discussions were interesting, and Jonah also isn't about cracking a very humorous joke now and then. So do yourself a favor and take this Expos; you'll probably end up one of the few who didn't hate Expos, and maybe even one of the VERY few who enjoyed it.","The course is not morbid! It's light, fun, and Jonah is an excellent preceptor!","Jonah makes the expos experience worthwhile.","Jonah's incredible, but expos is expos and most people won't enjoy it regardless. Still, the final essay in this class had a lot of freedom and allowed me to explore something I was truly passionate about.","This course has been the most transformative experience I've had all freshman year. Writing and thinking about tragedy is a great way to gain some inspiring insights into the human condition, and the lessons we learn are surprising applicable to everyday life. Writing an expos essay is always a rather painful experience, but at least this course makes you happy about the product at the end. Jonah is very approachable and I found his advice on writing to be extremely helpful. All in all a great way to fulfill the expos requirement!","I am very enthusiastic about recommending this course simply because Jonah is an excellent preceptor, which makes the whole Expos experience as painless as possible, but the caveat is that you still need to have an interest in literature and film analysis.  If you are more scientific-minded you may still have some trouble with this particular expos simply because you're dealing with some dense literature (both Shakespeare and Sophocles are pretty difficult, in my opinion), and so even though Jonah teaches and excellent course, this may not be the best one for you.","A very energetic and understanding preceptor!","Expos won't be fun due to the innate structure of the course. You might as well have an awesome preceptor who will teach you boatloads about writing and life while you take it","Jonah is awesome and the class is fun for an expos class.","Obviously expos is like pulling teeth, but Jonah makes it as palatable as it gets. His sarcasm is beyond impressive. I feel like there isn't much difference between expos sections beyond subject matter, so if you're at all interested in classical tragedy and drama and film analysis, then take this section. You'll love Jonah."]},"Spring '14":{"comments":["Be ready to always have something that you could be doing in the course. It's nonstop work.","Jonah is an unbelievable professor. great class. great class environment. he cares about your work so much and wants to see you improve. take it.","My favorite class so far at Harvard. Jonah is a phenomenal teacher","Jonah is an engaging and funny preceptor and wonderful with revisions. I felt free to experiment with writing techniques, and he was always positive while being constructive. It was never \"you did this wrong,\" but \"hmm, I see what you're trying to do and it's a great point--how can we communicate this more clearly together?\" Highly recommend this as a writing class, but don't come in expecting that much more knowledge about tragedy in everyday life.","Jonah is an awesome preceptor!  He is very accessible and gives really constructive feedback.  Furthermore he continuously brought enthusiasm to a class that didn't really return his efforts.  The topic can be kind of difficult- Antigone and King Lear really aren't the most interesting reads but having Jonah as a preceptor definitely makes it worth it!","Expos is a required class, and even then it's given to you randomly based on your preferences. That said, this class is a very good idea to put as one of your preferences. Jonah is a great preceptor. His wry humor actually makes class pleasurable to go to, and he gives a lot of of information to help you with your writing. The material you read is quite interesting, and the final unit involves watching a movie. A good enough reason to watch a movie as any."]}},"mostRecentQ":{"overall":"4.50","workload":"2.20","difficulty":"3.40","recommendation":"4.20","enrollment":"15","response rate":"73.33","QCourseOverall":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"0","3s":"1","4s":"3","5s":"7"},"QDifficulty":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"0","3s":"7","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.164","course_id":"1699","cat_num":"14403","1s":"0","2s":"9","3s":"2","4s":"0","5s":"0"}},"success":true}