{"scores":{"Spring '13":{"course_score":{"overall":"4.12","workload":"1.72","difficulty":"2.76","recommendation":"4.16","enrollment":"30","response rate":"83.33","QCourseOverall":{"number":"SOCIOL 170","course_id":"4676","cat_num":"65007","1s":"0","2s":"0","3s":"4","4s":"14","5s":"7"},"QDifficulty":{"number":"SOCIOL 170","course_id":"4676","cat_num":"65007","1s":"0","2s":"8","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"SOCIOL 170","course_id":"4676","cat_num":"65007","1s":"8","2s":"16","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOCIOL 170","cat_num":"65007","course_id":"4676","year":"2012","term":"2","id":"2029f57903c68868dbbff50916fe5038","first":" Bart","last":"Bonikowski","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.64","AccessibleOutsideClass":"4.58","GeneratesEnthusiasm":"4.56","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '13":{"comments":["Professor Bonikowski is the best!","The instructors and course were great, but unfortunately I was not very interested in the material. I would advise prospective students to make sure they are interested in what will be taught because the TF and professor definitely deserve attentive students!","not a course for everyone. although the material is super interesting for those who are already interested in cultural phenomena from a sociological point of view this is not for those who are vaguely interested or want hardcore network analysis. this class is super chill. the teaching staff is so accessible and friendly and funny. Bart is too nice and Anny is too funny. shop it, see what you think. get a feel for it. it's really worth a shot.","I loved this course. Bart is incredible and such a great teacher. He is one of my favorite professors I have ever had at Harvard.","Only for people motivated to learn about culture and networks. This is not the type of class that will still be a breeze if you aren't interested or if you don't do the work.","Take this class! This course will be one of the best you will take in the sociology department. The intersection of culture and networks is fascinating and you will leave the course very fulfilled. The readings are interesting (though sometimes long), the exams are fair, and Professor Bonikowski is the best!","This is a good course that can be applied across a wide range of social phenomena. The readings are dense and you should learn to skim and pay attention in lecture\/section to get the main points from each. Well organized, but the exam preparation is basically all up to you. Not the best course I have taken at Harvard, but far from the worst. Excellently prepped lectures and Bart is very responsive to student needs.","This course is a must for anyone remotely interested in the subject matter. The teaching is exceptional and Anny is an amazing TF. This class was, without a doubt, one of the best classes I've taken at Harvard.","Prof Bart and Anny make a really good team. Both were invested in our learning and creating enthusiasm for the subject matter. The course was cohesive throughout and had some interesting points some weeks (not so interesting other weeks). Similar to stuff learned in Soc190 so may be some overlap if you've taken that.","This class is the only one of its kind anywhere. It's very interesting, and it will open up your perspective to a new way to look at certain social phenomena. I haven't taken other sociology classes, but from what I can glean, it isn't your typical sociology class. Professor Bonikowski is very knowledgable and a great lecturer. Anny is also an amazing TF! Our section had a great rapport, and she was very good at explaining all the nuances of the topics we were learning about. Beware of the readings though. There is SO much reading every week...you will not read half to most of it most likely. Also, the readings are at times very tedious and hard to understand.","Great overview to culture and networks. No quantitative analysis, though.","This is a truly fantastic course, and doesn't require too much work - it is intellectually challenging without stressing you out. When the readings are difficult or dense (which some of them can be), Professor Bonikowski will explain them in lecture. This is a very unique course, and I don't think there's anything else offered that's even remotely similar. Professor Bonikowski is extremely approachable, and flexible in terms of adjusting the content of the course to our needs. The in-class final is also extremely helpful in reducing tension during reading period.","It's a light workload and the subject has a lot of potential, but only take it if you want to do the readings.","This is a good class if you're interested in engaging substantively with the material; however, there are a lot of terms and jargon so it's easy to get lost. Bart is an excellent professor."]}},"mostRecentQ":{"overall":"4.12","workload":"1.72","difficulty":"2.76","recommendation":"4.16","enrollment":"30","response rate":"83.33","QCourseOverall":{"number":"SOCIOL 170","course_id":"4676","cat_num":"65007","1s":"0","2s":"0","3s":"4","4s":"14","5s":"7"},"QDifficulty":{"number":"SOCIOL 170","course_id":"4676","cat_num":"65007","1s":"0","2s":"8","3s":"15","4s":"2","5s":"0"},"QWorkload":{"number":"SOCIOL 170","course_id":"4676","cat_num":"65007","1s":"8","2s":"16","3s":"1","4s":"0","5s":"0"}},"success":true}