{"scores":{"Spring '14":{"course_score":{"overall":"4.10","workload":"2.60","difficulty":"3.00","recommendation":"4.40","enrollment":"22","response rate":"72.73","QCourseOverall":{"number":"GOV 62","course_id":"2155","cat_num":"67712","1s":"0","2s":"1","3s":"4","4s":"3","5s":"8"},"QDifficulty":{"number":"GOV 62","course_id":"2155","cat_num":"67712","1s":"0","2s":"2","3s":"12","4s":"2","5s":"0"},"QWorkload":{"number":"GOV 62","course_id":"2155","cat_num":"67712","1s":"1","2s":"5","3s":"9","4s":"1","5s":"0"}},"instructor_scores":[{"number":"GOV 62","cat_num":"67712","course_id":"2155","year":"2013","term":"2","id":"9ff2b07269961c4b8f928c455a8e33f9","first":" Frances","last":"Hagopian","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '13":{"course_score":{"overall":"4.19","workload":"2.25","difficulty":"3.25","recommendation":"4.44","enrollment":"18","response rate":"88.89","QCourseOverall":{"number":"GOV 62","course_id":"2155","cat_num":"67712","1s":"0","2s":"1","3s":"4","4s":"3","5s":"8"},"QDifficulty":{"number":"GOV 62","course_id":"2155","cat_num":"67712","1s":"0","2s":"2","3s":"12","4s":"2","5s":"0"},"QWorkload":{"number":"GOV 62","course_id":"2155","cat_num":"67712","1s":"1","2s":"5","3s":"9","4s":"1","5s":"0"}},"instructor_scores":[{"number":"GOV 62","cat_num":"67712","course_id":"2155","year":"2012","term":"2","id":"9ff2b07269961c4b8f928c455a8e33f9","first":" Frances","last":"Hagopian","InstructorOverall":"4.56","EffectiveLecturesorPresentations":"4.31","AccessibleOutsideClass":"4.69","GeneratesEnthusiasm":"4.31","FacilitatesDiscussionEncouragesParticipation":"4.07","GivesUsefulFeedback":"4.92","ReturnsAssignmentsinTimelyFashion":"4.75"}]}},"comments":{"Spring '13":{"comments":["If you are thinking of writing a thesis in government, this class is a must. In addition to helping you think about some of the fundamental of political science research, it gives you an opportunity to develop your thesis topic and get feedback. Highly recommend this course!","This is a really good introduction into qualitative research methods--if you plan to write a qualitative thesis, I would definitely recommend the class","IF you are writing a thesis absolutely take this","This is a really important class to take if you're thinking about writing a thesis. Professor Hagopian is really helpful, and the class will help you get a jump start on thinking about how you want to design your research project (especially if it's about case studies).","Harvard needs more classes like this. It gives you an opportunity to discuss your research interests with other students, and teaches you how to best approach your research problem. If you are thinking about doing a research project or a thesis, this class will help you get there!! Professor Hagopian is one of the most dedicated educators you will find at Harvard, and our TF for this year, Jeffery, puts so much time and effort into helping us, he's not your average TF!! TAKE IT!","Absolute must take if you plan on writing a political thesis. Also, the end product is a full-blown research prospectus, so this class is a two for one.","As it was the first year the course was offered, and the department is actively working to improve the class based off of responses from the Q, I would recommend this class with reservations. You've likely encountered most of the exemplary readings in other Gov courses, but the methods readings can be incredibly dry and boring. Professor Hagopian is great, and is very much willing to work one-on-one with you outside of class. If you want to write a thesis, this is definitely the class for you. If you don't want to or are unsure, I'd stay away.","This course will serve you greatly in thinking about and refining your thesis research design and methodology.","If you are thinking of writing a thesis for either Government, Social Studies, or even Sociology, definitely take this course. The teaching staff - Professor Hagopian and TF Jeffrey Javed - will give you and your work plenty of attention and guidance and will really change the way you think about research in the social sciences, leading you to approach your thesis-writing with renewed vigor and a much more rigorous methodological approach. The fact that this class didn't previously exist was a huge deficit in the Government Department at Harvard and it would be a mistake not to take it now that it is - thankfully - offered.","If you want to write a qualitative thesis in Gov, this is an incredibly useful course in starting down that path.","Professor Hagopian and Jeff are so helpful and engaging! It's definitely a challenging class, but it also changes the way you think about writing your thesis. After you take it, you feel much more prepared than other juniors who haven't taken this class.","Was so incredibly transformative in shaping my thinking about methodologies, research designs, theories and political science in general! I highly, highly recommend aka recommend without reservation to any person, especially junior, who is interested in writing a thesis! It was so instrumental in exposing you to the relevant methodologies, research designs and literature in the field; in helping you make signified progress in developing your prospective thesis; And perhaps most importantly instilling in you the confidence to ultimately write one!","Take this course to prepare you for a good thesis and also if you are interested in graduate school.","Definitely take this class: it will make you much more prepared for the thesis research as well as for any other research you plan to do for the future. Doing it in sophomore year may also be a great idea. Take it even if you are thinking about doing a quant paper, as it will help you put research methods in a much more well-informed perspective."]},"Spring '14":{"comments":["The class is superb and incredibly important if you're going to write a thesis.  Only take it if you think you want to write a thesis, but if you do, it's incredibly useful.  There is a good deal of work, but it is crucial for preparing you for senior year, and is absolutely worth taking and putting in the time for.","If you are going to write a thesis, you really absolutely need to take this course. Social studies concentrators, take this instead of SS40!! Absolutely beyond helpful!","For anyone seeking a solid methods course to help you find more direction as you prepare for your senior thesis. Each week presents a new methodology and you will have the chance to read and evaluate exemplary works. This is very helpful. The best aspect of this class for me was the individual help that I got on my thesis preparation. The instructors were wonderful and so supportive!\r\n\r\nI am a social studies concentrator. I opted to take this methods class over Social Studies 40 (and other similar courses). I am so glad I chose this class! I think it gave me the broadest background and really relevant preparation for my senior thesis. It is definitely a great choice for anyone in the social sciences planning to write a thesis!","I definitely recommend this for junior government concentrators who are planning on writing a senior thesis as this course is great prep for the thesis process!","If you are considering writing a qualitative thesis in Gov, TAKE THIS COURSE. I cannot imagine writing a thesis without it. It will teach you the basics of a range of methodologies, help you develop your research and thesis question, and generally make your project more grounded in political science. I am going into my summer research confident that I'm on the right track thanks to Gov 62. The final presentation and prospectus was a great way to thoroughly develop my ideas and see what kinds of preliminary critiques and problems there were.","If you have a vague idea for a topic and want to explore ways to investigate it, this may be useful, but if you already have a good idea of what you want to do and how to approach it, a lot of the readings, etc may feel irrelevant","Awesome class, but definitely catered towards Government \/ Social Studies concentrators who are doing thesis studies. Best to have background in these fields if you want to maximize your experience.","If you are writing a thesis, take this class (even\/especially if you're Social Studies)! I cannot imagine beginning the thesis process without this class. It is focused on teaching you how to do research and what research methods and design you will need to get at the question you're interested. These are things I didn't even know I needed to be aware of but which are so so so important for research. It is also structured to help you develop your specific topic and question for your thesis, which is really helpful in junior spring as you're applying to grants and looking for an adviser. I'm Social Studies and it was immensely helpful, though a lot of the methods are designed for a government researcher so if you know you're going to do more anthro or history then this might not be ideal. I can't stress enough how helpful this course is. Also the final project is to write a prospectus for your thesis, which is what you'll have to do anyway in October so you'll be way ahead of the game.","If you are planning to write a qualitative thesis and expect it to be one of your strongest achievements while at Harvard, I would highly recommend taking this course. At the very least it gives you a space to begin thinking through your research question and design, way ahead of the game before you have to start writing your thesis. The experience overall will give you a strong foundation for your thesis research.","Great teaching staff! Professor Hagopian and Leslie are both two of the best teachers in the department. This is a rather new class, and I think they are still working out some of the kinks. Some of the material felt a little bit common sense. Some of the terms were a little bit harder to grasp.","Thank goodness Gov 62 exists! I truly do not know how I would have developed my research question and methodology for my thesis with out it. Professor Hagopian is brilliant, so hope she continues to teach the class! Leslie, our TF, was awesome and super great to work with. It is an absolute MUST for anyone planning to write a thesis in gov. Even if you think you want to use mainly quantitative methods, from the knowledge I have from friends who took this class's twin gov 61, gov 62 is the better taught\/run class. It is without a doubt invaluable to the enhancing the quality of your thesis. Even if you suddenly decide to not write a thesis, you will read works of political science with much, much greater precision and expertise. Also, if you are at all interested in grad school, this is a pretty good preview to what that type of work entails. I think there is no other class in the gov department quite as practical, but also enjoyable, as this one.","Super helpful, even as a social studies conc","YOU NEED TO TAKE THIS CLASS IF YOU'RE WRITING A THESIS. This is by far the best preparation I've had at Harvard to conduct my field work this summer including the Gov 94 classes. It teaches you the theory and methodology as well as pitfalls while also guiding you through the question creation and prospectus process. Anyone who takes this class will be lightyears ahead for doing field work and writing in the fall."]}},"mostRecentQ":{"overall":"4.10","workload":"2.60","difficulty":"3.00","recommendation":"4.40","enrollment":"22","response rate":"72.73","QCourseOverall":{"number":"GOV 62","course_id":"2155","cat_num":"67712","1s":"0","2s":"1","3s":"4","4s":"3","5s":"8"},"QDifficulty":{"number":"GOV 62","course_id":"2155","cat_num":"67712","1s":"0","2s":"2","3s":"12","4s":"2","5s":"0"},"QWorkload":{"number":"GOV 62","course_id":"2155","cat_num":"67712","1s":"1","2s":"5","3s":"9","4s":"1","5s":"0"}},"success":true}