{"scores":{"Fall '12":{"course_score":{"overall":"4.18","workload":"1.96","difficulty":"2.68","recommendation":"4.32","enrollment":"30","response rate":"93.33","QCourseOverall":{"number":"SOCIOL 132","course_id":"4655","cat_num":"51482","1s":"0","2s":"1","3s":"5","4s":"10","5s":"12"},"QDifficulty":{"number":"SOCIOL 132","course_id":"4655","cat_num":"51482","1s":"0","2s":"9","3s":"19","4s":"0","5s":"0"},"QWorkload":{"number":"SOCIOL 132","course_id":"4655","cat_num":"51482","1s":"8","2s":"13","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOCIOL 132","cat_num":"51482","course_id":"4655","year":"2012","term":"1","id":"458908b1d1ef32de0d790fe64551ab70","first":"Jocelyn","last":"Viterna","InstructorOverall":"4.32","EffectiveLecturesorPresentations":"4.18","AccessibleOutsideClass":"4.04","GeneratesEnthusiasm":"4.46","FacilitatesDiscussionEncouragesParticipation":"4.44","GivesUsefulFeedback":"4.32","ReturnsAssignmentsinTimelyFashion":"4.09"}]}},"comments":{"Fall '12":{"comments":["This is a fantastic course if you have any interest in sociology or social movements (and especially if you're a thesis writer working on social movement stuff). Dr. Viterna is so supportive and an amazing and engaging lecturer.  Even if you can't manage all of the reading (although the reading's really good), you get so much out of the class just by showing up to lecture. The assignments are also really manageable, and also just help you get a better grasp of the material so you never feel like it's busy work or unnecessary.","Fantastic class, one of my favorite at Harvard! Jocelyn and Beth are incredible, open to any question, in and out of class. The course lets you explore your interests within theory that has been established.","brilliant and comprehensive introduction to social movement theory. perfect for thesis writers.","Take this class - the material is fascinating, and Jocelyn is funny, warm, and a great teacher.","Professor Viterna is an excellent lecturer, she has a lot of enthusiasm for the course and will engage you with the material whether or not you are a Sociology concentrator.  The readings assigned are interesting and fairly distributed, don't miss out on the optional readings as they are quite useful for the course, especially your writing assignments.","If you want a breadth and depth of understanding on social movements, take this course","This class deals with a fascinating subject! This past year (its first year) it was disorganized and sometimes disapppointing, but hopefully in future years the format of the class will be adjusted so that students benefit more.","This class is a great introduction to social movement theory. You are able to choose a social movement to explore throughout the course, so students are able to feel invested in the class and have ownership over the work they produce and the in-class discussions. Jocelyn is a kind teacher and effective lecturer\/discussion facilitator and is helpful outside of class. This is a course that achieves a successful balance between theory and practice, and will help you approach social movements, both in the present and in the past, more systematically and thoughtfully.","Professor Viterna is a great resource for her students, especially thesis writers. Make sure to go to her office hours and get her advice.","great class on social movement theory, plus practical applications. it helped that i was writing a thesis on a social movement.","a very good standard course in social movement theory that was helpful for me in starting to write my senior thesis this semester","I would tell them that this to be strategic about readings. Many of the theories were outlined in detail in the first chapter. Also, make sure to pick a case that you really, really like because you'll be stuck with it for the rest of the semester.","This class is great! The material is so interesting and Professor Viterna has a way of making even the theory-based portions of the curriculum interesting! Also awesome how most of the seniors who took this class this year were able to incorporate their own thesis research into class discussion! You may want to wait til you're an upperclassman to take this though!","This course is absolutely amazing. One of the best I've taken at Harvard. If you have any interest in activism, social change, or simply studying how people mobilize together for a cause; take this course!","this is a really interesting class and professor viterna is great. it is more theoretical class though so if you don't like theory you might not enjoy it as much","I'm sure this class will get better when the teachers figure out what needs fixing. It has potential; it really does. Only take it, though, if you're already very interested in a particular social movement.","Best class I've taken at Harvard.  Great lectures and really engaging readings.","This class is great for becoming familiar with social movement theory. I came into it not really knowing what to expect. I came out of it really loving the perspective this field within sociology brings to social interaction and organizational theory. Professor Viterna gave really good lectures, and the project was enjoyable.","Professor Viterna is so enthusiastic and inspiring when lecturing. She also makes it a point to personally get to know each and every one of her students and called us all by name in class. You'll love her! The course material is also just very interesting as it covers a topic that is enjoyable to study and really dig into.","really interesting.","Lectures heavy on the theory behind social movements."]}},"mostRecentQ":{"overall":"4.18","workload":"1.96","difficulty":"2.68","recommendation":"4.32","enrollment":"30","response rate":"93.33","QCourseOverall":{"number":"SOCIOL 132","course_id":"4655","cat_num":"51482","1s":"0","2s":"1","3s":"5","4s":"10","5s":"12"},"QDifficulty":{"number":"SOCIOL 132","course_id":"4655","cat_num":"51482","1s":"0","2s":"9","3s":"19","4s":"0","5s":"0"},"QWorkload":{"number":"SOCIOL 132","course_id":"4655","cat_num":"51482","1s":"8","2s":"13","3s":"7","4s":"0","5s":"0"}},"success":true}