{"scores":{"Fall '12":{"course_score":{"overall":"3.98","workload":"2.09","difficulty":"2.78","recommendation":"4.04","enrollment":"50","response rate":"92.00","QCourseOverall":{"number":"US-WORLD 38","course_id":"2084","cat_num":"26219","1s":"0","2s":"3","3s":"8","4s":"21","5s":"13"},"QDifficulty":{"number":"US-WORLD 38","course_id":"2084","cat_num":"26219","1s":"4","2s":"9","3s":"27","4s":"5","5s":"1"},"QWorkload":{"number":"US-WORLD 38","course_id":"2084","cat_num":"26219","1s":"4","2s":"34","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"US-WORLD 38","cat_num":"26219","course_id":"2084","year":"2012","term":"1","id":"516ed0406b1cd6639dffa6b80181d1dd","first":"Erez","last":"Manela","InstructorOverall":"4.27","EffectiveLecturesorPresentations":"4.24","AccessibleOutsideClass":"4.13","GeneratesEnthusiasm":"4.13","FacilitatesDiscussionEncouragesParticipation":"4.08","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"},{"number":"US-WORLD 38","cat_num":"26219","course_id":"2084","year":"2012","term":"1","id":"b3c9d6fd5652472791118e19cac39b84","first":"Andrew","last":"Gordon","InstructorOverall":"3.62","EffectiveLecturesorPresentations":"3.46","AccessibleOutsideClass":"3.82","GeneratesEnthusiasm":"3.62","FacilitatesDiscussionEncouragesParticipation":"3.92","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '12":{"comments":["This is a very fair course.  It neither demonizes nor excuses the United States' role internationally over the past century.","It is helpful to be well-versed in US history!","This is an interesting look at the US and international history, an approach that you don't really encounter until the college level. While it can be difficult at times to synthesize all the material you are learning because the case studies can be a bit disparate, lectures are engaging and help you put all the pieces together. The material was interesting and it is refreshing to think about how the US escapades abroad came to be, and what actually happens when a nation committed to democracy occupies another in the name of freedom.","Really interesting history class with definite contemporary significance. A part of US history few people ever learn about.","Make sure your workload in other classes isn't that bad.  (Protip: USW 32 looks like more work but it doesn't have a final.  Take that one instead.)","This class is an excellent way to fulfill the US in the World requirement as it takes on a critical perspective and develops understanding in the ways the US has taken on occupations over the last century. It encourages some really interesting debates and will change your opinions.","There's not much to say about this course, it's a relatively unchallenging class with an earnest teaching staff and a certain sadness to the nearly-empty lectures in the basement of CGIS. I enjoyed the readings and writing the papers, but I don't think  I ever thought critically or got incredibly excited about the material. There's nothing *wrong* with this class, but it probably won't be the highlight of your semester.","This has been one of the best Gen.Ed classes I've taken here at Harvard. As a math\/pset person I have been dreading the US&W Gen.Ed, putting it off until senior year. In a way, I'm glad I did because this is the first time the class is offered (it doesn't feel like it though; the class is so well-run). I've learned a lot and despite my grade, I don't regret it at all.\r\n\r\nDifficulty wise, this class requires quite a bit of reading, which you have to do unless you don't plan to go to the mandatory discussion-driven sections. However, the readings are well-selected and interesting. Perhaps longer than your average gen-ed class but manageable.\r\n\r\nMoreover, I highly recommend you go to class. The professors are not just telling you what happened but they also have their own theories on history that make lecture worthwhile. \r\n\r\nThe TFs are not the most lenient graders (my humble opinion as a number person), but the essays usually have interesting prompts that make you think as opposed to simply regurgitating your readings.","Interesting subject matter, taught be able professors with a great interest in the course. Perhaps predictably, draws students who have radically anti-American mindsets and who might cause cerebral hemorrhaging. Comments such as \"America has no right to interfere with other countries, even when they commit genocide,\" were not uncommon in section. From a teaching perspective however, a very good course, that not only deals with the subject matter (American Nation-building\/Imperialism), but also very important aspects of American history often overlooked.","This was a fantastic course and definitely one of the best I have taken at Harvard (especially for a Gen Ed). The teaching staff was great - they were passionate about the material and committed to the students. If you are interested in history, and even if you are not, this is a great class to take. It gives you the opportunity to examine American foreign policy from a unique, critical perspective and provides you with a much better understanding of our recent actions in Iraq and Afghanistan.","Interesting class. If you know American history pretty well already it may be less interesting. The readings were very long and sometimes unnecessary. Go to every lecture and section to learn the material best and understand which parts of the readings are most important.","This course is a interesting and in-depth look at an aspect of American foreign policy that is frequently cited but little understood. The coverage of different occupations is uneven and skews towards the expertise of the two professors (as can be expected). Overall, this is a great class.\r\n\r\nDefinitely do the readings each week as they are critical for the section discussions which I found to be the best part of the course. I suppose you could get away without doing to many of the readings, but really, the point of the course is to read primary and secondary sources, discuss them, and draw well formed conclusions on the interventions. If you don't do the readings and just spout ideological opinions on US foreign policy, you've missed the point of the course.","This is a really great class - I took it as an elective but it would be a great option for a Gen Ed as well. Go to lecture - they're interesting and you need to attend them to stay on top of the material. I wasn't the biggest fan of the paper prompts and some of the readings, but all the work is manageable. I decided to take this class because despite taking many US history classes, I had never taken one focused specifically on US occupations from the late 1800s to today. I was really satisfied with the class and all that I learned. The professors are good lecturers and the TFs are awesome.","This course is fascinating especially in the present context of Iraq and Afghanistan. You will actually want to write the essays which aren't too bad. Nation building will continue to be a topic in our lifetimes and I feel like the course prepared me to have a discussion about how one can develop democracies and a modern economy (whereas before this course I could only give vague opinions about whether or not the US should have involved itself in certain interventions).","It is an ok class that surveys some important events in US diplomatic history. On a whole, I am quite dissatisfied since the class is very one-sided (only US perspectives, sources, documents) and the assignments are arbitrarily difficult for a Gen-Ed. I'd much more recommend Manela's real history course on the same topic, history 1465.","This class is great. Great lecturers and TFs (at least mine was). Material is interesting and it definitely connects to what is currently going on in the world.","An interesting course that's certainly among the better USW options, especially given the sweep of the topic and the reasonable reading load. Assignments (mostly essays) could occasionally be rather strange. The political views of the course staff could also seep into the course more than seemed necessary.","Very interesting class that compared different nation-building\/occupation projects. It was especially interesting because it provided perspectives into today's nation-building projects abroad.","As a new course this semester, the class surprisingly pleased me by the presence of a strong central thesis around which the readings, lectures, and sections discussions were based.  This was my first real experience of this kind of a course structure and for those unfamiliar with it, I would strongly recommend it to anyone.  Even though I took this class as a Gen Ed, I felt that I gained a lot from it by being flexible to the course's structure and by diving in depth into those areas where I was more interested.  The lectures were fascinating and enjoyable, the assignments were engaging, and the TFs were down-to-earth, combative, and incredible. Don't sleep through this class, not because you can't, but because you would be missing out.","This is a class about US imperial ventures abroad that entirely omits: a) any perspectives on the moral aspects or psychological consequences of imperialism, particularly when evaluating the \"effectiveness\" of US policy; b) any secondary sources (and almost no primary sources) from non-US perspectives, ie the point of view of the inhabitants of the nations the US was supposedly building. This dooms the whole undertaking of the class from the start. In fact, it renders the class downright dangerous, since it really is dangerous to learn only a one-sided view of history (and have it presented as factual.) So, yes: in this class, you will learn what US policy goals were and how generals & politicians went about attempting to achieve them, but you won't actually learn the results of these policies- though the professors will tell you that X or Y was effective or ineffective - because that's not possible with the sources presented. Don't take this class.","Take this class. It is so interesting and I really hope it comes back next year!!","It's great. Even if you have no interest in US history, this course will make you interested and teach you a lot.","It's a great class no matter your background.","Take this class if you just want the american perspective, otherwise, don't.","The information in this course is excellent--but be prepared to be treated like high school students, took themselves very seriously, and lots of work just to appease a TF it seemed. Besides the unenjoyable context though, I learned alot.","A relatively interesting gened, but too much reading assigned. Doing all of them isn't really necessary as forming study groups or just doing a couple for each week and going to lecture should be fine. Gave me a new perspective on how US nation building has developed over the years.","Interesting class, but not as enjoyable as you might think. Gordon's lectures are brutal to get through. Manela's are pretty solid though. The reading list isn't great, the essay topics are restrictive and annoying. This class has the makings to be great - just needs a little polishing.","Take this class if you want to learn about America's effect on the countries it has invaded, and where improvements can be made.","Very interesting subject and well-taught class. Professor Manela is a very interesting lecturer, and is full of interesting historical facts. Lastly the workload is quite fair: the readings are manageable (though they got a little longer in the Germany\/Japan section) and the essay assignments are fairly short.","Interesting essay prompts--not strictly analytical","This class successfully cobbles together a cohesive narrative of American occupation from the Civil War to the present.  Take it if you're interested in the subject matter.","Professor Gordon does not seem as animated and enthusiastic as Professor Manela, so half the course seemed to drag.","This was a very interesting course. A solid background in United States history is really helpful."]}},"mostRecentQ":{"overall":"3.98","workload":"2.09","difficulty":"2.78","recommendation":"4.04","enrollment":"50","response rate":"92.00","QCourseOverall":{"number":"US-WORLD 38","course_id":"2084","cat_num":"26219","1s":"0","2s":"3","3s":"8","4s":"21","5s":"13"},"QDifficulty":{"number":"US-WORLD 38","course_id":"2084","cat_num":"26219","1s":"4","2s":"9","3s":"27","4s":"5","5s":"1"},"QWorkload":{"number":"US-WORLD 38","course_id":"2084","cat_num":"26219","1s":"4","2s":"34","3s":"8","4s":"0","5s":"0"}},"success":true}