{"scores":{"Fall '14":{"course_score":{"overall":"4.40","workload":"5.00","difficulty":null,"recommendation":"4.90","enrollment":"13","response rate":"69.23","QCourseOverall":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"0","2s":"0","3s":"2","4s":"1","5s":"6"},"QDifficulty":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"0","2s":"1","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"1","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"WOMGEN 1424","cat_num":"91598","course_id":"4930","year":"2014","term":"1","id":"67a1dc7e159d9f57f7aa554402dea4a5","first":" Caroline","last":"Light","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.90"}]},"Fall '13":{"course_score":{"overall":"5.00","workload":"1.80","difficulty":"3.00","recommendation":"4.90","enrollment":"13","response rate":"69.23","QCourseOverall":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"0","2s":"0","3s":"2","4s":"1","5s":"6"},"QDifficulty":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"0","2s":"1","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"1","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"WOMGEN 1424","cat_num":"91598","course_id":"4930","year":"2013","term":"1","id":"67a1dc7e159d9f57f7aa554402dea4a5","first":" Caroline","last":"Light","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Fall '12":{"course_score":{"overall":"4.62","workload":"2.00","difficulty":"2.69","recommendation":"4.77","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"0","2s":"0","3s":"2","4s":"1","5s":"6"},"QDifficulty":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"0","2s":"1","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"1","2s":"5","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"WOMGEN 1424","cat_num":"91598","course_id":"4930","year":"2012","term":"1","id":"67a1dc7e159d9f57f7aa554402dea4a5","first":"Caroline","last":"Light","InstructorOverall":"4.92","EffectiveLecturesorPresentations":"4.67","AccessibleOutsideClass":"4.69","GeneratesEnthusiasm":"4.92","FacilitatesDiscussionEncouragesParticipation":"4.92","GivesUsefulFeedback":"4.83","ReturnsAssignmentsinTimelyFashion":"4.92"}]}},"comments":{"Fall '12":{"comments":["Definitely take the class! Caroline is amazing and I absolutely love her. Do the readings and come prepared to participate. Caroline demands that you participate but she is also willing to help you if you're shy. She's awesome and the class was great. Take it. Not the easiest, but good class. Don't take it if you don't work well with others because you will hate the assignments.","FANTASTIC CLASS!!! TAKE IT, TAKE IT :)","This class is a great overview in some feminist, neoliberal, and queer theory.  The fetish is everywhere and this course opens your eyes.  Discussion is lively, Professor Light is terrific, and the projects are fun and low-stress.","This course explores everything from the theoretical to the historical components of the Fetish. It puts an incredibly interesting spin on modern day advertisement and caused me to completely change the way in which I viewed the commercialization of \"the other\" and the advertisement of many products in the United States.","This is a loosely structured class. It's really what you make of it. If you put in the work, you'll get a lot out of it. But it's also really easy to lose focus.","This is an incredible class and Professor Light is an outstanding instructor. The readings are awesome, the assignments are reasonable, and the discussion is always interesting. If you're interested in anything on the syllabus, TAKE THIS CLASS! You won't regret it.","This class does take a lot of time given the dense readings and group projects; however, the material is so fascinating and pertinent, and the assignments enjoyable, that you will be willing to put in the effort. I learned so much not just from the coursework, but also from my peers in this close-knit discussion based seminar. Definitely a worthwhile course!","Great class with amazing readings. Professor Light is awesome and leads great discussions","If you get the opportunity to take a course with Caroline Light, you should do so!! She's one of my favorite Harvard professors, and throughout this course she facilitated the most interesting discussions. Taking this class helped me see a lot of consumer culture in a new light. I'd highly recommend it (but be ready to get your hands dirty with lots of filmmaking!)"]},"Fall '13":{"comments":["This is an amazing course and I highly suggest that anyone with interests in how race, pop culture, sexuality and history intersect TAKE IT!","Such an amazing seminar to engage with a small group of people and think about neoliberalism, fetishization of culture and certain types of bodies, colonialism, and more. Caroline Light gives me life.","Great class. Really rich material that changed the way I look at the world (corny, but true). Don't be scared off by the syllabus; it's a lot of reading, but not all of it gets covered in class (which is both a relief and frustrating). Professor Light is kind, generous, and brilliant. All in all, awesome.","AMAZING course.  Prof Light is a great teacher and facilitates very interesting and relevant discussion.  Reading can be a bit heavy and it is important to keep up with it to get the most out of this class.","This is a great class. Interesting readings and not too much out of class work. Totally applicable to Miley Cyrus.","I cannot attest highly enough to the wonder that is this class. Concurrently, I cannot recommend it highly enough--with the caveat that this class will probably work best for you if you can turn a critical eye toward culture.","Everyone should take this course. The course materials, assignments and discussions are so relevant and interesting, and it truly makes you view the world in a different way. Professor Light is awesome, too, and makes you look forward to this class every week. The only negative was that the final movie project took our group entire days on end to complete.. but even that was worth it!"]},"Fall '14":{"comments":["Caroline is incredible, and her thoughtfulness defines the course.  The readings are phenomenal, and your classmates will be some of the best you'll ever meet.  The projects are super engaging, and collaboration makes these projects even better.  Highly recommend taking this course!","This class is phenomenal. It is a reading-heavy course, but well worth the effort. Do not pass up the opportunity to take this class if you get lotteried in!","This class is amazing. The work is fun and rewarding, and you learn a ton. Professor Light is incredible, you MUST take a class with her before graduating.","This is by far the best course I took at Harvard. If you have taken a course with Caroline Light, you know how amazing she is; she is brilliant and kind and cool. Truly an inspiring and careful teacher. Apply for the course! And if you get a spot, know that you just won the lottery, and your life will never be the same. :)","Prof. Light is WONDERFUL! Seriously. Meet her before you graduate. She is one of the best aspects of this class and so are the other students you'll get to engage deeply with. A lot of group work which can be frustrating and overwhelming. At times the class feels really repetitive but through you're focusing on a main theme there is a lot of depth.","TAKE THIS CLASS. It is not an overstatement to say that this class changed the way I think about the world. I wouldn't stop talking about this class all semester. Caroline fosters an incredibly safe space that allows for in depth and honest discussions of topical and often sensitive material. I think it is important that EVERYONE take a class like this one. Not to mention the fact that it is a BLAST. We were all friends by the end of it.","Everyone should take this class!!!","Great class, but there is a lot of reading. Make sure you are prepared for section, and it will be a rewarding experience."]}},"mostRecentQ":{"overall":"4.40","workload":"5.00","difficulty":null,"recommendation":"4.90","enrollment":"13","response rate":"69.23","QCourseOverall":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"0","2s":"0","3s":"2","4s":"1","5s":"6"},"QDifficulty":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"0","2s":"1","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"WOMGEN 1424","course_id":"4930","cat_num":"91598","1s":"1","2s":"5","3s":"1","4s":"0","5s":"0"}},"success":true}