{"scores":{"Spring '14":{"course_score":{"overall":"4.90","workload":"2.20","difficulty":"2.70","recommendation":"4.90","enrollment":"19","response rate":"78.95","QCourseOverall":{"number":"WOMGEN 1127","course_id":"4907","cat_num":"48191","1s":"0","2s":"0","3s":"0","4s":"2","5s":"13"},"QDifficulty":{"number":"WOMGEN 1127","course_id":"4907","cat_num":"48191","1s":"0","2s":"6","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"WOMGEN 1127","course_id":"4907","cat_num":"48191","1s":"1","2s":"10","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"WOMGEN 1127","cat_num":"48191","course_id":"4907","year":"2013","term":"2","id":"a71fd2c5965c593b69c06613fc55f773","first":" Alice A.","last":"Jardine","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Fall '12":{"course_score":{"overall":"4.47","workload":"1.80","difficulty":"2.60","recommendation":"4.67","enrollment":"16","response rate":"93.75","QCourseOverall":{"number":"WOMGEN 1127","course_id":"4907","cat_num":"48191","1s":"0","2s":"0","3s":"0","4s":"2","5s":"13"},"QDifficulty":{"number":"WOMGEN 1127","course_id":"4907","cat_num":"48191","1s":"0","2s":"6","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"WOMGEN 1127","course_id":"4907","cat_num":"48191","1s":"1","2s":"10","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"WOMGEN 1127","cat_num":"48191","course_id":"4907","year":"2012","term":"1","id":"a71fd2c5965c593b69c06613fc55f773","first":"Alice","last":"Jardine","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.53","AccessibleOutsideClass":"4.29","GeneratesEnthusiasm":"4.93","FacilitatesDiscussionEncouragesParticipation":"4.86","GivesUsefulFeedback":"4.43","ReturnsAssignmentsinTimelyFashion":"4.43"}]}},"comments":{"Fall '12":{"comments":["I really enjoyed this class! I loved looking at the media with different lenses depending on the week we were on--science, religion, race, economics, war, democracy. The professor is so intelligent and really explains complex theory well. The theory is very applicable to the media we examine, and you are forced to analyze the news with multiple kinds of lenses. I loved it, and would definitely recommend it!","Jardine is absolutely wonderful - find a course to take with her.","Prof. Jardine's expertise and enthusiasm made 10-11 a.m. on Tuesdays and Thursdays the best two hours of my week. The course's focus on media in real time led me to read the news every day, and to push myself to consume information from sources I do not commonly frequent. The theoretical background on postmodernism and feminism led me to revolutionize how I interpret and understand today's mediascape. I also loved breaking up the course into issue areas to zone in on (i.e Environment, Race, Democracy, etc.). Reporting out on media topics and situating them in the literature we've read in class was a remarkable experience. Final projects were enjoyable.","This is hands down one of the best classes I have taken at Harvard.  This class will push you to unravel the many 'truths' we accept about the world around us, and to rebuild them with an acute awareness to not only WGS issues, but those of race, economics, and politics. I couldn't have chosen a better introduction to the department and regret waiting until my senior year.  Prof. Jardine is amazingly supportive, accessible, and down to earth.  I couldn't recommend this class more!","This was the best class I have ever taken at Harvard. It deals with relevant and important news outlets and stories that you encounter every day and gives you a plethora of philosophical tools with which to handle the world around you. It changes the way you think about issues ranging from economics to environmental studies. TAKE THIS CLASS. IT IS PHENOMENAL.","This class is a true gem; Professor Jardine is a wonderful woman and professor and one truly gets the sense that she cares about students and what they get out of the course. I would highly recommend this class if you're at all interested in media studies, as we examined media through a variety paradigms and in many contexts--not exclusively gender, but also in conjunction with race,  conflict and war, politics, the environment, and many other subjects . The class was very flexible in the way that it was taught and I got the sense that we as students had a significant hand in shaping the topics of discussion and the trajectory of the class, which was at once wonderful and also somewhat frustrating because at times it seemed somewhat nebulous. Nevertheless, however, I would certainly recommend it!","This class is amazing if you keep up with the reading and are enthusiastic about learning!","Sometimes the discussion frustrated me, but I really liked the readings, so take it if you want an easy way to engage with this stuff. There's no bs work you have to do, which is nice.","I loved this class and Professor Jardine. The discussion and theories were unlike what I have experienced in any other class at Harvard. Make sure you start on the project early and communicate with your group continually."]},"Spring '14":{"comments":["I would enthusiastically recommend any class taught by Professor Jardine. This class also gives an important base of knowledge for understanding post modernism in a non intimidating yet complicated theoretical way.","Wow. This course is very much wow. You will learn so much - you will learn how to learn. You will be terrified and overwhelmed at times by what you learn...but hopefully empowered by the end. Professor Jardine is one of the most humane professors you will find at this university - this class will be what you want it to be. Take it. Please. The narrative of the course is constructed perfectly. The readins are amazing. Just take it.","This is a good class, but sometimes the lack of structure is off-putting. Also, in the case of my class, there was a homogeneity of political opinions and leanings, which didn't make for as compelling discourse.","Honestly, it is a ridiculously amazing course with a fantastic professor and topic. I enjoyed all of it every second of the semester.","If you would like to get to know and have an excellent relationship with a professor who is a leader in her field, then this is the course for you. Professor Jardine is an excellent professor and really cares about her student's learning.","TAKE THIS CLASS!  I learned so much and feel that it has truly changed my perspective on life.","This course was incredible! I feel like I learned so much about issues that are very relevant to everyone today, and I don't think there's another course at Harvard that explores so many of these issues in one class.","This class is a wonderful opportunity to learn new ways of thinking about the experiences of others and about what is going on in the world around you. The more effort you put into participating in class and doing the readings and responses, the more you get out!","I have never used caps on the Q before, but--TAKE THIS CLASS! Alice Jardine is the most amazing Professor at this university. She changed my life and how I see the world. The material is SO useful--not just for WGS but for any concentration and for all parts of life. There is passion, interest, discussion, and self-discovery. Please don't miss the opportunity to take this class.","This course convinced me to pursue a secondary in WGS. It is not difficult because it is so interesting. I promise the class is a gem!","Take this class. Professor Jardine presents so many fascinating ideas in this course that are worth thinking about before you leave Harvard. This is NOT just a class. This is about how we live out our political lives, how we need to participate in conversations, how we need to TAKE NOTICE on what is really going on in the world. \r\n\r\nProfessor Jardine is also so sweet, and she really cares about what you think. Again, this class is not about grunt work or assignments - it's about thinking critically for YOURSELF. Not for an assignment, not for a grade, for YOURSELF. How are you going to be a citizen in this world? What is your opinion of your world? Those are questions that this class will help you think about. I learned a lot."]}},"mostRecentQ":{"overall":"4.90","workload":"2.20","difficulty":"2.70","recommendation":"4.90","enrollment":"19","response rate":"78.95","QCourseOverall":{"number":"WOMGEN 1127","course_id":"4907","cat_num":"48191","1s":"0","2s":"0","3s":"0","4s":"2","5s":"13"},"QDifficulty":{"number":"WOMGEN 1127","course_id":"4907","cat_num":"48191","1s":"0","2s":"6","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"WOMGEN 1127","course_id":"4907","cat_num":"48191","1s":"1","2s":"10","3s":"4","4s":"0","5s":"0"}},"success":true}