{"scores":{"Spring '13":{"course_score":{"overall":"4.58","workload":"2.67","difficulty":"3.25","recommendation":"4.55","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"VES 195g","course_id":"5240","cat_num":"59802","1s":"0","2s":"0","3s":"1","4s":"3","5s":"8"},"QDifficulty":{"number":"VES 195g","course_id":"5240","cat_num":"59802","1s":"0","2s":"1","3s":"7","4s":"4","5s":"0"},"QWorkload":{"number":"VES 195g","course_id":"5240","cat_num":"59802","1s":"0","2s":"7","3s":"3","4s":"1","5s":"1"}},"instructor_scores":[{"number":"VES 195g","cat_num":"59802","course_id":"5240","year":"2012","term":"2","id":"da0892ffcb1677e6887241febbe711af","first":" Haden","last":"Guest","InstructorOverall":"4.83","EffectiveLecturesorPresentations":"4.75","AccessibleOutsideClass":"4.58","GeneratesEnthusiasm":"4.92","FacilitatesDiscussionEncouragesParticipation":"4.73","GivesUsefulFeedback":"4.82","ReturnsAssignmentsinTimelyFashion":"4.82"}]}},"comments":{"Spring '13":{"comments":["This class truly is a Hollywood snapshot.  It's the type of course that addresses a plethora of subject matter concerning Hollywood, but in such a way that provokes curiosity and exploration.  The professor is incredibly passionate about the content, and provides reliable and sincere feedback on ALL assignments.   A true joy to take.","There is lot of reading so be prepared to deal with that because most of it is very important. The history of Hollywood is incredibly rich and covering it in a semester is quite a feat. That being said the films are spectacular and most of the readings are wonderfully interesting so engage with the materials as much as possible. You'll walk away feeling much more knowledgeable about the history and industry of Hollywood which is a great feeling!","You will probably consider this class one of the best taught courses at Harvard if you take it. The work can definitely feel overwhelming at times, but you gain so much from them and as well as the section discussions. Professor Guest is one of the most impressive professors I have met, and his preparation and ability to direct discussion so as to create the most fulfilling class conversations is what truly makes this class one of the best you could find.","Haden Guest is the greatest.","This was a fantastic course I would strongly recommend.  Haden is both intensely passionate and vastly knowledgable, the latter fact perhaps the biggest factor in the success of a course which could easily fall short under the helm of a lesser scholar.  All readings and viewings were engaging and rewarding, and I would encourage anyone taking this course in the future to take advantage of the Harvard Library system or other resources (Netflix, etc.) to watch as many related films as possible in addition to those screened (in 35mm!) at the Film Archive.  Lastly, it is worth noting that the curriculum rarely strayed from its cutting interrogation of \"Hollywood on Hollywood,\" as created by films, novels, and critical work from the past 90 years.  The best course in what has so far been my most enjoyable semester academically.","Great course. Be prepared for A LOT of readings, but they are probably the most enjoyable readings you will ever have in a film class."]}},"mostRecentQ":{"overall":"4.58","workload":"2.67","difficulty":"3.25","recommendation":"4.55","enrollment":"14","response rate":"85.71","QCourseOverall":{"number":"VES 195g","course_id":"5240","cat_num":"59802","1s":"0","2s":"0","3s":"1","4s":"3","5s":"8"},"QDifficulty":{"number":"VES 195g","course_id":"5240","cat_num":"59802","1s":"0","2s":"1","3s":"7","4s":"4","5s":"0"},"QWorkload":{"number":"VES 195g","course_id":"5240","cat_num":"59802","1s":"0","2s":"7","3s":"3","4s":"1","5s":"1"}},"success":true}