{"scores":{"Fall '12":{"course_score":{"overall":"3.81","workload":"1.85","difficulty":"2.80","recommendation":"3.87","enrollment":"101","response rate":"94.06","QCourseOverall":{"number":"CULTR&BLF 19","course_id":"1935","cat_num":"1065","1s":"0","2s":"8","3s":"29","4s":"31","5s":"27"},"QDifficulty":{"number":"CULTR&BLF 19","course_id":"1935","cat_num":"1065","1s":"5","2s":"20","3s":"60","4s":"7","5s":"2"},"QWorkload":{"number":"CULTR&BLF 19","course_id":"1935","cat_num":"1065","1s":"30","2s":"53","3s":"9","4s":"2","5s":"1"}},"instructor_scores":[{"number":"CULTR&BLF 19","cat_num":"1065","course_id":"1935","year":"2012","term":"1","id":"b734a65a5e0b66fad7b18d12f2eab69d","first":"Ali S.","last":"Asani","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.46","GeneratesEnthusiasm":"4.17","FacilitatesDiscussionEncouragesParticipation":"4.44","GivesUsefulFeedback":"4.46","ReturnsAssignmentsinTimelyFashion":"4.44"}]},"Spring '11":{"course_score":{"overall":"3.95","workload":"1.92","difficulty":"2.71","recommendation":"4.07","enrollment":"83","response rate":"89.16","QCourseOverall":{"number":"CULTR&BLF 19","course_id":"1935","cat_num":"1065","1s":"0","2s":"8","3s":"29","4s":"31","5s":"27"},"QDifficulty":{"number":"CULTR&BLF 19","course_id":"1935","cat_num":"1065","1s":"5","2s":"20","3s":"60","4s":"7","5s":"2"},"QWorkload":{"number":"CULTR&BLF 19","course_id":"1935","cat_num":"1065","1s":"30","2s":"53","3s":"9","4s":"2","5s":"1"}},"instructor_scores":[{"number":"CULTR&BLF 19","cat_num":"1065","course_id":"1935","year":"2010","term":"2","id":"b734a65a5e0b66fad7b18d12f2eab69d","first":"Ali S.","last":"Asani","InstructorOverall":"4.31","EffectiveLecturesorPresentations":"4.27","AccessibleOutsideClass":"4.76","GeneratesEnthusiasm":"4.47","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Spring '11":{"comments":["This is a great class! Professor Asani is a wonderful lecturer and the readings are very informative.  If you want to learn about Islam, this is a great introductory class.","Not too much work (take home midterm and final, one paper, weekly journal entries), and very interesting material; you might not have to do all the readings, considering the format, but doing so will definitelybe a rewarding experience.","It's a truly wonderful class providing you with a comprehensive overview of Islam, or rather the many different forms of Islam and the context in which they are embedded. It really makes people more culturally literate, even for Muslim students who see Islam through their lens but are unaware of the different forms of Islam different people practice. Seriously great class as Professor Asani is a great lecturer who can make the most difficult concept easy to understand and provide an open-minded and diverse outlook on the subject matter.","If you take this class, be willing to engage as deeply as possible.  It can be coasted through, but you'll regret it when you see how much enriching material it offers.","Great introductory class for learning about Islam. Professor Asani is a great teacher and prominent figure in the Islamic community. As for the class work, workload isn't bad and definitely gives the student an opportunity to provide their own opinions. Definitely recommend this class.","A wonderful course which will open your eyes to an important force in the world in which we live.","If I had to choose again I would still take this class.  The professor is an excellent academic and a committed educator.  The sections are (well, my section was at least) very uplifting.  The readings were thought-provoking and horizon-expanding.  All in all, a great class.","You will realise just how little you actually knew about Islam, and it will be an enriching course. Quite a lot of work (reading, weekly journal entries, long take home exams) Lectures a bit messy but covered in the reading. You should really be interested in Islam, there are def easier C&B GenEds out there if you are not....","A great course to learn about the foundations of Islam in the modern world.  A great course to take.","This class is good; some of the grading is arbitrary but you will learn a lot.","Understanding Islam is a class that all Harvard students should take, especially in a time when Islam is so relevant to the United States and this country's foreign policy. The course is well taught and learning the cultural studies approach is invaluable.","Don't lose track of the assignments, remember to start the journal entries early because they'll take longer than you think, and try not to miss lecture because the slides aren't posted. If you keep up with that, it's pretty easy.","This course is an excellent introduction to \"Islam,\" especially in a cultural and historical context.  Professor Asani is a clear lecturer and cares for all his students.  I actually looked forward to attending sections!  Hands down one of the best classes I have taken at Harvard.","Everyone should have an understanding of the basics of Islam. This course is perfect for that.","Take it for a core if you don't have better alternatives.","More work than it seems like it will be","Very interesting class.  Prof. Asani is a fantastic lecturer.","It is new material so it's really difficult, but it's interesting.","This is a very good class in terms of learning about Islam.","Culture and Belief 19 is an idea introduction to the complexities Islam in the world and its relationship with culture and society. These topics are presented with a breadth of examples and receive discussion from a variety of perspectives.","This class is very abstract and very general in regards to the themes it deals with. With the exception of a few interesting weeks, lectures are dry, and sections were not particularly stimulating or engaging. Unless you're interested in a lot of history I would not recommend this class.","You will come away with a much better-informed perspective of Muslims today.","Course material is interesting and relevant. Assignments are graded harshly, especially for a General Education class, and readings are time-consuming. Overall, a worthwhile but demanding class.","Professor Asani is a great lecturer. This class will teach you a lot, but it isn't painful or stressful at all. I really enjoyed it.","Very enjoyable way to fulfill the culture and belief gen ed credit. No thoughtless memorization, instead thoughtful discussion. Light workload.","This is an excellent course for anyone looking to gain a foundational knowledge in Islam and eye-opening in terms of showing the variation within the religion.","This is a really interesting course. It changed the way how I think about religion and issues surrounding Islam. Relatively easy. I would recommend this class to anyone with a remote interest in Islam or the Middle East.","interesting subject matter and not too much work. Professor Asani was great.","This is a great class to both fulfill  Gen Ed. and learn about Islam in depth.","Take this course! Especially if you grew up in a Western style educational system.","Very interesting class but be ready to read a lot","Incredibly enlightening, this class really encouraged debate and discussion","The first half of this class is extremely interesting although Professor Asani is, at times, rather boring and disorganized.  You learn a lot about the origins of Islamic traditions and the differences between Islamic groups.","VERY interesting! Very important to know so that people aren't ignorant in making stereotypes against Muslims","Definitely take this if you would like a better understanding of the world in the last 1400 years.  Asani and his TFs are excellent!","This class is one of my favorite classes ever! I would definitely recommend taking it. I am a Muslim but learned so much about Islam in general and its interaction with different cultures. I also understand why different cultures have different interpretations of Islam and how it affects other people and Islam itself.","This course is interesting, but it does not critically engage with Islam in the modern world. It is very biased and apologetic, and while that is a perspective that is needed in our society, I would have appreciated a more balanced approach.","This class is a very informative class and you will learn a lot about Islam; probably more than what you need to know in the first place. I took this class because I wanted to learn more about the religion we see on TV a lot, and that goal was accomplished. However, the cultural studies approach used in this class means that you will be reading short stories, painting and reading poems in addition to learning about the religion, which is interesting but can get a bit tedious at times. It is a GEN ED that requires a lot more work than most other Culture and Belief classes with a 2-page response paper every week, so be prepared for that. Dr. Asani is a good professor who cares a lot about his students, and he tries to spice lecture up with videos and music, but 2hr twice a week gets long, and the last 30 min require a lot of will for you to keep listening. The TFs are really good (I had the chance to have 3 out of 4), nice and funny. Sections are definitively pretty interesting.\r\n\r\nRegarding the course itself, there is a lot of reading per week. In addition, you will cover a lot of the history of Islam, but not that much about Islam today. Even then, you will read a lot of stuff that you don't really care about. For example, I know everything about Muslims in the city of Birminghton, UK, but we havent really talked about Muslims in NYC. Also, we dont really talk about the implications the rise of fundamentalist Islam will have on the future, or even the Arab Spring for that matter. Overall, this is a good intro class, but don't expect any awesome discussion about the present; most of the class is historical.","This Culture and Belief class teaches a perspective on religion and Islam specifically that I have never been exposed to before.  By approaching religion from a cultural studies approach, Islam appears very different from the unitary religion that we usually consider it.  Professor Asani is a great lecturer and is always open to comments and participation.  For your average CB, this may have a lot of work (extensive readings, reaction papers weekly, take-home exams that you should put a lot of effort into), but I think it was worth it.  Grading was not too tough, and I really feel like this class changed my worldview and how I approach religion.","lectures are mind numbingly boring","engaging lectures, interesting material; an easy way to fulfill a core requirement"]},"Fall '12":{"comments":["WORD OF WARNING: This is not a chill, painless gen-ed like a lot of people have said. Look at this objectively: weekly response paper, mandatory section attendance and readings, and an 18-page take home final. Doesn't sound too bad, huh? Also, steer clear of this if you want a grade gut. This is definitely not one of them -- for them, a 93 is an A-.","The material is all very interesting and remains relevant today, but it can be hard to keep up with all the readings.","Take this course if you're interested in Islam!","More work than usual for a GenEd. The final is heavily based on readings that were not covered enough in lecture and were never addressed in section.","Asani is an amazing lecturer and the section components get all the students involved as well.  We got to be an alim (religious interpreter) and make decisions based on the Qur'an.  Quite the great experience to even gain a small insight into the rich ideas and traditions of this religion.","The course meanders a good bit, but it will change the way you see the Islamic world.","For a gen ed, this class is a lot of work, and at times the grading can seem unjust. However, if you have a definitive interest in the material, the class offers A LOT - you will undoubtedly learn more than you expected.","Very interesting class that teaches you a lot about Islam. No prior knowledge needed or expected. There is a fair amount of reading, but it only helps you understand the material better. The exams and paper are fairly challenging.","Avoid.","It is a fun class and Asani is a fantastic professor. The work is nowhere near overwhelming and the lecture readings are fascinating (although you don't get assessed on them throughout the semester, you should definitely still do them. They are not long).","Professor Asani is most certainly worth getting to know. If you are in touch with him throughout the course, it will make the whole experience quite enjoyable. He is always ready to talk and engage with students, and I think I learned as much as I did in class from having meals with him.","Although the regular workload is light, the final is extremely time consuming. Be prepared to write an 18 page paper for the last 25% of your grade. Also the grading tend to be pretty arbitrary, especially when the TFs don't have time to skim through a few thousand pages of final papers.","Very knowledgable Professor, with a message that all students should get to promote mutual understandings across cultural and religious divides.","As a science major, with little to no experience in cultural studies or religion, I found this class to be moderately difficult, but a good introduction to the subject. If you are interested in the subject and would like to broaden your world view, take it. The final exam is rather lengthy (take home essay, about 20 pages) but that is the most difficult component of the class. Some people choose not to do the lecture readings, but they are helpful on the midterms and final.","IF you're looking to learn more about Islam or think critically about Islam or understand Islam in the global world, this is NOT the class for you.  While this class had the potential to be very informative and fun, it fell short of my expectations.  Lectures are just very inefficient.  Not a hard class though so it could be worth taking.","Take it for a better understanding of the U.S. - Middle East conflict","It is a class that everyone should take. It is the best into class on a world religion that Harvard has and you will learn far more than you would in a comparable class about a different culture that is more familiar. Also, do the readings, he really picks them with tremendous care and they are fascinating.","Professor Asani doesn't really teach anything because he's so wrapped up in using the cultural studies approach to paint a rosy picture of any controversial issue, to the point of being inaccurate. I was really frustrated with how little we learned in this course; if you want a rigorous course on understanding the Qur'an and going beyond a high school presentation of muslim societies, look elsewhere. That said, it's a well organized class and the expectations are really clear, so it's a great gen-ed where you learn a little bit and can get a good grade if you put in the work.","Professor Asani is an amazing lecturer and Henry was a great TF. This course totally changed the way I thought about organized religion. The readings are generally fascinating and the section readings are light. \r\n\r\nHowever, the assessments, particularly the midterm and the final, are miserable. The wording on the midterm's essay question was extremely confusing, and the take home midterm ended up being about 17 pages. Both felt like pulling teeth.","The class wasn't one I would take just for an easy Gen Ed. If you are interested in Islam, go for it, but be prepared for lengthy take home exams and weekly work. I also feel like I am more confused about what Islam is than I was when I started the class, but maybe that is simply the nature of religion in general.","lots of fluff, learn alot of tidbits. not much about islam","A non-stressful way to study religion and Islam in particular, both of which are relevant topics politics and are helpful to understand for practical, life reasons.","It's a great class with a reasonable day to day workload, but the midterm and especially the final are really long.","This course is an excellent to learn more about Islam and about how to approach a religion or cultural element one doesn't understand. I highly recommend this course to anyone who doesn't know anything about Islam and is even only a little curious about it. You will learn a great deal!","Professor Asani is an amazing lecturer and he does a very good job at explaining the material in an amazing way. Plus, he explains lots of misconceptions about Islam, not as a Sheikh or Imam, but simply as another human being telling you about Islam from a cultual perspective.","This class focuses much more on theology and Islam as a religion than it does on contemporary Islamic societies.  If you like that kind of thing it is fine, but Professor Asani focused on current issues for a fraction of one lecture.  That made this course very boring.","This is a great introduction to Islam, but be prepared for a course with little structure. If you are not well disciplined it is easy to fall behind in readings and lecture notes. The material covered is very interesting, but will focus more on the history of Islam than on modern societies.","You should not take this class if you are looking for an \"easy GenEd\" or \"easy A\" you should take it because it is a fascinating area to study, and is a well taught and well-constructed course.","If you have the slightest experience with Islam, this course is too basic for you. You won't learn and you won't be challenged. If you don't have any experience with Islam, it is an easy Culture and Belief.","This is a great class if you want to learn more about Islam- I learned so much! However, the final exam is killer (18 page take-home...but at least it was released 2 weeks before the deadline) compared to the rest of the work required for the semester. There's a lot of reading, but it's definitely manageable to pick and choose what you read.","Not just an easy gen ed class. Need to be really switched on and actually do quite a bit of work to get a good grade. Having said that, it was extremely interesting and the course material is very relevant to the world today. Great class if want to learn about an important and different culture","Very good introduction to Islam as a whole for the novice.","A good introduction to Islam. Professor Asani and the teaching staff is great. However (as with any class) you will get out what you put in.","This is a great gen-ed! I learned a lot about Islam and the work load is moderate. The final does take a lot of time but otherwise, it was a good class. Our section TF (Jeff Eden) was also engaging and funny. He's definitely one of the best tfs ever!","Honestly, it can be a bit boring at times, particularly the first half of the class which pertains to the basic tenets of Islam. It's also a lot of reading, and you don't need to do all of it to get a good grade. The weekly lecture reviews are kind of a pain, as well, particularly if you don't have any specific questions to address. This being said, it was a great class in that it opened my eyes to a lot of stereotypes and preconceived notions that I had of Islam.","This class is super-chill. Professor Asani is a great lecturer, quite enjoyable. The workload per week wasn't too bad and it was nice having all the lectures online. Just watch out, because the take-home midterm \/ essay \/ and take-home final will require a LOT of time.","It can be very repetitive, so if you're not extremely interested in the topic I would say take something else.","This course is low on workload and very interesting but the grading is very harsh for a humanities Gen-Ed. Don't take it if you're into math\/sci.","Make sure to keep up with lectures by either going to them or watching the recordings. Things will be easier down the road if you take the lecture reviews seriously and use it as an opportunity to reinforce material from each lecture. Professor Asani is very helpful and friendly, so don't be afraid to talk to him if you have any concerns.","A true GenEd. It changed how I view Islam and religion in general. Definitely take it if you have the time to keep up with the readings. The lecture readings are not super important but try to do the section readings. No matter how much you know about Islam, you can learn from this class. This is coming from someone that grew up in an Islamic country.","Very manageable as long as you keep up with the readings. Professor Asani is a great lecturer and does a great job of providing a framework from wich students can understand modern tensions and conflicts pertaining to Islam.","Take this iff you are interested in religion, Islam, or the historical Middle East. If your only reason to take this is to fulfill a general education requirement, you will suffer. The readings are long, and the lectures are longer. However, if this is a subject of interest for you, it is extremely informative and it is a wonderful and comprehensive course to start your studies on the Middle East and Islam.","This is an interesting class on a highly relevant topic with a relatively light workload (although the take home midterm and final require significantly more time than the weekly work).  However, it is very clear that Professor Asani favors a particular view of Islam as liberal and pluralistic, and the whole course more or less is framed around this conception.  This might not be as appropriate for an introductory class as some would like.  However, it is an interesting perspective, one that is not often brought up in a lot in discussions of Islam in the news.  Overall, I did feel like I learned a lot.  I would just advise others to keep an open mind, thinking critically about both Asani's viewpoints and those he is more or less arguing against.","Prof. Asani was an incredible teacher and my sections were usually thought provoking and relaxed. Lectures and most course materials were online, so attending class was pretty optional (although weekly lecture response papers meant watching online was necessary--which meant I had to watch enough of a lecture to learn what I needed to). Islamic history and culture are very relevant influences in our world, and if you want to understand it politically, socially, and theologically take this class. Also, the class was pretty pro-Islam and progressive, so (although a bit biased) it ended up nicely balancing with the negative attitude of the West.","Professor Asani and the TFs are incredibly supportive, and it's wonderful to engage with the core tenets that make up diverse practices of Islam, particularly in a college environment that often does not focus on the experience of religion, but only on its sociopolitical usages.","Take itâ€”very nice gen ed. If you go to the college, go to the actual lecture. Also, do put some effort in (read the books, read before sections) to get the most out of it. Prof. Asani is also fantasticâ€”makes an effort to meet every student! (seriously, I wish every prof. did this). He is also very accessible so if you have ANY question, approach him. Try the online section (I found it quite good since I met so many cool ppl from around the world).","You will learn so much more than you thought you knew about Islam, and religion in general.","This course was a really great introduction to Islam if you had no previous knowledge of Islam, but it also provided a different way of analyzing and approaching topics for those who did. It's consistent work that is manageable, and the midterm, the paper, and final were enjoyable. Just make sure you give yourself A LOT of time for the final because it is really long.","Go meet Professor Asani! He's a great professor, lecturer, and person!","If you have any cultural interest, I would absolutely recommend you to take this course. Although I would not call it a demanding or challenging course per se - as you can definitely get by even with little work - if you are prepared to challenge your own stereotypical or culturally shaped views and put in some hours to engage with the material and get something out for yourself, then this can be one of the most wonderful classes. And you will actually start seeing the world from a different perspective. Long story short: take this class! And if you can choose the Section: pick Henry's section, you will not regret it.","Professor Asani is phenomenal. As is TF Jeff.","I think everyone who is interested in the affairs of the world and who wants to understand the effects of occurrences in the Islamic world on the West needs to learn more about Islam from a perspective that is not Islamophobic and bias such as the one often projected by mainstream news. I wish more people could learn about Islam from the perspective of a person like Professor Asani.","Has a few good moments but not that many. very long take home midterm and take home final. I think there are more interesting classes out there.","This class is fantastic..gives you a good overview of Islam..prof asani \/ TFS were all very friendly and acessible...note of caution: prof asani practices grade deflation so only a handful of the 150 kids in the class got an A on the midterm (you should note this, but still understand that grading is by and large very fair); also you can't expect prof asani to cover all of islamic theology \/ all modern manifestations of islam \/ islamic history over 12 weeks in a semester.","Professor Asani is very knowledgeable and enthusiastic about the material. Definitely learned a lot this semester. Reading workload can be a bit heavy though, and the take home final was extremely long and time consuming. Other than that, the workload isn't too bad.","Wonderful course, not too demanding, interesting lectures and readings, will definitely give you a great overview of Islam, albeit not with tremendous depth","be ready for an 18 page final. I think the course description should include the amount of work required for the \"take home final\"","It's one of the best courses that introduce Muslims contemporary societies.","Incredible class and my favorite this semester. Professor Asani is an engaging lecturer and very accessible outside of class. I learned a lot of interesting material. The assignments were fair and section was a great experience.","This was a great course for a CB requirement. The professor is great and my TF held pretty good sections. The class can get tedious at times though since so much of it is paper based and the lectures are dry so I ended up just watching them online. It really helps to take good notes during lectures so you don't have to go through all the videos when it comes to writing essays for the take home midterm and final.","This is a very interesting class with not too much work, except the exams are pretty painful. But Asani is such a great lecturer- you will learn so much about Islam and religion in general. It does have a little bit of history, but it is mostly based on the approach to Islam and religion in general. Overall a great class. The lecture readings were a bit much, but section readings are more helpful\/interesting.","For someone like me who didn't know very much about Islam previously, this course was really informative. I learned a ton of facts and background information, and I also learned about the reasons why Muslim societies have certain customs. Professor Asani also clearly cares a lot about teaching and encourages students to come talk with him one on one. Not too much work, either.\r\n\r\nThe class is broadcast online though, which means it is a bit different than a normal lecture--few people actually come to the lecture hall. Half the sections meet online too, though you can opt for an in person section too. I wasn't a big fan of all this, but it probably doesn't bother some people.","Interesting introductory class.  Look out-it may be a gen. ed. but the professor does not believe in grade inflation.  (i.e. getting an A may be a little bit more difficult than expected)"]}},"mostRecentQ":{"overall":"3.81","workload":"1.85","difficulty":"2.80","recommendation":"3.87","enrollment":"101","response rate":"94.06","QCourseOverall":{"number":"CULTR&BLF 19","course_id":"1935","cat_num":"1065","1s":"0","2s":"8","3s":"29","4s":"31","5s":"27"},"QDifficulty":{"number":"CULTR&BLF 19","course_id":"1935","cat_num":"1065","1s":"5","2s":"20","3s":"60","4s":"7","5s":"2"},"QWorkload":{"number":"CULTR&BLF 19","course_id":"1935","cat_num":"1065","1s":"30","2s":"53","3s":"9","4s":"2","5s":"1"}},"success":true}