{"scores":{"Spring '14":{"course_score":{"overall":"2.50","workload":"3.20","difficulty":"3.90","recommendation":"2.60","enrollment":"25","response rate":"76.00","QCourseOverall":{"number":"ENG-SCI 183","course_id":"1349","cat_num":"16727","1s":"4","2s":"7","3s":"4","4s":"2","5s":"2"},"QDifficulty":{"number":"ENG-SCI 183","course_id":"1349","cat_num":"16727","1s":"0","2s":"0","3s":"6","4s":"9","5s":"4"},"QWorkload":{"number":"ENG-SCI 183","course_id":"1349","cat_num":"16727","1s":"0","2s":"4","3s":"9","4s":"5","5s":"1"}},"instructor_scores":[{"number":"ENG-SCI 183","cat_num":"16727","course_id":"1349","year":"2013","term":"2","id":"24ba63bfac055df4096a66927a7c8a15","first":" David","last":"Clarke","InstructorOverall":"2.90","EffectiveLecturesorPresentations":"2.90","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"3.10","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"3.10","ReturnsAssignmentsinTimelyFashion":"3.20"}]},"Spring '13":{"course_score":{"overall":"2.71","workload":"2.71","difficulty":"3.29","recommendation":"2.86","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"ENG-SCI 183","course_id":"1349","cat_num":"16727","1s":"4","2s":"7","3s":"4","4s":"2","5s":"2"},"QDifficulty":{"number":"ENG-SCI 183","course_id":"1349","cat_num":"16727","1s":"0","2s":"0","3s":"6","4s":"9","5s":"4"},"QWorkload":{"number":"ENG-SCI 183","course_id":"1349","cat_num":"16727","1s":"0","2s":"4","3s":"9","4s":"5","5s":"1"}},"instructor_scores":[{"number":"ENG-SCI 183","cat_num":"16727","course_id":"1349","year":"2012","term":"2","id":"24ba63bfac055df4096a66927a7c8a15","first":" David","last":"Clarke","InstructorOverall":"2.86","EffectiveLecturesorPresentations":"2.57","AccessibleOutsideClass":"3.17","GeneratesEnthusiasm":"3.43","FacilitatesDiscussionEncouragesParticipation":"3.33","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"3.00"}]}},"comments":{"Spring '14":{"comments":["This course was difficult due to the fact that there isn't much of a support structure. Make sure to read the textbook on your own and re-familiarize yourself with your thermo topics.","There were many speed bumps along the way in this course--problem sets had many errors, there was a noticeable lack of communication between the professor and TFs, the second exam questioned your ability to make a good cheat sheet more so than your knowledge of heat transfer, and the lab component of the course was unnecessarily demanding. However, by the end of the course I knew heat transfer well enough to apply it to real world situations, Professor Clarke is a kind and thought provoking professor, and the end of year BBQ was a lot of fun.","WORST ENGINEERING CLASS TAKEN AT HARVARD... Clarke needs to improve the course tremendously.  The psets had too many errors, and most of the times, the grad school TFs agreed that they had no idea what Clarke was asking for.  The final project was the worst where Clarke kept changing his mind about the approach to solving our proposal... and made us do extra calculations for two weeks that went against our entire initial set of findings.. to be told later that he had made a mistake.\r\nThe TFs would grade lab reports without any guidelines present and no comments.. Same with homework.  The sections were useless where the TFs did not even go over practice problems that would help us on the homework..","This course was pretty disorganized and its goals of a project\/assignment\/homework problem and knowing what was expected of us were often left unclear.","The most poorly organized badly taught engineering class for mechanical engineers. It's only in its second year which is partially why it's so unorganized, but wow. It's bad! You will not learn anything unless you teach yourself from the book. The problem sets are confusing and you always have to go to ohs, the TFs don't speak English, and Professor Clarke is a nice person but not the best as a prof. - stultifying lectures.","The material is so interesting and this class should be enjoyable, but due to Prof. Clarke's lack of organization and the course's misguided assignments (and mostly everything) it was the worst class I've taken at Harvard. It's too bad, right now at least, that it is required for ME. Hopefully the class can be improved so it can actually be an enjoyable requirement.","Don't take this course unless you have to.","Take it if you must. Else hold off until the course improves.","A \"necessary\" evil","requires a lot of work but very beneficial","It is a lot more work than I initially thought- I have spent more time with my group working on this final project than any single assignment I've yet completed in college, and we are still not done. I do feel as though I'm applying heat transfer principles well, and learning-- it's just much more difficult than rote problem set classes.","The material is incredibly useful and important if you're trying to be an engineer. The class is still a little rough around the edges, although it's only in its second year."]}},"mostRecentQ":{"overall":"2.50","workload":"3.20","difficulty":"3.90","recommendation":"2.60","enrollment":"25","response rate":"76.00","QCourseOverall":{"number":"ENG-SCI 183","course_id":"1349","cat_num":"16727","1s":"4","2s":"7","3s":"4","4s":"2","5s":"2"},"QDifficulty":{"number":"ENG-SCI 183","course_id":"1349","cat_num":"16727","1s":"0","2s":"0","3s":"6","4s":"9","5s":"4"},"QWorkload":{"number":"ENG-SCI 183","course_id":"1349","cat_num":"16727","1s":"0","2s":"4","3s":"9","4s":"5","5s":"1"}},"success":true}