{"scores":{"Spring '13":{"course_score":{"overall":"4.52","workload":"2.33","difficulty":"3.33","recommendation":"4.22","enrollment":"27","response rate":"100.00","QCourseOverall":{"number":"CULTR&BLF 55","course_id":"1968","cat_num":"14022","1s":"0","2s":"0","3s":"2","4s":"9","5s":"16"},"QDifficulty":{"number":"CULTR&BLF 55","course_id":"1968","cat_num":"14022","1s":"0","2s":"2","3s":"17","4s":"5","5s":"3"},"QWorkload":{"number":"CULTR&BLF 55","course_id":"1968","cat_num":"14022","1s":"2","2s":"15","3s":"9","4s":"1","5s":"0"}},"instructor_scores":[{"number":"CULTR&BLF 55","cat_num":"14022","course_id":"1968","year":"2012","term":"2","id":"04e26e5745cc926d59c1ed8a45ff9efc","first":" James","last":"Engell","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.67","AccessibleOutsideClass":"4.56","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.59","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.33"}]}},"comments":{"Spring '13":{"comments":["One of the best you can take at Harvard. Encapsulates the liberal arts education and inspires me to want to make a positive impact on the world. Professor Engell brings this material to life and makes Enlightenment era texts relevant and applicable to modern life. His passion for teaching, and in particular fro teaching this material, makes this class a truly wonderful experience.","It's a great course that makes you really think about things, and the readings, although long, are usually pretty interesting if you get into them!","Not easy but extremely rewarding. Don't take it if a low grade will scare you. That said, it seems like a quintessential Harvard course! Very stimulating.","Take advantage of the great opportunity to discuss great readings. You don't need to do all of the readings, and you can make a lot of the reading exciting if you try.","Make sure you do the readings. Also, because there are so many readings and they are so dense, plan your class schedule accordingly.","Great class, but it is a ton of work for a Gen Ed. You have to be ready to do a lot of reading.","It's phenomenal","The class is very interesting, but far from a \"walk in the park\". It requires a lot of time and is very difficult.","There are definitely problems with the Gen Ed system, but that doesn't mean there aren't any really great Gen Ed classes.","This course is a pretty easy great books class, you'll be better read and it doesn't ask too much of you. Engell is fantastic.","Nice way to knock out the Culture and Belief requirement while still learning something and not being surrounded by 100 students who are just there for the easiest Gen Ed possible. Pretty manageable course as the papers are very short. The syllabus is interesting and varied and the teaching staff is solid and friendly. Not quite as 'life-changing' as I thought it might be, though.","best course ever. professor engell is an amazing lecturer - he literally stands in front of the class and talks without any powerpoint\/aides, but he can get away with it because he's so awesome. the readings were significant, but the lectures are thorough enough that you can get away with not reading every single word. the assignments are structured so you actually get to work on papers and improve which is rare for a harvard class, and the class is designed to be relevant to your life. if you're looking for a blow-off class with no work, don't take this. if you want the epitome of a liberal arts education and a class you'll remember for the rest of your life, take this. (also, jake risinger is the best TF ever - incredibly helpful in office hours, guides the discussion in section without being overbearing, and genuinely cares about you as a student and also a person)","Great way to fulfill the CB req. You get exposure to great literature, the assignments are interesting, but not too hard, and Prof. Engell is a wonderful and conscientious teacher who really is excited about teaching.","Make sure to stay on top of the reading, as it is expected that you will be familiar with it in the lecture where it is discussed. The papers were short and difficult, but the opportunity to revise allows you to improve your writing, your paper, and your grade. This class was challenging, but I learned a lot, probably the most of any of my (non-concentration) Gen Eds.","This class is a lot of reading, but it is all essential to becoming a complete person. This is a class that everyone should be required to take before they graduate from Harvard. Though the reading is a times challenging, Professor Engell and the TFs are extremely helpful and knowledgeable on the subject. The teaching staff is extremely organized and one of the best teaching units I've had the pleasure of learning from. Additionally, the writing assignments may be challenging but chances to re-write give you a chance to succeed if you are willing to put in the effort.","Do yourself a favor and take whatever class that Professor Engell is teaching. Professor Engell is the epitome of what every professor should be like, and his dedication to teaching and commitment to students are both inspiring and make for an incredible academic experience. The readings and material discussed in class are intellectually interesting, and the teaching staff does a wonderful job of tying these discussions of the Enlightenment to broader conversations about our society today. Honestly, the readings for this class were fun, and you get so much out of it. This class is a must-take!","Phenomenal class - one of my favorites at Harvard. I loved how we read political theory, landmark historical documents, novels and poetry, which together gave a very rich perspective on Enlightenment movements. This course is a great way to read the kinds of things you'd get in a Social Studies 10 kind of class without the intense workload. Engell is also an engaging lecturer and puts a lot of care into his assignments to make sure his students get the most out of the material. All in all a fantastic experience.","there's a lot of reading, and the teaching staff will hold you to very high standards. that being said, that challenge forced me to become a better student\/reader\/thinker both when grappling with the readings and the discussions, but also tackling modern-day issues; i am so happy i took this course. it's what i imagined when i thought of a quintessential \"harvard course.\" You have the opportunity to engage with complex ideas\/texts\/thinkers, and to do so under professor engell's guidance is incredible. it's definitely NOT an easy GenEd, but it's so worthwhile.","Take this course to learn more about the Enlightenment and to deeper your philosophical thinking.  Be warned there is a ton of reading.","This class is a reasonably manageable way to knock out a Gen Ed and exposes you to a wide variety of ideas and readings.  However, there is a lot of reading, and one downside to the diversity of readings is that they are not always tied together effectively.  Hopefully, the course will be a little better organized in the future.  Prof. Engell clearly puts a lot of time and thought into his lectures, and many lectures are very good, but he sometimes engages in a little too much moralizing.","This was one of the best courses I have ever taken at Harvard.","This class was great, especially given that this was the first year that it was offered.  The readings were thought-provoking, and lectures went over them in more interesting ways than simply re-hashing summaries.  The readings are a bit dense at times, but they get cleared up in lecture and section significantly.  This is a solid course to fulfill a C&B requirement because of how interesting and applicable the materials in the course still are today."]}},"mostRecentQ":{"overall":"4.52","workload":"2.33","difficulty":"3.33","recommendation":"4.22","enrollment":"27","response rate":"100.00","QCourseOverall":{"number":"CULTR&BLF 55","course_id":"1968","cat_num":"14022","1s":"0","2s":"0","3s":"2","4s":"9","5s":"16"},"QDifficulty":{"number":"CULTR&BLF 55","course_id":"1968","cat_num":"14022","1s":"0","2s":"2","3s":"17","4s":"5","5s":"3"},"QWorkload":{"number":"CULTR&BLF 55","course_id":"1968","cat_num":"14022","1s":"2","2s":"15","3s":"9","4s":"1","5s":"0"}},"success":true}