{"scores":{"Spring '14":{"course_score":{"overall":"4.40","workload":"1.80","difficulty":"2.60","recommendation":"4.50","enrollment":"61","response rate":"59.02","QCourseOverall":{"number":"SOC-WORLD 49","course_id":"2062","cat_num":"29129","1s":"0","2s":"1","3s":"2","4s":"15","5s":"18"},"QDifficulty":{"number":"SOC-WORLD 49","course_id":"2062","cat_num":"29129","1s":"2","2s":"12","3s":"21","4s":"1","5s":"0"},"QWorkload":{"number":"SOC-WORLD 49","course_id":"2062","cat_num":"29129","1s":"10","2s":"22","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 49","cat_num":"29129","course_id":"2062","year":"2013","term":"2","id":"d6a94661ebb0b8225880301389fb0449","first":" William C.","last":"Kirby","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.90"}]},"Spring '13":{"course_score":{"overall":"4.31","workload":"2.02","difficulty":"2.82","recommendation":"4.45","enrollment":"59","response rate":"89.83","QCourseOverall":{"number":"SOC-WORLD 49","course_id":"2062","cat_num":"29129","1s":"0","2s":"1","3s":"2","4s":"15","5s":"18"},"QDifficulty":{"number":"SOC-WORLD 49","course_id":"2062","cat_num":"29129","1s":"2","2s":"12","3s":"21","4s":"1","5s":"0"},"QWorkload":{"number":"SOC-WORLD 49","course_id":"2062","cat_num":"29129","1s":"10","2s":"22","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 49","cat_num":"29129","course_id":"2062","year":"2012","term":"2","id":"d6a94661ebb0b8225880301389fb0449","first":" William C.","last":"Kirby","InstructorOverall":"4.42","EffectiveLecturesorPresentations":"4.62","AccessibleOutsideClass":"3.93","GeneratesEnthusiasm":"4.57","FacilitatesDiscussionEncouragesParticipation":"4.59","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.06"}]}},"comments":{"Spring '13":{"comments":["This class is great and is one of the few classes at Harvard that offers a glimpse into business school course material and lecture style. Kirby is obviously very knowledgeable and well-connected. \r\nThe participation focus can certainly be stressful especially for shyer students...get ready to sit with your hand up for the entire hour if you want participation credit.","Awesome class for anyone going into business or interested in China. I recommend it highly.","Professor Kirby gives interesting lectures -- if you want a sense of what aspects of 'business' we focus on, try to find an HBS case study to skim over. There was more history than I expected, but I enjoyed that. As a case study course, it isn't nearly as demanding as real HBS courses (which is less pressure, but if you're looking for that rigor then take an HBS course instead). The section TFs weren't very organized as a whole, although it was easy to get support if you reach out.","Not a lot of work, but it is hard to get an A unless you write according to certain guidelines. You learn to like what Prof. Kirby and the TFs expect though","Fantastic course to take. You learn a great deal about the business world in China, as well as Hong Kong and Taiwan. The cases, although sometimes long, are very interesting and offer strong perspectives. Be prepared for a lot of discussion in class. Attendance is mandatory and cold calling happens often, and many students were ill-prepared. The teaching staff is extremely enthusiastic and Kirby is just an amazing lecturer. Highly recommend this course.","This is a great course if you're interested in China or business. Professor Kirby is AMAZING and the class is so interesting. You absolutely have to read each case thoroughly before class, but there are no exams. Having a case-study class was a really cool experience. I probably learned and retained more from this class than any other class I've taken.","This is a really great class. Just be prepared to actually do the readings. You really don't want to be called out for not having properly done the readings of the cases for class discussion. With that said, the case studies are all very interesting","While the course material is interesting, the organization and grading are unpredictable.","This course is pretty easy and very interesting. It's a nice change in pace from the traditional course format at Harvard, and it's a good taste of what a business school course might be like!","The course needs a little bit more structure. I would also reach out to people who took it previously to know about how case study grading goes.","It's mainly for students without any background in China. Questions the prof. asked in class were not challenging. Class discussion was basically a competition of \"who read the cases more carefully and memorized the details\"..","Definitely take this course if you are at all interested in Chinese history\/culture and\/or international business. Professor Kirby is a renowned for his research about doing business in China and is makes the study of Chinese history and culture very engaging. The course load for the class is also very manageable, and the case studied we read for class were very interesting and eye-opening.","A different type of work than you might be used to, this course gives you a great deal if you are engaged the whole semester. I was not very interested in visiting China before this course, and now I am dying to go.","This is a great chance to learn about the booming economy of China through a interesting HBS style case format.","Definitely try and take this class. It was one of if not the best class that I have taken at Harvard. If you have any interest in going to business school or in doing business in China then you should absolutely take this class.","This is one of my favorite classes at Harvard. There are few classes that offer such incredible discussion with a top professor who actually invests in his students. The workload is manageable (although you really have to do the reading) and I enjoyed writing my own case study. The visitors from various corporations were also very interesting.","If you are interested in business in China, this course will teach you a few key points that are important to understand!","This is a great class that is very engaging. Definitely read the case studies before class, because that makes class way more interesting an also allows you to participate, which is a huge part of the grade. Professor Kirby is really entertaining, and you will learn a ton about China!","This course makes you want to go to class. The discussion lead by Kirby is always engaging and very thought provoking. You really feel like a part of the discussion when Kirby makes an effort to hear from a wide range of people and their opinions. Although a lot of comments were very fact based and individual opinions\/creative suggestion were not given too much time by Kirb.","It's an awesome class that makes you feel more like a Harvard student than usual haha. The case study format (HBS style) is really fun and forces you to be involved and do the short readings before each class. There are 2 short book reviews and 1 team final project, no midterms or exams, and the workload is very manageable. Its really popular and had to be lotteried, so have a backup in case it doesn't work out.","If you care about getting the grade you deserve or knowing how you're doing in the class, do not take this class. They never really tell you how you're graded\/evaluated. If you don't care about getting an arbitrary grade, then take the class! It's really interesting and the case study format (whole class discussion) is engaging.","The class has a light course load but is not very enlightening. The case studies are interesting, but the class discussions are rather dull in that they focus on regurgitating facts already presented in the case studies.","One of my favorite classes at Harvard! If you have any interesting in business (not necessarily in China) and can get into this class, definitely take it! Prof. Kirby is awesome, cases are super interesting, and in general it's just a great class. Throughout the term several case protagonists visited the class, which was an added bonus. Final group project took a lot of time but was actually pretty enjoyable. And do not worry of you do not speak Chinese - plenty of people don't, myself included. Overall a really good educational experience that came at relatively low effort week-to-week."]},"Spring '14":{"comments":["You learn a lot. The case studies are interesting and are not too long of a read. Guest speakers are well accomplished. Professor Kirby is quite the expert on the business environment in China.","This class is so interesting, and the topic is really important and will redefine how you think about global business. Even if you are not particularly interested in business, the topics are so relevant and interesting that you should consider taking this class. You have to go to class since participation is a huge part of your grade. It can be hard sometimes to get your thoughts in, but it's really well taught and the cases are fascinating. For your final project, make sure you start it early and make sure you have the data you need. Take this class!!!! Highly recommend!! Make sure to read the cases closely before class - there's nothing worse than getting cold called and not knowing the answer to a simple question.","This was a really cool class and I highly recommend it. It's run like a business school class, so read the cases and actually try to be prepared for class but readings (case studies) are completely manageable. You learn a lot about Chinese history by learning about Chinese business, and Professor Kirby is fantastic. One of my favorite classes at Harvard.","This is a truly wonderful class. Prof. Kirby is extremely knowledgeable, and you will learn a lot about China's history, politics, and business environment.","Taught in HBS case study format.  Very interesting material.  Only have to read about 10 pages for each class.","There is too much weight placed on class participation which makes the grading seem a little arbitrary. But this shouldn't deter one from taking the course; the material is very interesting and Prof. Kirby is an engaging lecturer.","This course was FANTASTIC. While it was  awesome to take a b school style class, don't take this class just to experience b school classes; it really is a course about China taught through the b school lens. That being said if you have any underlying interest in China and are comfortable in the b school setting, this is a must take if you can get in via the lottery. Kirby is incredibly knowledgable and the teaching staff is great. Readings are varied and fascinating, from the wine industry in China to fuel cells to Google. While the fact that almost half of your grade is based upon speaking in a 50 person lecture, don't let that stop you from taking this gem of a class. Your grades may not thank you, but you will walk out of that case-study room more knowledgeable each week.","If you can get into this class, TAKE IT! It's maybe 15 minutes of reading 2x a week, and the material rocks. The essay load is not too bad- if you split the final case 3 ways it's like 12 pages total for the whole semester... Class is super fun, but the experience varies based on your background- for me, as a white person who knew nothing about China, it was very illuminating and interesting.","Best class at Harvard! I actually enjoyed and completed all the readings, and I learned so much from Professor Kirby and the TFs.","Great class if you're thinking about working or doing business in China. You get to meet people featured in the cases too!","If you are interested in learning about China, especially if you have no prior knowledge, this class is great. A lot of reading but well worth it.","Case format and low workload are good. Could teach a lot more about China but it's a good intro","If you have any interest in business, take this course! It is a great senior spring class: interesting material, very manageable workload, and a refreshingly participatory format in both lecture and section.","The most useful aspect of this course for me was the readings. Lectures were a good way to reinforce what you read, but because a large part of the course is participation-based, this often resulted in a lot of people participating for the sake of participating (citing facts and figures from the case, which seemed not entirely useful since everyone ought to have read the case by that point), which was a turn-off for me. I found the discussions of patterns\/trends to be more useful, but because a large part of the course you get from the readings really think about whether you want to use this to take up one of the four or five classes you can take a semester. Prof Kirby can also be dismissive\/sarcastic about responses he doesn't agree with, which doesn't really foster an encouraging environment for students (depending how thick-skinned you are).","You will learn of a case of a life insurance company that is gaining market share in China, and how they have done it, before class - then you will be surprised to see the main player, CEO, of that company, in class, speaking to you and answering questions on the case you read prior to class. Excellent course, incredible HBS-like structure, boosts your communication skills as you need to participate, you get a full picture of what it is like doing business in China.","This class is a great introduction to China through the eyes of business. I would highly recommend this if you're interested in the rise of China and your place in this balance of world powers. You should be comfortable speaking up and participating in this class because TFs write down who speaks every lecture. Reading the cases if essential for full participation. You get out of this course what you put into it. You don't really have to know anything about China, although it would help tremendously considering the participation component of the grading system. That said, it is not a history class that goes deep down into the political of cultural history of China. If you're searching for that, this is not the class for you. But if you want a pretty low stress class where you learn a lot, go for it!","A great class, especially if you're interested in modern China or business. Kirby is a fantastic professor and class was always fun. I found the material engaging and the workload was never too heavy. Also, if you're interested in business school, this is a good introduction to the case-study format. It was one of the few classes at Harvard that kept me engaged every class all year round.","Professor Kirby is funny, knowledgeable, and engaging. The reading materials are interesting and not too long. In addition to gaining understanding of the Chinese business culture, it is a great review (or introduction) to modern Chinese history.","GREAT CLASS!! Learned so much about china, and business in China as the title demonstrates.  Seemingly every other class the professor had \"guests\" who were exceptionally powerful, interesting, innovative, successful and inspiring businesspeople in China.  The final project was fun and the case studies were stimulating, engaging and awesome!  HIGHLY recommend this course to anyone interested in business, china, innovation, entrepreneurialism or anything of the sort.","It's a great class."]}},"mostRecentQ":{"overall":"4.40","workload":"1.80","difficulty":"2.60","recommendation":"4.50","enrollment":"61","response rate":"59.02","QCourseOverall":{"number":"SOC-WORLD 49","course_id":"2062","cat_num":"29129","1s":"0","2s":"1","3s":"2","4s":"15","5s":"18"},"QDifficulty":{"number":"SOC-WORLD 49","course_id":"2062","cat_num":"29129","1s":"2","2s":"12","3s":"21","4s":"1","5s":"0"},"QWorkload":{"number":"SOC-WORLD 49","course_id":"2062","cat_num":"29129","1s":"10","2s":"22","3s":"4","4s":"0","5s":"0"}},"success":true}