{"scores":{"Fall '13":{"course_score":{"overall":"4.70","workload":"2.40","difficulty":"3.00","recommendation":"4.70","enrollment":"21","response rate":"80.95","QCourseOverall":{"number":"ANTHRO 1400","course_id":"147","cat_num":"53142","1s":"0","2s":"0","3s":"0","4s":"5","5s":"12"},"QDifficulty":{"number":"ANTHRO 1400","course_id":"147","cat_num":"53142","1s":"0","2s":"2","3s":"14","4s":"0","5s":"1"},"QWorkload":{"number":"ANTHRO 1400","course_id":"147","cat_num":"53142","1s":"1","2s":"10","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1400","cat_num":"53142","course_id":"147","year":"2013","term":"1","id":"0b03e86ef4eedb34b3e59d021d165838","first":" Arthur","last":"Kleinman","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.50"},{"number":"ANTHRO 1400","cat_num":"53142","course_id":"147","year":"2013","term":"1","id":"3c83ccd0120f2715a22ecff5ee871f82","first":" David","last":"Carrasco","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.40"}]}},"comments":{"Fall '13":{"comments":["There is no reason not to take this course. As long as you are interested in hearing what older, experienced teachers have learned over the years, and in sharing some personal stories to bounce off of theirs, you'll love this class. The readings are super engaging and the only real work is around essay-writing a couple of times a year. Doing the readings for the most part does not feel like homework at all, just like the class doesn't really feel like class, but rather some kind of self exploration, but through other peoples' experiences. It is truly awesome.","This is a beautiful and life-changing class, mainly because of it's relevance. Everything that you study, every discussion you have, every (distinguished) guest speaker you hear, is applicable to your life, your \"art of living.\" Prof. Kleinman and Prof. Carrasco are both amazing academics, teachers, and human beings that, though they may deny it, are incredibly wise. This class, like no other I've taken at Harvard, has helped me understand who I am in the context of my morality, my community, and the world. If you are interested in learning more about any of these things, take this class.","You should definitely take this class as it's a course like no other at Harvard, but do not expect a very clear outcome or take-away. Wisdom, obviously, means a lot of different things, so this course will not wrap up as easily as others.","An incredibly unique course. Taught by two fascinating professors, Anthro1400 creates a space for honest discussion about topics that really matter to us. Recommended for students that are questioning their post-graduate plans and those that value reflection. The readings are often times lengthy, but quite fun to read.","The more you put into this class, the more you will get out of it. It's very easy to scrape by without doing all the reading, but you will have a much more transformative experience if you actually do all the reading and think\/talk about the topics outside of the class. Both Professor Kleinman and Professor Carrasco are awesome! In short, take it if you're willing to take it seriously; don't waste their time and yours by taking it if you're not.","I haven't had time to take every class at Harvard but I feel confident saying that this is far and away the best class at this school. This is not a class to go into lightly, for an easy grade or easy class; you should be ready to completely buy in and spend time reflecting on the class materials every week, but it is worth it. If you fully commit to this course it will change your life. I can't recommend this course enough; it has been a significant event in my life. Professors Carrasco and Kleinman are absolute all-stars.","This class claims to be transformational and it actually is - you won't take another class at Harvard that is quite as student-focused and driven as this one, with professors as amazing as Carrasco and Kleinman.","this course really made me think about life in new ways, and I engaged with both my classmates and the professors on unprecedented levels. definetly one of those life changing, transformative classes if there ever was one.","This class is a once in a lifetime opportunity. I have never heard of another class at this school anything like it. In talking about wisdom and what really matters, you really are talking about what it means to live a moral life, and what different people in different times and places have had to say about that quest. I'm so sad that this class is ending for me, and I can already tell that it will be one of the courses that will remember long after I leave this school","Excellent class. If you are at all interested in being forced to think in new ways, take it.","This is a great way to work closely with leading figures in various academic fields and engage with intellectual texts and materials you may or may not have had a chance to work with in the past. You get out of this course the amount of time and effort you put into it. If you let it, the coursework and class discussions transcend the time you spend in the classroom, illuminating your everyday life.","This course is an absolute gem. Super-famous super-wise Professors Kleinman and Carrasco basically tell stories the whole time. After the class, they expect email updates for 5 years to see how we are doing, which is a nice touch. The readings are great, you get to meet a holocaust survivor, practice modern dance, and listen to Jazz. I am a science concentrator and have never taken an anthropology course in my life. Needless to say, it is accessible and applicable to anyone who has lived. Don't leave Harvard without taking this course.","This class was incredible. The material and professors were truly inspiring. Even though the material tended to be heavy, this class provided the means to approach big questions in a meaningful and pragmatic way."]}},"mostRecentQ":{"overall":"4.70","workload":"2.40","difficulty":"3.00","recommendation":"4.70","enrollment":"21","response rate":"80.95","QCourseOverall":{"number":"ANTHRO 1400","course_id":"147","cat_num":"53142","1s":"0","2s":"0","3s":"0","4s":"5","5s":"12"},"QDifficulty":{"number":"ANTHRO 1400","course_id":"147","cat_num":"53142","1s":"0","2s":"2","3s":"14","4s":"0","5s":"1"},"QWorkload":{"number":"ANTHRO 1400","course_id":"147","cat_num":"53142","1s":"1","2s":"10","3s":"5","4s":"1","5s":"0"}},"success":true}