{"scores":{"Fall '12":{"course_score":{"overall":"3.80","workload":"2.50","difficulty":"2.90","recommendation":"4.00","enrollment":"13","response rate":"76.92","QCourseOverall":{"number":"PSY 2652","course_id":"4344","cat_num":"52745","1s":"0","2s":"1","3s":"3","4s":"3","5s":"3"},"QDifficulty":{"number":"PSY 2652","course_id":"4344","cat_num":"52745","1s":"0","2s":"3","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"PSY 2652","course_id":"4344","cat_num":"52745","1s":"0","2s":"5","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 2652","cat_num":"52745","course_id":"4344","year":"2012","term":"1","id":"3918f1a9b1dac463f83262a97a8e372d","first":"Felix","last":"Warneken","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.29","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"3.56","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.44"}]}},"comments":{"Fall '12":{"comments":["The readings can be a bit overwhelming from time to time. Think of the readings in light of the guiding blurbs the professor provides--this will be immensely helpful!","A very conversation-driven seminar class. Lots of experts in the room!","This class has an excellent reading list, and if you read it you will gain quite a comprehensive perspective on cooperation. However, presentations by classmates, which form most of the actual class sessions, are of highly variable quality.","This is an awesome class!!! Cooperation is a fascinating topic, and this class does a great job presenting it from many different perspectives (evolution, development, proximate mechanisms in adults, non-human primate studies, etc). The papers are super interesting, and there are a lot of them, which is great because by the end of the class you will know a ton! The discussions are good and challenging and Dr. Warneken is great at facilitating then. He gives good and timely feedback on the response papers. The final paper was fun to write. Take it!!!","I would only recommend this course to students who had interests in evolution or economics-related topics.","The Prof. seems to have done some good quality research in the field but since he is relatively new he is not very experienced with leading discussion, evaluating students, making expectations clear about final papers, assignments etc., and giving constructive feedback. Also, he tried to butter up students on the last day by giving muffins in class so we wouldn't evaluate him too harshly. The assignments were not graded very harshly but the final paper was very subjectively evaluated as it tends to be in these kind of classes. Also, the Prof. wasn't able to give very good inputs during discussion and it wasn't always clear what he wanted us to understand. He needs a lot of practice. Plus, he could improve on his personal\/social skills as well which many Profs. lack anyway."]}},"mostRecentQ":{"overall":"3.80","workload":"2.50","difficulty":"2.90","recommendation":"4.00","enrollment":"13","response rate":"76.92","QCourseOverall":{"number":"PSY 2652","course_id":"4344","cat_num":"52745","1s":"0","2s":"1","3s":"3","4s":"3","5s":"3"},"QDifficulty":{"number":"PSY 2652","course_id":"4344","cat_num":"52745","1s":"0","2s":"3","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"PSY 2652","course_id":"4344","cat_num":"52745","1s":"0","2s":"5","3s":"5","4s":"0","5s":"0"}},"success":true}