{"scores":{"Spring '13":{"course_score":{"overall":"3.85","workload":"2.31","difficulty":"3.31","recommendation":"4.08","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.192","course_id":"1724","cat_num":"93478","1s":"0","2s":"0","3s":"3","4s":"9","5s":"1"},"QDifficulty":{"number":"EXPOS 20.192","course_id":"1724","cat_num":"93478","1s":"0","2s":"1","3s":"8","4s":"3","5s":"1"},"QWorkload":{"number":"EXPOS 20.192","course_id":"1724","cat_num":"93478","1s":"0","2s":"9","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.192","cat_num":"93478","course_id":"1724","year":"2012","term":"2","id":"cf5b370087713f7de2470d5d2bb0a65d","first":" Sara A","last":"Newland","InstructorOverall":"4.33","EffectiveLecturesorPresentations":"4.45","AccessibleOutsideClass":"4.33","GeneratesEnthusiasm":"4.08","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.58","ReturnsAssignmentsinTimelyFashion":"4.08"}]}},"comments":{"Spring '13":{"comments":["The course readings are very interesting and the preceptor (Sara) is extremely knowledgeable and provides great assistance with essay drafts.  I enjoyed the class discussions, which really served to raise my understanding of the readings.  I would recommend this class to anyone interesting in economics or political science, or to people like me who have no interest in the social sciences but just wanted to learn more about China.","I went into expos expecting the worst, but I honestly have no complaints about my expos experience -- it was really painless, and the subject matter was really interesting! Sara was a great preceptor -- the level of detail of her comments was really impressive to me, and you can tell that she spends a lot of time critically evaluating each paper. Her comments and the conferences were, for me, the most valuable part of the course. I went into the class a strong writing and I still feel like I learned something -- I have applied the lessons Sara taught to my other essay classes, which is the entire point of expos! The readings weren't excessive. Another thing that Sara helped me understand was how to tailor your writing based on what discipline you are writing for -- I entered with a very \"humanities-y\" style and learned how to make my style more appropriate for social science papers. Probably one of the better expos classes! You will not regret taking it!","A great course! Just be willing to listen and forget your pride; your writing may be good, but there is always much to learn. Take the time to put in the mental effort - writing's not something that just comes naturally (especially to me), but Sara has much to teach you!","Sara's feedback on conference drafts is excellent and very helpful, but only id you put in good effort. Its worth treating the conference draft like a final to get the best feedback possible","This is a difficult expos course but also a very interesting and relevant one. The assignments force you to think critically about the sources and ultimately allow you to shape your own perspective on the implications of China's continued development.","Sara is helpful and informative! If you are interested in China, you should like this course.","Engaging material and well structured course","Sara is a great preceptor and will give you great feedback on your essays. Make sure to read the readings carefully, and always look over the grading rubric with a final draft of your essay to make sure you nail all the points.","Readings and assignments are relatively interesting, unfortunately it's constrained by the fact that it is an expos course so the deadlines, format etc is a nightmare. For an expos class, it's decent.","For me personally, I thought this was one of the better Expos courses available. That will vary depending on your own interests, but if you think the course description looks interesting, then I say go for it."]}},"mostRecentQ":{"overall":"3.85","workload":"2.31","difficulty":"3.31","recommendation":"4.08","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"EXPOS 20.192","course_id":"1724","cat_num":"93478","1s":"0","2s":"0","3s":"3","4s":"9","5s":"1"},"QDifficulty":{"number":"EXPOS 20.192","course_id":"1724","cat_num":"93478","1s":"0","2s":"1","3s":"8","4s":"3","5s":"1"},"QWorkload":{"number":"EXPOS 20.192","course_id":"1724","cat_num":"93478","1s":"0","2s":"9","3s":"4","4s":"0","5s":"0"}},"success":true}