{"scores":{"Spring '13":{"course_score":{"overall":"4.64","workload":"1.93","difficulty":"2.86","recommendation":"4.79","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.196","course_id":"1728","cat_num":"39724","1s":"0","2s":"0","3s":"0","4s":"5","5s":"9"},"QDifficulty":{"number":"EXPOS 20.196","course_id":"1728","cat_num":"39724","1s":"1","2s":"1","3s":"11","4s":"1","5s":"0"},"QWorkload":{"number":"EXPOS 20.196","course_id":"1728","cat_num":"39724","1s":"3","2s":"9","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.196","cat_num":"39724","course_id":"1728","year":"2012","term":"2","id":"94a0a4322677333c1de4e8cfeed27eda","first":" Deirdre Alanna","last":"Mask","InstructorOverall":"4.86","EffectiveLecturesorPresentations":"4.57","AccessibleOutsideClass":"4.93","GeneratesEnthusiasm":"4.86","FacilitatesDiscussionEncouragesParticipation":"4.92","GivesUsefulFeedback":"4.77","ReturnsAssignmentsinTimelyFashion":"4.77"}]}},"comments":{"Spring '13":{"comments":["Deirdre, this course's preceptor, is among the most sincerely kind people I have ever met. She is helpful and encouraging--both with respect to the course and life in general. She made expos a non-intimidating and--dare I say it?--fun experience. If the law interests you, take this course. The readings will be manageable, and Deirdre's advice will be specific and useful.","Loved it!!","People complain about expos a lot, but this was actually one of my favorite classes I took all year. Deirdre is awesome, and she really helps you with your writing and is really fair. The outside reading isn't a lot at all, and I actually found the papers quite interesting to write.","It's Expos, so you have to do a lot of writing, but the material and assignments are so interesting and the preceptor is great.","Great class.","Although many students exclaim that expository writing courses have been horrible, I really had an awesome time with Deirdre. Not only did I get to have more insight in issues surrounding Freedom of Speech, I was able to brush up on my writing. The work is very manageable and Deirdre is so sweet, helpful and understanding!","You have to take expos. This is problem the best one you can take. It's still expos, so it sucks at times, but the topic is interesting and Deirdre is an amazing preceptor! She's extremely nice and helpful, and I really learned a lot thanks to her teaching.","If you're at all interested in law and government, you should take this for your Expos course.  The material is enjoyable, the reading load is relatively light, and Deirdre is possibly the ideal Expos preceptor - dedicated, perceptive, and easygoing.  There are certain aspects common to all Expos classes that no one really enjoys - mostly scheduling-related, I found, as the papers always seemed to come due precisely when I least wanted them to.  Don't let that dissuade you, though: you have to take one Expos class, and this one is excellent.","Please take this class. I'd heard so many horrible things about expos and I was prepared to hate it, but this was amazing. I'm also the only person I know who loves expos. This class is so great because Deirdre is awesome. She is so smart and caring and puts so much effort into getting to know all of her students. Her feedback is excellent, conferences with her are so helpful, and she is really accessible outside of class. Plus, the course material and assignments are actually really fun.","This is a great expos class. Even if you are not interested in law! Deirdre is wonderful, and the essays are definitely manageable and fun.","Like any freshman, I came in skeptical of expos in general; however, this is without a doubt the best class I have taken at Harvard. Deirdre is passionate, extremely helpful, supportive, and everything you could ever want in a preceptor and so much more. She approaches her role as a coach who has the unfortunate task of giving you a grade in the end, and you really get the sense that she is on your team and wants you to succeed more than anyone.  \r\n\r\nThe subject matter is also extremely interesting and the assignments really let you go in whatever direction you want. And, even if for some bizarre reason you don't find dangerous speech interesting, the reading load for this course is incredibly light so you'll be fine regardless. \r\n\r\nMake this your first choice Expos class and pray that you are lucky enough to get it! You will love the class and Deirdre, plus you will improve exponentially as a writer under her tutelage."]}},"mostRecentQ":{"overall":"4.64","workload":"1.93","difficulty":"2.86","recommendation":"4.79","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.196","course_id":"1728","cat_num":"39724","1s":"0","2s":"0","3s":"0","4s":"5","5s":"9"},"QDifficulty":{"number":"EXPOS 20.196","course_id":"1728","cat_num":"39724","1s":"1","2s":"1","3s":"11","4s":"1","5s":"0"},"QWorkload":{"number":"EXPOS 20.196","course_id":"1728","cat_num":"39724","1s":"3","2s":"9","3s":"2","4s":"0","5s":"0"}},"success":true}