{"scores":{"Spring '14":{"course_score":{"overall":"4.30","workload":"2.90","difficulty":"3.30","recommendation":"4.20","enrollment":"45","response rate":"84.44","QCourseOverall":{"number":"PHYSCI 12a","course_id":"5276","cat_num":"43244","1s":"0","2s":"0","3s":"4","4s":"18","5s":"15"},"QDifficulty":{"number":"PHYSCI 12a","course_id":"5276","cat_num":"43244","1s":"0","2s":"2","3s":"22","4s":"12","5s":"1"},"QWorkload":{"number":"PHYSCI 12a","course_id":"5276","cat_num":"43244","1s":"2","2s":"7","3s":"22","4s":"6","5s":"1"}},"instructor_scores":[{"number":"PHYSCI 12a","cat_num":"43244","course_id":"5276","year":"2013","term":"2","id":"9139380e2caf38f93af092c6d8ee7dc2","first":" Nils John","last":"Sorensen","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"},{"number":"PHYSCI 12a","cat_num":"43244","course_id":"5276","year":"2013","term":"2","id":"c423338381573ac449e23a5aa99dce4f","first":" Christopher William","last":"Stubbs","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"3.80"}]},"Spring '13":{"course_score":{"overall":"3.17","workload":"3.50","difficulty":"3.83","recommendation":"3.33","enrollment":"20","response rate":"95.00","QCourseOverall":{"number":"PHYSCI 12a","course_id":"5276","cat_num":"43244","1s":"0","2s":"0","3s":"4","4s":"18","5s":"15"},"QDifficulty":{"number":"PHYSCI 12a","course_id":"5276","cat_num":"43244","1s":"0","2s":"2","3s":"22","4s":"12","5s":"1"},"QWorkload":{"number":"PHYSCI 12a","course_id":"5276","cat_num":"43244","1s":"2","2s":"7","3s":"22","4s":"6","5s":"1"}},"instructor_scores":[{"number":"PHYSCI 12a","cat_num":"43244","course_id":"5276","year":"2012","term":"2","id":"19e95083d257b4e0d24166604dd4e778","first":" Randall","last":"Kelley","InstructorOverall":"4.17","EffectiveLecturesorPresentations":"4.17","AccessibleOutsideClass":"4.44","GeneratesEnthusiasm":"4.39","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"3.91","ReturnsAssignmentsinTimelyFashion":"3.91"},{"number":"PHYSCI 12a","cat_num":"43244","course_id":"5276","year":"2012","term":"2","id":"c423338381573ac449e23a5aa99dce4f","first":" Christopher William","last":"Stubbs","InstructorOverall":"3.25","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"2.75","GeneratesEnthusiasm":"3.43","FacilitatesDiscussionEncouragesParticipation":"3.22","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '13":{"comments":["take this class! the teaching staff is wonderful and very accessible, assignments are moderately challenging, and you will learn physics well if you put in a bit of effort","Don't take this class if you're not already comfortable with AP physics. They breeze through problems without explicitly explaining strategies, which hinders those who don't immediately find the strategies intuitive. Additionally, you're split between the physics and the statistics\/matlab component which takes up a significant amount of effort and brainpower. Make sure you're already comfortable with AP Physics C material or else you'll be struggling on both fronts.","This is the best physics option for non-physics majors. The class is small and the teaching staff is great, so the classroom atmosphere is really relaxed. Unlike PS2, you will actually learn some more in-depth, calculus-based analytic physics. The Matlab component takes some getting used to but is an incredibly useful skill for all scientists and engineers.","Same content as physics 15a but more practical, smaller class size, and more numerical less theoretical work.","This class is Hard and be prepared to struggle on the psets.  At the end though you will come away with a solid conceptual understanding of physics.","This class is definitely a better option that physics 15a. Although it is harder than PS2, this class gives you a deeper understanding of approaching physics problems, as well as gives you a good introduction to MATLAB. Randy is a great teacher and is willing to go the extra mile for his students. Because the class is small, you get to develop good connections with the teaching staff. Definitely make use of Randy's office hours and physics night, as they are the only way you'll finish the pset correctly. Overall, if you're an engineer and you are deciding between this and 15, definitely take this.","there's a lot of work and it takes a lot of time but its a good class","Randy is great, and so is the rest of the teaching staff. This course I think is much improved over the previous version as 11a. It seems like they're getting closer on the balance with Matlab and analytics. You have a ton of support in this class, which is really nice. Additionally, the small nature of the class was great. This differs from most other intro physics courses, in that it has a relatively large component of Matlab and numerical analysis, which is really applicable outside of the course, and is a great way for you to improve your Matlab coding. I also think you'll learn more in this than AP50, although it may be a bit more challenging.","Wait until the course has been further established before considering taking it. It seems fine for the first half and then there are several more concepts that you learn and there isn't enough time to go over them in depth and properly understand them.","This was a good physics class but it was not easy, do not take it lightly.","Strengths: The small class size was very nice; both in lecture and section there was a strong emphasis on participation.  It made it easy to raise your hand and ask questions.  Randy and Prof. Stubbs are fantastic lecturers;  Peter's sections are great.  Doing the psets together on Physics night was a great experience.  I especially admired Randy and Peter's dedication to the course on these late nights. \r\n\r\n\r\nWeaknesses: While the integration with MATLAB was great (definitely better than previous years judging by those Q scores), there still is some superfluous MATLAB and tedium especially in labs.  Grading seemed very subjective both in labs and on psets; points were taken off for very random and small issues, though the Berkeley grading system applied to quiz and exams were good.  Grades were not returned in a timely and organized fashion... many of my grades are still a unknown to me.  Perhaps an online grade book would be helpful.  Labs could be streamlined... they should take the allotted amount of time and be edited such that guidance from a TF is not always necessary.","You want an AP physics background and 21a &b knowledge. the math says you only need 1a\/b but the pset's require much more. The psets and labs take forever","The instructors really care about this class and the lab component is very good."]},"Spring '14":{"comments":["Interdisciplinary course that integrates physics, engineering, and statistics, which is pretty cool. You become familiar with Matlab, which is definitely useful. Also nice to have a final project instead of a final. Final presentation session was fun!","It's a great physics alternative but really different from conventional physics courses","Great class with a lot of resources and help when needed. The professors and teaching fellows are enthusiastic and willing to go the distance to help you understand the material.","Start Module Quizzes early!!!! And definitely go to office hours if you have any questions! The teaching staff are quite helpful!","The aim is to teach basic physics and MATLAB, and expose you to some statistics. You need to either have some exposure to CS or Physics before taking this class. I had never taken physics, but took CS50 and don't know what I would have done without it. \r\nThe homework consists of a small number of very complex problems, which in my case resulted in a week long headache as I scrambled to figure out what was going on with the physics component. \r\nI also did most of my learning from the textbook, as the 9:30 am lectures were often very dry, or just repeating what was in the text.","This is a fantastic alternative to PS2\/3 of physics15. I am a chemistry concentrator (not pre-med) and this class was perfect. It was challenging, but not overly time-consuming like physics15. However, it also was a great physics class, and I really learned a lot without some of the difficulties I've heard people have in PS2\/3. All the math that is involved, they go over very explicitly, the problem sets are not bad at all, and the module quiz instead of midterm system takes away a LOT of stress. The final project is also not bad at all, and lab is truly enjoyable and a learning experience (Nils is the coolest). Great class!!","much better than any of the other physics classes if you don't have a physics background. painless.","This was a great intro physics class-much smaller than some of the other ones with lots more individualized attention from the professors, who are great. No final exam, but definitely a fair amount of work with module quizzes throughout the semester.","This is absolutely your best choice for a physics class at Harvard provided that you're not a physics concentrator\/genius. The support provided by the class is amazing and there are no assessments under time pressure. Everything is take-home and there isn't even a final, so you can really focus on learning rather than cramming for tests. MATLAB is not easy but they are always willing to help you. Lab is pretty painless and actually kind of cool, though broken code is pretty sad to deal with.","If you are choosing between Physics 15a and Physical Sciences 12a, do absolutely should take PS 12a instead!!! This class is difficult but very doable because of the amazing teaching stuff and the help resources. You will learn to use MATLAB, a very useful skill, and you will learn so much through lab and the final project component. There are no exams for this course, which is absolutely wonderful and reduces unnecessary stress.","The teaching staff is great and extremely enthusiastic.  You also fell like you learn physics to address problems in the real world.","I did not enjoy this class. However, I did learn a lot of useful Matlab. That being said, there are also no exams (all take-home partner quizzes and final project).","You don't get that pre-medy vibe in this class.  But ironically, the majority of students in this class--intended to be for engineering sciences concentrators--are studying biological sciences.  It's not as tough as physics 15 and it doesn't require multivariable calc like physics 15, but there are not as many analytical (pencil and paper) questions as there are in physics 15.  There is, however, a lot of Matlab and numerical analysis, which I found very enjoyable especially since computation in this day and age depends on computers and manipulation\/visualization of data.","Know that PS12a is like AP Physics B\/C with MATLAB and basic AP Statistics. It certaintly can be challenging, but it's very doable, and if you're already very comfortable with physics, I think 15a is a better option. The MATLAB\/statistics part is obviously very practical, but it's also time-consuming and takes away from the actual physics part. The teaching staff is phenomenal though, and if that's your deciding factor, take 12a.","The exams and problem sets for this class are really great. You will learn a great deal. The only thing is that all throughout I figured out that I learned way more computer science and statistics than physics. I really would have liked just some more simple pencil and paper problems. I felt like the physics concepts were rushed and more time was spent just trying to answer these really elaborate problems and that by the time I figured out the problem I would realize I didn't really learn that much more physics. The lab staff and sections TFs are great. I really, really think that making the class easier and making the questions more straightforward might be better so that people can actually understand, which physics concepts they are learning. Furthermore, the textbook is really, really convoluted. They should offer some kind of condensed notes or something that summarize the key points. Having to read the textbook before class was also really irritating. Maybe they should just have a packet of notes for each module and a list of easy questions to do over the weekend before the lectures.","This is a pretty good course.  If you have a solid understanding of mechanics from AP Physics, you should excel.  The MATLAB component of the class was the most interesting part.","This is an awesome course with a great style of instruction.","This course is a really good introduction to physics and general applied science at Harvard. It is very numerically based, which makes it more interesting and applicable. Not having any exams and only tough problem sets is also a plus, and the final project at the end is a lot of fun.","I would like to tell future students how valuable this course is not only in teaching them physics, but in teaching them to be skeptical of unsubstantiated \"facts,\" and to evaluate critically claims made in the world around them.","Make use of Physics Night and office hours!","Definitely take this class!! The Matlab portion might seem strange at first, but it's a very useful tool. Also, the teaching staff are great.","This class was great in that it helped me learn how to use matlab, but other than that, I didn't feel like I learned much. Nils is the nicest\/most enthusiastic man on earth, and the lab component of the course was surprisingly the part where I learned the most. Randy is also great at explaining and makes an effort to make you understand material if you reach out to him. Stubbs sometimes led interesting conversations, but often gave frustratingly circuitous lectures and was extremely unhelpful in answering assignment related questions. Overall though, the course was pretty good. Didn't love it, but didn't hate it. Good alternative to Physics 15.","I would recommend it over physics 15 if you are not concentrating in math or physics. The lab component makes it more applicable to my field (EPS). It is also good for MATLAB beginners.","Overall, I enjoyed this course for the numerical component, which you would not get in Physics 15a. You learn to use MATLAB, which is a powerful tool for running simulations and understanding physics\/statistics concepts. The course staff are all rockstars.","This course is a great way to fulfill the Physics requirement for non-physics concentrators. The teaching staff is very engaging, and care very well about making this the best they could offer. For those interested in CS and research, it provides a painless and very useful introduction to numerical methods of problem solving using Matlab.","If you are interested in learning more about how the world works, and if you are willing to put in a fair amount of effort, take this class! PS 12a was definitely my favorite class that I took this semester for a bunch of reasons. First of all, the teaching staff is awesome. Professor Stubbs is a funny and great lecturer, and he is inspiring outside of the classroom. The man has a Wikipedia page, and will casually tell you about how he almost won a Nobel Prize, and then you're shocked that you are talking to such an intelligent dude and he is teaching you physics. Randy is also a really great teacher. At first he can be a little hard on you, or maybe cold toward you, but if you go to him for office hours he warms up to you really quickly. He is a good lecturer and really knows how to teach the information so the students grasp it. Also, this class is super life applicable. In this class not only did I learn a good background in physics, but I also learned how to code in Matlab. If you have no background with coding, fear not, because the staff will walk you through the basics of learning Matlab. And then, after you finish the class, you have a valuable life skill of coding in your bag of tricks. It's a wonderful class, but don't take it lightly. It's a huge time sink and I would spend at least 7-8 hours combined on assignments each week. The assignments are long and difficult, but they aren't tedious, so that's a huge plus when you can walk away from a homework assignment and not feel like you wasted time. Plus, no real exams, just take home midterms and a final project. You can't lose!","If you need or want to take physics, but you don't want to take Physics 15 or 16, and you want to learn how to code, this is definately a good choice.","great class with great teachers, take it. Be prepared to work though.","This is definitely a better alternative to PS2 for premeds, but it does require a lot of time and effort","This is an amazing course. Totally worth it.","Cool class - arguably better than other physics options. You have no in class midterms, instead there are take home midterms which are really just like a long pset (I thought I would hate it but I loved it). The class does a great job minimizing stress, but it is still a lot of work. Also the teaching staff is GREAT"]}},"mostRecentQ":{"overall":"4.30","workload":"2.90","difficulty":"3.30","recommendation":"4.20","enrollment":"45","response rate":"84.44","QCourseOverall":{"number":"PHYSCI 12a","course_id":"5276","cat_num":"43244","1s":"0","2s":"0","3s":"4","4s":"18","5s":"15"},"QDifficulty":{"number":"PHYSCI 12a","course_id":"5276","cat_num":"43244","1s":"0","2s":"2","3s":"22","4s":"12","5s":"1"},"QWorkload":{"number":"PHYSCI 12a","course_id":"5276","cat_num":"43244","1s":"2","2s":"7","3s":"22","4s":"6","5s":"1"}},"success":true}