{"scores":{"Spring '14":{"course_score":{"overall":"4.00","workload":"4.10","difficulty":"4.10","recommendation":"4.10","enrollment":"24","response rate":"66.67","QCourseOverall":{"number":"HISTSCI 99b","course_id":"5253","cat_num":"22497","1s":"0","2s":"0","3s":"4","4s":"6","5s":"4"},"QDifficulty":{"number":"HISTSCI 99b","course_id":"5253","cat_num":"22497","1s":"0","2s":"0","3s":"2","4s":"10","5s":"3"},"QWorkload":{"number":"HISTSCI 99b","course_id":"5253","cat_num":"22497","1s":"0","2s":"0","3s":"3","4s":"7","5s":"5"}},"instructor_scores":[{"number":"HISTSCI 99b","cat_num":"22497","course_id":"5253","year":"2013","term":"2","id":"0693984f5c31320e45c4a17af5fdebbd","first":" Nadine","last":"Weidman","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '13":{"course_score":{"overall":"4.48","workload":"4.19","difficulty":"4.00","recommendation":"4.24","enrollment":"30","response rate":"86.67","QCourseOverall":{"number":"HISTSCI 99b","course_id":"5253","cat_num":"22497","1s":"0","2s":"0","3s":"4","4s":"6","5s":"4"},"QDifficulty":{"number":"HISTSCI 99b","course_id":"5253","cat_num":"22497","1s":"0","2s":"0","3s":"2","4s":"10","5s":"3"},"QWorkload":{"number":"HISTSCI 99b","course_id":"5253","cat_num":"22497","1s":"0","2s":"0","3s":"3","4s":"7","5s":"5"}},"instructor_scores":[{"number":"HISTSCI 99b","cat_num":"22497","course_id":"5253","year":"2012","term":"2","id":"1cf5cff95adc5bf24cb478fa4792b626","first":" Christopher James","last":"Phillips","InstructorOverall":"4.58","EffectiveLecturesorPresentations":"4.68","AccessibleOutsideClass":"4.76","GeneratesEnthusiasm":"4.75","FacilitatesDiscussionEncouragesParticipation":"4.62","GivesUsefulFeedback":"4.79","ReturnsAssignmentsinTimelyFashion":"4.92"}]}},"comments":{"Spring '13":{"comments":["Writing a thesis is one of the most challenging yet most rewarding academic experiences I have done. History of Science provides with you good support to complete it!","The thesis experience in History of Science is undoubtedly one of the best there is.  While like with any thesis research the research and writing is largely self-directed, you really do have the entire department behind you and supporting you every step of the way.  Besides my advisor who was fantastic, I reached out to several faculty and admins in the department, all of whom were incredibly helpful.  My only word of advice besides starting your research as early as possible and having a balanced course load, is to make the transition from researching to writing sooner rather than later since the transition can often be a difficult one.  Overall, it was a fantastic way for me to end three memorable years in the department!","It is rewarding and not as scary as people think!","Only do this if you have a topic that you are actually interested in.  If you are actually interested then this will be a ton of fun and very rewarding.","In the aftermath of the thesis process, I look back at thesis-writing as one of the best experiences I have ever had. Although it was absolutely miserable at times during the process, I found it to be incredibly rewarding. I recommend the senior thesis tutorial only if you are absolutely sure you want to write a thesis. A good litmus test of whether or not you want to write a thesis, I think, is your experience with junior tutorial. Did you enjoy writing a junior paper? If you did, then writing a thesis may be the right option for you.","The way that the honors grades work within the department basically make writing a thesis irrelevant.  If you write one, the grade gets averaged with your overall department GPA to determine what degree of honors you get.  These are departmental honors and have nothing to do with the honors from the College that appear on the diploma.  So, do not write a thesis if you are only interested in getting an honors degree, since the thesis doesn't actually help you get that.","Write a thesis, you'll be glad you did.","If you have something that you are passionate about studying or pursuing as a career, take this course. This teaches you what it is like to really do something on your own, and is an amazing learning experience. it is not easy in the least, but you will learn more about yourself and subject than you could in any other class at harvard. once its all said and done, definitely worth it, but the key is keeping track of that notion over the course of an entire year.","You get to become an expert on a subject no one else has explored yet!","Writing a thesis expands your mind in ways you wouldn't predict. Bonds you with fellow thesis writers. Is a roller coaster ride emotionally. Challenges you. Helps you to see what a career in academia might be like. Makes you a better writer. Gives you a specialty.","Writing a thesis is a peak academic experience.  You will be stressed and uncertain and confused, but ultimately you will learn so much about yourself, the art of academic research and writing, and about becoming an expert on a topic.  I'm so glad I saw this process through, and am really proud of what I produced!","This is a great opportunity for you in your life -- regardless of the outcome.","This is the final step to finishing your thesis! If you work very hard and get your sources and research done early, this semester will still be a challenge, but a bit less stressful and you will have done something to be proud of! My advisor gave me great advice: In the end only a handful of people will end up reading your thesis so make sure you write work you'll be proud of and enjoy because you're the one who'll read it the most and be connected to it later in life. You can do it!","writing a thesis can be very rewarding and gratifying as long as you really like your topic and get along with your adviser","Writing a thesis isn't for everyone, but if there is something you are interested in- DO IT. It's a ton of work, but it's so rewarding to have accomplished something in a field that excites you"]},"Spring '14":{"comments":["Necessary part of the thesis research, it's gonna be what it's gonna be.","I really enjoyed writing a thesis because I wanted to produce a sustained work of scholarship and challenge myself to express a complex and original argument clearly and rigorously. If that kind of academic exercise appeals to you, writing a thesis in the History of Science department is a well-supported and well-structured experience, and well worth your time. It is certainly challenging as a senior but I was still able to have a great senior year.","Very independent process - your experience depends a lot on your individual advisor","Writing a thesis was the most difficult aspect of my undergraduate career. It was also the most stimulating and rewarding one.","Writing a thesis has been one of the most rewarding processes. Getting to work so closely with my thesis adviser has easily been the best part about the process; through my weekly meetings with my adviser, I really feel like my writing has grown tremendously, as has my thinking about the topics I am writing about. Highly recommend the weekly meetings with the adviser.\r\n\r\nThe group meetings were a little more vague in their purpose, but it was generally nice to meet with my peers and discuss things. It was infrequent enough that it didn't feel like the benefits outweighed the costs.","It's never too early to start writing.","It is advantageous to have an earlier startspend some time over the summer crystalizing a topic, so that when you arrive in September you are not starting completely anew!","Write a thesis!"]}},"mostRecentQ":{"overall":"4.00","workload":"4.10","difficulty":"4.10","recommendation":"4.10","enrollment":"24","response rate":"66.67","QCourseOverall":{"number":"HISTSCI 99b","course_id":"5253","cat_num":"22497","1s":"0","2s":"0","3s":"4","4s":"6","5s":"4"},"QDifficulty":{"number":"HISTSCI 99b","course_id":"5253","cat_num":"22497","1s":"0","2s":"0","3s":"2","4s":"10","5s":"3"},"QWorkload":{"number":"HISTSCI 99b","course_id":"5253","cat_num":"22497","1s":"0","2s":"0","3s":"3","4s":"7","5s":"5"}},"success":true}