{"scores":{"Spring '14":{"course_score":{"overall":"4.30","workload":"1.90","difficulty":"3.10","recommendation":"4.50","enrollment":"54","response rate":"75.93","QCourseOverall":{"number":"SCRB 187","course_id":"10601","cat_num":"73713","1s":"0","2s":"1","3s":"5","4s":"14","5s":"21"},"QDifficulty":{"number":"SCRB 187","course_id":"10601","cat_num":"73713","1s":"1","2s":"7","3s":"21","4s":"9","5s":"1"},"QWorkload":{"number":"SCRB 187","course_id":"10601","cat_num":"73713","1s":"9","2s":"27","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SCRB 187","cat_num":"73713","course_id":"10601","year":"2013","term":"2","id":"6a335ab3ed38e10d387baa0679142ac3","first":" Steven E.","last":"Hyman","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '13":{"course_score":{"overall":"4.44","workload":"1.69","difficulty":"2.69","recommendation":"4.47","enrollment":"33","response rate":"96.97","QCourseOverall":{"number":"SCRB 187","course_id":"10601","cat_num":"73713","1s":"0","2s":"1","3s":"5","4s":"14","5s":"21"},"QDifficulty":{"number":"SCRB 187","course_id":"10601","cat_num":"73713","1s":"1","2s":"7","3s":"21","4s":"9","5s":"1"},"QWorkload":{"number":"SCRB 187","course_id":"10601","cat_num":"73713","1s":"9","2s":"27","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SCRB 187","cat_num":"73713","course_id":"10601","year":"2012","term":"2","id":"6a335ab3ed38e10d387baa0679142ac3","first":" Steven E.","last":"Hyman","InstructorOverall":"4.23","EffectiveLecturesorPresentations":"4.16","AccessibleOutsideClass":"4.18","GeneratesEnthusiasm":"4.42","FacilitatesDiscussionEncouragesParticipation":"4.52","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '13":{"comments":["This is the best class I've taken at Harvard. Professor Hyman is incredible and the material is so interesting. The papers are short but make you think and the sections are awesome. Absolutely take this class!","I would tell them that this class is one that deals with real coming problems\/ethical issues in science.  It provides incredible knowledge of new technologies and causes us as scientists to think about the consequences of making these kinds of advances once they move beyond the laboratory.  The class is also fun and engaging.  The professor is fantastic and you will not find better TFs than Bill and Ray.  Also, in our class the group of students was very impressive and led to great discussion.","A gem! This course is well organized, clear, and not overly demanding. The material is extremely interesting, and the way we engage the ethical topics is THROUGH the biology (it's not just pie-in-the-sky ethical jabs). Hyman is a marvel of a lecturer, and the sections were not like previous sections I've had---onerous and painful---but built upon the lectures and explored the topics.","Take time to consider the essay topics, and start them in advance!","Think outside the box, debate controversial issues that touch on ethics and philosophical beliefs. Section is not only amazing with a debate style discussion, with arguments back and forth -- similar to a trial proceeding, but also the topics are revolutionary and simply cool (with cognitive stimulants to memory erasure drugs).","The class requires an understanding of somewhat in depth biology, but approaches this information from a unique and ethical perspective.","This is a very interesting course for potential researchers to realize that the work they do does have important ethical implications.  There is a very good balance between hard, technical science and ethical discussion.  The section discussions are also very thought-provoking.","Great discussion-based class! You will be discussing issues you never thought existed in a thorough, meaningful way.","Great uppler level SCRB class with phenomenal TFs","Take this. This class is a unique opportunity for science concentrators to approach interesting scientific developments with a realistic grounding in current affairs and ethics, which is all too often ignored. The workload is lighter than some science courses, though the papers require considerable thought, but that allows you to delve more into the work (rather than be overwhelmed by a heavy workload and ignore it)","Good course and a good way to fulfill an ethical reasoning course especially for science concentrators","The most interesting course I have ever taken. Changed the way I thought about drugs, mental illnesses, accountability, etc.","The class lectures are a bit disorganized. You may find yourself dozing off in lectures, but the sections are definitely intellectualizing stimulating. The material makes you think of new aspects of science and the society that you would not ordinarily talk about in other classes.","This is a very hard course. It will ask you to think VERY abstractly as well as REALLY integrate your knowledge of both the science and humanities of SCRB. If you are simply looking for a \"B\" in a scrb class with minimal work, then choose this class. But if you want to get an \"A,\" you will have to put in A LOT of work.","This class was fantastic - the lecture combined with the very open and involved format of the sections made this class one of my best experiences at Harvard.","This class makes you think about the future of science and medicine in ways you probably will not have encountered before. By making you think critically about your beliefs and values, it really forces you to better yourself and improve your opinions. Great course, would recommend for all science concentrators.","This is a great way to fulfill the ethical reasoning requirement if you're a science concentrator. The workload is relatively light and the paper assignments are great for making you think about issues related to stem cell biology","SCRB 187 is a gem of the SCRB department and perhaps the best way I could imagine to fulfill the Ethical Reasoning requirement for students with a scientific background.  The class was engaging and Professor Hyman is a phenomenally stimulating lecturer and conversationalist.  Take this class!","This class was one of the best I've taken at Harvard. The material is fascinating and the discussion sections were excellent! You'll get to think seriously about ethical issues that are relevant to scientists, and learn a lot about how scientific advances change ethical questions or create new ones. Definitely a class you should consider if you're a science major or interested in science!","This class has been my favorite at Harvard thus far. I STRONGLY recommend taking it. Dr. Hyman is an absolute genius, the lectures and sections were super interesting (not just someone talking at you). I had never taken a neurobiology or psych class before this, and I didn't find that to be a problem. The readings are totally manageable, and so are the assignments. Take. This. Class. Especially since now it counts as ethical reasoning!!!!","SCRB 187 is a fun, not too demanding class that is a perfect way to fill a SCRB elective and meet the Gen Ed requirement for ER. The only work for the class is a 3-4 page paper every three weeks and a 6-8 page final paper. No exams or p-sets! The class has weekly readings, but the only ones you actually need to do are the ones the TFs send to you by email each week. You can probably get away with not doing those ones, too. Section is really fun, too. I was lucky enough to get Bill, who is also my advisor, as my TF. He makes a comfortable atmosphere for learning and it was cool to get to know him better. Dr. Hyman is also really nice, though his lectures can get a bit boring sometimes. Also, though the course has a scientific basis, it's really concerned with the ethics of certain scientific practices or choices, so don't think that if you haven't had neuroscience you shouldn't take the class. Overall, no matter your background, the class is a fairly painless one that you'll probably enjoy."]},"Spring '14":{"comments":["Fairly easy course. not too many assignments but feedback on those assignments weren't great (i.e. they won't tell you how to get those 5s unless you go to office hours and ask). Don't really have to do readings except for the ones for section. don't really have to attend the lectures either but the lectures were good nonetheless. great way to fulfill ER. not really sure why this is a scrb class instead of a neuro class--so if you're doing this for the scrb advanced req, I would recommend something else.","This is the kind of class that Harvard needs to have more of: based on cutting-edge research, future-oriented, and provocative. SCRB187 gives you a chance to engage with recent findings on the mind and brain from an ethical perspective. It's a large enough class that there is diversity of opinion, but small enough that you won't feel lost in lecture. Section is enjoyable, and is a chance for you to discuss and debate interesting topics in a smaller setting. There are occasional dry spells in lecture when we delved into mechanisms and specifics about the brain, but they're more than worth it.","This class really made me think outside of my normal, scientific comfort zone. It compelled me to look at the ethical dilemmas of these scientific topics that we hear so much about during school and in the media. Without this class, I feel like I would be half a scientist when I emerge from Harvard - you need the ethical basis to truly understand these issues and research as a whole. Professor Hyman was a fantastic lecturer, and he was always available to talk if I had any questions about the reading or lecture. Bill was also wonderful - he was able to expand our knowledge during section, and I really appreciated the dedication and energy that he brought to the class. Overall, I would recommend this class with enthusiasm. It may not be as easy as a normal General Education class, but it is absolutely worth it.","sections are very gimmicky, grading is very hand-wavy, and the assignments are all super convoluted. material is inherently interesting, and hyman is an awesome guy\/professor.","take this. it is interesting, well taught, fun. if you are interested in psychiatric illness, neurobiological diseases and want to explore some really interesting ethical aspects of them, TAKE IT","Lottery this class until you get in. You won't regret it.","Although the professor of this course was very sincere in his dedication to the material and facilitating discussion about neuroethics topics, the class itself was not as interesting or engaging as I thought it was going to be. The short papers were confusing (in both topic and how to write them) and I would actually have preferred in-class or take-home exams instead of the short papers, because I don't feel like they utilized what we discussed in class much. Sections were debates which became tedious and fraught with tension at times. The professor dos bring sweets to every lecture (which was always nice to receive) but ultimately I feel like I came out of this course learning little.","This course is amazing. I never thought I would find an enjoyable way to fulfill an ethical reasoning requirement. The workload is also extremely low. The entirety of the work I did for this course consisted of four 3-page papers and one final 6-page paper that were both mostly opinion-based, so not much research was required. There is also reading but you really don't have to do it. Not to mention the topics are really interesting and will challenge the way you see identity and neurobiology. I can't say it enough -- take this course. Take it.","The class touches are fascinating topics but are wishy washy about all of them. There was not enough guidance to write the essays satisfactorily.","This is an interesting neuroethics course with a great teaching staff. All the materials and assignments are good, but not outstanding. HDRB concentrators and non-science concentrators alike will enjoy it. Far better than Justice or LS60.","PHENOMENAL.","This is a fantastic course- one of the best I took at Harvard. Professor Hyman brings valuable perspective to neuroethics topics and has first hand accounts of how these issues play out in policy and science today. The readings are fascinating and lectures are a great combination of information and discussion. Section is taught via small debates, which is fun and engaging. The assignments (and grading) are taken seriously by the teaching staff, but doable and interesting. I highly recommend this course to science and non-science concentrators interested in ethics and science!","Very interesting bioethics class.  Loved the focus and the way that Professor Hyman ran lectures. Overall, not a burdensome work load and a very painless way to get the ethical reasoning requirement out of the way, especially for science concentrators.","This was an exceptional class with an exceptional teaching staff and professor. The course was amazing in weaving together the disciplines of neurobiology, stem cell research, and ethics to portray the growing challenges that these new technologies may not only help us address, but that they raise. If you can get into this class ( There is usually a lot of demand). I would highly recommend it.","Be prepared to think!","This class was very interesting because it made me approach ideas of the natural sciences very differently.  I appreciated the emphasis on morality as opposed to the explicit focus on mechanisms of the brain, and discussing issues like deontology and utilitarianism was eye-opening.  I think this course is very helpful for people that aspire to become doctors in the future because it makes you think more carefully about how decisions can affect people in a manner other than a strictly medical one.","I found SCRB 187 to be very interesting and the topics are important to think about. However, I did not get very good feedback on my essays and the sections were very repetitive.","Professor Hyman is a brilliant lecturer, capable of facilitating an open, engaging debate in a lecture hall of 60 students. The topics covered are engaging, fascinating, and you'll find your own opinions continually challenged.","Throughout this course, I engaged with topics that were relevant, morally and ethically ambiguous, and downright fascinating. Finding order and reason in the midst of ethical quandaries was exciting, and well worth every minute.","This is an enjoyable way to fulfill ER, but it isn't a science class.","Here's the breakdown of the course: half the lecture is spent on introducing new concepts\/studies, and half is spent on discussions. Everybody participates in a debate during section on topics relating to law, responsibility, use of brain-enhancing drugs, etc. I really liked the class, especially section, since it got me thinking about multiple points of view on many different topics. Contrary to many of my classmates, I also really enjoyed the section on determinism\/existence of free will. This course will get you thinking about many of these topics and spur a lot of interesting conversations. HOWEVER, beware of the essay assignments. They can be graded quite arbitrarily (as in all writing classes, I guess), and count for a significant portion of your grade.","This class will change the way you think about human neurobiology and make you aware of neuroscience's broad societal implications. SCRB 187 focuses a lot on intellectual debates and discussions about ethics, so be prepared to think critically about morals, ethics, and societal values. For those who are very hard-science focused, this class will seem abstract and difficult to comprehend at times, but that is all part of the important learning experience. Although the papers in this class are short in length, they require quite a bit of critical thinking and logical reasoning. Overall, this class is great for anyone who is interested in the intersection between neurobiology and social science. It is also ideal for anyone who is interested in but has limited previous exposure to ethics and philosophy.","One of the best classes I've taken at Harvard. Every single lecture and reading was super interesting. Professor Hyman is an amazing teacher, and he is clearly passionate about the issues being discussed. Sections and short paper assignments really encourage you to take on new perspectives to think about extremely difficult ethical questions. I highly recommend taking this course to fulfill the Ethical Reasoning requirement (or just as an elective!).","Best Ethical Reasoning course. It is actually interesting, the assignments are fun, and the teaching staff is awesome!","The assignments aren't that hard, but it is definitely useful to meet with your TF beforehand to go over your ideas. THe lectures can get kind of boring, but they go out of their way to give you things like food and treats. Don't let the department fool you, this is not a SCRB class and almost no science background at all (other than understanding what controls are...) is needed.","This class is AWESOME.","AMAZING! This class is incredible and makes you think in wonderful ways. Best class I've taken at Harvard! TAKE THIS","I'm so grateful that I got to take this class, regardless of the ER credit. The papers are no walk in the park, but they are quite interesting to think and write about. Sections is excellent, so long as the group's dynamic is strong and engaging. Good luck with the lottery!"]}},"mostRecentQ":{"overall":"4.30","workload":"1.90","difficulty":"3.10","recommendation":"4.50","enrollment":"54","response rate":"75.93","QCourseOverall":{"number":"SCRB 187","course_id":"10601","cat_num":"73713","1s":"0","2s":"1","3s":"5","4s":"14","5s":"21"},"QDifficulty":{"number":"SCRB 187","course_id":"10601","cat_num":"73713","1s":"1","2s":"7","3s":"21","4s":"9","5s":"1"},"QWorkload":{"number":"SCRB 187","course_id":"10601","cat_num":"73713","1s":"9","2s":"27","3s":"4","4s":"0","5s":"0"}},"success":true}