{"scores":{"Spring '14":{"course_score":{"overall":"3.50","workload":"3.10","difficulty":"3.40","recommendation":"3.80","enrollment":"16","response rate":"50.00","QCourseOverall":{"number":"ENG-SCI 22","course_id":"10584","cat_num":"87699","1s":"2","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ENG-SCI 22","course_id":"10584","cat_num":"87699","1s":"0","2s":"1","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"ENG-SCI 22","course_id":"10584","cat_num":"87699","1s":"1","2s":"1","3s":"2","4s":"4","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 22","cat_num":"87699","course_id":"10584","year":"2013","term":"2","id":"370a799e210b10aa1a6cf94b72792ec5","first":" Bethanne","last":"Altringer","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"3.70","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Spring '13":{"course_score":{"overall":"3.36","workload":"2.64","difficulty":"2.92","recommendation":"3.56","enrollment":"29","response rate":"86.21","QCourseOverall":{"number":"ENG-SCI 22","course_id":"10584","cat_num":"87699","1s":"2","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ENG-SCI 22","course_id":"10584","cat_num":"87699","1s":"0","2s":"1","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"ENG-SCI 22","course_id":"10584","cat_num":"87699","1s":"1","2s":"1","3s":"2","4s":"4","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 22","cat_num":"87699","course_id":"10584","year":"2012","term":"2","id":"370a799e210b10aa1a6cf94b72792ec5","first":" Bethanne","last":"Altringer","InstructorOverall":"3.33","EffectiveLecturesorPresentations":"3.44","AccessibleOutsideClass":"4.12","GeneratesEnthusiasm":"3.96","FacilitatesDiscussionEncouragesParticipation":"3.87","GivesUsefulFeedback":"3.09","ReturnsAssignmentsinTimelyFashion":"3.25"}]}},"comments":{"Spring '13":{"comments":["This was the worst class I have taken so far at Harvard. It was as if they were trying to be like cool parents but failed miserably. While packaged prettily, there really isn't much to learn from the course. The \"products\" that win are essentially things that just look pretty but aren't applicable in the real world at all.","I recommend if you are comfortable with an experimental format. Rather than contributing to research, you become research (in certain ways).","This is a great class that pushes you to learn more about subjects that you would never learn about. It is helpful to know photoshop and\/or illustrators before you take this class. There are a lot of design school students that are very good with it in the class, so it is almost assumed that you know how to use it as well.","Great for building your portfolio.  Fun, but requires a bit of scheduling flexibility because it's all partner work (and your person changes every week).  Learned a lot indirectly through the assignments about how to generate ideas, work in teams, evaluate, do competitive analyses, get feedback, appeal to the masses, etc.","you learn to think in a new way. Very helpful!","This is the most fun you will have in school. It is a fast paced sometimes grueling course - but you build a tremendous portfolio.","This course is fast-paced, with a new design challenge every one to two weeks. From designing new iPhone apps to 3D printing pens to creating \"something iconic,\" there is an opportunity to explore a wide range of design possibilities. You will be paired with a new partner every week, challenged to work with different people and develop new skill sets. Because it covers a broad variety of challenges, this course can seem surface-level at times, without an opportunity to delve thoroughly into one idea. It's far more learning by doing than pedagogical, which not everyone loves, so really know what you're getting into. Don't take it just because it's fun or easy. Take it if you really want a chance to develop your design portfolio, for which there are few opportunities at Harvard.","If you are looking forward to doing the projects on your own, take it.  If you're looking to really learn something not from your own work, don't.","The course teaches many concrete skills for the process of designing a product to marketing it, but because of the short time frame, it's generally difficult to produce works that can be shown in a portfolio. Still a valuable experience though.","Don't take this class. It's remarkably non cognitive. If you want to spend two hours a week watching the mostly dumb ideas of your fellow students in a class where there is no feedback or criticism, sign up. Just know that the class is basically a competition for the prettiest power point.","Great way to learn about your own design perspective and find out what kind of people you work well with on challenging problems.","As long as you have an open mind, this class can give you fantastic skills in any area. It's unlike any other class I've ever taken: instead of reading something every week, you get to create something that actually has the potential to turn into a business. This class is great for networking with people you would otherwise never meet, and it's also a great public speaking workshop.","This class is great if you don't mind last minute changes and a bit of an unstructured paradigm. You learn many different things, but I wish we could have spent more time developing skills as opposed to moving on from one challenge to the next every single week.","This course was very disorganized. It was interesting, challenging, and stimulating at points, but also frustrating and difficult\/time consuming. Weekly challenges were fun and helped you grow, but with little time and mixed backgrounds, it was difficult to succeed\/feel confident on minimal instructions. This course will probably be better in the future, but there was a lot of moving around, times and dates of assignments shifted, new assignments, etc. that made it complicated and hard to prepare for.","A really great class if you put the time in \/ don't expect to know what you'll be doing in advance.","Hopefully in future iterations of the course some of the kinks will be ironed out. My main complaint with this course was the feedback--there was very little feedback on our projects, and when we did get feedback, it wasn't very constructive and more a summary of what we had done instead of a critique of our work. The teaching staff were very helpful with good feedback while our assignments were in progress however.","This class is a trendy class for the entrepreneurs, networkers, and iLab types. The challenges are interesting at times, but extremely vague. Though, it is an interesting exercise to create a prototype each week and not get married to an idea too early or without the kinks all worked out. You will get really good practical skills as well like photoshop, indesign, powerpoint. You will never be afraid to speak in public again or have issue working in a group."]},"Spring '14":{"comments":["This course is one of a kind. You won't find anything else like that at Harvard. If you're interested in getting some exposure to design thinking and creative processes, take this class. Professor Altringer is fantastic.","Will change the way you look at the things around you.","This class is fun and pushes you out of your comfort zone. If you are interested in making a design portfolio, you'll have the opportunity for a lot of cool projects through this course. If you take it, don't think about grades at all, and just focus on producing work (whether it's a poster, a video, an article of clothing, a song, etc.) that you're proud of. Take this class if you like group work and you're able to structure your own time well. The class is sometimes disorganized (in terms of communication, deadlines, expectations) but it's also extremely chill, which comes from its open-endedness. I found it to be a really fun elective even though I don't anticipate working in design in the future. It's also a very cool way to learn from your peers and meet people with interesting start-up ideas.","This class sounded like a great class initially, but it increasingly became worse and worse.  There was little to no transparency regarding the class schedule, upcoming assignments, or status in the course.  Additionally, despite this being a course in the college, the class consisted mainly of GSD and other graduate students and the class catered to these students more so than the college students.  The class did not provide adequate tutorials, in fact I showed up to a photoshop \"tutorial\" at 10am on a Saturday and the TF was NOT prepared, once we found the room he asked us \"so what do you not know?\"  This was a waste of everyone's time.  The class format needs to be seriously rethought and ultimately reworked  Also keep in mind the GSD students are taking this course pass\/fail and you will find that many do not put forth a fair effort since their success in this course has little consequences and matters very little in the scope of their coursework."]}},"mostRecentQ":{"overall":"3.50","workload":"3.10","difficulty":"3.40","recommendation":"3.80","enrollment":"16","response rate":"50.00","QCourseOverall":{"number":"ENG-SCI 22","course_id":"10584","cat_num":"87699","1s":"2","2s":"0","3s":"0","4s":"4","5s":"2"},"QDifficulty":{"number":"ENG-SCI 22","course_id":"10584","cat_num":"87699","1s":"0","2s":"1","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"ENG-SCI 22","course_id":"10584","cat_num":"87699","1s":"1","2s":"1","3s":"2","4s":"4","5s":"0"}},"success":true}