{"scores":{"Fall '13":{"course_score":{"overall":"4.10","workload":"1.20","difficulty":"1.80","recommendation":"4.20","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"FRSEMR 40p","course_id":"10836","cat_num":"36111","1s":"0","2s":"0","3s":"0","4s":"8","5s":"1"},"QDifficulty":{"number":"FRSEMR 40p","course_id":"10836","cat_num":"36111","1s":"3","2s":"5","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 40p","course_id":"10836","cat_num":"36111","1s":"7","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 40p","cat_num":"36111","course_id":"10836","year":"2013","term":"1","id":"46b7050df937dbcacc42b96dd2908508","first":" Robin","last":"Gottlieb","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.40"}]}},"comments":{"Fall '13":{"comments":["This is a great option for a first-term freshman seminar, especially if you're interested in math and\/or education policy. Robin is amazing, and you feel like you really get to know her and the other students in the class. Get started thinking about the final project early, since it's due with everything else during reading period and can really stress you out if you don't give it enough thought\/rush to do it at the last minute.","Awesome if you're interested in education or math, quite specialized, but important to know nonetheless.","This was an excellent course! Robin is fantastic at facilitating discussion and making everyone feel like their opinion was valued. The course really pushed me to consider where the flaws in my education may have been and how they could be corrected for the future.","As someone who is interested in teaching, this class was very interesting. Looking at the different pedagogical styles between countries was fascinating, and gave me an entirely different perspective on teaching. I would suggest this seminar, as it is cool, has a very light workload, and Robin is great.","This is not a math course, it is an exploration of math education. Robin is extremely well informed, as well as being very kind, friendly, and helpful. While this course didn't really apply to my studies, I found that I see society differently and now have exposure a huge component of our society that is not receiving nearly enough attention. Definitely worth taking.","Robin (as she likes us to call her) is interesting, smart, and very kind.  If you're at all interested in math education, I highly recommend this class.  Class readings and discussions are great, and the workload is very reasonable."]}},"mostRecentQ":{"overall":"4.10","workload":"1.20","difficulty":"1.80","recommendation":"4.20","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"FRSEMR 40p","course_id":"10836","cat_num":"36111","1s":"0","2s":"0","3s":"0","4s":"8","5s":"1"},"QDifficulty":{"number":"FRSEMR 40p","course_id":"10836","cat_num":"36111","1s":"3","2s":"5","3s":"1","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 40p","course_id":"10836","cat_num":"36111","1s":"7","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}