{"scores":{"Fall '14":{"course_score":{"overall":"3.30","workload":"9.20","difficulty":null,"recommendation":"3.70","enrollment":"64","response rate":"90.62","QCourseOverall":{"number":"PHYSCI 12b","course_id":"11091","cat_num":"82209","1s":"2","2s":"10","3s":"18","4s":"22","5s":"5"},"QDifficulty":{"number":"PHYSCI 12b","course_id":"11091","cat_num":"82209","1s":"0","2s":"1","3s":"6","4s":"9","5s":"2"},"QWorkload":{"number":"PHYSCI 12b","course_id":"11091","cat_num":"82209","1s":"0","2s":"12","3s":"27","4s":"11","5s":"6"}},"instructor_scores":[{"number":"PHYSCI 12b","cat_num":"82209","course_id":"11091","year":"2014","term":"1","id":"1ae486af4b2b6a37358bb9e925ef0fba","first":" Joon","last":"Pahk","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"3.70"},{"number":"PHYSCI 12b","cat_num":"82209","course_id":"11091","year":"2014","term":"1","id":"9139380e2caf38f93af092c6d8ee7dc2","first":" Nils John","last":"Sorensen","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.90"},{"number":"PHYSCI 12b","cat_num":"82209","course_id":"11091","year":"2014","term":"1","id":"e593094de525dcee02a56c2cae7ac4ab","first":" Efthimios","last":"Kaxiras","InstructorOverall":"3.90","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '13":{"course_score":{"overall":"4.40","workload":"3.00","difficulty":"3.70","recommendation":"4.20","enrollment":"19","response rate":"100.00","QCourseOverall":{"number":"PHYSCI 12b","course_id":"11091","cat_num":"82209","1s":"2","2s":"10","3s":"18","4s":"22","5s":"5"},"QDifficulty":{"number":"PHYSCI 12b","course_id":"11091","cat_num":"82209","1s":"0","2s":"1","3s":"6","4s":"9","5s":"2"},"QWorkload":{"number":"PHYSCI 12b","course_id":"11091","cat_num":"82209","1s":"0","2s":"12","3s":"27","4s":"11","5s":"6"}},"instructor_scores":[{"number":"PHYSCI 12b","cat_num":"82209","course_id":"11091","year":"2013","term":"1","id":"19e95083d257b4e0d24166604dd4e778","first":" Randall","last":"Kelley","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.80"},{"number":"PHYSCI 12b","cat_num":"82209","course_id":"11091","year":"2013","term":"1","id":"9139380e2caf38f93af092c6d8ee7dc2","first":" Nils John","last":"Sorensen","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.90"},{"number":"PHYSCI 12b","cat_num":"82209","course_id":"11091","year":"2013","term":"1","id":"e593094de525dcee02a56c2cae7ac4ab","first":" Efthimios","last":"Kaxiras","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Fall '13":{"comments":["I hate physics so I wouldn't say I enjoyed this course, but if you have to take real physics at Harvard (not PS2\/PS3), this is probably the best possible class to fulfill the requirement. All the tests were take-home, so you didn't have to cram and memorize trivial stuff, but could actually work through problems and discover important concepts. The take-home tests are hard\/long though, so they probably end up taking as long as exam studying, but at least you know you can do well. The teaching staff is super helpful and really care about the course, which makes it a good experience overall. If you're good at physics, you probably won't like this course very much compared to a course with traditional exams.","This class is great. It goes in depth enough to give a thorough understanding of the material but instead of spending a lot of time on complex, theoretical mathematical derivations it gets more into application. A much better option for those studying engineering than the 15 series.","I really enjoyed this class, especially being an introductory level physics class. Definitely pick this over the 15\/PS 2&3 series. Randy\/Kaxiras really care about the class and the students. Having pass\/fail labs was really great, and the final project was a lot of fun. Also having all the midterms\/finals take home and being able to work on them with a partner was much better than having in class exams. The workload is really manageable, and I never felt that overwhelmed at any point during the class. If you have any questions, go to office hours and you'll be set.","take this if you're looking to fulfill your second semester of physics -- all 4 midterms are take home and you are given a partner to complete the assignment. the final is a take home paper where we first look into the 3 topics covered and discuss one thing about each topic and second apply our physics knowledge to some sort of science","This has been my favorite course that I've taken at Harvard. You learn so much applicable material from Matlab to the fundamentals of Electromagnetism. If you've never learned about electromagnetism, definitely take this course, it's honestly some of the coolest stuff you can learn. \r\n\r\nEvery aspect of this course is well run, and the teaching staff is incredible. Randy and Tim work really well together and are almost always available outside of the classroom to help. The labs are also truly interesting, and designed to be very manageable and extremely low stress. On top of that, the lab TF's Nils and Brian are just great guys. I can honestly say that going to lab was always a highlight to my week. \r\n\r\nThe structure of this class is also very well organized, and makes for a low-stress experience while learning a ton. All the exams were take-home and taken in pairs, with at least a week to complete. The final is also take-home, and takes form of a course report, which is very straight forward. \r\n\r\nAbove all else, the best aspect of this course is the resources available outside of the classroom. There are scheduled office hours almost every day of the week, and all of the teaching staff will make themselves available if you have any questions. \r\n\r\nTake this course! Easily the best intro physics option for engineers!","Fun class, excellent lab, and a great, laid-back alternative to 15.","One of my favorite courses I've taken at Harvard, the teaching staff is fantastic and I learned a ton.  This course teaches the same material as 15b but focuses more on the practical and numerical rather than the hard-core theoretical (although you still learn the theory in this course, probably just not quite as in depth).  It is a class that was designed for engineers so you use MatLab on most of your assignments - most people take PS12a before 12b and I found that I really liked using MatLab after I got used to it (had no experience with MatLab pre-PS12a).  GO TO OFFICE HOURS!!  Randy's and professor Kaxiras's office hours are extremely helpful for learning the course material and completing psets.  They're always willing to explain things and go over concepts, and are also really approachable and want students to really understand the material.  The labs are also fabulous, they're pass\/fail and 2.5 hours long, they're really interesting and related to the course material and Nils who organizes and leads the labs it fantastic.  I can't say enough good things about the course.  Really enjoyed the small size of the course.  There are four midterms and they're all take-home and you work with a partner; they're hard and it is good to start early and go to office hours, but it is absolutely worth it to put in the time to do the midterms and psets well.  I learned a ton from this course.","This is definitely an applied physics class, but it still covers a ton conceptually in lecture format - probably the best of both worlds. The emphasis on hands-on work makes everything really relevant (which makes everything really interesting), and the emphasis on group-work \/ team-work makes working in applied physics\/engineering look really exciting while also decreasing the stressfulness of the course. Take-home midterms and group projects create a low-stress culture which allows you to focus on the content of the course instead of on any non-relevant stressors, which is huge. We learned a ton, and the goal of the course for the teaching staff is really that you learn. Randy, the preceptor, and Nils, the lab head are really exceptional, and the entire staff is willing to help out at pretty much any time.","You will the most out of this class if you are willing to put in the time and energy.","I would tell them that Professor Kaxiras has so much heart and enthusiasm that you really want to learn the material.","This was an amazing physics class. Really made me enjoy the material. Teaching staff is amazing, course is well organized and structured. Loved it","This class wasn't a cakewalk, but I learned a lot and it was by no means painful. We were evaluated based on take-home midterms (for which were assigned a partner) and turned in a paper instead of taking a final. My grasp of the material increased exponentially with every module test because my partner and I would sit and work through the problems and visit office hours until we got it right. Definitely the best way to teach this class.","Reflecting back on this course, I learned a ton of information- great class, great professors and preceptors."]},"Fall '14":{"comments":["Very good class, with great teaching staff. But it requires a lot more MATLAB than I thought.","Be prepared to do a LOT of MATLAB and have no training\/teaching about MATLAB done in the class.  Good lectures, though, and very committed teaching staff.","My biggest takeaway is being able to use MATLAB. This course is very time consuming. Don't have anything else scheduled on Wednesday nights. I wouldn't recommend taking math simultaneously. I wouldn't take this class unless it's a requirement.","This class is a good alternative to all the other physics options (15, AP50, and PS2\/3). The take home module quizzes and final project were a lot less stressful than a midterm and final would be. The lab is AWESOME (Nils is the best!), section was helpful, and all the TFs were really nice. I probably learned more from the textbook than from lecture, partially because I would read to prepare for the reading quizzes, but the textbook was good so that was fine with me. Also I took this before taking 12a and I was fine.","I really enjoyed this class. The professor and teaching staff are really dedicated and impressive. The psets are very interesting, and the module quizes are quite reasonable.","PS12b is a great way to learn satisfy a physics requirement and learn E&M. If you are a science\/math minded person, and like physics (but not in a LOVE physics kind of way), this is a good choice. The teaching staff is supportive and encourages a mix of analytical and numerical (MATLAB) work.","good class, best option in intro physics","I took this class after taking AP50a and realizing literally any experience could be better than that.  That said, physics 12b was really not bad.  The lectures are pretty dense and equation-derivation heavy, and most of the homeworks leave you questioning yourself after a first attempt--but physics night is crucial, as are other office hours and section.  The module quizzes (take home, weeklong, open material, partner-only assessments) were an interesting way of evaluating, and typically they tried to pair people with matlab experience to those without, but it often became the case that one person got totally shafted by their partner assignment. The final project was actually quite fun and I feel like I learned more from that than from any lecture in the course.","This course is great. The numerical portion of the course is challenging but really rewarding when you figure out how to solve a problem. Take this class!","Go to class and read before class, because it will make understanding much easier and you will learn more quickly. Professor Kaxiras' office hours are priceless and you can get a lot of help there, while also making friends with people in the course.","Difficulty: 4\/5. A lot of MATLAB, good for engineers","This class definitely needs some work. Professor Kaxiras and Joon are both extremely passionate and knowledgeable but I really didn't learn much this semester. The psets are heinously difficult and impossible to do without extensive trips to office hours. I have never felt quite the same despair as I did when working on the nearly impossible module quizzes. Hopefully this course will be better in the future, because it has so much potential! The lab component is the saving grace of this course. I wish it were a bigger part.","As far as the PS12 series goes, this is definitely the weaker of the two. Be prepared to put in a fair amount of time into the problem sets; though sometimes the physics required for the homework wasn't necessarily hard, there is a lot of nit-picky Matlab and geometry. Make sure you find a good pset group or take advantage of office hours in order to complete the homework in a timely manner. The Module Quizzes are a godsend though, because it is so much better to have a beefed up take-home midterm than an in-class midterm. Plus you get to work with a partner, so you're less likely to flounder. That being said, PS12b isn't a hard class to BS your way through, though I wouldn't suggest it personally. Everything is group based, so if you can find smart people and don't feel guilty being a leech, you could put in minimal work. \n\nThe lecture component of this course was fairly boring; Professor Kaxiras just derives formulas the whole time. He's a good guy though. The preceptor, Joon, is a little colder and doesn't seem to really be interested in the students. But all of this is made up for by the awesomeness that is Nils, the lab preceptor. He is literally the best.","MATLAB is difficult but a great tool to learn","I would tell future students that from what I have heard and experienced, the PS12 series is definitely a good physics track, especially since it provides tangible experience with Matlab.","It's taught very well and has far less Matlab than many of its counterparts and equivalent courses.","There's a lot of work. Reading quizzes, lab, problem sets. If you fall behind at first, you'll never catch up. Tony and Nils are super helpful. Professor Kaxiras's lectures are generally not a good use of time.","prior experience with physics helps so much.","Best way to meet the physics requirement, HANDS DOWN. The 15 series is more geared toward physics concentrators who really want a heavy theoretical challenge, while the PS 2\/3 series is too rife with pre-meds (and this is a pre-med writing this). Sure, there is a significant MATLAB component to this class, but this is a programming language WELL WORTH KNOWING, and you can't beat take-home exams.","Not enough support was offered for the matlab portion of the psets (which usually took 40% of the entire pset time).","Go to office hours as often as you can. Come with questions prepared.","While this is undoubtedly easier than Physics 15, the lack of communication in the class and the Matlab component still makes it difficult.","Good physics for engineers","In order to do well in this course, it will help greatly to have a strong background in physical concepts the class discusses.  Office hours are great if you have time.  Lectures focus on deriving different physical principles.","Great course - really liked the ps12a\/b series. I think the numeric component helped me learn concepts; by having to programmatically demonstrate a concept, such as the magnetic field around a solenoid, you'll be better able to grasp what is taught in lecture.","I didn't feel like lectures were as complimentary to the homework assignments, so expect to spend some extra time in office hours to learn the concepts revolving around problem sets.","This course was difficult-- lectures could be hard to follow, and the assignments were really challenging. Matlab background is really useful, since it's a big part of the assignments but not covered in lecture.","This class is a good intro to circuits\/E&M. The worst part is the partner quizzes. All of my partners were terrible and did 0 work. Lectures are boring, but you don't need to go to them. I took AP Physics C in high school and was able to figure most of the PSets out without additional help.","This is a hard class that will require a lot of outside work. Very theoretical.","This class is a more practical, as opposed to theoretical, approach to physics. The focus is really on application of physical concepts, which makes it a great class for engineers. The class is also extremely collaborative. If you don't like working with a partner or a group, it is not for you. Every exam is a partner take-home, and there is a group final project. This is also a great class to take if you enjoy programming or want to improve your MATLAB skills, as there is a very large MATLAB component.","This course has a good deal of numerical applications pertinent to engineering and the life sciences. The focus is more on the practical aspects of physics. The professor cares and makes time to meet with students--please do go to his office hours.","The format of the course is stellar - the homeworks are tough but reasonable. The lab component is also great - very hands on and super easy. You should have some prior experience with matlab or  coding - the course is very matlab heavy.","This could have been a stronger class with the old TF. The teaching staff did not seem as cohesive this time around, though the TFs were always willing to help out. My primary complaint has to be with the vagueness of the assignments and the frequent irrelevance of the lectures, as the only way to do the homework ended up being asking for clarification again and again from the TFs. Professors and TFs didn't even agree on how to approach things, and while they were well-intentioned and accommodating, it was kind of stressful. If you have the time, I think you do learn a lot from the class and can guarantee you do well since all exams are take home and let you spend a lot of time learning and perfecting your answers. Make sure you know MATLAB and you should do okay!","Lectures are not the best, but Kaxiras' office hours are lifesavers","This course is very good and you will learn a lot about electromagnetism and waves. However, be prepared to struggle with problem sets as the problems are not trivial. Moreover, the material is somewhat difficult, not nearly as difficult as any of the Physics 15\/16 series.","It's a very good physics class and I enjoyed the Matlab components a lot, but it's definitely more proof-heavy than PS12a was... Very interesting material, but not always helpful for doing the homework.","If you want to take physics, but you don't want to take physics 15 or 16, this is a good course for you. If you're fairly good at physics and you want to learn CS, or vice versa, this is a good course for you. If you want an easy gen ed, this is not a good course for you.","This class requires a pretty significant amount of work for the psets and module quizzes, but having no exams is worth it, and the final project is fun.","This class is a good compromise between AP50 and Physics 15b, in that there are psets but it is not over the top rigorous in the analytical approach. The matlab portion of the course seems daunting, especially if like me you have never used matlab before. That being said, if you have experience coding and go to the matlab bootcamp at the beginning of the semester, you will be fine. Expect to spend a lot of time on the psets for this course, though they are totally do-able if you work with others. Also, PLEASE participate in class. Speak up and ask questions and you will understand the material better. If you do not, then honestly most of the class will be lost along with you and you will have to figure it out on your own. There is some material in this course where you will just have to figure it out on your own. The Section TFs are extremely helpful with this though.","useful to learn MATLAB quickly, but is overwhelming for new, unexperienced coders","I am a chemistry concentrator, and the ps12a\/b track was by far the best option for physics. I liked 12a better, but I still learned a lot about electricity and magnetism is a very low-stress way. Psets aren't too bad, and the system with module quizzes is really great and takes away a lot of the stress. Not necessarily the best taught class, but the teaching staff is also very willing to help and very accessible outside of class. Overall, a very low-stress, interesting, and engaging way to fulfill a physics requirement. Nils and Joon are particularly fantastic!!","Tests are take home, but the course is poorly organized.","nothing"]}},"mostRecentQ":{"overall":"3.30","workload":"9.20","difficulty":null,"recommendation":"3.70","enrollment":"64","response rate":"90.62","QCourseOverall":{"number":"PHYSCI 12b","course_id":"11091","cat_num":"82209","1s":"2","2s":"10","3s":"18","4s":"22","5s":"5"},"QDifficulty":{"number":"PHYSCI 12b","course_id":"11091","cat_num":"82209","1s":"0","2s":"1","3s":"6","4s":"9","5s":"2"},"QWorkload":{"number":"PHYSCI 12b","course_id":"11091","cat_num":"82209","1s":"0","2s":"12","3s":"27","4s":"11","5s":"6"}},"success":true}