{"scores":{"Fall '13":{"course_score":{"overall":"4.90","workload":"1.90","difficulty":"2.70","recommendation":"4.90","enrollment":"14","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 41e","course_id":"10838","cat_num":"79188","1s":"0","2s":"0","3s":"0","4s":"1","5s":"13"},"QDifficulty":{"number":"FRSEMR 41e","course_id":"10838","cat_num":"79188","1s":"1","2s":"3","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"FRSEMR 41e","course_id":"10838","cat_num":"79188","1s":"4","2s":"8","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 41e","cat_num":"79188","course_id":"10838","year":"2013","term":"1","id":"5d84842456531e8ec8b79929ef146ce2","first":" Carol","last":"Steiker","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"3.90"}]}},"comments":{"Fall '13":{"comments":["Be prepared to read","This class is amazing -- you get to interact with a law school professor in a really meaningful way and develop your own views about the death penalty and the criminal justice system in general.  Do NOT take this class if you have no interest in law and criminal justice because there is a lot of reading.  The reading is all interesting and informative, but it might seem overwhelming some weeks if you don't have an interest in law.  That being said, you don't need to have any background in law in order for this class to be successful!","If you like to think critically about moral questions and then debate them with enthusiastic peers, if you would like to know more about the American Death Penalty and the debate surrounding it, this is the chance to do all that with a brilliant professor that you will not have the chance to know otherwise at the college.","Doing all of the readings is worth it.","This freshman seminar is an excellent opportunity to learn more about capital punishment. However, more importantly, it's a great learning opportunity when it comes to personal development as well. By discussing complex readings and ideas with other students in class, and by hearing Professor Steiker's input, I feel that, through this class, I have sharpened by reasoning skills and my speaking skills. This course has forced me to challenge assumptions that I previously had and to argue my views more effectively. Overall, on top of learning about a fascinating and controversial topic from one of the foremost experts on it, this class was so worthwhile because it developed skills that will be helpful long after the class ends.","It is super intense. But you will get a lot out of it if you put a lot into it.","Professor Steiker is an amazing teacher, resource, mentor, and anything else you can add to the list. She really brings a lot of tough legal material to a level where freshman can not only understand, but apply. If the scope of the class wasn't enough of a reason to take it, learning from Professor Steiker is an opportunity that should not be missed.","The professor is great, and the material is incredibly interesting. You have probably never taken a course like this before.","This class will give a taste of what kind of analysis and readings you will encounter in law school"]}},"mostRecentQ":{"overall":"4.90","workload":"1.90","difficulty":"2.70","recommendation":"4.90","enrollment":"14","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 41e","course_id":"10838","cat_num":"79188","1s":"0","2s":"0","3s":"0","4s":"1","5s":"13"},"QDifficulty":{"number":"FRSEMR 41e","course_id":"10838","cat_num":"79188","1s":"1","2s":"3","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"FRSEMR 41e","course_id":"10838","cat_num":"79188","1s":"4","2s":"8","3s":"2","4s":"0","5s":"0"}},"success":true}