{"scores":{"Fall '13":{"course_score":{"overall":"4.80","workload":"2.80","difficulty":"3.20","recommendation":"4.60","enrollment":"16","response rate":"81.25","QCourseOverall":{"number":"COMPSCI 127","course_id":"10729","cat_num":"23635","1s":"0","2s":"0","3s":"0","4s":"3","5s":"10"},"QDifficulty":{"number":"COMPSCI 127","course_id":"10729","cat_num":"23635","1s":"0","2s":"3","3s":"4","4s":"6","5s":"0"},"QWorkload":{"number":"COMPSCI 127","course_id":"10729","cat_num":"23635","1s":"0","2s":"5","3s":"6","4s":"2","5s":"0"}},"instructor_scores":[{"number":"COMPSCI 127","cat_num":"23635","course_id":"10729","year":"2013","term":"1","id":"ba6f67cdb84f203cc4d6c531b5629fbe","first":" Salil P.","last":"Vadhan","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '13":{"comments":["Professor Vadhan is a fantastic lecturer. The material was innately interesting, and Professor Vadhan's clear enthusiasm for the material made the course all the more exciting.","Salil is such an awesome teacher. He is one of the few professors who can provide crystal clarity to complicated subjects. Some say that if you cannot explain your research in a language that 10 years old could understand, then you don't really understand it. It's easy to throw your students a bunch of strange terms and appear intellectually superior (which many Harvard professors do). It's difficult to teach with the same level of simplicity and clarity Salil does.","Salil's really great and it seems like he genuinely wants you to learn the material! The workload wasn't that much, but sometimes the problem sets could be a bit semantic meaning you could spend an hour or two trying to write the details of something perfectly.","More work than expected (compared to the 2006 iteration of the course). Interesting material and assignments. Salil really cares about the course and his students.","Salil is an excellent lecturer. He makes the class. If the subject matter seems difficult to you, at least know that (in my opinion) the grading and especially the testing was very fair.","It's hard and can get confusing later on in the course with many definitions, but it is a very rewarding and interesting theoretical course. I definitely learned a lot, and it is so amazing to see how so many different protocols can be constructed from such low-level assumptions.\r\n\r\nLectures \/ lecture notes are very clear, and office hours are super helpful as well. Problem sets can be challenging, but I wouldn't say overly challenging.","Great course, interesting topic matter. Salil was a great lecturer and has a very clearly organized lecture plan.","Cryptography is extremely interesting and Salil is a great lecturer. I don't know if they plan to offer this course again soon, but if they do make sure to take it. Salil also cares a lot about his students and is very approachable. If you are interested is cs theory, then any course taught by Salil is one you should seriously consider.","I HIGHLY recommend this class because (1) Salil is an absolutely fantastic teacher. You will learn a lot from him. (2) I discovered cryptography is a really interesting field with very important real world applications.  (3) You will get lots of practicing in reasoning about protocols\/\"games\" (especially through reductions) in the abstract in order to construct proofs of security, which really teaches you how to think and solve problems in a different way.","This is a very proof oriented class similar to the reduction proofs done in CS 121.  Every assignment involved proofs.  If you did well in CS 121 or liked the style of proofs then this class will be easy to understand since the language of CS 121 seems to directly apply here."]}},"mostRecentQ":{"overall":"4.80","workload":"2.80","difficulty":"3.20","recommendation":"4.60","enrollment":"16","response rate":"81.25","QCourseOverall":{"number":"COMPSCI 127","course_id":"10729","cat_num":"23635","1s":"0","2s":"0","3s":"0","4s":"3","5s":"10"},"QDifficulty":{"number":"COMPSCI 127","course_id":"10729","cat_num":"23635","1s":"0","2s":"3","3s":"4","4s":"6","5s":"0"},"QWorkload":{"number":"COMPSCI 127","course_id":"10729","cat_num":"23635","1s":"0","2s":"5","3s":"6","4s":"2","5s":"0"}},"success":true}