{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"1.70","difficulty":"2.70","recommendation":"4.30","enrollment":"59","response rate":"72.88","QCourseOverall":{"number":"RELIGION 1513","course_id":"11238","cat_num":"1233","1s":"1","2s":"2","3s":"6","4s":"10","5s":"23"},"QDifficulty":{"number":"RELIGION 1513","course_id":"11238","cat_num":"1233","1s":"2","2s":"13","3s":"23","4s":"4","5s":"0"},"QWorkload":{"number":"RELIGION 1513","course_id":"11238","cat_num":"1233","1s":"19","2s":"17","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"RELIGION 1513","cat_num":"1233","course_id":"11238","year":"2013","term":"2","id":"dda95ec995dcecdae2351741e1250182","first":" Stephen","last":"Shoemaker","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '14":{"comments":["The first part of the class is very boring. The last part of the class that pertains to modern day harvard is more interesting.","This is the single best course at Harvard- but that does not mean it's easy! Be prepared to be challenged to read critically, write in an argumentative manner and learn complex theological theories. If you are willing to be challenged, you will absolutely stand to benefit immensely from this course.","If you want to know anything about where Harvard comes from, definitely take this course! Also, definitely get started early on the final paper!","Every student at Harvard should take this course before they graduate. Dr. Shoemaker has done a truly marvelous job at constructing and carrying out a course with the appropriate breadth to cover the diversity of Harvard history while also ensuring the appropriate depth so that students walk away from the course with tangible knowledge of specific events and personalities throughout Harvard's history. Moreover, having an understanding of Harvard history really allows one to be introspective and to think reflectively about one's own Harvard undergraduate experience, and what it means to be a part of this institution. I think that students will find that so many of the themes throughout Harvard history resonate very powerfully with our contemporary college experience. This is one of those rare classes that is exciting and fulfilling both academically and personally. It is my sincere hope that this course is offered again, and that Dr. Shoemaker teaches this course, because every student at Harvard should have the opportunity to take this class.","ALL HARVARD UNDERGRADUATES SHOULD TAKE THIS COURSE!!! Well taught, and good, useful information that will make your time here more meaningful! \r\n\r\nDo the readings each week and contribute in section--that is an extremely important portion of your grade that is easy to let slide when other classes get busy some weeks. But doing the readings will make lectures and discussions much more interesting and will make preparing for the final much easier!","Dr. Shoe is wonderful. Glad I took this class, but would probably take it pass fail if I was to do it again! Take it!","Interesting course but know that it's a bit of a limited view point for approaching Harvard's history. Section was a blast though.","This was a really fun class! Professor Shoemaker is really passionate about the class, and learning about Harvard's past is interesting and makes you feel connected to its past.","An absolutely amazing course. It was so interesting to learn the history of the University I have the privileged of studying at. Harvard has such a rich history and there is so much information out there about it. Also, Professor Shoemaker is the best. Simply put.","the one page papers will challenge you a bit but its a cool fun elective to take, put in a little bit of effort and you'll do well","Don't get trapped by this class. Take it pass\/fail if you're looking for a gem.","This course was a phenomenal way of making Harvard's history alive. While taking this course, I found myself looking around the campus and having a whole new appreciation for its three hundred year history. Shoemaker's passion, much like his cheerful and jocular personality, was contagious!","I would say that it is  a fun course and you look at Harvard in a whole new way. The lectures are great to bring parents and friends to and Professor Shoemaker really tries to bring the history to life. There is a large portion about religion at the beginning of the course and it can be tiring to talk about. However the readings are fascinating , especially Morrison and anybody who appreciates Harvard overall will enjoy this course. Take it in the spring to relax and have fun!","This class is wonderful! If you are expecting an easy A you will not get it here, but you will definitely love the course.  The readings are not too bad and section is very engaging and informative.  This is probably one of the only courses were I really looked forward to going to lecture each week.","It's a great course. The material is interesting and I think it's very important and eye opening to know the history of this place. The professor is great, really friendly, approachable and fair. One of the better courses I have taken.","This was the perfect course with which to end my Harvard career. Dr. Shoemaker is an engaging, wonderful lecturer who has a clear passion for Harvard's history. This was one of my favorite classes at Harvard.","TAKE THIS CLASS! It really did help me appreciate harvard in ways i couldn't have imagined. Our school's history is fascinating and the harvard we know today is so different from what it was.  It is a good class for thesis people because most of the grades are after break, but you still should go to class (they're fun though!) because there aren't lecture slides\/videos. Also be sure to go to the archives early to start the research for your paper. I had to switch topics a bunch because of lack of good archival material and the archives have tricky hours. This being said, it's so cool to look through archival documents! Definitely use Dr. Shoemaker to run ideas by because he knows what works and what doesn't.","This class was one of the most interesting classes that I've taken at Harvard. It's a great class to take pass fail.  If you go to lecture you will do fine on the exam.  The readings are dense and there are a lot of them but you don't need to do them.  Dr. Shoemaker is a great lecturer.","Dr. Shoemaker is an extraordinarily interested lecturer who is a very fair grader, in the sense that this course is not an easy A.  Harvard's History is absolutely fascinating and Dr. Shoemaker discusses the subject with such passion and enthusiasm.","This is a very fun course. Make sure you follow along to truly get the most you can get out of it. While Dr. Shoemaker isn't an easy grader, if you put in the work, you will succeed in this class and get a lot out of it.","This is not as easy a class as I think some people expect, but it definitely is a worthwhile one and I can't imaging having graduated from Harvard without taking it. Dr. Shoemaker is a wonderful professor, and I learned as much from him about Harvard history as I did about what it means to be interested in history. He also gives great instructions & feedback on writing assignments, and is very available as a professor. By taking this class you will learn not only what kind of legacy you're a part of by attending this school but also what your education means and aspects of American history that you may not have fully known beforehand.","I found this class enormously tedious. The lectures are an oversimplification of ideas that could be far more interesting and nuanced than how they are presented. The class is also quite parochial. And, the grading is completely arbitrary. I went into the final not knowing my grade and I worked on the response papers each week with little confidence on how I could and could not improve.","beware- this class requires a lot of attention to detail and a large amount of work towards the final.","Every Harvard student should know something about this university's complex history before graduating. Harvard has been at the heart of some of the world's most challenging conversations. Don't spend four years here without appreciating what made this place what it is.","TAKE THIS CLASS. It is absolutely one of my favorite classes I've taken at Harvard; people make fun of the fact that only Harvard would have a class on the history of itself, but it's an incredible opportunity to learn about the school we all go to and how it became what it is today. Learning about how Harvard evolved with America is also just so cool, and Professor Shoemaker has some great stories (hopefully he'll have two Radcliffe lectures next year, because those were some of the best ones). Professor Shoemaker is also the nicest, funniest professor, who clearly has so much enthusiasm for the course material, and it was an absolute pleasure to take a class from him. If you're like me and spend most of your time doing problem sets, I'd recommend pass\/fail-ing it so you don't have to stress about all the writing, but the workload really isn't bad at all.","This was probably the best class I took in my four years at Harvard! If you're interested in Harvard (you probably are because you go to school here), this class will really help you understand the foundations of Harvard and how they affect how the institution functions today. Take it as early in your college career as possible so that you can benefit from the knowledge gained while you're still around here!","This is one of my favorite classes at Harvard! Definitely take it as a senior, you'll appreciate it more knowing your days are numbered here in Cambridge. Also, don't be afraid to reach out to Doc Shoe he was very responsive to any questions.","There's so much about Harvard that you probably don't know, and so this is a must take during your time here. Dr. Shoemaker is so enthusiastic about the subject, often telling his own stories from his research. It was also really cool to spend time researching in the Archives, as that's probably not something you'll do much otherwise here.","This is a fantastic way to bookend a college career at Harvard. Dr. Shoemaker is engaging, funny, and has unbelievable stories. It is fantastic to learn about the Presidents for whom Harvard's houses are named, and a 10 page research paper is only slightly painful, but teaches you a lot about archival research. The class starts off boring (the religion\/non-President information are not interesting), however, and Dr. Shoemaker is not always clear about what he expects for response papers, which is very frustrating. However, overall the class is worthwhile, fun, and an awesome experience in the end.","TAKE THIS CLASS! TAKE THIS CLASS! TAKE THIS CLASS!\r\n\r\nBut seriously, this is the best course ever offered at Harvard.  Dr. Shoe is the best professor at Harvard.  I think you get the point.  This class should be required of every Harvard student.  You really develop a whole new appreciation for Harvard and learning about its storied history from such a charismatic, funny, intelligent, witty, engaging professor is an experience that I wouldn't trade for anything.  I wish I could take this course every spring.  I would be surprised if this course wasn't lotteried in the future and became more popular than Ec10 and CS50 combined.  If you don't take this course while at Harvard, I feel extremely badly for you and I'm very sorry.  To conclude, Dr. Shoe is the coolest, and you should take this course.","Whether you are a freshman who is just adjusting to Harvard and still awestruck by being 'at Harvard' or you a senior who is looking forward to commencement, this will enrich your experience while here. It will make you understand the long tradition and history that you are a part of, and inspire you by learning about some of the impressive figures and characters who contributed to that history as a student or administrator. Take it!! The long paper may intimidate you, and this is not a \"gut\" a \"gem\" or a \"snap,\" but you can really pursue whatever topic interests you for your paper and will get a lot more out of this than you will from many other elective courses.","I LOVED this class! It gives you a completely new view of Harvard and how special this place is. The research paper and small project give you a chance to use the archives and delve into one aspect of history that you find particularly interesting.","This is only a good course if you are looking for something that requires minimal effort. It isn't intellectually interesting or challenging at all, and the lectures and readings presented no arguments. The only interesting component was the final paper, when we could actually discuss substantial material."]}},"mostRecentQ":{"overall":"4.20","workload":"1.70","difficulty":"2.70","recommendation":"4.30","enrollment":"59","response rate":"72.88","QCourseOverall":{"number":"RELIGION 1513","course_id":"11238","cat_num":"1233","1s":"1","2s":"2","3s":"6","4s":"10","5s":"23"},"QDifficulty":{"number":"RELIGION 1513","course_id":"11238","cat_num":"1233","1s":"2","2s":"13","3s":"23","4s":"4","5s":"0"},"QWorkload":{"number":"RELIGION 1513","course_id":"11238","cat_num":"1233","1s":"19","2s":"17","3s":"6","4s":"0","5s":"0"}},"success":true}