{"scores":{"Fall '13":{"course_score":{"overall":"4.10","workload":"1.70","difficulty":"2.00","recommendation":"4.40","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":"CULTR&BLF 57","course_id":"10853","cat_num":"25057","1s":"0","2s":"2","3s":"2","4s":"5","5s":"7"},"QDifficulty":{"number":"CULTR&BLF 57","course_id":"10853","cat_num":"25057","1s":"5","2s":"6","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"CULTR&BLF 57","course_id":"10853","cat_num":"25057","1s":"8","2s":"6","3s":"1","4s":"1","5s":"0"}},"instructor_scores":[{"number":"CULTR&BLF 57","cat_num":"25057","course_id":"10853","year":"2013","term":"1","id":"305d145a078c6e8fbaeb73819d960c96","first":" Helen","last":"Hardacre","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.30"}]}},"comments":{"Fall '13":{"comments":["This course seems like it could be cool, and maybe it will improve after this (I think its first) year. But at least based on when I took it, I wouldn't recommend it unless you just want a totally easy class and want to watch some really good movies. The lectures and sections are really, really boring most of the time. Again, worthwhile if you want to just hang out and watch some movies, but if you want your classes to be really deep and engaging, I might pass on this right now.","This course is a great way to get the Culture and Belief gen ed out of the way. Having one of two weekly sections consist of watching a movie and only one short response paper every week, this class is pretty easy in terms of workload. However, having a general interest in Japan would definitely be recommended, as your analysis will be directly compared with a majority of people who are either East Asian Studies concentrators, from Japan, or both. Also, minimal knowledge of Japanese would be helpful given all of the movies were shown in Japanese with English subtitles. From what I could tell, most of my classmates could speak Japanese fairly proficiently which could have added a certain depth to the films, considering at least a marginal bit of original interpretation is lost in translation when converting a language as characteristically unique as Japanese to English.","This class is awesome if you are interested in anime and\/or want to fulfill the Culture and Belief requirement.","This course is fun with awesome material and fun films. However it also emphasizes critical writing with amazing feedback that seeks to make you a much better writer in the humanities. The teachers truly care about your feedback and implement changes to make the course more dynamic as the weeks pass on. Definitely take it and enjoy the Hayao Miyazaki films!","If you are even slightly interested in Japanese culture, anime, or manga, you should definitely take this course! The lectures are awesome and Helen is one of the sweetest people you'll ever encounter here at Harvard. Definitely take this course if you're looking to satisfy a Culture and Belief requirement.","You will never look at anime and manga the same way again! This course has given me so much insight into the contemporary world of Japan and of course, Japanese Buddhism. I seriously feel like this is one of the most engaging and interesting courses I have taken yet! My classmates were all interested in anime and manga and just that alone totally made for incredibly interesting discussion section - not once did I dread having to go to section. Also, the courseload is EXTREMELY light - either a discussion post or a (short!) response paper (it's changed to one or the other every week which makes the work feel less repetitive). Also, Adam is an amazing TF - he's kind, cool and taught me how to write all over again. Didn't think a class on anime and Buddhism would teach me how to write, but it did! Movies seemed to take the most time outside of lecture but if you plan to take this course and don't mind going to weekly screenings, totally worth it - the movies are wonderful (and some are interesting in different ways) and are very relevant to the course. I absolutely enjoyed this course and walked away from it knowing much more than I thought I would (and they even have a recommended anime list!) Take this course!!","If you like anime, it's not what you think.","This is a great class to take if you are remotely interested in anime or Japanese culture and want to fill the Gen Ed requirement.","This was a fun course, the subject matter is interesting and the films you watch are great!","Films are wonderful and Professor Hardacre really cares about the material and teaching. Guest lecturers are wonderful too.","This is honestly one of the best courses I've taken at Harvard. It covered Japanese religion quite well, and made strong, clear ties to the films it watched. Take this class if you're interested at all in Japanese religion or anime and film."]}},"mostRecentQ":{"overall":"4.10","workload":"1.70","difficulty":"2.00","recommendation":"4.40","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":"CULTR&BLF 57","course_id":"10853","cat_num":"25057","1s":"0","2s":"2","3s":"2","4s":"5","5s":"7"},"QDifficulty":{"number":"CULTR&BLF 57","course_id":"10853","cat_num":"25057","1s":"5","2s":"6","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"CULTR&BLF 57","course_id":"10853","cat_num":"25057","1s":"8","2s":"6","3s":"1","4s":"1","5s":"0"}},"success":true}