{"scores":{"Spring '14":{"course_score":{"overall":"4.10","workload":"2.00","difficulty":"2.80","recommendation":"4.00","enrollment":"35","response rate":"51.43","QCourseOverall":{"number":"PHIL 34","course_id":"11076","cat_num":"60569","1s":"0","2s":"0","3s":"3","4s":"10","5s":"5"},"QDifficulty":{"number":"PHIL 34","course_id":"11076","cat_num":"60569","1s":"0","2s":"5","3s":"12","4s":"0","5s":"1"},"QWorkload":{"number":"PHIL 34","course_id":"11076","cat_num":"60569","1s":"4","2s":"11","3s":"2","4s":"1","5s":"0"}},"instructor_scores":[{"number":"PHIL 34","cat_num":"60569","course_id":"11076","year":"2013","term":"2","id":"b41e46a9f0ec4f42b6db21ac94ca579d","first":" Sean D","last":"Kelly","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Spring '14":{"comments":["One of the most enjoyable classes I've taken. Professor Kelly may be my favorite lecturer at Harvard","If it stays as it was this year, it's a LOT of reading. Really, a lot. It's very rewarding, I'm sure, if you do it. Professor Kelly is great. But I couldn't (or at least didn't) keep up with all the readings. But if that doesn't bother you, then definitely take it. Great material, a really good lecturer, what more could you want?","Prof. Kelly is great, he's enthusiastic and extremely open to meeting with students outside of class just to talk. Lectures are interesting if occassionally repetitive.  There's more of an emphasis on theistic existentialism than I would have liked, but it's worth it to spend so much time on The Brothers Karamazov. The work load is manageable in general, but TBK is obviously a lot of reading. Lauren is also great, she's a really thoughtful discussion leader and gives good essay feedback.","This course teaches some very interesting and thought-provoking texts, and some great movies. Professor Kelly is a good lecturer, with smart insights and a genuine care for students and his subject. This is also the type of course that causes a self-reflection and helps change, at least for me, not only how I think in a classroom but how I act in everyday life. His syllabus may scare you with a seemingly large workload, but besides Dostoevsky the reading was only an hour or two each week. I'd tell any friend to take it.","TAKE THIS CLASS! Professor Kelly and Lauren are an awesome team! The readings are fantastic! You get to read Dostoevsky's The Brothers Karamazov which is life changing and other great novels like Kierkegaard's Fear and Trembling, Samuel Beckett's play Endgame, etc. TAKE IT! This class is so doable. The essays are interesting and pain free, the readings are amazing, and the lecturer\/professor is intelligent and a good speaker.","I have mixed feelings about this course. As a non-humanities major, I took it because I wanted to try out philosophy. I felt like I was at a significant disadvantage and struggled with all of the papers. I don't feel like I got the necessary feedback to improve my writings, and I (think) I'm getting the lowest grade in this class that I've gotten in any class at Harvard.\r\nOutside of my GPA, however, the material of this class was fairly interesting. If you're interested in existentialism, such as Kierkegaard and Dostoevsky, this course is great.","Take this class if you would like to learn more about Existentialism, but if you are not a concentrator and are only taking one philosophy class to try out philosophy, I would likely recommend another.","Kelly is a magical professor and Lauren is a fantastic TF. A great introduction to philosophy with a very humble and captivating teaching staff!","This was a wonderful introduction to philosophy. If you are new to philosophy, I would take it if you know you only want to take one philosophy class without getting huge foundation (if you prefer building a foundation, you should consider Phil 8). The readings and films were very interesting - the type you'll wish you had spent more time on. Favorite was Nietzsche's The Gay Science. Sean Kelly is a fantastic professor. Definitely go to his office hours because he is incredibly open-minded and fun to talk to. He is one of those professors for whom you don't have to prepare a question to go to his office hours and he will ask you about yourself. He gives very interesting analyses that are also very accessible. Lastly, this course will probably make you reflect on your own existence to some extent. For me, there were many moments when I was surprised at how applicable \"defining commitments\" and \"choosing how and what to think\" were important concepts for what was going on in my life.","This class is a great introduction to existentialism. You do get a taste of philosophy, but at the end of the day, you're reading great literature and watching some terrific films. The material is incredibly interesting - on both an intellectual and personal level. Great course overall!","The course materials, and thus the course, focus heavily on religion. Thus, many of the discussions were based on religious questions and on how man deals with religious quandaries.","The material was great, the structure could have definitely been better and the time spent on each writer and subject should be reavaluated","This class is good, but far from a perfect class on Existentialism. The bulk of the course is on the Brothers K, and if you don't connect with that one text, the class will be much more difficult to engage with."]}},"mostRecentQ":{"overall":"4.10","workload":"2.00","difficulty":"2.80","recommendation":"4.00","enrollment":"35","response rate":"51.43","QCourseOverall":{"number":"PHIL 34","course_id":"11076","cat_num":"60569","1s":"0","2s":"0","3s":"3","4s":"10","5s":"5"},"QDifficulty":{"number":"PHIL 34","course_id":"11076","cat_num":"60569","1s":"0","2s":"5","3s":"12","4s":"0","5s":"1"},"QWorkload":{"number":"PHIL 34","course_id":"11076","cat_num":"60569","1s":"4","2s":"11","3s":"2","4s":"1","5s":"0"}},"success":true}