{"scores":{"Fall '13":{"course_score":{"overall":"4.30","workload":"2.00","difficulty":"2.80","recommendation":"4.40","enrollment":"60","response rate":"90.00","QCourseOverall":{"number":"SOCIOL 27","course_id":"11158","cat_num":"67106","1s":"0","2s":"1","3s":"4","4s":"25","5s":"23"},"QDifficulty":{"number":"SOCIOL 27","course_id":"11158","cat_num":"67106","1s":"3","2s":"13","3s":"32","4s":"6","5s":"0"},"QWorkload":{"number":"SOCIOL 27","course_id":"11158","cat_num":"67106","1s":"13","2s":"29","3s":"10","4s":"2","5s":"0"}},"instructor_scores":[{"number":"SOCIOL 27","cat_num":"67106","course_id":"11158","year":"2013","term":"1","id":"458908b1d1ef32de0d790fe64551ab70","first":" Jocelyn","last":"Viterna","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Fall '13":{"comments":["Take it. That is all you need to know. Professor Viterna is the single best lecturer I've had to date. This class blends aspects of small discussion with very effective, engaging, and enlightening lecture content. (I had at least three epiphanies during the course.) Jocelyn's policies on essays and readings are completely spot on. Sections are very well run, and the course is very responsive to student input and suggestions.\r\n\r\nJust do yourselves a favor and take this course.","This class will be one of the highlights of your college experience if you take it. Prof. Viterna is a really great, kind, and encouraging professor and the content is fascinating. She explains things lucidly and presents issues and debates with multiple angles. Also, it gives you a chance to pursue independent research on a case that interests you, which is a good way to learn the material in the course. It feels good to take ownership of a subject and understand it through the lens of the theories presented in lecture. The assignments are useful, and enjoyable. Very highly recommended.","a lot of work but very rewarding!!","Viterna and the TFs (especially Theo) are amazing. All are incredibly dedicated to making the class useful. It is best if you have had previous experience studying or being in a social movement or have special interest in a social movement. Do not use this as a class to learn about social movements if you have not had previous experience before because then you will feel lost and not as invested in a class which deserves full class participation. One problem is that I still don't really understand why it's important to study social movements, though I do know how to analyze social movements.","The course material itself is not too difficult, but I don't think I learned as much as I could have in this class. The professor and TF's are all wonderful people, and discussion could be interesting. Sometimes lectures were just a little bit dull though.","This course changed my life for the better by exposing me to sociology. It is incredibly well taught, and although the time commitment is relatively high, you will not notice because it is so FUN TO LEARN this stuff. I doubt that there are better professors than Professor Viterna. Do yourselves a favor and take this course. Even if you are not planning on concentrating in the social sciences, you will be engaged and interested in this course.","Professor Viterna is wonderful, as are the TFs.  The class environment is warm and engaging.  To get the most out of this class, attend office hours regularly to get a firm grasp on theory, start doing research for your final exam early (and be organized!), and ask lots of questions. The class doesn't have an insane workload, which gives you time to process and understand the ideas being discussed. Overall, I have no complaints about this class.","This is a fantastic course! Professor Viterna is a great lecturer and is very accessible - TFs for the course were great too. The workload is very reasonable and the course progresses very logically with respect to assignments and material.","Jocelyn Viterna is an excellent lecturer and this is a great introduction to sociology courses. Though I do not plan on concentrating in the humanities, this course did give me a greater amount of respect for sociology and social theory.","The class was relatively easy but had a heavy work load. The material is interesting, and the essay topics really get you to think about the literature and the theories in new ways. Professor Viterna is an amazing professor who is very approachable and keeps your attention.","A lot of essays... the individual research aspect provides a great opportunity to explore a topic that you're interested in. Prof. Viterna is a good lecturer but lectures on theory got boring before long. For whatever reason it was hard to stay focused on the class...might have been the subject matter","This class is full of interesting information and case studies on social movements and revolutions throughout history and all around the world. As long as you approach this class with sincerity, you should perform well on the assignments and in lecture\/section. The papers are manageable, and even challenging essay prompts can be workshopped with the teaching staff. A highly accessible and virtually painless way to earn a Sociology or GenEd credit.","I really loved this class; it made me change my concentration to Sociology. Professor Viterna is a great lecturer and the sections are very engaging. The fact that you can do research on what you want is definitively a plus and eases the way you learn the social movement theories.","The material in this class is really interesting. You get a lot of information on social movement theory as well as actual social movements.","A really solid class! The content is interesting throughout, the professor and TFs are great, and the workload is both manageable and flexible. Plus you get to spend a lot of time on your own case study which is a really cool, independent way to explore social movements that personally interest you.","This class is really terrific. Viterna is a great lecturer and is very eager to ensure that all students have a fulfilling experience. \r\nThe course readings are very interesting. The structure of the course allows for students to pick their own movement to study. This allows for immediate application of the theory, and ensures that all students will thoroughly learn all the material.","This class has many interesting case studies but be prepared to write, in total, five long essays. Having said that, due to the amount of research available it is not hard to write these essays.","If you're passionate about a certain cause, this class is fantastic. You pick your own case study at the beginning and follow it through until the final, so it really gives a lot of leeway for personal interests, which I enjoyed. The assignments are designed to prepare you for the final, so they were actually really helpful in drawing together a cohesive picture of what you learned in the class.","If you have a case in mind you want to study, this is a great class to get that done. If not it's rather disorganized and the material is rather disjointed; but if you're really into social movements I think this is your only option.","This class is great because social movements are such common thing in the world and this class provides you with the knowledge to understand how these movements work and how they were formed","Really try to do the extra readings for the class and pay attention in lecture.  It is all very interesting","If you like social movements and want to learn about sociology theory, take it!","A lot of fun, intellectually stimulating, but with many names to learn","Really worth it. I find that I can look at events through a different sociological lens and that was my reason for taking the class. You're going to find some intense political activists in this class, but there are intense people in every class. Also, Professor Viterna really leaves a lot of room for discussion.","This course was highly disorganized and, in my opinion, mostly a waste of time. Do not take this course if you are interested in actual social movement theory. That being said, it was a new course and some people seemed to really enjoy the course. My TF was great, the prof not so much.","AMAZING! The lectures are unquestionably the best I've ever sat through. Ever week I actually looked forward to TuTh at 2, because these lectures were effective, engaging, and fun. This class is not to be missed if you are at all interested in any social movement in history. You spend section and homework researching a movement to which you apply the theory taught in class. Instead of falling asleep to dense and boring theory articles, lecture provides the tools and you provide the case study. Superbly innovative distribution of labor.","Whether or not you have activist experience, you will learn something from this course. It's a nice way to get theoretical backgrounds while also being able to do a case study on something you may have already worked on.","The class is an excellent opportunity to test the waters of sociology and social theory. The course won't be easy (in terms of reading, essays), but is manageable. And all work feel necessary - no busywork.","The course is still in transition to an introductory sociology course. Upperclassmen generally found this class more enjoyable in the past (and this year), as it's liberating to study what you truly want to. However, the class format is conclusive to learning more about sociological theory\/real life case studies. Viterna is also interactive and friendly, a boon which should not be understated!","This class was not as interesting as I had initially hoped. The topic of social protests sounds very interesting, but keep in mind that theory can be very dry. Still I would say that the theory will change how you analyze new social movements. For someone interested in a career in government or policy, I think it is crucial that you take a class on this kind of content. The workload of this class is really light and the grading is also really easy. You don't have to be the best writer to do well on the essays. Also the notes that Professor Viterna provides basically cover everything that you need to know.","Great class. Viterna is a passionate lecturer. The assignments are great- the way they are set up you do an in-depth exploration of three of the five segments of the course, which prepares you really well for the final. Also you get to apple the the theories of the class on a social movement you're interested in for the midterm and the final, and I loved that because I got to write about something I cared about.","If you're interested in sociology, social movements, or a larger more theoretical view of social movements, this course is great.","Great introduction to sociology","Great class to learn about social movements from around the world from a sociological standpoint. Low workload on the readings side, but you learn a lot from the case studies in lecture and the cases of other people in the class.","I took this class just for fun. I was interested in sociology and social movements, and it was intro level, so it seemed perfect. Now, I think I might consider sociology as a concentration. The professor is incredible and lectures were always super interesting. The course readings never really felt too heavy because they were so engaging. I really loved this course and I would highly recommend it to anyone who wants to try out sociology.","This course is definitely interesting and engaging. You have the opportunity to choose your own case study to research and apply theory to. I think it is a better course for junior or senior sociology majors working on their thesis; however, as a freshman, it was a great introduction in social movement theory and a great way to learn about movements throughout the world. Jocelyn is a great professor, super nice and willing to help with anything. The subject matter is interesting and the books are good - just make sure you don't leave the reading until the night you have to write the paper. Overall, it is a great course.","The lectures are awesome and engaging. It is not too course heavy, but make sure not to leave your three essays to the last minute (since you get to choose to write 3 out of five essays during the semester). Also choose a movement that has a lot of literature written about it so that you can analyze it easier."]}},"mostRecentQ":{"overall":"4.30","workload":"2.00","difficulty":"2.80","recommendation":"4.40","enrollment":"60","response rate":"90.00","QCourseOverall":{"number":"SOCIOL 27","course_id":"11158","cat_num":"67106","1s":"0","2s":"1","3s":"4","4s":"25","5s":"23"},"QDifficulty":{"number":"SOCIOL 27","course_id":"11158","cat_num":"67106","1s":"3","2s":"13","3s":"32","4s":"6","5s":"0"},"QWorkload":{"number":"SOCIOL 27","course_id":"11158","cat_num":"67106","1s":"13","2s":"29","3s":"10","4s":"2","5s":"0"}},"success":true}