{"scores":{"Spring '14":{"course_score":{"overall":"4.40","workload":"2.10","difficulty":"3.30","recommendation":"4.30","enrollment":"18","response rate":"83.33","QCourseOverall":{"number":"MCB 170","course_id":"11037","cat_num":"43947","1s":"0","2s":"1","3s":"0","4s":"6","5s":"8"},"QDifficulty":{"number":"MCB 170","course_id":"11037","cat_num":"43947","1s":"0","2s":"2","3s":"7","4s":"5","5s":"1"},"QWorkload":{"number":"MCB 170","course_id":"11037","cat_num":"43947","1s":"1","2s":"13","3s":"0","4s":"1","5s":"0"}},"instructor_scores":[{"number":"MCB 170","cat_num":"43947","course_id":"11037","year":"2013","term":"2","id":"eaefaf3b475fb5eeef801fc9c39608b5","first":" Laura M.","last":"Magnotti","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.30"}]}},"comments":{"Spring '14":{"comments":["This was a great seminar. The topics were interesting, the workload was manageable, and the lectures were interesting. Take it!","This course was really interesting, but prepare to do a lot of work and memorize quite a bit of material.","Take this class for an excellent neurobio elective. You learn lots of great microbiology and many topics skillfully incorporate important concepts in neurobiology, such as a review of the electrophysiology of an action potential in the autoimmune disease lecture and the properties of the blood brain barrier in learning about how to design a drug that will cross it. Laura is a highly effective lecturer who is laid-back and really wants you to succeed. Mike is a super nice guy","Great class but don't underestimate the workload. Laura is wonderful but there is a LOT of material to memorize and work that you should be willing and prepared to do. That said, super interesting!!","This is one of the most interesting classes I've taken at Harvard. You learn a lot about the different diseases of the brain, lectures are very enjoyable, the questions\/scenarios you encounter during reviews\/exams are entertaining. That being said though, you do cover a lot of material in the course of this class, so be sure to take good notes, and review them often.","Great class with very interesting material. Make sure to review every week, or else you will forget the material very easily, as there is so much of it. Manageable workload, and great for learning to read papers critically. Just make sure to start studying for the midterm and final early enough!","This was a great and interesting class. If you like immunology but also neurbio it is perfect for you.","Way way way too many things going on.  You have 5-6 writing assignments, a midterm, a project, a final paper, AND a final exam.  Furthermore, the amount of material is non-trivial.  Streamline the class please!! Also presentations could have been better...lectures were simply words read verbatim off slides...so easy to zone out and not pay attention.","MCB 170 was a really fun, pretty low work load upper level class. Prof. Magnotti is awesome, clearly cares about teaching and even baked for us! I really enjoyed going to class every week and learning about the wonderful pathogens that like to invade our brains! Take it if you have the chance!! (even as a non-neuro concentrator, it was easy to keep up!)","Laura is a great professor and a really nice person to get to know.  The course is in its infancy so there are some issues, like overall view of the material vs little facts.  Still, I learned a surprisingly great amount of immunology and the course was interesting overall.","Interesting, generally relaxed course; learned a lot about neurobiology but also about basic biology. Fun environment, good-sized class, and great teaching staff!","I thoroughly enjoyed taking this class. The subject matter of this course is excellent. I applied much of what we learned to my other classes, and the diseases were fun to chat with my friends about over dinner. Discussion section can be tedious (big focus on explaining figures which gets old fast), but the papers are at least interesting.","Thins is a very interesting course that looks at the intersection of neurobiology, microbiology, and immunology without requiring too much previous, in-depth background. The requirements make it very reasonable and Laura is absolutely wonderful. Highly recommended elective"]}},"mostRecentQ":{"overall":"4.40","workload":"2.10","difficulty":"3.30","recommendation":"4.30","enrollment":"18","response rate":"83.33","QCourseOverall":{"number":"MCB 170","course_id":"11037","cat_num":"43947","1s":"0","2s":"1","3s":"0","4s":"6","5s":"8"},"QDifficulty":{"number":"MCB 170","course_id":"11037","cat_num":"43947","1s":"0","2s":"2","3s":"7","4s":"5","5s":"1"},"QWorkload":{"number":"MCB 170","course_id":"11037","cat_num":"43947","1s":"1","2s":"13","3s":"0","4s":"1","5s":"0"}},"success":true}