{"scores":{"Spring '14":{"course_score":{"overall":"4.40","workload":"2.00","difficulty":"2.60","recommendation":"4.50","enrollment":"43","response rate":"67.44","QCourseOverall":{"number":"CULTR&BLF 58","course_id":"10854","cat_num":"63195","1s":"0","2s":"1","3s":"2","4s":"10","5s":"15"},"QDifficulty":{"number":"CULTR&BLF 58","course_id":"10854","cat_num":"63195","1s":"1","2s":"10","3s":"17","4s":"0","5s":"0"},"QWorkload":{"number":"CULTR&BLF 58","course_id":"10854","cat_num":"63195","1s":"3","2s":"21","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CULTR&BLF 58","cat_num":"63195","course_id":"10854","year":"2013","term":"2","id":"0b03e86ef4eedb34b3e59d021d165838","first":" Arthur","last":"Kleinman","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.70"},{"number":"CULTR&BLF 58","cat_num":"63195","course_id":"10854","year":"2013","term":"2","id":"172929cf4c6b52dd8d88e24d67ad2549","first":" Jeffrey F.","last":"Hamburger","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"2.80","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.50"},{"number":"CULTR&BLF 58","cat_num":"63195","course_id":"10854","year":"2013","term":"2","id":"17ca3a66be3f7e8654d22e7d35391b31","first":" Thomas Forrest","last":"Kelly","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"},{"number":"CULTR&BLF 58","cat_num":"63195","course_id":"10854","year":"2013","term":"2","id":"dfbb1f4e749c96d35ea6bc00bf4f2311","first":" Karen Laura","last":"Thornber","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"},{"number":"CULTR&BLF 58","cat_num":"63195","course_id":"10854","year":"2013","term":"2","id":"ffdef953c00697b7354e6be8ec7db8c4","first":" David Shumway","last":"Jones","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.60"}]}},"comments":{"Spring '14":{"comments":["This course was definitely very interesting and not too difficult, but I don't feel like I got as much out of it as I would have liked. I loved many of the professors' lectures and some of the papers were actually a lot of fun to write. However, some of the units felt very disconnected from the rest of the course (a danger of an \"interdisciplinary course\"). Overall, I thought this was a painless way to fulfill the C&B gened, and overall a great introduction for me to some fields of the humanities that I had not previously studied.","I loved, loved, loved this class. It was incredibly interesting, made me think about the topic in entirely new ways, and the interdisciplinary set up was fascinating. This is one of the best classes I've taken here (and I'm a senior, so I've got a lot to compare to). Prof. Jones in particular  is an excellent lecturer, but a number of the lectures in this class seemed almost like works of art in and of themselves. I found some topics more engaging than others, but even the sections I enjoyed less were still great. Section was also incredibly interesting and engaging and made me think in ways sections do not normally (Austin is great). Take this class.","Take this class if you want a foray into multiple different disciplines at Harvard with the best professors in those fields.","Great class; I loved that multiple different fields of study were incorporated to understand death; the teaching staff is excellent and very talented; would highly recommend the course","lots of work, depressing but cool to study different media","I think pretty much all premeds should take a class like this or literature and medicine--necessary to make you aware of the human side of medicine--really interesting exposure to a lot of different kinds of humanities, good readings and discussions","This course is a great lens into your own life. I would recommend it strongly. You won't regret it.","This class was one of my favorites. All of the professors are very knowledgeable and the Q&A session at the end of each lecture is great. This class is not just for pre-meds.","If you're not genuinely interested by the course description, don't take it.","Don't nitpick about the minutiae of the course readings; rather, focus on the thematic content of the lectures after you've done the readings in order to figure out what the professors want you to learn from the readings. You'll get more out of the course if you understand the main concepts and themes (e.g. caregiving and presence) rather than just knowing the exact number of pages in the Tale of Genji or the names of the opera singers who premiered Mozart's Don Giovanni. Of course, it's important to know specific examples that illustrate the course's themes, but don't lose sight of the forest by staring at a single tree.","Great survey course in medical humanities. I would definitely recommend for science concentrators planning on going into medicine.","This is a fantastic course, especially for premeds who love the humanities! Even if you're not interested in pursuing a career in medicine, this is a great course to get a wide flavor of many different humanities disciplines. The professors and lectures are incredible, and because you explore the topic through a variety of lenses, you get a varied perspective and are never bored. The readings are not overwhelming and are truly interesting. Also, you get some creative assignments which make the work really fun! For me personally, this class, with its focus on death and dying (note that the topic will be changing), really helped me put more perspective on my own life, and I am so glad I took this course.","first year they were really open to feedback- great professors!","This course is not very well structured, so be ready for that. Additionally, make sure to have a good system for taking notes in this class. Most of the things taught are very vague so notes are tough to take for the course.","CB 58 was great--it was a wonderful introduction to various perspectives in the humanities that are very pertinent to our understanding of medicine.  It moves at a fast pace and there is a lot of material, but if you're interested in the topic at hand, then the work is very fulfilling!","If you're looking for an interesting gen-ed with a light workload, this is a great one (especially if you're premed). I think in future years it will be focused on something other than death and dying (this year's focus), so it may even be less depressing. Great lecturers.","This course was one of the most rewarding Gen-Eds I have ever taken at Harvard. Exploring death through cultural, anthropological, art, literature and historical lenses provided me with a unique and deep understanding of the topic in the context of the medical humanities. Important education for any individual (doctors included!) who want to connect on a more empathetic level with other people.","Great special course that is the epitome of what Harvard has to offer. Great scholars getting students to think about important questions that inform a world view."]}},"mostRecentQ":{"overall":"4.40","workload":"2.00","difficulty":"2.60","recommendation":"4.50","enrollment":"43","response rate":"67.44","QCourseOverall":{"number":"CULTR&BLF 58","course_id":"10854","cat_num":"63195","1s":"0","2s":"1","3s":"2","4s":"10","5s":"15"},"QDifficulty":{"number":"CULTR&BLF 58","course_id":"10854","cat_num":"63195","1s":"1","2s":"10","3s":"17","4s":"0","5s":"0"},"QWorkload":{"number":"CULTR&BLF 58","course_id":"10854","cat_num":"63195","1s":"3","2s":"21","3s":"4","4s":"0","5s":"0"}},"success":true}