{"scores":{"Fall '14":{"course_score":{"overall":"5.00","workload":"8.00","difficulty":null,"recommendation":"5.00","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"GOV 94py","course_id":"10881","cat_num":"70025","1s":"0","2s":"0","3s":"0","4s":"0","5s":"5"},"QDifficulty":{"number":"GOV 94py","course_id":"10881","cat_num":"70025","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"GOV 94py","course_id":"10881","cat_num":"70025","1s":"0","2s":"3","3s":"1","4s":"0","5s":"1"}}},"Fall '13":{"course_score":{"overall":"4.80","workload":"2.80","difficulty":"3.60","recommendation":"4.60","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"GOV 94py","course_id":"10881","cat_num":"70025","1s":"0","2s":"0","3s":"0","4s":"0","5s":"5"},"QDifficulty":{"number":"GOV 94py","course_id":"10881","cat_num":"70025","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"GOV 94py","course_id":"10881","cat_num":"70025","1s":"0","2s":"3","3s":"1","4s":"0","5s":"1"}},"instructor_scores":[{"number":"GOV 94py","cat_num":"70025","course_id":"10881","year":"2013","term":"1","id":"4857a46ad5d966727ab13c96902c90fe","first":" Payam","last":"Mohseni","InstructorOverall":"4.78","EffectiveLecturesorPresentations":"4.89","AccessibleOutsideClass":"4.89","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"4.75","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.38"}]}},"comments":{"Fall '13":{"comments":["This is a hard course but is also one of the best I've taken at Harvard. Professor Mohseni is incredibly  knowledgable on Iran and you will learn a lot.","This class was fantastic. It gave me a whole new framework for thinking about Iran, and really explored the complexities and contradictions not only within Iranian politics, but in the way that it is viewed. I've never come out of a class feeling like I've learnt so much.","This course is great, it provides you with many different perspectives which are necessary to understand the politics of Iran and the dynamics of the revolution. The materials might be a little overwhelming at times, but they are extremely interesting and vary a lot (from philosophical pieces regarding the ideology of the Islamic Revolution, to the Islamic constitution to the speech delivered by Ahmadinejad at Columbia University and many others). This course also provides a background on the history and culture of Iran. I found it extremely helpful to meet with the professor to discuss some topics that were not clear to me, so do that if you have time!","There's an exorbitant amount of reading each week, but as a whole, it was probably the best Gov course I've ever taken. Professor Mohseni clearly cared about planning each class to make the best use of everyone's time, and he pushed back on students' opinions to force us to think more critically.","Definitely worth taking if you're at all interested in the topic. A lot of work, but it pays off. Great professor, really engaging and knowledgeable. Research paper is a lot of work, don't procrastinate.","This was a great course to not only understand what is going on politically in Iran but also to understand the culture and society there."]},"Fall '14":{"comments":["A problem that usually plagues Gov seminars or courses is the broadness of the scope of the class -- this course is the absolute antithesis of that trend, for which I am extremely thankful. The granularity with which you learn about Iranian society and politics is one that other courses in the Gov department should seek to replicate. If you're at all interested in American-Iranian affairs or the domestic politics within Iran -- hint: it's fascinating -- take this course.","Take it! This is the type of course for which you come to Harvard. Grades are secondary and learning is the priority. Some of the discussions will leave you in awe.","This class is not for the faint of heart, but what you get out of it is so worth it that I would tell most people who are interested in Government and specifically the Middle East to take it","If you want to learn anything substantive about Iran, this is the course to take.","This is a demanding class, but it is an incredibly rewarding one. You learn an impressive amount about the inner workings of the Iranian regime from one of the few professors who has personal experience and stories about the government and its senior leadership. The work is not trivial, but the payoff is more than worth it."]}},"mostRecentQ":{"overall":"5.00","workload":"8.00","difficulty":null,"recommendation":"5.00","enrollment":"5","response rate":"100.00","QCourseOverall":{"number":"GOV 94py","course_id":"10881","cat_num":"70025","1s":"0","2s":"0","3s":"0","4s":"0","5s":"5"},"QDifficulty":{"number":"GOV 94py","course_id":"10881","cat_num":"70025","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"GOV 94py","course_id":"10881","cat_num":"70025","1s":"0","2s":"3","3s":"1","4s":"0","5s":"1"}},"success":true}