{"scores":{"Spring '14":{"course_score":{"overall":"4.80","workload":"2.60","difficulty":"3.20","recommendation":"4.70","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"GOV 94xp","course_id":"10887","cat_num":"93956","1s":"0","2s":"0","3s":"0","4s":"2","5s":"8"},"QDifficulty":{"number":"GOV 94xp","course_id":"10887","cat_num":"93956","1s":"1","2s":"0","3s":"5","4s":"4","5s":"0"},"QWorkload":{"number":"GOV 94xp","course_id":"10887","cat_num":"93956","1s":"1","2s":"3","3s":"5","4s":"1","5s":"0"}}}},"comments":{"Spring '14":{"comments":["If you really want to earn a solid understanding of how the cyber domain is transforming politics and political science - there is no better course for you than Cyberpolitics. That being said, if you are only casually interested in the subject material, I would consider enrolling more carefully.","This class will give you a great background in cyberpolitics and give you a community of students (plus Ruxy, the tutorial leader) who you can always discuss these matters with.","This class is awesome. Ruxandra is a FANTASTIC teacher. She doesn't talk down to you and truly views you as an equal when you're discussing your opinions and ideas. The class is structured in a way that you can pay attention to things that you find interesting, and skip the things you don't find interesting (which means the week to week reading workload is as difficult or as easy as you want to make it). The final project\/paper is fairly straight forward and allows you to explore an idea that you found interesting in the class. Given that cyberpolitics play such a large role now days, this class is a MUST take for any government concentrator.","The day to day requirements of the class are totally manageable. The readings range, you will find some super interesting and some not so much. But the materials give you a great background on the topic. As far as government seminars go, I think this is one of the best you can take. Ruxy is passionate, (in my class) the students were also very passionate, and class was lively and engaging. The readings were generally manageable in quantity and enjoyable in quality. After talking to my friends in different seminars, I definitely think Cyberpolitics is a great choice. I feel like I REALLY learned in this class.","Take this class! If you are interested in technology, or political science, or social sciences, it is for you. If you care about living in a globalized, interconnected society and want to understand how that works -- and how the tech tools you use every day mean something in the context of society -- take this class no matter your concentration focus. The readings and discussion for this class are relevant. And the course setup is fantastic and conducive to deep thinking and discussions. And we have awesome guest speakers! Most of all, Ruxy is one of the best professors I have had at Harvard -- she is a brilliant, committed and supportive teacher and mentor and is willing to be there for you for every step of your research and writing process. I hope this class is offered for a long time to come. You won't be sorry -- sign up!","This is a terrific seminar for any student who is interested in learning more about how Internet technologies affect American politics, comparative politics, and international relations. The range of topics is comprehensive, and the diverse course readings cover both theory and practice. Ruxy is a knowledgeable instructor and excellent teacher who cares about getting to know each of her students.","This is a fantastic course. Everything from the topics to the instructor and the guest speakers is great. However be prepared for a lot of work, especially reading and preparing well for class (with 12 people in the room, you notice who hasn't prepared)","This course is an opportunity to study the impact of cyberspace on government with someone who really cares about it. The big issue is that cyberspace may have no effect (or a trivial, obvious one) on government. We don't know. This course might help you find out.","This first year course is unbelievably strong and interesting.  Ruxy's approach to teaching is collaborative and focused on helping her students achieve ambitiously, and the work she puts into the course shows.  The discussions, guest lecturers, and readings all contribute to an atmosphere of really rich knowledge of a subject often ignored in the Government department."]}},"mostRecentQ":{"overall":"4.80","workload":"2.60","difficulty":"3.20","recommendation":"4.70","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"GOV 94xp","course_id":"10887","cat_num":"93956","1s":"0","2s":"0","3s":"0","4s":"2","5s":"8"},"QDifficulty":{"number":"GOV 94xp","course_id":"10887","cat_num":"93956","1s":"1","2s":"0","3s":"5","4s":"4","5s":"0"},"QWorkload":{"number":"GOV 94xp","course_id":"10887","cat_num":"93956","1s":"1","2s":"3","3s":"5","4s":"1","5s":"0"}},"success":true}