{"scores":{"Fall '14":{"course_score":{"overall":"4.10","workload":"3.70","difficulty":null,"recommendation":"4.30","enrollment":"52","response rate":"82.69","QCourseOverall":{"number":"SOCIOL 115","course_id":"11165","cat_num":"63027","1s":"0","2s":"0","3s":"12","4s":"13","5s":"18"},"QDifficulty":{"number":"SOCIOL 115","course_id":"11165","cat_num":"63027","1s":"9","2s":"30","3s":"36","4s":"2","5s":"0"},"QWorkload":{"number":"SOCIOL 115","course_id":"11165","cat_num":"63027","1s":"10","2s":"23","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOCIOL 115","cat_num":"63027","course_id":"11165","year":"2014","term":"1","id":"610fb9d76043d30fa5f13c355af54ee5","first":" Matthew Erik","last":"Kaliner","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Spring '14":{"course_score":{"overall":"3.80","workload":"1.80","difficulty":"2.40","recommendation":"4.10","enrollment":"98","response rate":"78.57","QCourseOverall":{"number":"SOCIOL 115","course_id":"11165","cat_num":"63027","1s":"0","2s":"0","3s":"12","4s":"13","5s":"18"},"QDifficulty":{"number":"SOCIOL 115","course_id":"11165","cat_num":"63027","1s":"9","2s":"30","3s":"36","4s":"2","5s":"0"},"QWorkload":{"number":"SOCIOL 115","course_id":"11165","cat_num":"63027","1s":"10","2s":"23","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Spring '14":{"comments":["This is a very hands-on, unique class. You take control as a student.","This class is paper based, but make sure you are reading the articles so you know what to write about.","The topic is interesting but the translation of the subject material to the course structure does not effectively do it justice.","Take it! This is how liberal arts should be taught","This class is really amazing. The teachers genuinely show interest in the subject which makes you excited as well. Lots of interesting lectures and content throughout the semester and great people.","This class is very interesting and the material is not very difficult to understand.","Rather painless class but you learn so much about an important topic for the future.  The impact of the media and technology will only grow in our culture.  One of my favorites at Harvard","Professor Kaliner is enthusiastic about his work and that contributes to the greatness of his class. The class has a manageable workload and interesting content.","Awesome elective, seems like a lot of writing but on topics you will want to write about, one of the more enjoyable sections I've had here at Harvard.","Great class, interesting material. Lectures can be a little difficult to sit through, but Professor Kaliner is passionate and a great guy.","Definitely takes this class if you are interested in consumer culture, cultural interaction(e.g. the development of subcultures), social networks, e.t.c. The course covers a wide variety of topics but if you define early on what you want to get from the course, you will get it.","Fun and chill class.","Section was great, Theo should be the lecture professor.","This class was super interesting and is a must if you are interested in marketing.  Harvard does not offer very many courses on this type of subject matter, and if you are interested in marketing you will be exposed to some great literature.  Additionally, the assignments are pretty fun, but do require you to do the readings.  As much as I liked the course I thought the grading was too strict.","Do the reading! One thing that i did not do was do all the reading but I wish I had.","Cool and easy course","This course is relatively fun and straightforward. I found the course materials interesting and the assignments manageable. The lectures weren't very engaging and didn't add too much to the class.","this class is really interesting if you are willing to invest in it - if you coast through or think you will just slide by, then it is not worth taking,but if you think you will engage with the ideas outside the classroom, that is where it is most interesting. much in this course available to potential use in other classes.","The topics are interesting but lectures are quite boring. There's a decent amount of writing but, again, the topics were interesting!","Fun course, but it was definitely also new. I would recommend shopping and see how you feel about the lecture and take a look at the syllabus to see what the readings look like.  I think it has a lot of potential.","This is a great class that will surely be an even better class the next time around. The readings are not too stressful, the teaching fellows are great, and the material is relevant to today.","Definitely a worthwhile, interesting course if you care about popular culture and media","This is the first time the course was offered so it was a bit disorganized, but promising for future years.","This class is pretty good. The readings are interesting and the topics explored are relevant to your daily life. Section always produced interesting discussions. It's new, so there are definitely some little issues that could be ironed out in future semesters.","Sociology 115 is such an enjoyable and relatable class- recommend for concentrators and non-concentrators alike! Also a great class for freshman looking to delve into an upper-level sociology class.","You will read great pieces, talk about relevant issues, and get a good dose of multimedia presentations during lecture and section. There's quite a bit of reading every week, but the essays are really manageable.","This course is great and super relevant, and it is extremely straightforward -- Take it!","I enjoyed the topic and reading materials and did learn a lot in this course. Section was interesting, but the lectures did not work well together and Professor Kaliner seemed nervous a lot of the time. Professor Kaliner definitely wanted this course to work and was really nice, but he was not the most engaging of lecturers.","I think the class is going to undergo a number of structural changes. Lectures are a good review of the readings, albeit sometimes a little less than engaging. Theo, my TF was very engaging and got us thinking about these topics from a sociological perspective.","If you're at all interested in marketing, advertising, or general consumer behavior, take this class!","Super easy class. Interesting topics, and great discussions. The teaching staff was really great and very kind.  Only had to write four short papers and a final paper so class seemed useless at times.  Very easy overall.","This is an excellent course! The material is extremely interesting and the workload is manageable.","Great course-- I've talked about the topics I've learned in this class more in daily conversation than any other class in my four years here. Truly enjoyable. I read the readings not because they were completely necessary, but rather because they were that great to read.","This course is not high-stress, which is nice, but it may overlap significantly with other sociology courses that you've taken here.  Lectures are not really necessary, but may be changed\/improved by the time you take the course.  Paper prompts are manageable and interesting to write.","The lectures of this class are a total waste of time. You can skim the readings and have great section discussions and write great papers based off that.","This is one of the most fun courses at Harvard. You get to analyze popular culture and get credit for it! I absolutely enjoyed section - it's so much fun and it makes you forget that you are even in class.","Great class - easy and a lot of fun","Take this class.","This is a very interesting class that teaches you a lot that applies to the real world. You can learn a lot without having to do too much work.","Not a strong class. Section is the best, but kind of a crap shoot based on TF's","Lectures might be a little stiff and boring at times, but the professor is new to lecturing and will eventually get the hang of it. The content of the class is very interesting and the assignments are more like exercises to get you thinking about the concepts covered in class. It is a very relaxed class with cool assignments."]},"Fall '14":{"comments":["If you are interested in media, definitely take this class. The subject matter is super fun and the assignments allow you to study what you are passionate about.","Even though I've never taken a sociology class before, I'm really glad that I went ahead and took this class! This class is insanely interesting! You'll learn a lot about the material and get to explore things that interest you personally, as well. Go to lectures and sections! The discussions and material are really engaging. I definitely recommend this class to anyone who just finds the media and different aspects of culture interesting.","This is a great class to take as an elective or for a requirement. It would also be great for athletes in season because it requires very little work outside of class. Sections are lively and and it's there that you really learn most of the material on a relatable level.","This course is a unique course offered at harvard that engages in relevant topics to the 21st century.","This class is interesting and applies to the real world.","Not as interesting as what meets the eye.  The lecturers were dry and there were a lot of papers and a lot of readings.  The papers were graded more harshly than expected.  A lot of info on theories and less on culture and media.","This course is a fabulous way to academically explore a very fun topic. People were always surprised that I got to bring my love of pop culture and celebrities into the classroom.","I really enjoyed this course. The material is relevant and interesting, and Prof Kaliner is great. You do have to write a few essays (5) but four are pretty short and the topics are fun.","Great class and great chance to meet Prof. Kaliner","Lots of fun and will definitely change the way you see the world, as media is all around us.  You will be more aware of not just the content, but the implications of other aspects of media (the length, the medium, etc.).","You don't need to do most of the reading. Section was a waste of time, lectures were interesting but no exams.","This course was enjoyable in general. The professor is nice and willing to meet with students, and facilitates good discussions in lecture. \n\nHowever, there were some downsides to this course that are worth considering. It was somewhat all over the place in terms of topics discussed, for one, so that I don't feel particularly enlightened upon completion about popular culture as a sociological phenomenon, though some readings were interesting on their own. I also felt that lectures were disorganized and the professor was often several minutes late. The grading was bizarrely harsh and seemed random at times, and expectations for assignments upon which grades seemed to be awarded were not clearly defined or explained.","Super fun and interesting class! Very applicable to our world today and everyday lives","This course is an interesting survey of media and popular culture, with many relevant sections that apply to contemporary times. The assignments were sporadically spaced throughout the semester, often with little time between the prompt release date and the due date, making some week sin the class more intense than others in terms of workload.","This class is great if you want to explore the cultural world around you or delve into a social phenomenon that has always interested you. It's not an incredibly difficult class to keep up with, but you'll get the most out of it if you're willing to engage with the readings and in-class discussions.","This is a great class with interesting content and a good workload. It is fairly easy (assignment-wise) if you like writing papers. All of the papers are on interesting material and there are not any exams. I'd recommend it!","It was super interesting and not very hard, especially if you are into the material. I liked coming to lecture","not an easy A, not a great lecturer, but interesting material.  take the class if you have a passion for this stuff","Seems interesting, but it's not what you expect","Though there is a lot of writing for this course, it helps you to think about the world in a new way.","GREAT CLASS. Matt is the man. Go to his office hours. He has so much knowledge about life that you will learn a ton. Class was very interesting. Great class discussions in the lecture and in section. You need to write a couple essays but they are all interesting. Take this class.","absolutely take this class! it is pretty easy but also a lot of fun and actually interesting. you'll want to go to lecture, and probably even do the readings. the professor is great, and can gauge how lecture is going--if he thinks something is getting boring, he'll say \"ok, this is getting boring, let's move on.\" so lecture's are always engaging. going to office hours is great too, and he'll talk about anything and everything. there are 4 papers and a final research paper, but they're not hard at all, and very flexible so you can write about anything you want. overall, one of my favorite sociology classes--it was fun but also informative"]}},"mostRecentQ":{"overall":"4.10","workload":"3.70","difficulty":null,"recommendation":"4.30","enrollment":"52","response rate":"82.69","QCourseOverall":{"number":"SOCIOL 115","course_id":"11165","cat_num":"63027","1s":"0","2s":"0","3s":"12","4s":"13","5s":"18"},"QDifficulty":{"number":"SOCIOL 115","course_id":"11165","cat_num":"63027","1s":"9","2s":"30","3s":"36","4s":"2","5s":"0"},"QWorkload":{"number":"SOCIOL 115","course_id":"11165","cat_num":"63027","1s":"10","2s":"23","3s":"3","4s":"0","5s":"0"}},"success":true}