{"scores":{"Spring '14":{"course_score":{"overall":"4.50","workload":"3.00","difficulty":"3.80","recommendation":"4.20","enrollment":"6","response rate":"66.67","QCourseOverall":{"number":"HEB 1451","course_id":"11005","cat_num":"99399","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":"HEB 1451","course_id":"11005","cat_num":"99399","1s":"0","2s":"0","3s":"1","4s":"3","5s":"0"},"QWorkload":{"number":"HEB 1451","course_id":"11005","cat_num":"99399","1s":"0","2s":"1","3s":"2","4s":"1","5s":"0"}},"instructor_scores":[{"number":"HEB 1451","cat_num":"99399","course_id":"11005","year":"2013","term":"2","id":"85c7bd61b373969d123929119c884f01","first":" Terence D.","last":"Capellini","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '14":{"comments":["This is, hands down, the best genetics course you could take at Harvard. If you are looking for a fully immersive genetics experience, and one that is applicable to actual genetics work taking place in the field right now, look no further. Absolutely take this course--don't let LS1B scare you away from genetics; Capellini will show you the light! Great course, great professor, great primary source readings, not too difficult. This is a must take.","This course was amazing. Dr. Capellini is very knowledgeable about the material and more than that is (more than any other professor I know) ALWAYS there to help, care, and further your understanding of genetics. Such a great course - I highly recommend taking this as an HEB Research seminar!","This is great course, but only take it if you can commit a decent chunk of time to it throughout the semester.","This class teaches you a lot. You learn how to explore genomes (which is really very exciting) and get practice reading and writing scientific papers. The final project can also be very interesting based on your topic. \r\nYou should take this class if you are very interested in learning about genomics and genetics in HEB, which is an extremely fascinating subject. I would not recommend taking the course if you are not very interested in this subject, as it is a very focused class.\r\nIf you are really interested in taking the class (if you are in HEB and you want to get into genetics it may be your only choice) then here are a few tips. Meet with the instructor often and make sure to do assignments well before they are due so you can incorporate his suggestions. Put a lot of time into selecting a suitable topic for the final project and research it thoroughly. Put a lot of work into the first few assignments. Be sure to at least skim all of the readings and mark things that you might be interested in looking into further with your final project."]}},"mostRecentQ":{"overall":"4.50","workload":"3.00","difficulty":"3.80","recommendation":"4.20","enrollment":"6","response rate":"66.67","QCourseOverall":{"number":"HEB 1451","course_id":"11005","cat_num":"99399","1s":"0","2s":"0","3s":"0","4s":"2","5s":"2"},"QDifficulty":{"number":"HEB 1451","course_id":"11005","cat_num":"99399","1s":"0","2s":"0","3s":"1","4s":"3","5s":"0"},"QWorkload":{"number":"HEB 1451","course_id":"11005","cat_num":"99399","1s":"0","2s":"1","3s":"2","4s":"1","5s":"0"}},"success":true}