{"scores":{"Fall '13":{"course_score":{"overall":"4.30","workload":"1.90","difficulty":"2.30","recommendation":"4.30","enrollment":"56","response rate":"92.86","QCourseOverall":{"number":"HUMAN 11a","course_id":"11007","cat_num":"66831","1s":"0","2s":"1","3s":"6","4s":"23","5s":"22"},"QDifficulty":{"number":"HUMAN 11a","course_id":"11007","cat_num":"66831","1s":"8","2s":"22","3s":"20","4s":"1","5s":"0"},"QWorkload":{"number":"HUMAN 11a","course_id":"11007","cat_num":"66831","1s":"13","2s":"29","3s":"9","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HUMAN 11a","cat_num":"66831","course_id":"11007","year":"2013","term":"1","id":"cda09aae232767cac57c6ef5075e7b5d","first":" Robin","last":"Kelsey","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.30"},{"number":"HUMAN 11a","cat_num":"66831","course_id":"11007","year":"2013","term":"1","id":"fa82738bf1de4870e9ca6290c40bafa4","first":" Jennifer L.","last":"Roberts","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Fall '13":{"comments":["This class is a wonderful, fun, relaxing Gen Ed to take, especially if you already have a pretty busy schedule. I'm a sophomore, and I hadn't taken any sort of art\/humanities class at Harvard before, and really like that this was a survey class, with a new topic every week. The section field trips were great - I went to museums and saw artifacts I didn't know existed on Harvard's campus. The writing assignments were short, but fun and creative. And I learned how to look a art a little differently and how to ask questions about art and the development of art forms.","This course is refreshing, captivating, and enriching. The lectures are marvelous--they are informative and entertaining. The structure of the course (the rotations between lecture, looking, and lab) proved effective for catalyzing the greatest engagement with all of the visual technologies. The varied manner in which information is presented and interacted with provides maximum coverage and understanding of the material. The course is nontraditional and fun. The work is not overly demanding, yet remains stimulating. The deliberation with which the assignments were crafted is apparent; nothing is busy work and the assignments never feel like a  waste of time. Overall, this course was extremely interesting and beneficial. I fervently recommend the Art of Looking.","this course is pleasant in the sense that it was often generally interesting and rarely required much effort","This class is a great way to be introduced to the humanities. The sections were fun and there wasn't a lot of work outside of class, but the lectures could be boring sometimes. The final project was a good experience.","This course teaches you how to think in new ways. I loved its multi-disciplinary nature and the relevance of the material in my everyday life. If you want to learn more about art\/technology\/interaction and history of both, you should definitely take this course!","Take this class! It will open your eyes to new ways of thinking about the world. It is a very chill class, but you get a lot out of it. There is a lot of freedom, especially with the final project. The professors and TFs really care about this course, so it is very well done and unlike any other class.","I went into this class thinking that it would be something like an art history class, but although that wasn't really the case, I'm extremely glad that I took it. Professor Roberts and Professor Kelsey are great and each week is unique and different with creative assignments that aren't too difficult.","This course is a really great way to fulfill your A&i requirement. The lectures are engaging and the sections are led by graduate students that do an amazing job with actually getting you to interact with the the visual elements discussed in lecture. The assignments that follow often allow for a significant amount of creativity and the final project, while a bit time-consuming, is enough within this same vein to be pretty enjoyable process. I would definitely recommend this course to anyone interested in it. I think you'll be surprised at just how much you end up liking it.","A great intro course to the humanities.","This class is really interesting. It isn't really like a classic college course, but that is one of the best things about it. I am positive that this class helped me look at art and the world in a new way. It taught me how to look for deeper meaning behind the things I see every day that I take for granted.","Taking this class is like landing on a distant planet ruled by elementary school teachers. The material and assignments are foreign and new, but at the same time childish, faux-insightful, and agonizingly easy.\r\n\r\nBut it's an A&I gen ed. So yes, I'd recommend it.","I learned so much about topics that I didn't know existed. I developed new interests and skills that I didn't know I would ever learn. Taking this course was a highlight of my semester and learning experience in general.","This is a very dumbed down version of an actual Art History course. I would not take this course if you want to take a real Art History course. This course deals more with the visual culture of the society.","Fantastic \"pre-disciplinary\" course with straight-up fun assignments, innovative lecture\/section format, and great faculty\/TF support.","This class is a great opportunity to observe and discuss objects in Harvard's collections first-hand, yet it also allows you to connect these visual technologies to wider social and historical trends. The assignments are engaging and encourage a creative approach.","Gives you a new outlook on art as a whole","This class is the best class I have taken at Harvard yet. If you have space for an elective or need an Aesthetic and Interpretive Understanding class, TAKE THIS CLASS!!!","I loved this class for all of the knowledge it teaches. It was exciting learning about various topics ranging from daguerreotypes to color palettes to mahogany. The class granted me a breadth of art history but also an amount of depth to truly appreciate each individual visual technology.","Great way to become more aware of the visual components that surround our lives","Roberts and Kelsey are incredible lecturers and the class is fun and innovative. As a new class there were a couple of bumps, but they do a great job of trying to make it less of a straight history of art class and more of a science of art class.","The course is very easy and fun at times. This was the first year it was taught, but I hope it stays the same going forward.","It's a really fun class that stays interesting the entire time. Not very difficult and a good intro class and gen ed course. Take this class.","I took this class to meet a gen-ed requirement my first semester here and it was an excellent decision. Every time the professors talked I could feel my IQ increasing. The readings are easy and non-essential, but you understand everything much better if you do them because the method of analysis, which is the true subject of the class, works from facts developed in the readings. The assignments are unique and entertaining to the point that they do not feel like assignments. This is also true of the final project, which is very well structured.","This is a wonderful class that will definitely teach you to evaluate the world in a new way. I had never before considered the visual properties of mahogany, but now I can probably talk for over an hour on it and several other \"visual technologies.\" This is a great way to be introduced to the humanities, or to fill out a Gen Ed.","The class is really interesting for those who aren't used to analyzing implicit ways of thinking.","strongly recommend to those students with no background in arts or who think they do not have a sense of art in any way, it would let you see that an abundant amount of stuff you never thought as art in your daily life is actually visual technology of some kind worth looking into, it is fun to have a final project of your own to work on as well","This class is a great intro to the humanities.  It teaches you to analyze technologies for their values and limitations, which is an important skill for the humanities as well as other fields.  It is also very fun!","I feel so grateful to be able to have taken this introductory humanities course at Harvard.  A highly innovative and monumental feat, this class broke academic boundaries and assumptions at every step of the way and yet somehow flowed smoothly all along.  Lectures by Prof. Roberts & Kelsey are a real treat, and field trips and class labs greatly enhance the entire experience.  The analytical framework of a \"visual technology\" is one that I will now carry with me for the rest of my life.","This was the first offering of a uniquely structured class that is bound to be even better in coming years. As a \"Frameworks\" course, it is intended to introduce students to broad techniques of interdisciplinary investigation. In place of the typical lectures and discussion sections, weekly class meetings are separated into lectures, looking sessions, and labs.  Lectures are traditional talks on highlighted visual technologies ranging from maps to microscopes.  Looking sessions involve visits to museums or galleries to view local examples. Labs are creative section activities that engage with a given technology, such as \"speed dating\" sessions based on color swatches or trial hearings using student-designed graphs as evidence.  Rather than an exam, the course culminates with the design of an online research plan regarding a chosen visual technology.  Overall, the class is a fun way to fulfill your A&I GenEd with innovative assignments and a caring staff.","This course is a great introduction to art history that anyone could take regardless of their interests. It fosters the creation of new ideas by encouraging students to create new views on a visual technology of their choice.","This class is awesome if you want to learn from two of the most interesting professors at Harvard. The class, however, is poorly structured and doesn't really help individual students as much as people would like.","This class is a great mix of interesting visual forms, fun field trips, unique lab assignments and great lectures! I would recommend it to upper clansmen as well!","It's a great introduction to art and art history for someone not familiar with either. I could easily imagine a STEM major enjoying and excelling in this class, which is a perfect way to get your feet wet while also knocking off a Gen-Ed. If you have significant background in the humanities, I'd recommend taking a more in-depth, traditional course. Not because I believe that format works better necessarily, but because you don't get to see the element of continuity within an artistic tradition through this course, which I think is a critical part of studies in art history. That said, I think it's the perfect little taste of interesting, thought-provoking analysis and beautiful art to whet the appetite. Would definitely recommend to anyone looking for an interesting and enjoyable Gen-Ed.","Take this class. It is incredible. The assignments are interesting and the lectures are wonderful. Both professors have the ability to blow your mind. The final project might sound intimidating, but if you choose a subject you enjoy, it's actually fun. Seriously, take this class."]}},"mostRecentQ":{"overall":"4.30","workload":"1.90","difficulty":"2.30","recommendation":"4.30","enrollment":"56","response rate":"92.86","QCourseOverall":{"number":"HUMAN 11a","course_id":"11007","cat_num":"66831","1s":"0","2s":"1","3s":"6","4s":"23","5s":"22"},"QDifficulty":{"number":"HUMAN 11a","course_id":"11007","cat_num":"66831","1s":"8","2s":"22","3s":"20","4s":"1","5s":"0"},"QWorkload":{"number":"HUMAN 11a","course_id":"11007","cat_num":"66831","1s":"13","2s":"29","3s":"9","4s":"0","5s":"0"}},"success":true}