{"scores":{"Spring '14":{"course_score":{"overall":"3.90","workload":"3.40","difficulty":"3.90","recommendation":"4.00","enrollment":"34","response rate":"82.35","QCourseOverall":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"3","3s":"4","4s":"9","5s":"11"},"QDifficulty":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"0","2s":"4","3s":"6","4s":"7","5s":"10"},"QWorkload":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"6","3s":"7","4s":"6","5s":"6"}},"instructor_scores":[{"number":"MATH 112","cat_num":"1123","course_id":"2851","year":"2013","term":"2","id":"01a11d5e22fd4a007501233cd12542f8","first":" Yaiza","last":"Canzani","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"3.40","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Spring '13":{"course_score":{"overall":"3.95","workload":"2.60","difficulty":"3.20","recommendation":"3.80","enrollment":"25","response rate":"84.00","QCourseOverall":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"3","3s":"4","4s":"9","5s":"11"},"QDifficulty":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"0","2s":"4","3s":"6","4s":"7","5s":"10"},"QWorkload":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"6","3s":"7","4s":"6","5s":"6"}},"instructor_scores":[{"number":"MATH 112","cat_num":"1123","course_id":"2851","year":"2012","term":"2","id":"352fc62a030f77bcb62771a931d82deb","first":" Michael J.","last":"Hopkins","InstructorOverall":"4.19","EffectiveLecturesorPresentations":"4.05","AccessibleOutsideClass":"3.95","GeneratesEnthusiasm":"4.14","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"2.45","ReturnsAssignmentsinTimelyFashion":"2.33"}]},"Spring '12":{"course_score":{"overall":"4.08","workload":"3.08","difficulty":"3.75","recommendation":"4.00","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"3","3s":"4","4s":"9","5s":"11"},"QDifficulty":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"0","2s":"4","3s":"6","4s":"7","5s":"10"},"QWorkload":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"6","3s":"7","4s":"6","5s":"6"}},"instructor_scores":[{"number":"MATH 112","cat_num":"1123","course_id":"2851","year":"2011","term":"2","id":"4f2d399f56d4e9cc7eab00ab41bc5192","first":"Jacob Alexander","last":"Lurie","InstructorOverall":"4.25","EffectiveLecturesorPresentations":"4.58","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"4.08","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Fall '10":{"course_score":{"overall":"3.00","workload":"4.70","difficulty":"4.90","recommendation":"3.20","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"3","3s":"4","4s":"9","5s":"11"},"QDifficulty":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"0","2s":"4","3s":"6","4s":"7","5s":"10"},"QWorkload":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"6","3s":"7","4s":"6","5s":"6"}},"instructor_scores":[{"number":"MATH 112","cat_num":"1123","course_id":"2851","year":"2010","term":"1","id":"80d12e5368e47ce0480832555eb3f7e0","first":"Yum-Tong","last":"Siu","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"2.25","GivesUsefulFeedback":"2.67","ReturnsAssignmentsinTimelyFashion":"4.17"}]},"Spring '10":{"course_score":{"overall":"3.15","workload":"3.33","difficulty":"3.91","recommendation":"3.45","enrollment":"40","response rate":"85.00","QCourseOverall":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"3","3s":"4","4s":"9","5s":"11"},"QDifficulty":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"0","2s":"4","3s":"6","4s":"7","5s":"10"},"QWorkload":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"6","3s":"7","4s":"6","5s":"6"}},"instructor_scores":[{"number":"MATH 112","cat_num":"1123","course_id":"2851","year":"2009","term":"2","id":"2b8cae327405cf3dfeed5b944e593b4a","first":"Gerald E.","last":"Sacks","InstructorOverall":"3.19","EffectiveLecturesorPresentations":"2.94","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"3.64","FacilitatesDiscussionEncouragesParticipation":"3.46","GivesUsefulFeedback":"3.29","ReturnsAssignmentsinTimelyFashion":"3.62"}]},"Spring '09":{"course_score":{"overall":"3.96","workload":"3.29","difficulty":"3.64","recommendation":"4.04","enrollment":"31","response rate":"90.32","QCourseOverall":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"3","3s":"4","4s":"9","5s":"11"},"QDifficulty":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"0","2s":"4","3s":"6","4s":"7","5s":"10"},"QWorkload":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"6","3s":"7","4s":"6","5s":"6"}},"instructor_scores":[{"number":"MATH 112","cat_num":"1123","course_id":"2851","year":"2008","term":"2","id":"77e1dae1643aa540769e66d3e21df092","first":"Danijela","last":"Damjanovic","InstructorOverall":"3.93","EffectiveLecturesorPresentations":"3.86","AccessibleOutsideClass":"4.38","GeneratesEnthusiasm":"3.82","FacilitatesDiscussionEncouragesParticipation":"3.65","GivesUsefulFeedback":"3.89","ReturnsAssignmentsinTimelyFashion":"4.14"}]},"Spring '08":{"course_score":{"overall":"4.04","workload":"3.26","difficulty":"3.74","recommendation":"4.22","enrollment":"36","response rate":"75.00","QCourseOverall":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"3","3s":"4","4s":"9","5s":"11"},"QDifficulty":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"0","2s":"4","3s":"6","4s":"7","5s":"10"},"QWorkload":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"6","3s":"7","4s":"6","5s":"6"}},"instructor_scores":[{"number":"MATH 112","cat_num":"1123","course_id":"2851","year":"2007","term":"2","id":"77e1dae1643aa540769e66d3e21df092","first":"Danijela","last":"Damjanovic","InstructorOverall":"4.19","EffectiveLecturesorPresentations":"4.15","AccessibleOutsideClass":"4.08","GeneratesEnthusiasm":"3.69","FacilitatesDiscussionEncouragesParticipation":"3.78","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '07":{"course_score":{"overall":"3.00","workload":"3.33","difficulty":"4.33","recommendation":"3.33","enrollment":"20","response rate":"45.00","QCourseOverall":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"3","3s":"4","4s":"9","5s":"11"},"QDifficulty":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"0","2s":"4","3s":"6","4s":"7","5s":"10"},"QWorkload":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"6","3s":"7","4s":"6","5s":"6"}},"instructor_scores":[{"number":"MATH 112","cat_num":"1123","course_id":"2851","year":"2006","term":"2","id":"96a4fd459e314c51faabe469b03cabeb","first":"Joachim","last":"Krieger","InstructorOverall":"3.00","EffectiveLecturesorPresentations":"3.11","AccessibleOutsideClass":"3.62","GeneratesEnthusiasm":"3.11","FacilitatesDiscussionEncouragesParticipation":"3.00","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"3.33"}]}},"comments":{"Spring '08":{"comments":["This is a pretty well organized course.  The lecturer is generally good and sheÂ´s fair in the way she accepts assignments and the problems that she gives.","Essential material, must be learned.","Excellent way to learn higher mathematics.","Difficult and time-consuming, but worth it.","This class requires a lot of time.","For Applied Math majors, unless you are interested in the theoretical areas of topic, there is probably a less time-consuming way to learn the relevant material for the concentration requirement.","You probably won't ever use the math but the problem solving skills are valuable.","The math you learn in this course is extremely important. If you took math 21, you need to take this course.","By taking this course, you will partially recover from the mistake of having taken Mathematics 21."]},"Spring '10":{"comments":["Don't take it with Sacks.","It's difficult and can be pretty dry. Math classes also really depend on the instructor, so shop it first to get a feel for it.","Request the syllabus at the beginning of the class.","The course material is interesting and I'm glad I learned it. The grading is easy and the exam was very fair. However, actual class was not very useful, and many people didn't attend.","It is a very rigorous and interesting course.  In the first few weeks you may find yourself completely lost and worried you will never understand certain topics (I certainly was).  But about halfway through the semester you start to get the mindset to work through the course, and when you look back at the earlier material you wonder why you thought it was so difficult.","Be prepared to work hard and think deeply about the contents taught in this class.","This course will teach you to solve problems and explain your solution in clear, concise language.  Learning this method of proof is valuable even if you may not use the particular content of real analysis.","Like most courses in the math department, the experience is likely dependent on the instructor.  Professor Sacks was a bit clumsy at times, but overall his lectures were effective in teaching the most important material from each chapter.  Assignments were challenging, but manageable.","I guess the math department has different professors teach courses every year, so it's hard to say.","This is interesting and important subject matter, and it is not that hard to get a good grade in this class.  However, this class is not well organized, and there is a lot of inefficiency.","This class is a bit of a mess.","Many of the homework problems have solutions on line so you must be disciplined and not look at these solutions so as to properly learn the material. Without struggling through the psets there is no other way to understand the stuff.","BE COMFORTABLE WITH PROOFS","The material was largely uninteresting.  A lot of analysis seems like proof for the sake of proof.  Also, Professor Sacks rarely said anything that couldn't be found in the book, and often if he did it only made things more confusing.  I stopped going to class around the time of the midterm and it wasn't a problem at all."]},"Fall '10":{"comments":["Yum-Tong is a tough professor, but stick with him, and you'll learn a lot.","Professor Siu is enthusiastic about the material and he teaches it well, which makes the class better, But the material is difficult and so is the class.","This course turns boys into men.","Probably ought to wait until Professor Siu isn't teaching it again. He teaches well but is very demanding; in the previous year (Professor Sachs), there wasn't even a final!","Take this course, but with another professor.","If you're into math and you want this to be your hardest class, take it with Siu.  He's wicked smart and you will (willingly or unwillingly) learn a lot.  If you want this to be your second or third hardest class, do not do not do not take this with Siu.  As rewarding as it can be at times, it requires extreme dedication to get through the problem sets that you may not have time for.","This class (and its associated workload) is very teacher-specific. Even if this particular year gets bad reviews, definitely shop this course. Real Analysis is an interesting and incredibly useful subject that pops up everywhere, so it's definitely worth it to take the course, if the teacher is good and the workload manageable. Just shop it and see what the workload is."]},"Spring '12":{"comments":["The difficulty seems to vary a lot from year to year.  Based on comparisons with last year's material, I think this incarnation was easier, which is good if you're really only interested in getting good at proofs (i.e. as a prereq for other stuff like Econ) rather than becoming a hardcore mathematician","This course really depends on the professor but Lurie was clear and helpful; despite being a great mathematician I felt he was able to sympathize with the mathematical maturity of most of the class","For students coming out of 21a and 21b (which are poorly run classes), this is a great introduction to higher level math and analysis. (and a lot more enjoyable than 21a\/b). That said, it is still a challenging course and will require some time and effort. Lurie was probably the best\/second best math teacher I've had at Harvard.","This class is only for those interested in mathematics for its own sake, and willing to put in lots of time proving results that (in some cases) are from math 1a\/1b. That said, Professor Lurie is brilliant, lectures for 90 minutes with only a piece of chalk (no notes, etc), and does do a good job, for the most part, of making difficult concepts clear.","That being said, Lurie is an awesome lecturer who is great at motivating the proofs and engaging the class, and Akhil is a super helpful and nice CA. They're great at explaining and answering questions. Would take classes with them again.","If Professor Lurie is teaching it, the class will in general be very well structured with easy-to-follow lectures, and fair psets and exams. Concepts covered include continuity, series, sequences, convergence, compactness. If a student is already familiar with these, the first half of the class will be a lot of review. The second half covered mostly differentiation and integration. Concentrate on taking good notes and do not count on the textbook as a good source to learn material. Exams and psets are based primarily on lectures."]},"Spring '13":{"comments":["I would highly recommend Math 112 with Professor Hopkins for those interested in analysis and writing proofs.","Walked into this class expected a challenge, but this version probably moved too slowly.  Should be fine to take after 21a, 21b without too much trouble.","Do it. Especially if Prof. Hopkins teaches. He's a cool dude, knows his stuff and a great entertainer. Favorite class this term!","it seems that the professor changes every year. if hopkins is teaching, take it. hes a great lecturer and gives fair assignments","Course will require you to understand the langauge used in Math. Exposure to proof writing and logic before taking the class will be useful.","Great course, really focuses on important concepts in introductory real analysis. Hopkins is hilarious and a great teacher!","This course sets out rigorous proofs of basic calculus. None of the material is new, but it is a great opportunity to learn why calculus actually works. I would recommend it to anyone who has taken lower-level math and wants to get some experience with proofs. I took the class after only 21a and 21b, and I was able to understand with some work even though I hadn't taken math 101. More than any particular topic, this class teaches you how to think logically. Take it!","Analysis is a hairy subject, and this course will not make you love it. Take it if you like integrals and have a strong work ethic; otherwise, don't.","The course material was really interesting and fun to work on. I also came from 23 and it was not very repetitive and I really learned how to do proofs which I did not learn in 23.  If Hopkins is teaching again, he is very interesting and engaging but does not put that much time into the course and it is rather unorganized.","There is a high chance this class will make you fell stupid. But keep in mind that this is not an intro course where you learn a formula and apply it mechanically, but where 3 lines of proof require several hours of thinking and connecting definitions and theorems. If you really want to understand what is going on in the course, be willing to put many hours and a lot of thought into it.","the hardness depends heavily on the instructor","As many will say of introductory analysis, the material of the course is not very exciting - it's stuff you know i.e. derivatives, integrals etc.  However, you should take this course to get a better understanding of proofs in analysis.  Professor Hopkins does an excellent job of working through the rationale of different proofs and focusing on the methodology.","I took this class as an economics concentrator with Math 21a\/b background, which I took 3 years ago. The material was tough at times but the course was extremely accommodating. It was one of the most rewarding experiences I've in college.","Prof. Hopkins is fantastic however the course instructor usually changes from year to year. Math 112 will give you an understanding of why we use the real numbers and their subsequent properties. Take if you like proof-based math. Expect to put in a significant number of hours on the problem sets (unless you've taken analysis before) but this is how you'll learn the material."]},"Spring '14":{"comments":["Prof. Canzani is a great teacher! She gives clear lectures, and actually cares about her students, so definitely take this class if she teaches it again. Otherwise, it's pretty standard real analysis: epsilon-delta proofs, a little topology, study of limits and functions, etc.","Prepare to work the hardest you ever have . I did (the hardest I have in any math class in my entire life). But the feeling of accomplishment and achievement I sensed at the end of this semester have been incredible. I truly understand the foundations of real analysis. Even more, I feel confident enough to take on higher level math and challenging courses at Harvard. This class will work you hard, but it will provide you with a skill set few other classes can.","Yaiza is a great teacher, and I enjoyed reading the book we used (Marsden, not Rudin!). She is very approachable and always makes sure that the class is on the same page. She also has great handwriting. Section was optional, and not really related to the class: it's enough to read the book and attend lecture.","The course was taught incredibly well and it is a fantastic platform for becoming more comfortable with proof based mathematics.","PRACTICE. PRACTICE. PRACTICE. TILL INFINITY.","Challenging but rewarding. Don't know how it stacks up against its applied math equivalent, but in my experience the pure math department courses are always better taught. Be prepared to put in the necessary work and effort.","Definitely doable even if you haven't taken a proof class before, but in that case, you need to find people in the class to study with!","Be prepared to spend often 20 hours on weekly assignments depending on the professor; work and other classes will get pushed to the back burner.","Don't try to take notes in lecture, just focus and then look up the relevant proofs and examples in the book later. For me, taking notes was too distracting and I would get lost.","I get the sense that the quality of this class depends on the quality of the instructor. Unfortunately, the instructor changes every year. Yaiza was fantastic, she really cares about the course and is really helpful to students. That said, the material isn't easy. It takes a lot of time and effort to get it right. So I would make sure you are comfortable with the instructor and be willing to put in the time.","I took the class with Yaiza, but I believe she won't be teaching this next year so I'm sorry my comments won't be super-generalizable. However, I still want to take the chance to talk about how great this class was. The material is foundational to all the math you learn up to 21a, and Yaiza did a wonderful job explaining it all. She was incredibly supportive and knowledgeable. She also was clearly dedicated to ensuring her students succeeded; when some were unhappy with their scores on the first midterm, she added an optional extra component to the second midterm so students could make up points they'd lost on the first one. I can't speak highly enough about the course and professor.","Personally, I'm just not a huge fan of real analysis.  So the class was good - it was well organized with plenty of office hours for support, all good things for a class - but I didn't love it.","This is going to be challenging but if you following the lectures\/ understand the homeworks and be able to recreate the proofs, you'll be able to master this material.","Do not take this course if you have not done proofs before. It will be difficult.","A solid introduction to real analysis that could definitely benefit from more continuity in professors teaching the course and material covered."]}},"mostRecentQ":{"overall":"3.90","workload":"3.40","difficulty":"3.90","recommendation":"4.00","enrollment":"34","response rate":"82.35","QCourseOverall":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"3","3s":"4","4s":"9","5s":"11"},"QDifficulty":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"0","2s":"4","3s":"6","4s":"7","5s":"10"},"QWorkload":{"number":"MATH 112","course_id":"2851","cat_num":"1123","1s":"1","2s":"6","3s":"7","4s":"6","5s":"6"}},"success":true}