{"scores":{"Spring '14":{"course_score":{"overall":"4.10","workload":"1.20","difficulty":"2.50","recommendation":"4.10","enrollment":"11","response rate":"63.64","QCourseOverall":{"number":"MBB 980h","course_id":"11034","cat_num":"20291","1s":"0","2s":"0","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MBB 980h","course_id":"11034","cat_num":"20291","1s":"1","2s":"1","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"MBB 980h","course_id":"11034","cat_num":"20291","1s":"5","2s":"1","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MBB 980h","cat_num":"20291","course_id":"11034","year":"2013","term":"2","id":"9ffccc7f8e266b447d5a5497115ed3c5","first":" William","last":"Milberg","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '14":{"comments":["It was entertaining, Dr. Alexander and Dr. Milberg are dynamic and have lots of real-world experience, which is always a great trait for an educator to have. At times this class was very scattered and unorganized, and I wish there were more clear progressions and connections between topics. I would recommend this course if it was greatly restructured. The two-professor dynamic could be beneficial and detrimental, and I definitely felt that it was detrimental more often than not. I learned A LOT from the frequent, marginally related tangents, but those weren't things I expected to learn and didn't necessarily fit into the progression of learning. Each section was like it's own mini course, which isn't necessarily a bad thing, it's just not what I expected or what I would've chosen if I had known.","This class is taught in the way that most classes should be taught. The goal is or you to learn something and enjoy yourself, not for you to complete useless assignments. There are in fact only two assignments the entire semester. The rest of the time, you'll get to enjoy the fantastic back-and-forth between the two professors, who also happen to be good friends, and a lot of stories from their long careers. This class is not very discussion-based, so you don't really need to do any readings ahead of time. In other words, ideal! The brain dissection is extremely unique; don't miss out.","That it is an enjoyable and engaging seminar that explores how disease helps our understanding of cognition. Some key points include the anecdotal style of lecture, as well as the strong emphasis on student presentations."]}},"mostRecentQ":{"overall":"4.10","workload":"1.20","difficulty":"2.50","recommendation":"4.10","enrollment":"11","response rate":"63.64","QCourseOverall":{"number":"MBB 980h","course_id":"11034","cat_num":"20291","1s":"0","2s":"0","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MBB 980h","course_id":"11034","cat_num":"20291","1s":"1","2s":"1","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"MBB 980h","course_id":"11034","cat_num":"20291","1s":"5","2s":"1","3s":"0","4s":"0","5s":"0"}},"success":true}