{"scores":{"Fall '13":{"course_score":{"overall":"4.70","workload":"2.40","difficulty":"3.10","recommendation":"4.60","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"RELIGION 57","course_id":"11217","cat_num":"44656","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"RELIGION 57","course_id":"11217","cat_num":"44656","1s":"0","2s":"2","3s":"8","4s":"3","5s":"0"},"QWorkload":{"number":"RELIGION 57","course_id":"11217","cat_num":"44656","1s":"0","2s":"8","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"RELIGION 57","cat_num":"44656","course_id":"11217","year":"2013","term":"1","id":"afeeb8242ff10928d87dd4c2c4dd010d","first":" Courtney Bickel","last":"Lamberth","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Fall '13":{"comments":["Great course. The readings are very good and most aren't unreasonably challenging. You'll definitely delve a little deeper than a standard gen-ed course but the course is definitely approachable for someone with no experience in philosophy\/religion. Professor Lamberth is great and focuses the course on class discussion and applying the readings to our lives.","This is a phenomenal class, and you should take it.  Prof Lamberth is a wonderful professor, and the course material is really very good.  It's a look at existentialism across modernity, both inside and outside of a religious context.  Readings include literature and philosophy, and are fairly manageable.  The course was taught as a seminar, with discussion being the main focus of the meeting each week.  Highly recommend.","As a senior, this is the most meaningful course I've taken in college. If you have genuine interest in this philosophical tradition or have experienced anything like \"existential crisis\" in your life, not taking this course would be a sacrilege to your soul. But, do NOT take this course if you just see a favorable Q score or heard good things. You must be interested in the material and willing to buy into the class or else you will hold the class back and take away from other people's experience.","Professor Lamberth leads great discussion, and the small seminar class is a really open environment that is perfect for throwing around ideas and interpretations. The readings are tedious and difficult at times, but can also be life changing and make you think about things in a different way. I found that this class changed my interpretation of authenticity and existential thinking.","This class is fantastic. Professor Lamberth is wonderful, the materials are interesting, and I wholeheartedly recommend this class. It's easy to get away with not doing the readings but don't do it. You won't get anything out of the course if you skimp on the readings. Great class--definitely take it if you're interested in big philosophical\/religious questions.","Absolutely take this class if it is offered again. My life has truly been changed by this course. The readings and discussions will make you rethink who you are, what you want, and what you believe about yourself and your purpose in life. If nothing else, at least you have lively party conversation and will be able to read some of the most interesting philosophers of the 19th and 20th centuries.","Lamberth is spectacular. She is kind, smart, and helpful. This class really challenges you to address your viewpoint of the world.","The class had a good mix of people--freshmen and seniors, science people and humanities people, so don't feel too intimidated. The readings are really interesting, and you should definitely read all of it if you can.","This is a good course to explore the works of major existentialist thinkers. It was a bit in the clouds sometimes, but really grounded in the text. The texts can be dense, but Professor Lamberth does a good job of breaking them down in class."]}},"mostRecentQ":{"overall":"4.70","workload":"2.40","difficulty":"3.10","recommendation":"4.60","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"RELIGION 57","course_id":"11217","cat_num":"44656","1s":"0","2s":"0","3s":"1","4s":"2","5s":"10"},"QDifficulty":{"number":"RELIGION 57","course_id":"11217","cat_num":"44656","1s":"0","2s":"2","3s":"8","4s":"3","5s":"0"},"QWorkload":{"number":"RELIGION 57","course_id":"11217","cat_num":"44656","1s":"0","2s":"8","3s":"5","4s":"0","5s":"0"}},"success":true}