{"scores":{"Fall '14":{"course_score":{"overall":"4.10","workload":"7.70","difficulty":null,"recommendation":"4.00","enrollment":"16","response rate":"93.75","QCourseOverall":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"2","3s":"2","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"4","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"5","3s":"9","4s":"0","5s":"1"}},"instructor_scores":[{"number":"ENG-SCI 52","cat_num":"50605","course_id":"10731","year":"2014","term":"1","id":"98a1c3f176f79c622ce9e97759aa4be7","first":" David Eric","last":"Abrams","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.40"}]},"Spring '14":{"course_score":{"overall":"3.50","workload":"2.30","difficulty":"3.10","recommendation":"3.60","enrollment":"25","response rate":"88.00","QCourseOverall":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"2","3s":"2","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"4","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"5","3s":"9","4s":"0","5s":"1"}},"instructor_scores":[{"number":"ENG-SCI 52","cat_num":"50605","course_id":"10731","year":"2013","term":"2","id":"98a1c3f176f79c622ce9e97759aa4be7","first":" David Eric","last":"Abrams","InstructorOverall":"3.30","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"3.30","GeneratesEnthusiasm":"3.50","FacilitatesDiscussionEncouragesParticipation":"3.10","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '13":{"course_score":{"overall":"3.90","workload":"2.70","difficulty":"3.40","recommendation":"4.10","enrollment":"39","response rate":"92.31","QCourseOverall":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"2","3s":"2","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"4","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"5","3s":"9","4s":"0","5s":"1"}},"instructor_scores":[{"number":"ENG-SCI 52","cat_num":"50605","course_id":"10731","year":"2013","term":"1","id":"98a1c3f176f79c622ce9e97759aa4be7","first":" David Eric","last":"Abrams","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"3.30"}]}},"comments":{"Fall '13":{"comments":["Completion grading is great, the quizzes are very reasonable\/fair and the staff is helpful and easygoing. In return, you'll need to be prepared to spend a lot of time in lab. You pay for the positives of this course with your time.","This is a great option for fulfilling your electronics requirement.  The labs are time intensive but the homeworks are pretty light and the theoretical component of the course is helpful but doesn't dive too deep.  The course definitely needs some polishing but I'd recommend it over what I've heard from P123.","this is class is about picking up practical knowledge so don't just focus on finishing the labs. make sure you have an understanding of why things work. if you don't, you'll have a hard time on exams and the final project. also try to be creative with the final project and do research on the parts you plan to order to make sure they are compatible. don't be afraid of abrams. he's intimidating but he doesnt bite.","This course is incredible. If you have no background whatsoever in electromagnetism it may be a bit more challenging, but for science people this is a really fun, interesting, easy course.","This class gave a solid introduction to digital and analog electronics. There was some new-course roughness at time, but overall a very useful course. Take the course if you want to develop the basic skillset necessary to approach more complicated electronics problems.","Be prepared to spend more time on the lab component of this course than the allotted hours of lab during regular class time. Also, do not think this is an easy introductory engineering course. It is certainly not as hard as ES 154 or Phys 123, but it is considerably more conceptually difficult than ES 1, ES 6, ES 51. That being said, if you want to get hand on experience with electronics and build a really cool project at the end of the course, take this class!","For the non EE, this is the best way to fulfill the electronics criteria and give you enough useful breadth about the subject. For EE and people on the fence, this class fantastic introduction to the topic. Besides that, you learn an incredible amount of material that is actually useful, a rare quality at Harvard. This class also allow you to gain intuitive understanding of electronics and build circuits. Some pacing issues was apparent along, and there was confusing approaches to certain topics since it was the first time it's offered, but the teaching staff are adamant about improving the course over time.","Prior engineering background a must.","You learn alot in the class, but there are still many kinks to be worked out since it is a new class.","This class is not as in depth as the one it is supposed to replace (PS 123 I think?) and won't teach you as much, but is fun, not the most difficult course on the planet, and still a good way to learn.","I really loved this class, and it will go down as one of my favorites I've taken at Harvard. As an electrical engineer I feel that it gave me the necessary tools to understand circuits and how they work, and think that this course will only continue to improve over time. The instructors are both great and willing to help you out and debug your circuits. Overall, a challenging course that was always interesting and fun as each class has a lab section in which you are designing and creating functional circuits.","This class was really interesting, fun, and applicable. The only problems I had with it were due to lack of organization, etc because it was the first offering of the class. These things are bound to improve for further semesters","The class is new so naturally there's a lot of disorganization. The teaching staff, however, are trying really hard to reduce that. Both Avi and professor Abrams are very helpful and can sometimes sit down with you for hours to figure out why stuff is not working or to explain concepts you do not understand.\r\nThe course is very fast paced though, so it is important to go over finished labs at home to make sure you understand everything before moving on to new topics.","This is definitely a better alternative to Physics 123, but but it was still a lot of work, most of which was quite unstructured seeing how it was taught for the first time this semester.  It has a really sharp learning curve, but the material is enjoyable. The book was complicated, had mistakes and never made sense, and lectures were even more confusing than the book. Also, I wouldn't recommend taking this class without having taken ES50 or another intro circuits class. They say that you can take this class as your first EE class ever and that they'll teach you everything, but you'll struggle because some of these concepts need you to spend more than just 2-3 days on in order to fully grasp.","Good class, but more time consuming than expected. A lot of the labs too a long time.","The class was fairly unorganized because it was a new course, but it will get better. It's difficult to stay focused during the whole 3 hour period. Avi is definitely the saving grace of the course; he is always available and willing to help. Overall, not a bad way to fulfill the EE requirement for mechanical engineers.","It's a great introductory course to electrical engineering.  You cover a large variety of topics and it is very hands on!","This course is a real time-suck.  You will be spending a lot of time tinkering in the basement of Maxwell Dworkin.  I would make sure to buy the recommended book, as it is an excellent supplement to the material covered and will most likely prove helpful when studying for the midterms or when just trying to understand a concept that went over your head in lecture.  That being said, lectures weren't the most helpful in my opinion; they were usually too fast paced.","Very fun class, learned a lot.  This is a good class to take before 154 and 156 if you are an electrical engineer because it introduces you to a lot of the material without the theoretical and mathematical rigor.","If you want to learn electronics in a practical way, take this course.  You end up being able to understand more circuits and increase your confidence in making new things.","Be prepared to read the textbook, and spend time outside regular hours to really go through your labs and make sure that you are understanding what you are doing and not building for the sake of building, but designing for the sake of learning.","An essential course to gain experience with practical electronics.","This was a new course so there were organization issues but this class has a lot of potential to be really amazing. It is lab heavy so it is very hands on, which I loved. Avi is amazing and it is a shame to go without ever working with him. There is a final project in place of a final and doing the final project is incredibly fun and rewarding when you have a physical accomplishment of all your hard work. It was a pain when the prof kept assuming we knew certain things that many of the students didn't know, which made completing assignments annoying. But homework is graded on completion so that's a plus. Also the prof is fairly condescending so prepare.","The only reason I am not giving a \"recommend with enthusiasm\" is because the course was very disorganized (first year problems...?). Also, this is not an intro course. You need at least ES50 or you will be strained by the pace. Avi is fantastic! Professor Abrams is also great once you figure out his teaching style.","This course has the potential to be really really great, so don't be disappointed by the q guide scores if they aren't great. This was the first semester the course was offered and they're planning on making a lot of changes for the better. That said, I still really enjoyed this course as it was. The labs are really cool- you build things like a heart monitor, digital dice, flashlight, audio amplifier and equalizer etc. The labs are fun and you have to apply a lot of the principles of analog and digital circuitry that you learn. The course is pretty low stress - the problem sets aren't difficult at all. Most of the work is spent in lab trying to finish the lab projects, sometimes you have to go in outside of class to finish them up. The exams are manageable but you need to make sure you understand the material. For the final project, don't set too high expectations for yourself. It's better to set moderate expectations and exceed them. Ask for help often in lab.","In terms of a hands-on design class, it was awesome and I had a good time. If you can wait, this course in two years when they've really got things figured out. I think the next time it will be offered it will probably be better - Avi and Professor Abrams are cool guys, but the organization was poor and the expectations for the course were confusing."]},"Spring '14":{"comments":["Take notes on the assigned readings in the textbook--it's a great resource!","You will get very good at breadboarding....This class often lacks in teaching theoretical understanding of the material, and that is mostly because the homework assignments do not cover the material in as much depth you will use it in lab or in your final project. If you want to learn very basic analog and digital circuitry, I highly recommend this course. If you already have some background in the material, your time is better used taking something else.","If you actually want to learn about circuits, take Physics 123 which is a much better class that covers much more information that will be useful.","It was a good class, but if you are looking for a challenge try taking Physics 123 or MIT's 6.002.","Having taken ES50 already, this course was a whole new level. Compared to ES50, this course goes into a lot more depth and focuses more on the practical design aspect of circuits. You get a lot of hands-on experience working with different types of circuits and learn a lot about the types of things you need to think about when designing an electronic component. It's still a new class so there are still kinks that the teaching staff needs to iron out, but overall, it's a very interesting course. If you haven't taken ES50 though and haven't had exposure to circuits or electronic components before, this may be a bit tougher for you than for people who have taken ES50. CS50 experience is also helpful for when you work with microcontrollers. Overall, I would only recommend this class to people who have to take it (instead of Physics 123) or people who have had exposure to circuits and want a interesting hands-on learning experience with electronics.","If you've ever wanted to work on interesting electronics projects this is the class for you.","DO NOT TAKE THIS COURSE","The Joy of Electronics? How about the Torture\/Struggle\/Pain\/Misery of Electronics?! Only take this class if you are fulfilling an electrical requirement and physics 123 doesn't fit in your schedule. The professor and TF spend half of their time arguing with each other, so don't expect them to pay any attention to you. And if you're in lab and have no clue what is going on, don't worry - everyone else has no idea either. Sadly, David Abrams has no intention of helping you, and he would rather insult all the failed attempts you have made on your circuit. And Avi will answer a simple question with a 30 minute lecture about every electrical engineering topic ever invented, and you will be more confused than before. Utilize the TAs. THEY ARE YOUR FRIENDS, and they feel your pain. They actually WANT you to succeed, unlike Avi and David. So please, think long and hard before submitting yourself to this torture.","Really fun class. Good focus on the labs where you learn a lot about design. Low pressure since psets and labs are graded on completion\/effort. Avi knows so much and is amazingly patient and great at explaining things. You'll learn a lot and enjoy doing it.","This is an awesome lab based approach to learning circuits. The material moves very quickly but you learn a lot and get to understand and then build lots of small electronic devices. The final project can be really cool if you are prepared to spend a lot of time on it.","You're best off taking ES50 before you take this class. Not to say that you can't do it without a little background, but it makes things much easier. The class isn't easy but it is very rewarding.","This isn't going to be a breeze. You'll suffer but it'll be worth it.","I strongly recommend this to everybody who is ok with spending many hours in the lab (the time you have to put into this class outside lectures and labs is negligible though). This course was one of the things keeping me sane this semester. I enjoy creating something with my hands, so the lab was definitely the most enjoyable part of this course for me. The material is not very complicated, but after you go through the course you are able to do magic with circuits. This year the number of people taking it was not very large, so professors actually had enough time to talk to you and know who you are - speaking of which, Avi is simply amazing. As for professor Abrams, if you are prepared for him being a bit condescending and can deal with it, he is also excellent. It was the second time this course was offered, but there were almost no major logistical issues (maybe only that the parts for final projects did not seem to arrive and one of the tests started late), thumbs up. I am very glad I took this instead of ES50 (which is certainly also a good course, I just think this one was better for me). I also recommend that you do not procrastinate on your final project - the sooner you start, the more awesome thing you have time to build."]},"Fall '14":{"comments":["Really fun class, with a focus on the lab portion of the class. The staff really know their stuff, and are incredibly helpful with the labs, and especially the final project. I feel like I definitely learned a lot, but I might not have without already having taken ES50. I don't know how Physics 123 is, but for any EE's, it might be better to take that class instead, since it's supposed to cover more things in greater depth.","I don't think I've ever learned so much practical information in a single course. I went in with the attitude that electronics are magic, and came out with the attitude that I can take on a wide array of design challenges. I feel like I could invent some really cool things if struck with the ideas. Professor Abrams and Avi are extremely helpful if you just take the time to approach them. You may struggle at first (I definitely did), but know that if you put in a bit of effort you can get a lot out of this course.","This is a hands on class with a slightly significant work load. Take it if you're really interested in designing electronic circuits.","I loved ES 52! I had taken ES 50 already, which is a nice overview, but it didn't really give me a strong foundation. I came out of ES 52 with much more confidence in my circuit-designing skills. The labs and project all build on knowledge taught earlier in the course, which helped reinforce the learning.","be prepared to spend ten hours per week in this class between lecture and lab.  You will only be looking at about 3 hours outside of it, but then a ton of time on the final project.  Avi and David are amazing especially as the semester goes on, and you learn more material.","This was an amazing class!\n\nIt is a very large time commitment (8 hrs for lab\/lecture plus time for readings and psets) but you get a lot out of it. As long as you put in a decent amount of effort and make sure you never fall behind by going to office hours and such you will learn so much! I was amazed by the projects everyone was able to create by the end especially considering that most of us had no prior circuit experience.\n\nAvi and professor Abrams trade off teaching and are both really great lecturers. Also, both of them are always there for lab and have lots of office hours. During lab, Professor Abrams usually makes me feel like I am in massive amounts of trouble when I ask him questions so I'm a little afraid of him... But honestly he is very nice, just very blunt so try not to let it bother you. Avi is a lot kinder in how he approaches explanations and I always found it a lot easier to talk to him. Both of them are incredibly helpful, put a lot of work into the course and really want to see the students succeed.\n\nMy only warning would be cs. They say you don't need any coding background but you actually do. You will need to write some programs in arduino code which is basically C. I took CS50 concurrently and was fine.","Interesting course, but can be a big time commitment because of lab. Concepts can be difficult to grasp.","If you're a mechanical engineer student trying to fulfill your electronics requirement, I'd recommend this one over Physics 123. I mean this one is pretty time extensive, but the difficulty is pretty fair. Things do get a little hectic around final project time, but it's manageable. In your schedule, this should go down as one of your harder classes.","Take this class if you really want to learn electronics, you need to like the material to enjoy the class. If you want a flashy class thats a fun gened and will give you an easy time take es50. If you like electricity though this class is amazing and will challenge you alot but also expand your knowledge and interest.","If you are interested in electrical engineering at all, take this course.","Perfect EE breadth course for MEs.","This class provides a great foundation for circuitry and electronics. It's very hands-on, and the labs, psets, and exams work well together to ensure that you learn the materials. Great course to take for any engineer."]}},"mostRecentQ":{"overall":"4.10","workload":"7.70","difficulty":null,"recommendation":"4.00","enrollment":"16","response rate":"93.75","QCourseOverall":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"2","3s":"2","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"4","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"ENG-SCI 52","course_id":"10731","cat_num":"50605","1s":"0","2s":"5","3s":"9","4s":"0","5s":"1"}},"success":true}