{"scores":{"Fall '13":{"course_score":{"overall":"4.30","workload":"2.10","difficulty":"3.10","recommendation":"4.10","enrollment":"30","response rate":"100.00","QCourseOverall":{"number":"ESPP 77","course_id":"10786","cat_num":"11172","1s":"0","2s":"0","3s":"7","4s":"8","5s":"15"},"QDifficulty":{"number":"ESPP 77","course_id":"10786","cat_num":"11172","1s":"0","2s":"2","3s":"24","4s":"3","5s":"1"},"QWorkload":{"number":"ESPP 77","course_id":"10786","cat_num":"11172","1s":"5","2s":"17","3s":"7","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ESPP 77","cat_num":"11172","course_id":"10786","year":"2013","term":"1","id":"921a0da39765c5df9f0fd85a2cf9e236","first":" Sheila","last":"Jasanoff","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.40","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"3.70"}]}},"comments":{"Fall '13":{"comments":["Be prepared to challenge yourself but this is a very interesting course. Be okay with reading strange theories then moving on, however.","This was the first year the course was offered, but it ran very smoothly and the readings were interesting. Make sure you understand the conceptual readings early in the class and it will make the rest of the class more enjoyable.","Sounds much more interesting than it is. Don't take it unless you are an ESPP concentrator or interesting in the theoretical component of science & technology. There was a shockingly limited focus on public policy or case studies that would be applicable outside of the class. Taught me to think in a new way, but I don't think overall it was very valuable.","Professor Jasanoff is a great lecturer- easy to listen to , approachable, and so knowledgeable about all she lectures on that it is a pleasure learning from her.","Great course, challenges you to think about technologies from cars to nuclear energy to GMO's.","ESPP 77 was a good class. It was very interesting, and it helped me get a sense of the policy side of things (I study CS and EPS). Prof. Jasanoff is great, too. Beware, though, that to me at least, this was a sociology class -- a bit more sociological theory than I bargained for! But it was still a good, interesting, engaging, and manageable class.","Listen to TF feedback to know what they are looking for in response papers, talk to them about the final project often to know what they would think is best. Not a really hard class or really easy, just know all the concepts and answer in the right manner and it is a painless semester.","If you are interested in the connections between the environment, technology and society, then consider taking this course. You are exposed to a wide range of interesting topics and theories. And the course is likely only to improve, since this was the first year it was offered.","This class is a really neat way of looking at how technology functions in society and will seriously change how you regard technology in society. Be warned though, this class is almost like a philosophy class and less about actual environmental technology.  The readings can be kind of dense, but the second half of the course deals with a lot of case studies (Fukushima, GMOs, geoengineering, etc) and those are very interesting and really relevant to current debates.  This class won't exactly be easy, but I would definitely recommend taking it if you're at all interested in environmental philosophy and technology!","This is an incredible foundational course in Science, Technology and Society, which Harvard does not often provide for undergraduates. The critical theory with which we look at case studies would really benefit all students, with the hope that engineering concentrators would look at their work through these lenses always.  All the my peers in this class would remark on how enjoyable this class was for us. The course staff really does take care of you. A great introduction to new methodologies and key Science, Technology and Society theories.","Inspiring and engaging lectures given by an amazingly knowledgable scholar and instructor; a timely course with a rich and varied selection of intriguing readings","Take this class! Professor Jasanoff is a wonderful teacher and lecturer. This course is based in the concept that the technical and social are inseparable. It makes you see the world in a new way, with applications for public policy, engineering, urban planning, as well as any field that interacts with sociotechnological infrastructures (more than you probably realize). The readings are interesting and lectures and sections are engaging, especially if you get Tijs!","The course is interesting but could use a name change.  This course focused on ways to analyze how technologies effect and interact with society rather than being a course about Environmental Technologies.  It's a sociology course, not a science course.","Pretty cool subject, makes you look at technology in a whole new way.  Useful","You will gain a contemporary understanding of environmental issues and technology and the policy surrounding them. You will also gain historical interpretations of environmental technologies.","This course is great - if you want to engage in philosophical debates about how society should be interacting with technology.  It'll definitely open your eyes to a new way of thinking about issues, but make sure that you go in with the knowledge that it's not going to be about \"green\" technologies (at all).","This is a great class taught by a professor who created and leads the field of science, technology, and society. It introduces a different lens through which to view environment and technology, and is an extremely interesting perspective. Lectures are well-prepared and engaging. Readings are generally interesting, although very long so definitely form a study group for the tests. The course does a good job of applying theories to case studies so they actually seem relevant.","This class is enlightening in a lot of ways and learning theories to analyze the social aspects of technology is very useful. However, the course expects a lot from you: readings are pretty long and dense and response papers are time-consuming and graded pretty harshly. But the course will change the way you think about technology and its implications.","This is a remarkably well-organized course with a variety of subtopics. The conversations started in these sections brought together students from a variety of academic backgrounds, which made for a really enriching, relevant, and thought-provoking experience.","Professor Jasanoff is a wonderful lecturer and the readings, which include theory and newspaper clippings, are very interesting. My thinking hasn't radically changed, but now I do ponder more deeply the implications of technology in society, rather than simply accept \"progress\" for progress."]}},"mostRecentQ":{"overall":"4.30","workload":"2.10","difficulty":"3.10","recommendation":"4.10","enrollment":"30","response rate":"100.00","QCourseOverall":{"number":"ESPP 77","course_id":"10786","cat_num":"11172","1s":"0","2s":"0","3s":"7","4s":"8","5s":"15"},"QDifficulty":{"number":"ESPP 77","course_id":"10786","cat_num":"11172","1s":"0","2s":"2","3s":"24","4s":"3","5s":"1"},"QWorkload":{"number":"ESPP 77","course_id":"10786","cat_num":"11172","1s":"5","2s":"17","3s":"7","4s":"1","5s":"0"}},"success":true}