{"scores":{"Spring '14":{"course_score":{"overall":"3.90","workload":"1.60","difficulty":"2.40","recommendation":"4.00","enrollment":"41","response rate":"65.85","QCourseOverall":{"number":"HISTSCI 149v","course_id":"10994","cat_num":"68182","1s":"0","2s":"2","3s":"6","4s":"13","5s":"6"},"QDifficulty":{"number":"HISTSCI 149v","course_id":"10994","cat_num":"68182","1s":"4","2s":"9","3s":"12","4s":"2","5s":"0"},"QWorkload":{"number":"HISTSCI 149v","course_id":"10994","cat_num":"68182","1s":"13","2s":"13","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HISTSCI 149v","cat_num":"68182","course_id":"10994","year":"2013","term":"2","id":"bdbed5d055fbefc9f13f21348d2be8d2","first":" Aaron Pascal","last":"Mauck","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"3.70"}]}},"comments":{"Spring '14":{"comments":["The material covered in this course is very interesting, but as a new class, it was poorly organized and not well taught. Perhaps it will be better next year, but this year there was a lot of ambiguity about due dates and assignments. If you are interested in history of science or the course material, I would recommend shopping it first to see how the course will be organized next year.","This class, and Professor Mauck, was great. Professor Mauck taught us so much, and he did so in a poised and eloquent manner.","This class was really interesting, but you should definitely try to do hte readings if you can, because you will get much more out of the course.","This is a great class to take to learn generally about a bunch of different epidemics without getting too stressed out about little details if you worry about that when it comes to testing. The set-up allows you to take exams or write a large paper so you can have the option of doing your own research on the most interesting topic for you personally.","It's unorganized but SO interesting and painfully easy. TAKE IT.","Aaron is a great lecturer and the material in the class is very interesting. Would highly recommend to everyone interested in medicine","this class is phenomenal. The lecturer is clear, articulate and engaged with the material. Every week has an interesting new topic and the course requirements are totally reasonable. this course made me want to become a history of science concentrator!","Entirely lecture-based, with no section. Given this format, it becomes really easy to be disengaged with the course material.","This class was stressful in terms of assignments because the syllabus was not concrete and all of the assignments were assigned haphazardly","This was a good class for anyone curious about epidemics over history.","Extremely interesting subject matter and very low time commitment","This is a very easy course. Requires relatively little reading and day-to-day effort. The lectures are generally enjoyable, and often have an interesting take on material that most people in the class have probably heard before.","This course is very balanced -- with the option of doing a midterm exam or a final paper, there is room to tailor it to your own interests.","Dr. Mauck is really great and enthusiastic about the material, as well as knowledgeable about a variety of related topics in addition to the course material. The course surveyed a variety of diseases throughout history including modern epidemics and how the term might be applied to things such as violence, obesity, and other non-infectious disease related topics. Overall, it was a really great course with a really low workload; I would highly recommend!","A relatively low workload with engaging lectures, though a bit administratively scattered.","This is a great course. Professor Mauck is super laid back but so so smart and an amazing lecturer. All the topics are really fascinating and he's particularly knowledgable about the obesity epidemic so that week was particularly great. I did the long paper option and as long as you work ahead and choose a topic that you like it's really stress-free and I'm sure will be great practice for writing a thesis chapter. I looked forward to this class every week!","-No section component, which means you will get behind on the readings but will be able to enjoy Professor Mauck's lectures and will have minimal work each week\r\n-Exams were fair, paper was open-ended\r\n-Material is very interesting, as are the readings!","This course is great! Professor Mauck is a fantastic lecturer, and the material is super interesting. If you're interested in epidemics or the history of medicine this course is for you.","Very interesting and enjoyable class. It covers a lot of ground in a painless and thought provoking way"]}},"mostRecentQ":{"overall":"3.90","workload":"1.60","difficulty":"2.40","recommendation":"4.00","enrollment":"41","response rate":"65.85","QCourseOverall":{"number":"HISTSCI 149v","course_id":"10994","cat_num":"68182","1s":"0","2s":"2","3s":"6","4s":"13","5s":"6"},"QDifficulty":{"number":"HISTSCI 149v","course_id":"10994","cat_num":"68182","1s":"4","2s":"9","3s":"12","4s":"2","5s":"0"},"QWorkload":{"number":"HISTSCI 149v","course_id":"10994","cat_num":"68182","1s":"13","2s":"13","3s":"1","4s":"0","5s":"0"}},"success":true}