{"scores":{"Spring '14":{"course_score":{"overall":"4.40","workload":"2.40","difficulty":"3.20","recommendation":"4.10","enrollment":"18","response rate":"88.89","QCourseOverall":{"number":"ECON 1544","course_id":"10720","cat_num":"83909","1s":"1","2s":"0","3s":"1","4s":"4","5s":"10"},"QDifficulty":{"number":"ECON 1544","course_id":"10720","cat_num":"83909","1s":"0","2s":"2","3s":"9","4s":"4","5s":"1"},"QWorkload":{"number":"ECON 1544","course_id":"10720","cat_num":"83909","1s":"2","2s":"7","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ECON 1544","cat_num":"83909","course_id":"10720","year":"2013","term":"2","id":"b035630efb522eafd0a0e3b6faf4ca81","first":" Gita","last":"Gopinath","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '14":{"comments":["If you want to understand how the global economy works at a practical level, this course is perfect. It stays out of the weeds of the more complex models and instead gives you practical, generally accepted information. You'll be able to grasp crises such as the one that wracked the Eurozone in 2011 much more clearly after having taken this course. Its a lot of day to day work (weekly quizzes, etc.) but that translates into less time studying for the exams (and the marginal value of your time is higher around exams, trust me, so this is a very efficient feature).","If the course material sounds at all interesting to you--then this is the class for you. It requires no paper, only two midterms, and the amount that you can learn is incredible. Plus Gita may be one of the best (and most attractive) professors at Harvard. My one piece of advice is to not take this class pass-fail if you are worried about your grade in this class. I was a little freaked out at how smart and knowledgeable everyone seemed to be at the beginning, but I ended up doing much better than I expected and probably should have taken the class for a grade to get even more out of it.","Great course to learn a lot about macro that is not very difficult or mathy.","This class was definetly enjoyable because you did end up learning a lot about international macroeconomic policy and you could tell the professor actually cared whether the students learned the material or not. However, there were a few shortcomings. I felt like the quizzes varied too widely in difficulty. Sometimes they would be very straightforward and other times we would be asked questions on really specific details that we had literally spent 30 seconds on in lecture. This variability made it difficult to study\/prepare for the quizzes because you never got a good sense of how to study for them. Furthermore, the problem sets were poorly constructed. A lot of the times it will end up being a random excel spreadsheet exercise rather than practice problems, so they really served no purpose when studying\/preparing for exams. This made it really difficult to study for the exams because we had no previous practice problems to base our studying off of except the quizzes, which didn't even have many problems in the first place. Also I wish section had been weekly instead of every other week, because section was actually pretty helpful in understanding the material. Furthermore, the class seemed to move too quickly in the beginning then slowed down significantly at the end. The exams were manageable but seemed to test us really deeply on concepts we had glossed over in class. There were a few students in class who you could already tell had a strong financial background so discussions could sometimes become too specific and esoteric that most of the class is left wondering what is even going on. It would be helpful if discussions could be moderated more appropriately for future classes.","Take this if you like to see a strong, smart woman teach of concepts that are worldly relevant and you would only hear men talk of otherwise. This is a well structured course and very much oriented to discussion. She is phenomenal.","Good class, well taught. Take it only if you are very interested in the material.","Professor Gopinath is clearly a leading-edge expert in the field and colors the interesting material with her research and experience. Great crash course on some basic economic concepts for those with no prior economics experience. Her lectures are clear and engaging, and the weekly quizzes are painless and extremely helpful in making sure you stay on top of the material."]}},"mostRecentQ":{"overall":"4.40","workload":"2.40","difficulty":"3.20","recommendation":"4.10","enrollment":"18","response rate":"88.89","QCourseOverall":{"number":"ECON 1544","course_id":"10720","cat_num":"83909","1s":"1","2s":"0","3s":"1","4s":"4","5s":"10"},"QDifficulty":{"number":"ECON 1544","course_id":"10720","cat_num":"83909","1s":"0","2s":"2","3s":"9","4s":"4","5s":"1"},"QWorkload":{"number":"ECON 1544","course_id":"10720","cat_num":"83909","1s":"2","2s":"7","3s":"6","4s":"1","5s":"0"}},"success":true}