{"scores":{"Spring '14":{"course_score":{"overall":"3.80","workload":"3.10","difficulty":"3.60","recommendation":"3.40","enrollment":"15","response rate":"60.00","QCourseOverall":{"number":"HIST 97e","course_id":"10921","cat_num":"31936","1s":"0","2s":"1","3s":"3","4s":"2","5s":"3"},"QDifficulty":{"number":"HIST 97e","course_id":"10921","cat_num":"31936","1s":"0","2s":"1","3s":"3","4s":"4","5s":"1"},"QWorkload":{"number":"HIST 97e","course_id":"10921","cat_num":"31936","1s":"0","2s":"3","3s":"4","4s":"0","5s":"2"}},"instructor_scores":[{"number":"HIST 97e","cat_num":"31936","course_id":"10921","year":"2013","term":"2","id":"9ac7035fefcd39b20b126d7e628d39aa","first":" Kelly","last":"O'Neill","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"3.70","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '14":{"comments":["It will take up all of your time, so choose other classes that have a minimal workload so that your GPA doesn't suffer. If you get into the readings instead of treating them like another assignment to plough through, they're actually really fascinating and the class discussions are incredibly stimulating. You may resent the workload, but you'll enjoy the class.","This course isn't as bad as people say! Though it does require a ton of time to do the readings and 3 essays, revisions, and the final paper\/revisions, you actually get better at writing. It definitely took up most of my time this semester, but the professor and TF will be there to help you along the way. If you can get a theme you like, then you'll be able to pull through without feeling like it was just a requirement you had to satisfy.","If you've heard horror stories about the trial by fire that is History 97, rest easy. The new and improved 97 is not a particularly difficult class at all - there is an above average amount of essays, but deadlines are well-spread out and readings are not overburdensome. \r\n\r\nIf you find yourself in Imperial History, be prepared to interact with lots of different periods and eras on a very cursory level. By the very nature of this course (thematic history), you will be mostly focused on concepts and ideas than specifics of historical periods. This isn't to say I didn't learn anything about the Ottomans, or British India, etc. - I did. But imperial history in particular has less of a overarching, definitive narrative than, say, medical history. It's really a collection of similar but distinct historical narratives than we only get glimpses of. If you like meta-history or discussions of cultural exchange, you'll probably find this course to your liking. Prof. O'Neill is an engaging teacher. Just make sure you have a fairly competent grasp of the week's readings, or you'll probably not have much to offer in class.","Although they have tried to make the course easier, it is still definitely a difficult course and is a lot more work than the average course.  Also, the revision process makes it so that you have deadlines almost every week, which is tough.  I guess you have to take the course, but it's not so bad and reasonably interesting.","This class is difficult, and honestly poorly constructed.  Would have liked to have more feedback from the professor, and not just our TF.","your experience in 97 is 100% determine by your professor and TF. Kelly and Marysia are great. Be careful when selecting your tutorial. They have gotten easier but if you get a bad teacher or worse TF it will ruin the class for you. Think very carefully about what genre of history you want to spend the whole semester reading and writing about or you will be bored to death."]}},"mostRecentQ":{"overall":"3.80","workload":"3.10","difficulty":"3.60","recommendation":"3.40","enrollment":"15","response rate":"60.00","QCourseOverall":{"number":"HIST 97e","course_id":"10921","cat_num":"31936","1s":"0","2s":"1","3s":"3","4s":"2","5s":"3"},"QDifficulty":{"number":"HIST 97e","course_id":"10921","cat_num":"31936","1s":"0","2s":"1","3s":"3","4s":"4","5s":"1"},"QWorkload":{"number":"HIST 97e","course_id":"10921","cat_num":"31936","1s":"0","2s":"3","3s":"4","4s":"0","5s":"2"}},"success":true}