{"scores":{"Spring '14":{"course_score":{"overall":"3.90","workload":"2.90","difficulty":"3.90","recommendation":"4.00","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"HIST 97c","course_id":"10919","cat_num":"38556","1s":"0","2s":"0","3s":"3","4s":"5","5s":"2"},"QDifficulty":{"number":"HIST 97c","course_id":"10919","cat_num":"38556","1s":"0","2s":"0","3s":"2","4s":"7","5s":"1"},"QWorkload":{"number":"HIST 97c","course_id":"10919","cat_num":"38556","1s":"0","2s":"4","3s":"4","4s":"1","5s":"1"}},"instructor_scores":[{"number":"HIST 97c","cat_num":"38556","course_id":"10919","year":"2013","term":"2","id":"81497fd91cf61783821fcf727ecd7ab6","first":" Ann M.","last":"Blair","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '14":{"comments":["This course is like another Expos course, but it teaches you how to write in the history discipline. It will teach you how to do research and how to write concisely and well.","Great seminar discussion - Professor Blair is great. The readings were manageable, and the class provided great flexibility to choose research topics. Definitely take it!","This class is an excellent choice for the sophomore history tutorial. I was worried that, as a tutorial the class would be a bit intimidating. However, that was not a problem at all. Professor Blair created a super comfortable and welcoming space. It was a class I truly enjoyed going to and was the fastest-passing two hour class I've taken at Harvard. Most importantly, the class is incredibly well-structured. Now that the semester is over, I definitely feel that I've become a better writer. I am more confident in my writing abilities, and I feel more prepared as a history concentrator.","This course is Expos for History concentrators.  It is hard, you get bad grades, and it is all about improving you writing.  But it is worthwhile.","Opportunities to revise with guidance were the highlight of this course! I also loved the freedom that we had to write about what we wanted to! \r\nI think it was challenging to be engaged in seminar. I understand that the idea that we'd read material that did that tasks we were supposed to do in our own writing (historiography, close read, contextualize primary sources, etc.) but the readings were not on topics that I personally felt remotely interested in, so I ended up barely doing any of the readings. \r\nAlso, it was frustrating that the time we were allotted to meet with the TF to move from draft to revision was so short. \r\nBe aware of what day the course is and what that means about when papers are due. Sunday afternoon due dates take away weekends.","History 97c is pretty painless. Unfortunately it looks like Michael will not be TFing again next year, but he and Professor Blair are both incredibly intelligent and helpful resources. The only downside is that paper assignments are due two days before tutorial meets--that is, Sunday."]}},"mostRecentQ":{"overall":"3.90","workload":"2.90","difficulty":"3.90","recommendation":"4.00","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"HIST 97c","course_id":"10919","cat_num":"38556","1s":"0","2s":"0","3s":"3","4s":"5","5s":"2"},"QDifficulty":{"number":"HIST 97c","course_id":"10919","cat_num":"38556","1s":"0","2s":"0","3s":"2","4s":"7","5s":"1"},"QWorkload":{"number":"HIST 97c","course_id":"10919","cat_num":"38556","1s":"0","2s":"4","3s":"4","4s":"1","5s":"1"}},"success":true}