{"scores":{"Spring '14":{"course_score":{"overall":"3.50","workload":"2.30","difficulty":"3.10","recommendation":"3.60","enrollment":"28","response rate":"85.71","QCourseOverall":{"number":"ESPP 11","course_id":"10784","cat_num":"79625","1s":"1","2s":"5","3s":"5","4s":"7","5s":"6"},"QDifficulty":{"number":"ESPP 11","course_id":"10784","cat_num":"79625","1s":"0","2s":"2","3s":"17","4s":"3","5s":"1"},"QWorkload":{"number":"ESPP 11","course_id":"10784","cat_num":"79625","1s":"1","2s":"15","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ESPP 11","cat_num":"79625","course_id":"10784","year":"2013","term":"2","id":"b42639a109b1b06b31112409f62998a1","first":" William C.","last":"Clark","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"3.00"}]}},"comments":{"Spring '14":{"comments":["Gives a very solid framework to think about sustainable development (that is the main strength of this course). Some readings aren't really necessary to do in order to have good discussion in class. The teaching staff definitely have opinions that you need to cater to not in the discussion but in the writing.\r\n\r\nMost important, however, is that the main assignments of this course is a group essay with a group and topic that you do not have any choice in. Some of the essays are not very collaborative so you get someone's grade for something they wrote and which you have minimal input in. If you have no reservations on group essays, do take this course. Good way to fulfill a GenEd but you won't be blown away, just well-equipped as you progress forward by excercising different analytic techniques.","Group work is a central component of this course, which is a turnoff for many people. Also, lectures are mandatory but not always very helpful, which is frustrating. However, the material covered is extremely important, and I highly recommend that everyone consider taking the course.","This course needs a lot of changes but overall it was good if you are interested in development and such. If you put in the time, it can stretch your mind in a really positive way!","This is  gen-ed course that requires a good amount of your time, so make sure you are interested in the topic if you are looking to have fun and enjoy the class.","It will change your perspective on social events ie: \"news\"","Take it! This was a wonderful class, the lectures were never boring, and the discussions were informative.","This class was in its first year, and its biggest strength was its dedicated and passionate teaching staff. So I trust that it will improve a lot in the next year. The main problem was that everything was very abstract and theoretical. I felt overwhelmed by the empty space within the big brackets we were drawing everywhere, We were tasked with creating policy recommendations without concrete knowledge of what good policy recommendations look like, which resulted in a lot of inflating piecemeal research with wordiness. The presentation was a great exercise, the teaching staff (especially Alicia Harley) was very supportive, things were very open and friendly, and I wish I had spent more time on the readings. The study of sustainable development is inherently nebulous, but Bill also tends to talk kind of repetitively without getting to the meat of the subject matter, so it was easy to get lost and unmotivated. But I would definitely shop this class to see what changes they make because Bill Clark is very dedicated.","Learn how to do independent research.","If the structure of the course is drastically changed, I would absolutely recommend it. The topic is fascinating and very applicable to all parts of your life. However, overall I was very disappointed with this class given the structure\/administrative aspect of the class.","Don't take this as an easy gened. Take it as a really interesting class where you have to put in a lot of work, but where you'll learn a lot and also it's a gened.","Take this class. It is awesome. By far the best class I've taken at Harvard.","If you're looking for something to engage seriously with questions about sustainable development, this is NOT the class. Though the readings are good, lectures are completely useless and involve a lot of hand-waving and reciting of the textbook Prof. Clark is working on. The project is poorly organized and an unnecessarily high amount of work. You don't actually learn much, but some of the readings are interesting if you do them.","This was a good class, but I would really only recommend taking it if you have a flexible schedule because of the group work. The entire semester (and almost of of the work for the class) was done in groups of 5, which obviously is really difficult if you can't ever find time to meet. Would be a great class to take pass\/fail just to get exposed to the topic and material.","wonderful course!  while the readings may not be too heavy of a courseload, don't take this if you simply want an easy class.  The more you put into the class the more you'll get out of it, and the interim assignments, presentations, and final projects will certainly take a lot of time.  You'll feel super accomplished, though, if you take these assignments seriously and put in the proper effort.","The material is very interesting and constantly evolving. It is an evolving and critical approach to the problems of today and tomorrow. The ethnocentric perspective was new, interesting and remarkably applicable. I trust they will work out some of the kinks in the class.","The class had great ideas but is definitely an acquired taste.  Should definitely be shopped and considered deeply.  In order for this class to be good, huge improvements need to be made.","This class has so much potential, but it really needs to change structurally.","stay away, unless you: 1. like learning about things that can be thought through using common sense, 2. enjoy professors that can't facilitate discussion and resort to cold-calling, 3. enjoy professors that think cold-calling on students is funny, or 4. love tedious group projects\r\n\r\nthis class had a lot of potential as a \"Sustainable Development\" class taught by a Kennedy school professor...but it turned out to be a total disappointment. I felt that Professor Clark didn't know how to teach undergrads (he spent too much time on really simple concepts) and I didn't think the readings, assignments, projects, and lectures were meaningful...felt like high school. The grading was really quirky and disconcerting. WAY too much work for a gened","Major reservations in taking this class, unless they change the course dramatically. My biggest issue was with the grading scheme; it was very opaque, and my group felt as if our grades given pretty arbitrarily because no rubric was ever given for the written assignments and presentations. The course is very logistically taxing, especially towards the end of the semester with an assignment due every three days. Do not take if your reading period is packed, or if you don't like working in groups, because ~70% or your grade is essentially shared among your group work. I definitely learned a lot about SD and its literature, but--thinking retrospectively--I don't think I would take this course if I could again unless major changes are made.","this is a course they are still figuring out how to teach, but it's interesting. shop it and see if it's something you like. it's not an easy gen ed by any means, they want you to put in hours.","I think a lot of people might say how disorganized the course was, but personally I really enjoyed the course. I think sustainable development is an extremely important topic that everyone should learn about. Yes, it was a bit disorganized, but it was also the first year the course was run. Using case studies to study different regions was very effective, and the professor and TFs really put a lot of time into commenting on your essays and providing you with feedback, which is much more than I can say for most other classes here."]}},"mostRecentQ":{"overall":"3.50","workload":"2.30","difficulty":"3.10","recommendation":"3.60","enrollment":"28","response rate":"85.71","QCourseOverall":{"number":"ESPP 11","course_id":"10784","cat_num":"79625","1s":"1","2s":"5","3s":"5","4s":"7","5s":"6"},"QDifficulty":{"number":"ESPP 11","course_id":"10784","cat_num":"79625","1s":"0","2s":"2","3s":"17","4s":"3","5s":"1"},"QWorkload":{"number":"ESPP 11","course_id":"10784","cat_num":"79625","1s":"1","2s":"15","3s":"7","4s":"0","5s":"0"}},"success":true}