{"scores":{"Spring '14":{"course_score":{"overall":"4.40","workload":"2.20","difficulty":"3.40","recommendation":"4.80","enrollment":"8","response rate":"62.50","QCourseOverall":{"number":"PHYSICS 144","course_id":"11092","cat_num":"94978","1s":"0","2s":"0","3s":"0","4s":"3","5s":"2"},"QDifficulty":{"number":"PHYSICS 144","course_id":"11092","cat_num":"94978","1s":"0","2s":"0","3s":"4","4s":"0","5s":"1"},"QWorkload":{"number":"PHYSICS 144","course_id":"11092","cat_num":"94978","1s":"0","2s":"4","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PHYSICS 144","cat_num":"94978","course_id":"11092","year":"2013","term":"2","id":"c5924c2db168138b28af0050d67415cd","first":" Eugene","last":"Demler","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '14":{"comments":["Physics 144 was a way for me to see what theoretical condensed matter research was like, and more importantly a way to visualize the seemingly disconnected worlds of group theory and experimental physics.","Definitely take this class when it's offered! It's so much fun, the role that group theory, and later topology, plays in physics is fascinating! Demler was great!","Really great class. Take it if you are interested in solid state physics and how one can use symmetries\/group theory to study condensed matter. Even if you're not interested in solids it's still cool to see how abstract math finds its way into physics. This class is particularly good because you can learn in a relatively low-pressure environment (no midterms\/final, psets every other week). Also the professor and TF are both very interested in the material and make it fun to study. David Benjamin's sections are always entertaining too.","Although Eugene Demler has gotten some scathing Q guide reviews in the past when he taught 143a, this class was pleasantly the opposite experience. I think this is due to the different formats and intentions of each class. Unlike 143a, which is a typical intro course, this class was small and its material drew from a medley of different topics unified by a common theme. Based on my experience, this class was executed wonderfully. I always looked forward to attending lecture and section, as they complimented each other well. Demler is a great lecturer with a sexy Russian accent to boot; class is never boring","This class is a great extension of what you learn in Physics 143a, especially if you have taken Chem 40! The instructors are very good and very willing to meet with you a lot outside of class. If you put a lot of effort into this class, you will be very rewarded at the end because you will know a lot of physics and will have learned very well how to think about quantum mechanical\/symmetry problems. Can also be taken as an upper level \"senior spring\"-type class, and you will learn some cool things about physics\/quantum mechanics. Make sure to take advantage of the incredible opportunity you get with this great teaching staff!"]}},"mostRecentQ":{"overall":"4.40","workload":"2.20","difficulty":"3.40","recommendation":"4.80","enrollment":"8","response rate":"62.50","QCourseOverall":{"number":"PHYSICS 144","course_id":"11092","cat_num":"94978","1s":"0","2s":"0","3s":"0","4s":"3","5s":"2"},"QDifficulty":{"number":"PHYSICS 144","course_id":"11092","cat_num":"94978","1s":"0","2s":"0","3s":"4","4s":"0","5s":"1"},"QWorkload":{"number":"PHYSICS 144","course_id":"11092","cat_num":"94978","1s":"0","2s":"4","3s":"1","4s":"0","5s":"0"}},"success":true}