{"scores":{"Fall '14":{"course_score":{"overall":"3.00","workload":"9.00","difficulty":null,"recommendation":"3.10","enrollment":"46","response rate":"89.13","QCourseOverall":{"number":"STAT 121","course_id":"11175","cat_num":"97597","1s":"5","2s":"6","3s":"19","4s":"6","5s":"5"},"QDifficulty":{"number":"STAT 121","course_id":"11175","cat_num":"97597","1s":"2","2s":"4","3s":"27","4s":"18","5s":"11"},"QWorkload":{"number":"STAT 121","course_id":"11175","cat_num":"97597","1s":"0","2s":"12","3s":"14","4s":"1","5s":"6"}},"instructor_scores":[{"number":"STAT 121","cat_num":"97597","course_id":"11175","year":"2014","term":"1","id":"4601e9030f00ad9a0ccc5a27d3073908","first":" Verena S","last":"Kaynig-Fittkau","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.10"},{"number":"STAT 121","cat_num":"97597","course_id":"11175","year":"2014","term":"1","id":"60c5662b12ec0618fbb5838ddf3b2d1c","first":" Rafael","last":"Irizarry","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"3.30","GeneratesEnthusiasm":"3.50","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"3.90"}]},"Fall '13":{"course_score":{"overall":"3.60","workload":"3.70","difficulty":"3.50","recommendation":"3.60","enrollment":"68","response rate":"95.59","QCourseOverall":{"number":"STAT 121","course_id":"11175","cat_num":"97597","1s":"5","2s":"6","3s":"19","4s":"6","5s":"5"},"QDifficulty":{"number":"STAT 121","course_id":"11175","cat_num":"97597","1s":"2","2s":"4","3s":"27","4s":"18","5s":"11"},"QWorkload":{"number":"STAT 121","course_id":"11175","cat_num":"97597","1s":"0","2s":"12","3s":"14","4s":"1","5s":"6"}},"instructor_scores":[{"number":"STAT 121","cat_num":"97597","course_id":"11175","year":"2013","term":"1","id":"48331742259037b9b8a17000234a8e7e","first":" Joseph K.","last":"Blitzstein","InstructorOverall":"3.90","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.10"},{"number":"STAT 121","cat_num":"97597","course_id":"11175","year":"2013","term":"1","id":"eb985b4d2726bc24a44af105688de784","first":" Hanspeter","last":"Pfister","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Fall '13":{"comments":["I would say that it's a cool class - the homework assignments are definitely cool.  It's not that time-intensive either, but it's not the most inspiring class.  It's basically structured exploration rather than an experience through which you learn something from a teacher.  You don't learn much math, but you do learn how to use packages without knowing what's going on under the hood.","Interesting problem sets, but lectures try to cover so much you end up learning very little from them","Data science is really cool, but this course hasn't really figured out the lectures yet.","I can see the course being really hard if you don't have any programming background--I had CS50 and the psets were quite time-consuming. When you consider that the class doesn't have mandatory section though, it's not too much work. The course was a really good way for me to learn the basics of Python (I had no experience with it) and the project was fun!","Finally, a class on data science. While the size can get annoying, it's still a unique opportunity to learn about a field that's becoming increasingly important.","Recommended to CS major students for introduction to statistical analysis","Tons of work, learned a lot of really usable methods.","Great intro to data science for those truly interested. Takes a ton of work to get through but it's a VERY rewarding experience. Be warned though, there is a lot of programming and having taken stat 110 is a must. If you're up for a challenge or are interested in data science, it's a really worthwhile experience.","This class goes through many useful concepts and models at an extremely shallow level. The homework is, in principle, very interesting but in practice holds your hand through anything requiring conceptual or deep thinking. You end up spending way more time configuring dumb packages or doing random visualizations than thinking about the Data Science process. All that said, the upsides are learning Python and the project, both of which will probably be very useful going forward.","It's a very good class but the assignments really walk you through too much so you don't always come away having learned a lot. The grading scale is also quite subjective and being out of 4 points can easily mess your entire grade up, especially with the final project","This class was hugely time-consuming and very challenging, especially since I had limited experience in coding in Python, but ultimately extremely rewarding. The skills I learned using Python, including using matplotlib, scipy, gephi, networkx, and other tools will definitely come in handy as I work with data as a biological researcher.","come ready to work.  the psets are no joke.","Since I already had experience with Python, I found the problem sets pretty interesting and not tedious but many people had varying experiences. That being said, the lectures were almost entirely non-essential for success on the psets and the lack of a midterm or any component other than the psets made it so class became even more useless to me. I did find the things I learned very useful but knowing Blitzstein I think future offerings of the class will continue to improve.","Great practice working with data. But you can easily learn all the material yourself.","I took this class without having taken CS50, so don't be intimidated by the requirement. I just knew a little bit of R and did very well in the class. You need to be willing to devote many hours to fixing bugs in your code, but the coding expected of you is really not that hard to learn. As for the Statistics... again, I feel Stat110 is more than you need. Most of what you need to know Joe will probably cover, and the problem sets spoon-feed you most of the statistics anyway. The key is really the final project where a lot of people tanked on the statistics requirement so make sure you get a partner who knows what they're doing if you feel shaky on the theory. I thought it was a fun class! I also took it with all my friends.","Terrible Class. Lectures are unfollowable and PSets are pointless.","Very time consuming problem sets that aren't necessarily hard.  Very interesting course material.","This is a great survey course to Data Science. It's a good introduction, but it will not go into much depth.","This class is nascent and unrefined - it shows us a variety of statistical methods rather than helping us learn when and how to use them.","This class was very interesting and provided a broad overview of data science.","be prepared to spend lots of time on the problem sets","This is a big survey class. Fairly unorganized on the first iteration, but I'll write that off to it being the first iteration. You learn a wide array of things, but because this is such an organic topic, you could very much learn the same through online tutorials. Surf datatau.com for a month and you'll probably build out a library of resources better than this class.","anything done in this class can be learned in 15 minutes by reading the f'in manual.","You will learn a lot of good skills for data mining and analysis, but you will pay with much more time any one class should reasonably take from your semester","There is a lot of potential for a course like this to be great, particularly with a professor like Blitzstein. Unfortunately, it fell short. The problem was that they didn't really teach anything. Sure, we would hear about a lot of data science and bayesian techniques in class, but we were taught neither the math behind them nor how to actually use them. The psets consist of making histograms in ipython and filling one-liners into prewritten functions. I can't think of a single thing that I actually learned.","I would not recommend this class in its current state. The course material is very interesting, so with a lot of work this could be a useful course.  Unfortunately, this semester it was disorganized, poorly structured, poorly taught, and incredibly time-consuming.","Do not take this class unless you have had some programming experience above CS50. The stats portions of the class were not particularly difficult, you should get by if you did really well in Stat 104. Labs and lectures were not useful to finishing the PSETs. Some of the TFs did not seem to know what was going on in the class; one of the TFs had the wrong answer when I went to his\/her office hour and wasted about an hour of my time. Note that the project is worth 50% of your grade, which means that you do not have to do that well on the psets. Hopefully the class will be better run in future years, but as it is, you have to be fairly self-reliant in order to do well in this class.","The amount of work is not outweighed by the amount learned.","Poor organization. Final project is weighted too highly","It was the first time, so I imagine the instructors are still working out the kinks, but the logistical mishaps and inefficiencies made the experience extremely unpleasant and outweighed the benefit I think I derived from the data science practice.","The class gives you an opportunity to delve into interesting topics, while also letting you figure out the programming along the way. If you're not comfortable with Python and are also not interested in putting in the time, then this course is not for you.","In many ways this class was a lot of fun; I learned how to scrape and clean data and some important methods of analyzing and visualizing data. I took the class primarily to learn statistics, but I feel I learned more computer science methods than anything else. Lectures aren't always very engaging, but the problem sets are interesting and involve very interesting analyses.","Take this class if you would like to know how to do cool things with data and how to program in Python.  This is more of a CS class than a Statistics class, and the lectures were not very exciting, but the problem sets were actually quite enjoyable."]},"Fall '14":{"comments":["It's always difficult to teach coding in a classroom. You learn by doing, and you have to make a lot of time for it. The assignments take forever -- the wording is confusing and there are lots of different ways to interpret the questions. The final project is a pain, especially the documentation part. It's all about having something presentable and pretty at the end and yet we don't receive any useful or helpful feedback.","All the lectures were done as powerpoints and hard to pay attention to. The first four problem sets were quite confusing, especially the fourth. The amount of confusion and questions on Piazza speaks to that fact. I didn't really get as much as I wanted out of this course.","Hard to follow lectures, though the problem sets can be fun and useful","Prefer forming teams with other non-extension students.","This class could be better organized, but the material is very relevant and important especially in a time where big data is so prominent.","This is a good course to get to know some python and how to use it to implement statistical and machine learning methods. You also get a good exposure to several topics (bayesian statistics, regression, map-reduce, clustering, SVM, random forests) but they are not covered very deeply. \n\nIt is a good course if you want to get a taste of different things to see which courses you want to take afterwards. If you want to get a deeper understanding of the topics, the course is definitely not enough.","I think this class has a ton of potential. The field of data science is incredibly interesting, and it is definitely becoming more and more relevant. This class, however, struggles to capture much of the excitement in data science. I'd  love to see more engaging lectures that talked about some of the awesome things data scientists do and how it affects industry, as well as some awesome case studies of how algorithms have been used. Additionally, the class doesn't go into the math behind machine learning algorithms, which I think is really important if we want to be applying them in this class. The psets can be tedious, and it feels like we're just playing around with Python pacakges until things work. I'd love to see a better framework developed for how we should approach difficult problems.","A great idea for a course, but the execution was botched. Lectures were snoozeworthy. Assignments (except for assignment 5) were poorly written and confusing, which means I spent hours combing through documentation and didn't really learn anything. The course itself wasn't that hard. Not CS-y enough for the CS people, not Stat-y enough for the Stat people.","I was really interested in data science when I took the class and wanted to learn some python, so in that since the class was useful, but goodness gracious the organization of this class was poor. Problem sets were all over the place and completely disregarding lectures to spend time swimming through the mess that was a problem set was definitely the way to go. For scientists, the instructors (or whoever wrote the problem sets) just had no grasp of what it meant to have clear instructions. They had their conception of what the answer should look like but did a very poor job of guiding us toward that with the framing of the question and examples. On Piazzas, TFs frequently sounded clueless despite their best efforts and that was discouraging. Take the class only if you really are interested in the material since the pain is not worth it otherwise.","This course was interesting, and it taught me some useful data science skills that I think I could apply to real projects. However, lecture was not very helpful.","There is nor reason this should be a class. It has zero content.","meh","it's a fun course. not too much work except for the bi-weekly panic sessions of, \"holy crap this pset is due tomorrow and i have no idea where to even begin.\" interesting stuff too, and i really do enjoy coding in python. thought it was pretty manageable if you have a decent CS background. watch out for the final project & getting saddled with a useless TF.","Take it if you want to get a survey in data science. It is not rigorous at all, but a good hands-on class the exposes you to many techniques.","It's very broad...I learned about lots of topics, but I'm not sure how to apply them to many other types of problems.","This class is essentially a glorified python tutorial. The psets suck if you start them the day before (like me!!!) but they're honestly not that difficult, particularly if you know python (unlike me), and they were every two weeks. My roommates also frequently forgot I was in this class because lecture is pointless and so all you really have to do is do a pset every two weeks.","Do not take this class!","For a sophomore or junior looking to fill a concentration requirement whike getting solid data analysis, python skills, it's great!","Sure, take this course but ONLY if Irizarry is gone. He might be the single worst professor at Harvard."]}},"mostRecentQ":{"overall":"3.00","workload":"9.00","difficulty":null,"recommendation":"3.10","enrollment":"46","response rate":"89.13","QCourseOverall":{"number":"STAT 121","course_id":"11175","cat_num":"97597","1s":"5","2s":"6","3s":"19","4s":"6","5s":"5"},"QDifficulty":{"number":"STAT 121","course_id":"11175","cat_num":"97597","1s":"2","2s":"4","3s":"27","4s":"18","5s":"11"},"QWorkload":{"number":"STAT 121","course_id":"11175","cat_num":"97597","1s":"0","2s":"12","3s":"14","4s":"1","5s":"6"}},"success":true}