{"scores":{"Spring '14":{"course_score":{"overall":"4.80","workload":"2.60","difficulty":"3.10","recommendation":"4.90","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"LITERATURE 151","course_id":"10684","cat_num":"68486","1s":"0","2s":"0","3s":"0","4s":"1","5s":"5"},"QDifficulty":{"number":"LITERATURE 151","course_id":"10684","cat_num":"68486","1s":"0","2s":"0","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"LITERATURE 151","course_id":"10684","cat_num":"68486","1s":"0","2s":"3","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"LITERATURE 151","cat_num":"68486","course_id":"10684","year":"2013","term":"2","id":"af94a2aee8164f3e3c63a2eb86b49aab","first":" Delia","last":"Ungureanu","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '14":{"comments":["This course transcended any that I have taken, and changed the way I view life, both real and imagined, forever. Go in with an open mind, an appreciation for beauty, and a willingness to engage with all the material. Prof Ungureanu lives what she teaches and will inspire you to do the same.","Professor Ungureanu is the most committed professor I've ever taken a class with at Harvard. She cares so, so much about her students and material and puts in an unbelievable amount of effort into her classes, her assignments, her extra materials, etc. You know how most lit classes require some kind of weekly blog post\/response paper that never is read or commented on by the professor? Delia would respond with consistent 800-1000 word (even going into the 2k range) responses to EACH BLOG POST EVERY WEEK. These advanced my knowledge of the material so much and made it seem like each seminar was twice as productive as a normal one since we were all so well-prepped on the material. Now, onto that material: dream literature is absolutely fascinating and the lenses\/vocabulary you'll learn in this class are applicable to a shocking amount of what you'll read in other classes. I constantly found myself this semester referencing our primary material and theoretical sources in other classes when a text mentioned a dream or used a dream device. Professor Ungureanu crafts an incredible reading list and syllabus and has an unbelievably deep and broad knowledge of literature she uses to supplement that syllabus in class. I'm constantly astounded by her memory, erudition, and insight. In short, don't don't miss out on this class--for the material of course but even more importantly for the caring, thoughtful, and brilliant professor.","Take this if you want to broaden your understanding of literary analysis with great texts that you may or may not have read before. Prof Ungureanu is awesome! Best class I've taken at Harvard.","This class is incredible. I know Delia will be offering other courses next year, but this is a must take if you are interested in world literature. You certainly have to speak up in class and be prepared, but the class itself will be incredible - especially because she shared with us both syllabi for next year and asked for our feedback. Don't be intimidated by the readings (most are excerpts) and a lot of the real analytical work will be done in class. Seriously, she is incredible. This class was truly a diamond in the rough."]}},"mostRecentQ":{"overall":"4.80","workload":"2.60","difficulty":"3.10","recommendation":"4.90","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"LITERATURE 151","course_id":"10684","cat_num":"68486","1s":"0","2s":"0","3s":"0","4s":"1","5s":"5"},"QDifficulty":{"number":"LITERATURE 151","course_id":"10684","cat_num":"68486","1s":"0","2s":"0","3s":"6","4s":"1","5s":"0"},"QWorkload":{"number":"LITERATURE 151","course_id":"10684","cat_num":"68486","1s":"0","2s":"3","3s":"4","4s":"0","5s":"0"}},"success":true}