{"scores":{"Spring '14":{"course_score":{"overall":"3.80","workload":"2.00","difficulty":"2.60","recommendation":"3.90","enrollment":"122","response rate":"76.23","QCourseOverall":{"number":"STAT 102","course_id":"11174","cat_num":"38791","1s":"2","2s":"4","3s":"26","4s":"39","5s":"21"},"QDifficulty":{"number":"STAT 102","course_id":"11174","cat_num":"38791","1s":"5","2s":"34","3s":"44","4s":"9","5s":"0"},"QWorkload":{"number":"STAT 102","course_id":"11174","cat_num":"38791","1s":"14","2s":"64","3s":"14","4s":"0","5s":"0"}},"instructor_scores":[{"number":"STAT 102","cat_num":"38791","course_id":"11174","year":"2013","term":"2","id":"cc725da1acbd0d09c6e62f4ee84f2aad","first":" David","last":"Harrington","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.70"}]}},"comments":{"Spring '14":{"comments":["Stat 102 covers less biology than I expected. It is an intro stats course with biology examples but don't expect any bioinformatics-type material. Gives you a great foundation for using R, which is a very helpful tool for research.","This is a good class if you're interested in very introductory statistics and their applications to biological research.  It also very nicely introduces the use of R if you have never used it before.","Lectures can be sort of dry, but Prof Harrington is clearly very knowledgeable in his field. If you want any chance of paying attention during lectures, do not take notes on your laptop. The first unit is review from basic math concepts but use the time to get the hang of R. GO TO AN R TUTORIAL SESSION. Helps so much. Also keep track of all the important formulas. Makes exam prep easier.","great intro to stat, esp if you've never had any stat before","The course is not difficult and has interesting components, but if you are looking for a challenge then a higher level stat course might be better","This course is great because it teaches the perfect mixture of theory and practical applications and about 80% of the time, you know how you can directly apply what you're learning to real life, which is really satisfying.","This is a good introductory statistics course, but if you have taken a statistics course before then you probably won't need this course.","A very painless course! Especially if you have a decent math background, this class is easy and moves relatively slowly. The assignments and exams (open notes!) are not bad, and some of the data is actually pretty interesting. Even though the lectures move somewhat slowly, Professor Harrington is pretty entertaining. Overall, a great way to knock out the premed stat req!","Stat 102 covered a variety of interesting biological examples and methods to analyze data. It was a great way to enter statistics if you are in biology. The problem sets were straight forward and explained clearly and exams and quizzes were open note, so the class was completely manageable if you attended class.","An intro statistics class with great instructors, dedicated TFs and assignments which prepare you well for exams. You will learn how to use many important tools in statistics.","The class was nice because it was specifically for medicine and science, but also did not have many practice problems, did things like give practice problems without answers, some TFs were better than others, and left students at times clueless about how to do problems on the problem set until the day they were due which was completely unfair to students who didn't have time that day to fix them.","If you are looking for a practical bio-statistics course, this isn't it. Although we used R (which was helpful), too much time was spent on covering the basics (slowly, too) and not teaching us when to use certain tests in certain circumstances.","This class is A MESS.  Granted, this was the first year it was taught, so things definitely need to be ironed out.  Prof Harrington was incredibly condescending... prefaced every important formula or lesson with \"well, this should really be intuitive...so I won't explain it...\" Lecture was such a waste of time.  Most of the time, the prof fiddled with R and played around with examples, without teaching ANYTHING.  Had to piece together all of the lessons using section and the lecture slides.  This was one of the most disorganized and unpleasant courses I have taken at Harvard.  Don't take this course until it gets tidied up.  If the exams hadn't been open notes, I would have died.","This course is very nice for pre-meds who need to fill a statistics requirement and is equally interesting\/educational for both those who have taken statistics before and those who have not. It's not particularly challenging, but I enjoyed it because it went through foundational concepts with interesting biological examples. Particularly in the case of pre-med reqs, there are some classes that I dread going to, but this one was never one of them.","You learn a lot especially with the amount of time you put into it, Definitely great biology applications, everything in this class is FAIR!!","Great course on statistics and medicine.","Maybe it's cause this class is in its infancy, but this class is very disorganized and unclear and the support network is very weak. I would recommend giving this class some time to figure itself out and maybe just take Stat104 since its more stable and organized. Also, too many overachieving stressed out pre-meds in this class.. Could potentially be a great class if it could be more organized and strengthen it's support network\/lectures\/assignments etc..","This class is generally really easy to handle","Easiest class ever.","This course is a great way to learn basic statistics and has the added bonus of learning R. The only problem is that if you are a graduate student, this is not the solution to the never ending quest to find a course that \"teaches you what you need to know\". You will still cover all of the basic things and will barely get to the tests that are most important for research. While this is advertised as a practical course, some of the material is not relevant, like probability.","This class is not very hard, though I expect this might change because this was the first year this course was offered. The professor is a quirky funny guy though it can be frustrating to learn from him because he takes a long time to explain unimportant things and then isn't so good at explaining the important or more complicated concepts. However the section leaders are great, there's a lot of support and good study material for the course, plus all assessments were open note. So a good stat course overall.","Good intro stats class. Cool because you get to learn the R programming language. Don't underestimate the time you should dedicate to it..........","Stat 102 was a great class.  Very doable if you pay attention to lecture. Not sure how the course will change going into the future, but from taking it this year, I'd highly recommend it.","If you're pre-med and have to take a stat class anyway, take this one.  It is very relevant to what you will be doing, and the final project (though be prepared to take your time on it) is super interesting and relevant, and makes you excited to know that you can do it.  However, BEWARE THE QUIZZES! They are set up to trick you.","Do not start psets the day they are due so that you can actually understand the material. Try going to multiple office hours so that you can have the material re-explained in order to make sure you are not just putting in commands but are actually understand the concepts behind them.","Material is made unappealing by slow pace of lectures.","Pretty painless way to get your math req. out of the way.  Dr. Harrington is great.","The subject matter is quite interesting and the teaching staff works really hard. This was the first time the class was thought so there were some kinks. Overall it was great experience.","Painless, useful course for learning statistics and completing a math gen ed.","Super easy. If you want a general overview of statistics, this is great. Won't go too in-depth, though. Really nice professor.","This is by far the best lecture course I have ever taken at Harvard. The material covered on problem sets, quizzes, and exams correspond perfectly with material covered in lecture. Lecture notes themselves are an invaluable resource, well-organized, comprehensive, and filled with appropriate examples, conceptual statements, R code, etc. Prof. Harrington is an excellent lecturer and equally helpful at office hours. \r\n\r\nThe first iteration of this course is not a true introduction to biostatistics, as the majority of the material is covered in AP\/IB Statistics, and there is not much treatment of intermediate\/advanced statistics, or statistics directly related to biological applications. That said, this may change in future.","Go to lecture, take notes, pay attention, and the psets will be a walk in the park.","Make use of the OpenIntro textbook online whenever you get confused.  The class starts out really easy but it does get harder--make sure you're paying attention when it does!  Don't be intimidated by the R portion of the class--for the most part learning the code is really simple.","It is a great class in which one learns a lot about statistical analysis and concepts.","If you've taken statistics in high school, you can skip this class.","This class is really great.  It was new this year, so they haven't quite perfected the organization and system, but the TFs and professor are always thinking of the students and their wants\/needs so it all works out really well.  This class is very focused on student success and learning which is nice, despite it being a larger class (about 200).","The class material is interesting, but I think they are still ironing out how to balance the class body, which seems to be half students with no stat background and half those with lab experience and prior AP stat coursework. If you're in the former, you're likely to struggle with the statistics, and if you're in the latter, you might be disappointed by how little new material you'll learn and how the \"biostatistics\" is not as emphasized as you'd hoped. \r\nI would still prefer this course to Stat 104, because the applications to health-related data and genetic screens is very interesting, and we learn to use R, which is more useful than Stata in the \"real world.\"\r\nThe open notes exams and the free online textbook, as well as the relaxed lecture format (Dr. Harrington's really cool) are a testament to how accessible statistics can be!","Teaching staff is not dedicated. (e.g. there are no practice tests). The course is new and still needs a couple rounds to get figured out. Take this if you're in some sort of real rush to get started with biology-related statistics, but if you're serious at all about it take 110.","This is a really great class for students interested in medicine, biology, and public health as it treats problems from each field. It is not very difficult but you learn a lot and you learn to use R which I thought is great. Prof Harrington is very supportive of students' learning and constantly adapts the course to student feedback.","The material seemed interesting and applicable, but not in-depth enough. I don't feel that I learned as much as I hoped I would.","You will learn a lot! Stat changes the way you think and look at data. And it makes sure you will not be intimidated by stat because it gives applicable examples. Very good course.","By tf.","This class is an excellent way to learn basic statistics, and it's a great way to learn those basic skills in a way that applies to biological data. I'd almost say that if you're planning on going into any part of the life sciences that would require reading scientific papers, you should take this class because although it won't (ever) thrill you, it will give you the ability to understand what the mathematical basis for claims in science is.","Stat is very interesting and it was nice to take it while dealing with applications I find interesting (disease instead of the economy, e.g.). Professor Harrington is a good teacher and great at office hours. However, the course still needs some organizational kinks worked out.","A fantastic course to take for pre-medical students who need to fulfill a Stats requirement. Offers very interesting material that is biologically relevant and far superior to the two other intro stats courses!","It is really great to finally have a biology-related statistics course! Prof. Harrington is really awesome and interacts really well with undergrads. Since this was the first time the course was run, he was also super open to feedback from us. I had never taken statistics before and enjoyed studying it from a biological perspective (usually a medical perspective, in this case). I felt like the pacing of some of the units was a bit off, but I'm sure Prof. Harrington will make adjustments next year. The problem sets were fairly easy and didn't take a ton of time for me (maybe 2.5 hours\/week). Instead of having two midterms, we had one midterm and 4 quizzes (and the lowest one was dropped), which was really great. The questions on the exams\/quizzes reflected problem sets pretty well, and section also provided extra practice problems to help solidify the different topics.","Very manageable course, but you also learn a ton.","This class is a wonderful way to be introduced to basic statistical principles! The examples are all drawn from medical topics, like birthweight, fertility rate, and calcium measurements, which makes the problems have a real-world feel. The psets, quizzes, and midterms are very doable, the professor is engaging, and you learn how to do a few basic codes in R. It's a wonderful combination.","Very useful class; you will learn statistical basics and to learn to use R, a free open source software. This class is a great alternative for those of us who aren't as interested in economics and more interested in biostatistics.","This is a great intro statistics course for anyone who is pre-med or life sciences oriented. There are  many statistical methods that overlap with LS1b which can be useful if taken at the same time. The course did not provide practice tests since it was the first time being offered but it shouldn't be an issue in future semesters. This class was also really easy because the intro stat classes by nature are very easy. I highly recommend this class to fulfill stats credits wherever they may be needed.","that it is a relatively easy introduction to basic statistics with reasonable expectations from the professor and TAs.","This class would be perfectly fine for someone who has not taken AP Statistics. Otherwise, it becomes a little bit too easy and honestly not a particularly good use of your time. Professor Harrington is fabulous and really caters to the struggling students in the class, so he'll take the time to spend half of lecture reviewing the previous lecture. This is good for those learning the material for the first time, but less so for someone coming from AP Statistics. Also, note that you do use R but not enough to really say you've learned much in it. The actual genetics components of the course are minimal.","Definitely worth taking if you haven't had experience with AP Stats or similar. Professor Harrington is a great teacher + definitely take advantage of his office hours - he is friendly + willing to help!","Make sure to write down blackboard notes that Professor Harrington puts up in class!","Professor Harrington is a homie. Class is really nicely paced and a light workload.","This course was pretty poorly taught overall. The grading is really subjective and kind of ridiculous. The problem sets take a decent amount of time, and they don't even grade every problem. If you're hoping to get an A, there are definitely safer bets than this course, as the teaching staff really doesn't seem to care about how well the students do. Some other major flaws: the tfs held two of the worst review sessions I've ever attended at Harvard (painfully bad and not helpful); clicker participation is worth 10% of your grade, but there are few clicker questions throughout the semester and many, many lectures with no clicker questions; the lecture slide handouts are hard to follow as they often say \"solution in class\" (I will never understand why the professor leaves out the most important equations from the lecture slides). Overall, the teaching staff is really lazy. They don't post all the solutions for the practice problems (which they don't release until a few days before the midterm and final) or the solutions for the section handouts, and they also don't give partial credit most of the time because it takes too much time to actually read through the answer than to just see if it matches the solution exactly. Oh, and good luck with multiple regression. There are no problem sets that cover multiple regression in depth, and no solutions posted for the practice problems for this topic (Why? Who knows!). Yet, it shows up on the final multiple times. Don't take this course unless you don't care about your grade or already have a lot of experience with statistics.","This class is a really good way to learn introductory statistics and apply the concepts to scientific contexts. You have to work hard, but the professors and TFs make the material straightforward and approachable.","This is a very interesting class, but it's not well put together. Though it came together at the end, a lot of the first few weeks were just a medley of random assignments with no clear goal. I hope the class improves. It has a lot of potential.","This is a pretty basic statistics class. If you took Stats in high school, you should consider taking the next level of stats because you probably won't find the class very engaging.","Everyone should take an introductory statistics class, and if you are interested in biology or medicine in the least bit you should take Stat 102! The applications are super relevant and interesting whether it be data about obesity across different income levels, genomic data (the Golub Paper) and the Hardy-Weinberg principle or testing the effectiveness of a new HIV drug.  The course was very enjoyable and Prof. Harrington was very knowledgeable and effective as a lecturer.","This is a great introduction course for statistics that is not too hard.","This class is great. Dave Harrington is excellent. The TFs were extraordinary, though I think many are graduating. It's got a few kinks to work out, being that it's a new course, but even with those, it was a fantastic course. I felt like I learned a lot and tend to think about statistics more in my day-to-day experiences, when it comes to scientific papers and data, etc. Couldn't recommend this class more highly.","Stat 102 is a good alternative to Stat 104 in terms of the context of the problems. However, most concentrations outside of the sciences do not accept 102. Think hard about this before you take this class.  104 will be taken for pre-med requirements also.","Recommend as an intro stat course for LS majors - much more interesting than STAT 104 would be.","Great intro to statistics and introduction to the R program. You learn not only the methods used, but why they are important and where they are applicable later on.","Take it in about 3 years after the kinks have been worked out!  Has a lot of potential but did not have the best experience this year.","Lots of potential, poor execution. The class spent too much time on easy material then rushed through the more difficult material at the end. The emphasis on biological examples was gimmicky rather than helpful, and time spent on them decreased the scope of statistical concepts covered which made the class less useful overall than I expected. In the future this class may improve but as it is I found it very disappointing.","Stat 102 is an easy stat class, not because the professor intentionally makes it but because it is introductory. However, it is still a really good intro to understanding how to analyze data dealing with biological studies. If taken seriously, you can get a lot out of it. The section component is not that helpful but it is not mandatory and Prof Harrington really does a good job at showing everything that needs to be known in lecture."]}},"mostRecentQ":{"overall":"3.80","workload":"2.00","difficulty":"2.60","recommendation":"3.90","enrollment":"122","response rate":"76.23","QCourseOverall":{"number":"STAT 102","course_id":"11174","cat_num":"38791","1s":"2","2s":"4","3s":"26","4s":"39","5s":"21"},"QDifficulty":{"number":"STAT 102","course_id":"11174","cat_num":"38791","1s":"5","2s":"34","3s":"44","4s":"9","5s":"0"},"QWorkload":{"number":"STAT 102","course_id":"11174","cat_num":"38791","1s":"14","2s":"64","3s":"14","4s":"0","5s":"0"}},"success":true}