{"scores":{"Spring '14":{"course_score":{"overall":"3.60","workload":"2.10","difficulty":"3.00","recommendation":"3.60","enrollment":"17","response rate":"82.35","QCourseOverall":{"number":"BE 191","course_id":"10727","cat_num":"30212","1s":"0","2s":"2","3s":"5","4s":"4","5s":"3"},"QDifficulty":{"number":"BE 191","course_id":"10727","cat_num":"30212","1s":"0","2s":"2","3s":"10","4s":"2","5s":"0"},"QWorkload":{"number":"BE 191","course_id":"10727","cat_num":"30212","1s":"2","2s":"10","3s":"1","4s":"1","5s":"0"}},"instructor_scores":[{"number":"BE 191","cat_num":"30212","course_id":"10727","year":"2013","term":"2","id":"743bb8e65fa07a2fbcaeed650126346d","first":" Jennifer","last":"Lewis","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.20","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"3.40","ReturnsAssignmentsinTimelyFashion":"3.60"}]}},"comments":{"Spring '14":{"comments":["I would tell future students not to be intimidated by how specific or difficult they think the subject matter is, because I think that it is manageable to learn and very interesting, even with minimal background.","Take this class if you want to understand the materials elements of biomedical and bio-engineering devices --- this class gives you a great description of how materials mimic biology, and what considerations you must have for an engineered system to function within the unique environment of the human body","For biomedical engineers, this course is much better than the alternative (ES190). It is a good introduction to biomaterials and Professor Lewis is a leading expert and really wants you to learn what she has to share.","Hopefully this class would contain a section component next year to review some of the most important points covered in lecture. Prof.Lewis covers a great deal of interesting material in her slides, but students are sometimes confused as to what is important for the homework and the exam. We had very little idea what was going to be on the final, and as there were no midterms prior to this exam, some sort of practice problems would have helped greatly. The final project was highly enjoyable. Overall, it is understandable that there would be some issues with the class since it is the first time it is offered, and I think the class has potential to be good later on.","This is a great course. Dr. Lewis is a great teacher and the material is very interesting.","I'm guessing the Q score from this semester won't be great BUT GIVE THE CLASS A CHANCE. This was professor Lewis' first class at Harvard so I'm sure she will take all the comments from this year to heart and make changes. Also, she is just a great person and makes the lectures enjoyable by being so personable. I learned quite a bit in the class and although it became frustrating at times I would recommend you at least try the class. In general, go to Prof Lewis' office hours to learn what is important (she is very effective outside of class in OH). Also, when you get big projects like the long lab report DO NOT wait to start it! It takes a long time but it's a very satisfying product having a professional lab report. Also the design project at the end of the year is great - it was the most in depth design project I've done and I got the chance to really learn a lot about something I care about. So, the class had issues but has HUGE potential and prof Lewis in wonderful.","take it if you are looking for not too much work, but don't expect interesting material.","A great introduction to materials (not *just* biomaterials) -- I'd recommend it over ES 190 (Materials Science and Engineering) because it covers the same material AND MORE. Prof. Lewis is a great instructor, very engaging and friendly, and the TFs (Ryan and Travis) did a great job explaining things in section, talking over graded homeworks and grading rationales, and getting labs to run smoothly."]}},"mostRecentQ":{"overall":"3.60","workload":"2.10","difficulty":"3.00","recommendation":"3.60","enrollment":"17","response rate":"82.35","QCourseOverall":{"number":"BE 191","course_id":"10727","cat_num":"30212","1s":"0","2s":"2","3s":"5","4s":"4","5s":"3"},"QDifficulty":{"number":"BE 191","course_id":"10727","cat_num":"30212","1s":"0","2s":"2","3s":"10","4s":"2","5s":"0"},"QWorkload":{"number":"BE 191","course_id":"10727","cat_num":"30212","1s":"2","2s":"10","3s":"1","4s":"1","5s":"0"}},"success":true}