{"scores":{"Spring '14":{"course_score":{"overall":"3.30","workload":"3.20","difficulty":"3.40","recommendation":"3.60","enrollment":"59","response rate":"81.36","QCourseOverall":{"number":"STAT 186","course_id":"11177","cat_num":"48805","1s":"3","2s":"4","3s":"21","4s":"15","5s":"5"},"QDifficulty":{"number":"STAT 186","course_id":"11177","cat_num":"48805","1s":"0","2s":"3","3s":"25","4s":"18","5s":"2"},"QWorkload":{"number":"STAT 186","course_id":"11177","cat_num":"48805","1s":"0","2s":"13","3s":"20","4s":"6","5s":"9"}}}},"comments":{"Spring '14":{"comments":["If Valeria is teaching this class again, ruun, ruuuuuuuun away. IT IS NOT WORTH IT. IT IS A WASTE OF YOUR TIME. I CRY WHEN I THINK FO ALL THE OTHER CLASSES I COULD HAVE TAKEN. I have never wasted $4000 in this way before.\r\n\r\nIf you must take this class for whatever reason (you don't, look at EC 1126, Stat 111 ANYTHING), but say you do. Either wait for the actual instructor to come back. If not, be prepared to teach yourself all the material (Rubin's book is fantastic, if convoluted) plus go to all sections and office hours. Nik and Viviana are the best people in the world.","This class is great. Valeria is a fantastic professor and she has tons of energy for the subject, which makes the class awesome! I would suggest that you have a background in coding and a decent  knowledge of R.","Really interesting class. The assignments were really long but you learn so much from them. I really enjoyed the assignments. The subject matter is really cool too. I would encourage anyone interested in doing any sort of quantitative research to take this class. The biggest downside to this class would be the lectures. I felt like the lectures were a little boring, which made it hard to engage.","While the course material is interesting and useful, do not expect to learn a lot about it from lecture, but rather through sections and assignments.","Stat 186 is a good class overall. The assignments are long, so do start early.","After taking this course, I decided to switch my concentration to Statistics.  This course has the perfect balance between theory and practice, and I think it is one of the most interesting classes I have taken at Harvard.  Caveat though, the lectures are not really worth it.  You'd be better off reading the book and going to section and then struggle through the psets.","The class material is pretty interesting, as a lot of it is from fairly recent discoveries. Valeria was a great teacher who taught us the material very well, and problem sets were constructed so that we got the most out of the material. Definitely be sure to have some coding background coming in to the class as you'll be spending a lot of time doing R.","Stat 186 is your chance to learn how researchers approach data to try and infer causation. If you're interested in applied research (econ\/sociology\/public health\/etc), take this class. You'll learn several basic but powerful techniques for dealing with randomized experiments, observational studies, and more. Psets are due every two weeks, and the middle ones (#2-4) take a while to complete. The work can be challenging - lectures focus on theoretical topics, so you'll have to be ready to figure out how to actually implement the procedures you talk about. Valeria and the TFs are very willing to offer guidance if you ask.","Stat 186 was a great course to fulfill the econometrics requirement for Am\/Ec and get out of actually taking econometrics. I loved that I got to learn R and work with actual data and that the class was completely project based. You come out of this course feeling like you learned so much and that all the work was worth it. Projects are every other week-and as long as you start them super early and go to office hours and section you will be fine. But be warned, projects can sometimes take up to 15-20 hours, especially if you have never used R before. I took this course after Stat 110, and preferred it infinitely to Stat 110-so much more applicable! Overall, take it, it's a gem of a stats class.","This is a very applied stats class. It was fun to be given a data set and asked to analyze it concretely. I didn't know how to code in R at all before taking this class, so there were 2 problem sets that were extremely hard, but once you get the hang of it (you have to go to office hours to get R help!!) the rest were okay. Viviana (a TF) was a lifesaver - she's great. The fact that problem sets are due every two weeks is so much better than every week.","The material you learn is useful, but I wasn't sure if I learned anything past the second week of class.   In the current iteration of the course lecture is not worth going to and assignments are not that great, often the problem is one of not knowing the right R methods. If a revamp happens take it, otherwise pass.","Make sure you're comfortable with coding before taking the class. The psets can take quite a long time.","Highly recommend it. I see research questions very differently after taking this course. Plus the teaching staff were so dedicated, and always approachable.","it's really unique","If you're AM\/Ec and considering this class or Stat 111, it really depends on what you want from your class. This class is great because there's only one quiz at the beginning of the semester and the psets are only every other week. So you can essentially not go to class after the quiz and just suffer for 1-2 nights before the psets are due. Also, there's no final exam and the final project is not too bad--it was worth the same percent of the grade as a pset and can be done in 1-2 (difficult) days. Allegedly, 111 teaches you more theory and is more mathy while this class is a bit more practical, and 111 has weekly psets as well as a midterm and final. This semester, there were some really enthusiastic grad students in the class but otherwise there was not much enthusiasm and attendance at lecture was sparse...but again, you don't necessarily need to go. Since the homework assignments are worth a lot of your grade and only happen every other week, they are very long and tend to require a lot of R, so hopefully you're at least familiar with\/have taken a class requiring R--it will make the homework go a lot faster.","This is a really good way to deal with the Applied Math\/Ec econometrics requirement. It's not super difficult, though it may not be quite as applicable to you as the normal econometrics class that ec concentrators take. Lectures can be a bit dull, but they are informative. The problem sets also contain a lot of information within themselves.","Overall Stat 186 is a good class, although you definitely need to be aware that this class will be very time-demanding, and that you NEED to have some knowledge of programming, especially in R. \r\n\r\nKnowing R when you come into the class vs. just knowing a little coding and expecting to learn R over the first few weeks of class as you do the assignments could quite possibly be the difference between getting an A and an A- (or B+ vs B, etc) in this class, as the first coding assignment is conceptually challenging, and becomes extremely difficult when you don't know how to code in R. It takes about 2 coding assignments to become fully proficient in R, by which time that's 30% of your entire grade already decided. Basically you're otherwise at a huge disadvantage to everyone else who knows R coming into the course.\r\n\r\nIn the end, the material itself isn't difficult as the TF's hold fantastic sections that explain the material well, and tbh the learning curve is only steep for the first two assignments, so this is definitely a manageable class, just expect it to be your main commitment course-wise for this semester, if you want to get a good grade. This course is very much about putting in the effort to understand the intricacies of the course material, so that you are able to apply it to data sets and justify why you did so in each assignment.","This course has no exams (other than a short quiz). But the assignments can be tedious and involve a lot of coding -- it definitely helps to be familiar with R. The material is sometimes interesting but is often presented in a very dry way. Difficult but not too heavy a workload.","This class is not too difficult as long as you pay attention in section and start your problem sets relatively early. Problem sets are due every other week and take awhile even if they are not difficult. I definitely recommend this class because the TF's (Nik and Viviana) are great at explaining the relevance of the material to real life\/real research.","Beware. Know some R beforehand as there is no guidance given apart from a one hour intro session which isn't enough. There aren't enough office hours to get doubts cleared. Expectations in assignments are often unclear and points are taken off by the dozen for not addressing something that you may not know was asked for. Lecture was unhelpful as were the slides. Support in the course was minimal and so was feedback. If you're taking it, find a pset group, answers should contain specific terminology they are looking for. Course material itself was interesting, but I was very unhappy in the course.","The material is a bit dry and perhaps not presented as well as it could have been. Valeria tries to make the lecture slides as uninformative as possible in order to make you come to lecture, but then the writing on the board is so illegibly small.","This is one of the worst classes I've taken at Harvard. Actually the worst. I know it's Valeria's first time actually teaching this course (TFed it before), but she's mediocre at best. She cares a lot, and while I sympathize, it's hard to excuse the plainly bad teaching. I often questioned whether she actually knew what she was talking about; it seemed like she just made up answers sometimes to students' questions. If she's teaching it when you're reading this, I highly recommend against taking this course.\r\n\r\nOverall, the psets are very long (biweekly though). They're certainly frustrating because there's a lot of R code. If you don't have a solid background in R, beware! They sort of help you in section, but lecture doesn't talk about nearly anything relevant to the psets.\r\n\r\nThe quiz is super easy, but don't be misled by the first 2 weeks of the class; it quickly gets much more intensive. The project was decent and somewhat interesting, but similar to the psets, there's hardly any guidance on that.\r\n\r\nI've taken many quantitative classes here that have been great in different ways. This class is not one of them. Be warned.","You are expected to have some statistics background. You are also expected to know some R programming. You should be prepared to learn the course materials by yourself. The instructor's lectures (presentation skills)  are not good.","Awesome material and definitely doable for someone without a strong stats background. The assignments are challenging and time-consuming but really helps you learn the material.","This is one of the best courses that I have taken at Harvard. The material is very interesting and presented in an understandable manner. The teaching staff (especially Professor Espinosa) are all extremely patient and helpful. Unlike other classes where exams are impossible, every single assignment in this course was manageable. The assignments do take a fair amount of time depending on your coding strength, but they were never unreasonably long. You are also given ~2 weeks for each assignment, so there really is more than enough time. I would recommend this course to everyone (and actually have!).","The teaching\/topics are great, but the grading (at least for this semester) did not seem to reflect understanding.","This class was interesting and useful, and it should improve over the next years when Valeria has more experience teaching it.  The concepts taught in the class are both theoretical and practical.  The psets are long but they are assigned bi-weekly so you are given more time to think about them.","Start the assignments by saturday at the latest and go to office hours to clarify what the questions are asking. It;s a really interesting class and subject, and it's very useful, but it's not the best taught class."]}},"mostRecentQ":{"overall":"3.30","workload":"3.20","difficulty":"3.40","recommendation":"3.60","enrollment":"59","response rate":"81.36","QCourseOverall":{"number":"STAT 186","course_id":"11177","cat_num":"48805","1s":"3","2s":"4","3s":"21","4s":"15","5s":"5"},"QDifficulty":{"number":"STAT 186","course_id":"11177","cat_num":"48805","1s":"0","2s":"3","3s":"25","4s":"18","5s":"2"},"QWorkload":{"number":"STAT 186","course_id":"11177","cat_num":"48805","1s":"0","2s":"13","3s":"20","4s":"6","5s":"9"}},"success":true}