{"scores":{"Spring '14":{"course_score":{"overall":"4.60","workload":"1.60","difficulty":"3.20","recommendation":"4.30","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"ECON 980z","course_id":"10718","cat_num":"95127","1s":"0","2s":"0","3s":"0","4s":"4","5s":"6"},"QDifficulty":{"number":"ECON 980z","course_id":"10718","cat_num":"95127","1s":"0","2s":"0","3s":"8","4s":"2","5s":"0"},"QWorkload":{"number":"ECON 980z","course_id":"10718","cat_num":"95127","1s":"4","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 980z","cat_num":"95127","course_id":"10718","year":"2013","term":"2","id":"cbdbd4fb4281b19b89852fbc0d4c7025","first":" Martin S.","last":"Feldstein","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '14":{"comments":["This course is one of those courses that you can only take at Harvard. Professor Feldstein is a legend in the field of public economics, and has authored some of the most important literature over the past few decades related to tax and budget policy. His experience in the Reagan administration is very valuable, as he can combine practical insights with theory. The course is structured such that he lectures the first half of the semester, and then students present their papers each week for the latter half. Your grade is essentially based on your paper, but the paper isn't too bad, and they are very flexible with topics and style of writing. Paper topics included the corporate tax rate, social security reform, and capital flows. Max (the TF) was very helpful and accessible, and Feldstein meets with everyone who wants to to discuss the paper. Note that this course is heavily lotteried, and is typically only open to junior economics concentrators. Overall, excellent class; would highly recommend it.","Not everyone likes the topic.  In fact, I'd venture to say that most people find tax and budget policy to be rather dull.  But getting to study under a professor like Feldstein in such a small setting is not an opportunity you want to pass up.","Very cool opportunity to take a seminar with Professor Feldstein.","This is a great class if you are at all interested in tax & budget policy, and want to learn from one of the foremost economists involved in that sphere. Stay ahead of the ball with regards to the research paper as, other than a paper proposal & in-class presentation, there are no deadlines until the final submission. It is to your advantage to get ahead early so that you can maximize time with both Professor Feldstein and Max, who are fantastic resources and always willing to help.","It's a great class that discusses a lot of pertinent issues. If you're at all interested in tax and budget policy, take this class! Having Prof. Feldstein in a 15-person seminar is an experience you really can't get anywhere else.","There is no better way to learn about the subject than in an intimate small group setting with one of the dominant faces of economics in the 20th century. This class significantly improved my understanding of policy economics.","This is a great opportunity to work with an expert in economics and explore a topic that you find interesting. The class is also really educational, and you can learn a lot about how to explore economic questions and conduct research projects. However, you should make sure that you really care about tax and budget policy, and that you are ready for a class with just one project and no deadlines\/ways to keep you accountable for your readings, etc.","This course seemed like a smaller and more targeted version of Ec1420 (American Economic Policy). As a result, we got a lot of interaction with a fantastic professor and are able to study the material that is most interesting to you and the rest of the class with a selection of papers and Op Eds on the material. Both Professor Feldstein and our TF were helpful in working on our final project, and if you reached out to them, gave feedback along the way. The only suggestion I would make is that we didnt have any formal writing assignment other than the final paper (and its proposal), so it was a bit difficult to judge the quality of our work beforehand. Definitely would recommend if you are wondering whether to write a thesis."]}},"mostRecentQ":{"overall":"4.60","workload":"1.60","difficulty":"3.20","recommendation":"4.30","enrollment":"15","response rate":"66.67","QCourseOverall":{"number":"ECON 980z","course_id":"10718","cat_num":"95127","1s":"0","2s":"0","3s":"0","4s":"4","5s":"6"},"QDifficulty":{"number":"ECON 980z","course_id":"10718","cat_num":"95127","1s":"0","2s":"0","3s":"8","4s":"2","5s":"0"},"QWorkload":{"number":"ECON 980z","course_id":"10718","cat_num":"95127","1s":"4","2s":"6","3s":"0","4s":"0","5s":"0"}},"success":true}