{"scores":{"Fall '13":{"course_score":{"overall":"4.10","workload":"1.60","difficulty":"2.20","recommendation":"4.20","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"GOV 1430","course_id":"10893","cat_num":"68912","1s":"0","2s":"0","3s":"3","4s":"5","5s":"4"},"QDifficulty":{"number":"GOV 1430","course_id":"10893","cat_num":"68912","1s":"1","2s":"7","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1430","course_id":"10893","cat_num":"68912","1s":"5","2s":"7","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 1430","cat_num":"68912","course_id":"10893","year":"2013","term":"1","id":"763adf2ec6fdea2e4cdffc119b661c7f","first":" Latanya","last":"Sweeney","InstructorOverall":"4.08","EffectiveLecturesorPresentations":"3.92","AccessibleOutsideClass":"4.08","GeneratesEnthusiasm":"4.75","FacilitatesDiscussionEncouragesParticipation":"4.36","GivesUsefulFeedback":"2.00","ReturnsAssignmentsinTimelyFashion":"1.55"}]}},"comments":{"Fall '13":{"comments":["This class is exceptional. The content is all fascinating, the teaching is exquisite, and the workload is manageable. This class gives you room to follow whatever path you want, so long as it fits in the general framework. This class is an excellent way to expand into the CS realm while still focusing on Gov.","This class is extremely unorganized. It was interesting in spurts - Professor Sweeney's lectures were boring and seemed like they didn't have a clear point, but most of the guest speakers and labs were good. The real highlight, though, was learning from the others in the class, which included graduate students and people with amazing real-life experiences to contribute. My final project was less ambitious and fun than it could've been because Professor Sweeney promised me essential materials and then took weeks to deliver them. Similarly, she loses a lot of emails and never returned most of our graded assignments. This class is a nice elective\/gov class because the workload is light (no homework except for biweekly labs, which are a lot of work), but beware the disorganization\/potential frustration.","Professor Sweeney is incredible, brilliant, and interesting.  You learn about topical issues and think about ways to solve them.  Completely and totally worth your time.","The material is interesting and Professor Sweeney is one of the coolest professors I have met.","This class is incredibly fun and cool, but be aware that it is poorly organized.","How many classes let you fly quadcopters around campus or ask you to hunt for Social Security numbers online? Only one, and this class is it. It's a Gov class, but don't let that fool you into thinking you'll just be reading and writing. How many Gov classes give you the opportunity to write code? You should take this class instead of CS 105.","This course was pretty interesting. Professor Sweeney is quite knowledgeable and brings in a variety of interesting guest speakers. Labs were practical and provided an interesting take on the material.","Take the time and effort to find a final project, and be sure to rely on Prof. Sweeney's great enthusiasm, resources, and connections in making it happen.","This class is really cool and interesting, but it has its limitations in this trial run at Harvard. Professor Sweeney's incredible experience plus breadth and depth of knowledge made the material and discussion consistently interesting; guest lecturers added a lot of expertise and perspective as well. Everything here is certainly relevant to everyone and is a good intro to topics in privacy and policy. On the flip side, though, expectations were consistently unclear or unrealistic, with some labs taking many hours and others hardly any time at all, and due dates shifting around or being announced last minute. There's also virtually no feedback, so no way to know your grade or how you're doing in the class. All in all it was a worthwhile and fun experience, though not without its shortcomings. Take it to get to know the awesome Professor Sweeney as well as hear from some truly fascinating guest speakers, and to benefit from regularly discussing these eminently relevant topics with gifted peers, grad students, and professionals in the field."]}},"mostRecentQ":{"overall":"4.10","workload":"1.60","difficulty":"2.20","recommendation":"4.20","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"GOV 1430","course_id":"10893","cat_num":"68912","1s":"0","2s":"0","3s":"3","4s":"5","5s":"4"},"QDifficulty":{"number":"GOV 1430","course_id":"10893","cat_num":"68912","1s":"1","2s":"7","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1430","course_id":"10893","cat_num":"68912","1s":"5","2s":"7","3s":"0","4s":"0","5s":"0"}},"success":true}