{"scores":{"Fall '13":{"course_score":{"overall":"4.30","workload":"2.00","difficulty":"2.40","recommendation":"4.50","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"GOV 2430","course_id":"10901","cat_num":"28112","1s":"0","2s":"0","3s":"2","4s":"2","5s":"5"},"QDifficulty":{"number":"GOV 2430","course_id":"10901","cat_num":"28112","1s":"0","2s":"6","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 2430","course_id":"10901","cat_num":"28112","1s":"0","2s":"10","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 2430","cat_num":"28112","course_id":"10901","year":"2013","term":"1","id":"763adf2ec6fdea2e4cdffc119b661c7f","first":" Latanya","last":"Sweeney","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"2.50","ReturnsAssignmentsinTimelyFashion":"2.00"}]}},"comments":{"Fall '13":{"comments":["Prof Sweeney is very engaging, and the topics are typically very interesting.  The course is not difficult but I think you will learn a decent bit about data science.  I recommend tackling reasonably tough projects so that you maximize your own learning- the course is very flexible, but that also means the assignments are what you choose to make of them.  Learn something new and experiment with new software in getting your projects done.","I'm a CS concentrator. I'm used to programming algorithms and learning theories. This is partially a CS class, but in a different way. It will honestly change how you view the applications of programming. You get to approach protest data in interesting ways. Prepare to discuss how tech can work with law surveillance. Research papers by the end of this will be piece of cake to you. The final project is the best and Sweeney is always easily accessible. There was little feedback during the semester since she was teaching 3 courses without help from TF. However, this doesn't seem like it will be the case in the future. Sweeney honestly makes this class amazing: I only went to 3 hours of class a week, 2 hours for this course is time well spent.","This is a wonderful class for people who want to try their hand at a data science in a relaxed setting. It's easy, with only a few small assignments throughout the year, but it will definitely give you a chance to create some cool projects using data. However, Professor Sweeney may be taking a leave of absence, so tread carefully.","This is a really fun course and Professor Sweeney is a great professor. I would highly recommend taking this class if you like working on real problems rather than pointless problem sets.","The Professor is great and brings a lot to the table due to her tremendous real-world experience. It's a very hands-on, applied, discussion-oriented course","Professor Sweeney is a wonderful and fascinating person, with incredibly interdisciplinary interests. Really take advantage of her office hours! The course was very unstructured and sudden changes in schedule (due to her teaching 3 classes...) could occur, but the rest of the course was what you make of it. (She'll be on leave for the next semester at least, but if possible in the future, I highly recommend taking a class with her and getting to know her.)","Professor Sweeney is awesome! She really cares about her students and makes herself very available for office hours and random chat. This course also gives you a lot of latitude to pursue projects of your own interests. The more effort you put in, the more you get out of it."]}},"mostRecentQ":{"overall":"4.30","workload":"2.00","difficulty":"2.40","recommendation":"4.50","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"GOV 2430","course_id":"10901","cat_num":"28112","1s":"0","2s":"0","3s":"2","4s":"2","5s":"5"},"QDifficulty":{"number":"GOV 2430","course_id":"10901","cat_num":"28112","1s":"0","2s":"6","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 2430","course_id":"10901","cat_num":"28112","1s":"0","2s":"10","3s":"0","4s":"0","5s":"0"}},"success":true}