{"scores":{"Fall '13":{"course_score":{"overall":"3.40","workload":"1.40","difficulty":"2.50","recommendation":"3.90","enrollment":"28","response rate":"96.43","QCourseOverall":{"number":"PSY 1007","course_id":"11328","cat_num":"91486","1s":"0","2s":"5","3s":"10","4s":"8","5s":"4"},"QDifficulty":{"number":"PSY 1007","course_id":"11328","cat_num":"91486","1s":"2","2s":"10","3s":"15","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1007","course_id":"11328","cat_num":"91486","1s":"15","2s":"12","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1007","cat_num":"91486","course_id":"11328","year":"2013","term":"1","id":"4ed65f15f44ef43f044c37d0b84cda35","first":" Allison Elizabeth","last":"Seitchik","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"3.80"}]}},"comments":{"Fall '13":{"comments":["If you enjoy discussions around sports this is a great class to take. It was really interesting the role of psychology has on athletes. I would recommend this class if these things interest you. There is a lot of writing but most of it you were open to write about subjects that interest you.","This course was not what I expected it to be. Lecture and assignments were dry at point. Course was more of a broad overview of topics. With a course restructuring it could be an incredible course. Basically were given a topic, a study to back it up and a book definition.","This is a great opportunity for you to learn about sports in a new way!","THe class was very interesting (especially if you are an athlete because it is so applicable) and the professor was really fantastic.  Having been her first class, I feel as though her next go around will be much smoother and a must take.","This is an AWESOME class and Professor Seitchik does a great job keeping it interesting and filled with thought-provoking topics, discussions and activities!","Know that the final paper will be graded much harder.","This course is a great introduction to sport psychology.  The information is extremely interesting and applicable in real life, especially in sports.  Professor Seitchik is awesome and makes the class fun.","Easy course.  Easy material that can be fun, but also sometimes common-knowledge type stuff.  Really great if you are an athlete.","This class definitely did not fulfill my expectations. The material was very common sense at times and there were days where Seitchik's lectures were painfully boring. After reading Gary Mack's \"Mind Gym,\" I was expecting a class that presented case studies about athletes and teams and could really benefit me as an athlete, but I cannot say that this class did those things. This class is not difficult, but don't expect to get very much out of it.","This class kind of throws you off grading wise. It went from really easy grading to pretty tough grading but then we ended up getting points back at the end, so I got a good grade overall. If you need a psych course with a relatively low work load I'd recommend this class. Also, a lot of the things are pretty relevant for athletes.","If you are an athlete this class is really great for learning how to maximize your own performance.  That being said, it is not an easy class just because athletes take it.  The assignments are interesting and the material is great.","This class is a gem, especially if you are really into athletics. I found the material very interesting and the work load was pretty minimal. If you are a psych concentrator, I recommend taking this class.","Definitely take this class! Super interesting material, and really applicable if you are an athlete!","Not as philosophical as one might guess... but LOTS of concrete info to memorize","It is a very easy course if you follow what's expected of you. The exams are straightforward, no tricking. However, the lectures sometimes can get long and boring","May be more interesting for non-athletes albeit less applicable","know the findings of the assigned studies"]}},"mostRecentQ":{"overall":"3.40","workload":"1.40","difficulty":"2.50","recommendation":"3.90","enrollment":"28","response rate":"96.43","QCourseOverall":{"number":"PSY 1007","course_id":"11328","cat_num":"91486","1s":"0","2s":"5","3s":"10","4s":"8","5s":"4"},"QDifficulty":{"number":"PSY 1007","course_id":"11328","cat_num":"91486","1s":"2","2s":"10","3s":"15","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1007","course_id":"11328","cat_num":"91486","1s":"15","2s":"12","3s":"0","4s":"0","5s":"0"}},"success":true}