{"scores":{"Spring '14":{"course_score":{"overall":"3.60","workload":"2.00","difficulty":"2.60","recommendation":"3.60","enrollment":"13","response rate":"76.92","QCourseOverall":{"number":"AFRAMER 196x","course_id":"11289","cat_num":"71091","1s":"0","2s":"0","3s":"5","4s":"4","5s":"1"},"QDifficulty":{"number":"AFRAMER 196x","course_id":"11289","cat_num":"71091","1s":"0","2s":"4","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"AFRAMER 196x","course_id":"11289","cat_num":"71091","1s":"2","2s":"6","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"AFRAMER 196x","cat_num":"71091","course_id":"11289","year":"2013","term":"2","id":"c6ff37ed5a7ccc49f7ba6d4311cd5d5c","first":" Patrick","last":"Vinck","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"3.10","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"2.20"}]}},"comments":{"Spring '14":{"comments":["The material is really interesting, and Patrick Vinck has a lot of fascinating experience to share.","It is a very interesting course but it does demand a lot of research time.","This is a great class to delve into the history and development data on a country. If you approach the material critically, you'll be well prepared to take on the work. Assignments are really fair, and if you put in the effort, you'll get a lot out of the class. It's a broad survey of development, so don't expect to get really deep into any of the data - the point of this class is to be an introduction to some major trends and types of information in the development world.","Be prepared for heavy coursework towards the end of the semester, and to be able to use resources not taught in class for your assignments.","Vinck does interesting work and knows a lot but falls short in communicating course materials and expectations to the class in a timely manner. He needs be more clear with the students from the beginning about: a) the expectations for the assignments b) the due dates of the assignments c) the course readings. He would sometimes send out course readings the night before class. He would also not post assignments and then not communicate with students about postponing the due date. He also did not specify the scope of assignments  at the beginning of the course (it was not clear that the response papers would be 6 pages of writing plus data and that the country case study would be a 20 page research paper). The response papers and the case study took a lot of time and effort to do well, though I did learn a lot by doing them. The lectures varied--some were interesting, but often the tended too far into the theoretical without being grounded in case studies to be particularly useful. In some cases, response papers were not returned with feedback until after the next one was due, which is entirely unhelpful for improving the work.\r\n\r\nThat said, I've learned some interesting things, but not nearly as much as I had hoped. This course might improve, but I'm not optimistic.","This is a good course that suffers from a lack of organization. The material is engaging and the workload manageable if you stay on top of the short papers. You get to choose a country to focus on, which allows you to apply what you are learning from the readings to an actual situation. Vinck is very knowledgeable and makes the two hour seminar worthwhile. On the whole, a very enjoyable, straightforward course that simply needs a bit more organization.","Class is pretty dry, but assignments provide good practice using indicators"]}},"mostRecentQ":{"overall":"3.60","workload":"2.00","difficulty":"2.60","recommendation":"3.60","enrollment":"13","response rate":"76.92","QCourseOverall":{"number":"AFRAMER 196x","course_id":"11289","cat_num":"71091","1s":"0","2s":"0","3s":"5","4s":"4","5s":"1"},"QDifficulty":{"number":"AFRAMER 196x","course_id":"11289","cat_num":"71091","1s":"0","2s":"4","3s":"6","4s":"0","5s":"0"},"QWorkload":{"number":"AFRAMER 196x","course_id":"11289","cat_num":"71091","1s":"2","2s":"6","3s":"2","4s":"0","5s":"0"}},"success":true}