{"scores":{"Spring '14":{"course_score":{"overall":"3.70","workload":"2.20","difficulty":"2.90","recommendation":"4.10","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"EXPOS 20.236","course_id":"11312","cat_num":"24829","1s":"1","2s":"0","3s":"3","4s":"6","5s":"2"},"QDifficulty":{"number":"EXPOS 20.236","course_id":"11312","cat_num":"24829","1s":"0","2s":"3","3s":"7","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.236","course_id":"11312","cat_num":"24829","1s":"2","2s":"7","3s":"2","4s":"1","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.236","cat_num":"24829","course_id":"11312","year":"2013","term":"2","id":"8ba1304ec8e49fe4b02b8fd8598f93d9","first":" Janling L.","last":"Fu","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"2.90"}]}},"comments":{"Spring '14":{"comments":["Take it if you like discussing about archeology and nationalism.","This is a great course that makes you think about issues that you probably wouldn't have normally encountered.","Just know this class is meant to be hard. Don't worry about your grade and try to learn what you can.","This class is very engaging and Janling is an awesome professor! I really enjoyed grappling with all of the moral issues in the course and would highly recommend it to future students. The class may not have helped so much with the technical aspect of writing, but it certainly did help a lot with the writing process and making papers engaging.","It introduced a whole different topic that I would have otherwise not experienced!","This expos was a great way to think about different issues relating to archaeology and was fascinating no matter your experience with the subject. It was a really enjoyable expos experience.","I would tell future students that sometimes the readings are a bit dry, but that they are usually not very long and everything that is a required reading is beneficial for that essay. There is no busy work in the course, all of the work you do has a purpose. Janling is a great teacher and is relaxed as well as very helpful.","Light reading, and interesting discussion, but I don't think my writing improved.","Definitely a great Expos to take!","This expository writing class is probably one of the most interesting ones you could find. Janling is very knowledgable about the topic and brings in a wide range of issues. Janling facilitates wonderful discussions that allow you to explore possible paper topics in every class.","It's really interesting material to learn about! I liked learning about the history of archaeology and the politics surrounding it; it's not something I would have reached out to learn myself. This course actually inspired me to look further into history courses at Harvard!"]}},"mostRecentQ":{"overall":"3.70","workload":"2.20","difficulty":"2.90","recommendation":"4.10","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"EXPOS 20.236","course_id":"11312","cat_num":"24829","1s":"1","2s":"0","3s":"3","4s":"6","5s":"2"},"QDifficulty":{"number":"EXPOS 20.236","course_id":"11312","cat_num":"24829","1s":"0","2s":"3","3s":"7","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.236","course_id":"11312","cat_num":"24829","1s":"2","2s":"7","3s":"2","4s":"1","5s":"0"}},"success":true}