{"scores":{"Fall '14":{"course_score":{"overall":"4.90","workload":"2.50","difficulty":null,"recommendation":"4.90","enrollment":"21","response rate":"71.43","QCourseOverall":{"number":"MUSIC 15hfr","course_id":"11324","cat_num":"38516","1s":"0","2s":"0","3s":"1","4s":"0","5s":"14"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 15hfr","course_id":"11324","cat_num":"38516","1s":"8","2s":"4","3s":"0","4s":"0","5s":"0"}}}},"comments":{"Fall '14":{"comments":["Glee club is awesome!","The Glee Club is an amazing family.","Being enrolled in the course hasn't changed my HGC experience at all, except that it will almost undoubtedly open up room for me to take a three-course semester sometime later, which will be very helpful if I write a thesis.  Joining the Glee Club last year is the best extracurricular decision I've made so far in college.","The Harvard Glee Club is a wonderful opportunity; it is the club I am the most happy about joining since freshman fall. It is a great social group, but with the purpose of making music. The abundance of wonderful performances makes the work in rehearsals all worth it. If you want to make music with others, it's a golden opportunity.","I highly recommend joining Glee Club. We welcome singers of all backgrounds, we have a great sense of community, and we produce beautiful music. You'll make lots of friends and learn music for free. All you need to join Glee Club is the courage to audition and the ability to sing in tune -- Glee Club will take care of the rest. If you're a weak sight-singer\/music-reader, Glee Club will pair you with someone more experienced on the seating chart, which allows you to follow along with your part. Warnings: it's a significant commitment of 4 hours (for Glee Club itself) and 8 hours (including Glee Club Lite, the a cappella subset of Glee Club).","Glee Club is awesome! We sing great music.","Do HGC!","Put in practice time outside of class. It really does benefit the entire Glee Club.","Glee Club is a lot of fun!  Even if you do not have the most singing\/musical experience in the world, I recommend you audition.  I have improved so much as a singer and musician, and it was one of the best decisions I made as a freshman this year."]}},"mostRecentQ":{"overall":"4.90","workload":"2.50","difficulty":null,"recommendation":"4.90","enrollment":"21","response rate":"71.43","QCourseOverall":{"number":"MUSIC 15hfr","course_id":"11324","cat_num":"38516","1s":"0","2s":"0","3s":"1","4s":"0","5s":"14"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"MUSIC 15hfr","course_id":"11324","cat_num":"38516","1s":"8","2s":"4","3s":"0","4s":"0","5s":"0"}},"success":true}