{"scores":{"Spring '14":{"course_score":{"overall":"4.60","workload":"3.00","difficulty":"3.60","recommendation":"4.60","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"COMPSCI 260r","course_id":"11418","cat_num":"49684","1s":"0","2s":"0","3s":"1","4s":"2","5s":"6"},"QDifficulty":{"number":"COMPSCI 260r","course_id":"11418","cat_num":"49684","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"COMPSCI 260r","course_id":"11418","cat_num":"49684","1s":"0","2s":"3","3s":"3","4s":"3","5s":"0"}},"instructor_scores":[{"number":"COMPSCI 260r","cat_num":"49684","course_id":"11418","year":"2013","term":"2","id":"cdf8bf39a49c70d6218dd80cd27b715b","first":" Eddie","last":"Kohler","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '14":{"comments":["The discussions in this class were some of the best I've ever had and resulted in a deep understanding and appreciation of distributed systems with a focus on distributed consensus algorithms. A brilliant mixture of people made for great conversation and Eddie did ignited topics and kept us on track.","This class is a lot of work, both in reading and coding. Do not attempt to bullshit your way through it or give high-level, hand-wavy answers. Both will fail. Also, just do what Eddie says, even if you disagree. It's not worth the fight.","Eddie is an excellent instructor and brings both incredible enthusiasm and well-thought out lectures.","Best class I've ever taken. Actually, so great (unfortunately, who knows if it will be the same course\/professor next year). We read all the big papers in distributed systems, and Eddie really makes you understand them (I went to the second class having only skimmed the papers, and definitely realized that simply wouldn't cut it).\r\n\r\nThe coding is cool too (yep, we code up Paxos) and pretty hard. Recommend thinking about the design of the system a fair amount instead of just jumping into coding like we did.\r\n\r\nEddie also is a great brainstormer and will help you come up with great ideas to make something awesome for your final project and just plain learn a lot.\r\n\r\nAlso it is a pretty serious\/hard course so get ready ;)","If Eddie's teaching this class, take it!!","Prof. Kohler is very enthusiastic and has a great sense of humor. Both of these are contagious. He is also one of the few professors who writes a ton of code and is very very good at it. He is the main reason to take this course. \r\n\r\nDon't be afraid of reading research papers; part of the point of taking this class is to learn critical reading of dense papers. The topic will change in the future, but you can expect a significant amount of programming, probably in teams. This is a good class to begin learning about \"real\" software engineering (collaboration, testing, bug fixing, building on existing libraries, evolving code and adding new undesigned-for features). Fun!"]}},"mostRecentQ":{"overall":"4.60","workload":"3.00","difficulty":"3.60","recommendation":"4.60","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"COMPSCI 260r","course_id":"11418","cat_num":"49684","1s":"0","2s":"0","3s":"1","4s":"2","5s":"6"},"QDifficulty":{"number":"COMPSCI 260r","course_id":"11418","cat_num":"49684","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"COMPSCI 260r","course_id":"11418","cat_num":"49684","1s":"0","2s":"3","3s":"3","4s":"3","5s":"0"}},"success":true}