{"scores":{"Spring '14":{"course_score":{"overall":"3.20","workload":"1.90","difficulty":"3.70","recommendation":"3.00","enrollment":"26","response rate":"73.08","QCourseOverall":{"number":"GOV 1096","course_id":"11360","cat_num":"47232","1s":"0","2s":"4","3s":"10","4s":"2","5s":"3"},"QDifficulty":{"number":"GOV 1096","course_id":"11360","cat_num":"47232","1s":"0","2s":"1","3s":"7","4s":"7","5s":"4"},"QWorkload":{"number":"GOV 1096","course_id":"11360","cat_num":"47232","1s":"4","2s":"13","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 1096","cat_num":"47232","course_id":"11360","year":"2013","term":"2","id":"364131a5f409e74f89a4ac6f8b2547e3","first":" Roberto","last":"Unger","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"3.20","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"1.80","ReturnsAssignmentsinTimelyFashion":"2.20"}]}},"comments":{"Spring '14":{"comments":["The class will make you think deeply and shape your vision of the world around you.  However, be prepared: Professor Unger is very \"out there\" and the entire class is based around his vision of the world.  He will tinker with some ways that you think, but at the same time it can sometimes be hard to relate with some things that he is saying and it is VERY easy to get lost in his web of ideas.  Sections help to untangle what he is saying, and I would recommend everyone take one class with him during their time at Harvard, but just do be prepared for the complexity and abstractness of his ideas.","Learning from Prof. Unger in a class like this is definitely a very cool experience -- this class would be recommended with enthusiasm if that successfully structure it more towards undergrads in the future, but the way it stands, take caution before making your decision: the class is 100% one paper you write at the end of the semester, and not much guidance is provided along the way.","Lectures get repetitive. Sections are not well organized. There are better legal theory classes. Not a class for jurisprudence.","Make sure you want this, hope that Unger provides a bit more structure","Unger is not for everybody. His lecture style is polemic his ideas radical. But if you are engaged just from the first lecture that you shop, I would strongly recommend taking this course. If legal theory is not your thing, taking any of his other classes would be strongly recommended simply for the new ideas being said.","Course is a difficult one to follow along with but the one assignment per term was nice"]}},"mostRecentQ":{"overall":"3.20","workload":"1.90","difficulty":"3.70","recommendation":"3.00","enrollment":"26","response rate":"73.08","QCourseOverall":{"number":"GOV 1096","course_id":"11360","cat_num":"47232","1s":"0","2s":"4","3s":"10","4s":"2","5s":"3"},"QDifficulty":{"number":"GOV 1096","course_id":"11360","cat_num":"47232","1s":"0","2s":"1","3s":"7","4s":"7","5s":"4"},"QWorkload":{"number":"GOV 1096","course_id":"11360","cat_num":"47232","1s":"4","2s":"13","3s":"2","4s":"0","5s":"0"}},"success":true}