{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"2.60","difficulty":"3.30","recommendation":"4.10","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.239","course_id":"11351","cat_num":"91768","1s":"0","2s":"0","3s":"1","4s":"9","5s":"4"},"QDifficulty":{"number":"EXPOS 20.239","course_id":"11351","cat_num":"91768","1s":"0","2s":"0","3s":"10","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.239","course_id":"11351","cat_num":"91768","1s":"0","2s":"6","3s":"8","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.239","cat_num":"91768","course_id":"11351","year":"2013","term":"2","id":"e86fa9b7a27ce6cb2d91b233a53ec583","first":" Christina Kim","last":"Becker","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"3.50"}]}},"comments":{"Spring '14":{"comments":["This class involves some abstract and complex thinking, but, coming from someone who is concentrating in science, everything is very do-able. The preceptor, Christina Becker, is fantastic and gives a lot of help with essays whenever you need her. To me, this was an enjoyable Expos class.","I really enjoyed the readings and discussions in this class. However, there is a lot of close readings that are time consuming so one has to be certain that they are willing to spend time on the readings.","if you like wolff or hemingway take it","The material is excellent, and Dr. Becker is amazing. No expos class is perfect, but this one is pretty good.","Dr. Becker is very supportive and provides lots of great feedback. A great class to improve your writing!","If you want to read a few good classics while you're getting your expos requirement out of the way, take this course: the books you read are great.","It's a significant amount of work, especially for an expos class. However, the work is interesting and the grading is very fair. Dr. Becker gives awesome feedback and really takes the time to help you better articulate your ideas. Take this expos if you either have a real passion for literature, or like me, want an awesome opportunity to explore the humanities and learn how to deeply analyze literature.","I feel that students must be enthusiastic about both Woolf and Hemingway in order to fully participate in discussions and dedicate their time to the essays and revisions.","I really enjoyed this course overall, but it was definitely a lot of work. I think it was certainly one of the hardest Expos courses with the most reading, but I got a lot out of it in the end, and I'm really glad that I took it.","If you are a solid writer with respect to literary analysis, I recommend taking another Expos 20 class in a subject matter that you do not feel as comfortable. Dr. Becker is great and the material is well chosen, but it sometimes felt like a preliminary writing course (which it is). If you want an English class, take one. Don't rely on this course to fulfill your desire to fully analyze texts. If you are not as confident in your literary analysis, take this class! You will learn so much, and Dr. Becker is a wonderful teacher."]}},"mostRecentQ":{"overall":"4.20","workload":"2.60","difficulty":"3.30","recommendation":"4.10","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.239","course_id":"11351","cat_num":"91768","1s":"0","2s":"0","3s":"1","4s":"9","5s":"4"},"QDifficulty":{"number":"EXPOS 20.239","course_id":"11351","cat_num":"91768","1s":"0","2s":"0","3s":"10","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.239","course_id":"11351","cat_num":"91768","1s":"0","2s":"6","3s":"8","4s":"0","5s":"0"}},"success":true}