{"scores":{"Spring '14":{"course_score":{"overall":"3.90","workload":"1.70","difficulty":"2.60","recommendation":"4.40","enrollment":"19","response rate":"73.68","QCourseOverall":{"number":"CHEM 110","course_id":"11342","cat_num":"49486","1s":"0","2s":"0","3s":"3","4s":"7","5s":"2"},"QDifficulty":{"number":"CHEM 110","course_id":"11342","cat_num":"49486","1s":"0","2s":"6","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"CHEM 110","course_id":"11342","cat_num":"49486","1s":"5","2s":"8","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CHEM 110","cat_num":"49486","course_id":"11342","year":"2013","term":"2","id":"a5ac356b0c5cb0c617ff15308b6cf533","first":" Matthew","last":"Shair","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"4.10"}]}},"comments":{"Spring '14":{"comments":["If you like organic chemistry and are interested in how small molecules interact with and modulate complex biological systems, this course is for you. The lectures and section readings feature cutting-edge research and will leave you with a greater understanding of the future of small molecule drugs and probes.","This is a great class!  Really covers the cutting edge in chemistry and chemical biology research with a medically relevant leaning.  Especially great for those interested in drug discovery\/medical applications of chemistry.","Great course for students interested in small-molecule centered chemical biology","The material from this course overlaps significantly with that from Chem 170. The course would have been more valuable without having taken 170 the semester before.","One of the best Chem classes at Harvard I have seen so far! The content covered is very interesting and contemporary, you learn a lot of what is going on in research at the moment AND what might be in a couple of years. The workload is managable overall, but be prepared to have literally nothing to do for the class over the entire semester but work exclusively on your final project for 1-2 weeks at the end of the semester.","I strongly encourage this class for anybody who has settled themselves into organic chemsitry. This course will likely teach you to stretch your knowledge and learn to apply it in a biological context.","The class was a laid-back yet very detailed survey of the different ways that scientists can study biological systems with small molecules.","You learned something new and interesting every lecture."]}},"mostRecentQ":{"overall":"3.90","workload":"1.70","difficulty":"2.60","recommendation":"4.40","enrollment":"19","response rate":"73.68","QCourseOverall":{"number":"CHEM 110","course_id":"11342","cat_num":"49486","1s":"0","2s":"0","3s":"3","4s":"7","5s":"2"},"QDifficulty":{"number":"CHEM 110","course_id":"11342","cat_num":"49486","1s":"0","2s":"6","3s":"7","4s":"1","5s":"0"},"QWorkload":{"number":"CHEM 110","course_id":"11342","cat_num":"49486","1s":"5","2s":"8","3s":"1","4s":"0","5s":"0"}},"success":true}