{"scores":{"Spring '14":{"course_score":{"overall":"4.10","workload":"2.70","difficulty":"3.50","recommendation":"4.20","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"EXPOS 20.243","course_id":"11355","cat_num":"37993","1s":"0","2s":"1","3s":"2","4s":"5","5s":"5"},"QDifficulty":{"number":"EXPOS 20.243","course_id":"11355","cat_num":"37993","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"EXPOS 20.243","course_id":"11355","cat_num":"37993","1s":"0","2s":"6","3s":"5","4s":"2","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.243","cat_num":"37993","course_id":"11355","year":"2013","term":"2","id":"d72a6188e7beff62fa317866c2584991","first":" Jerusha","last":"Achterberg","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.90","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.10"}]}},"comments":{"Spring '14":{"comments":["TAKE IT. Jerusha is a topnotch preceptor, the class is easy and enjoyable if you do the work and she is ALWAYS open to talk to and get to know.","I found Expos to be much less rewarding than others have claimed it to be, possibly because I don't think my writing has improved enormously and my future pursuits will require minimal writing anyway. That said, Expos is required, and if you enjoy public health, this class is likely one of the least painful ways to fulfill the requirement.","Jerusha is a great preceptor.  She expects a lot of you, but that is true for all Expos, and that is probably the best way to make you work and to get something out of Expos.  There were a lot of readings, but they were mostly helpful.  The subject matter is scientific, but you are always welcome to take different approaches to it - philosophical, economic, etc. Make sure to participate in class and take advantage of office hours! Jerusha is very accessible, which is not true of all preceptors.","If you are wanting to take a class that is focused on analysis of public health publications and do scientific writing, this may be a good chance to do that on an introductory level. If you are more used to, and continue doing more literary analysis than scientific writing, this course may be less helpful.","This expos section is awesome. The readings are mostly research papers, but they are not particularly terse and are very interesting. I always tell my friends that if I were in a dentist's office and one of the assigned readings were on the table, then i would pick them up and read them - they are just interesting ones!","This class is definitely for people who like public health policy\/ethical reasoning papers. Be prepared to spend a lot of time revising and rewriting between the draft and final paper.","Definitely one of the more interesting Expos classes out there. You have a lot of freedom in terms of the direction you take your paper, and you get to choose your topic entirely for the third\/final paper. Jerusha works hard on providing meaningful feedback, and you'll learn a lot if you invest time in the course.","This class was easily the best expos experience I could have imagined. Jerusha is a fantastic preceptor and person, and is always available to help. She gives really constructive and helpful feedback, which will help your writing improve tremendously. The written assignments were very fair, but take note of when homework assignments are due (as it may be difficult to keep up with). I would highly recommend taking this course, but it may be helpful to only take it if you are interested in public health.","Paradox in Public Health is not just a public health course. It is applicable to ethics, philosophy, business, government, economics, human rights, law, and social studies. You are given a lot of ownership as to how you want to address topics and utilize information which makes the class incredibly easy to tailor to your interests. I found this made the class a lot of fun!"]}},"mostRecentQ":{"overall":"4.10","workload":"2.70","difficulty":"3.50","recommendation":"4.20","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"EXPOS 20.243","course_id":"11355","cat_num":"37993","1s":"0","2s":"1","3s":"2","4s":"5","5s":"5"},"QDifficulty":{"number":"EXPOS 20.243","course_id":"11355","cat_num":"37993","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"EXPOS 20.243","course_id":"11355","cat_num":"37993","1s":"0","2s":"6","3s":"5","4s":"2","5s":"0"}},"success":true}