{"scores":{"Spring '14":{"course_score":{"overall":"3.60","workload":"2.40","difficulty":"3.60","recommendation":"3.90","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.244","course_id":"11356","cat_num":"89896","1s":"0","2s":"2","3s":"4","4s":"5","5s":"3"},"QDifficulty":{"number":"EXPOS 20.244","course_id":"11356","cat_num":"89896","1s":"0","2s":"0","3s":"7","4s":"6","5s":"1"},"QWorkload":{"number":"EXPOS 20.244","course_id":"11356","cat_num":"89896","1s":"2","2s":"7","3s":"4","4s":"0","5s":"1"}},"instructor_scores":[{"number":"EXPOS 20.244","cat_num":"89896","course_id":"11356","year":"2013","term":"2","id":"d72a6188e7beff62fa317866c2584991","first":" Jerusha","last":"Achterberg","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.30"}]}},"comments":{"Spring '14":{"comments":["This Expos class is not for the faint of heart, though you will be glad you took it at the end of the semester. Jerusha provides feedback that while helpful, makes for extensive revisions. Unlike some other Expos classes, Jerusha doesn't provide any extensions, but this makes for great conferences and peer review because everyone has their entire draft ready to go. Don't expect to learn a lot of public health, as you will study 3 topics, and then one of your choosing.","If you're interested in public health, take this class. There aren't too many readings, and we only had one writing assignment outside of the three required papers. I enjoyed the class discussions and actually learned a lot about public health and how to improve my writing.","Take this course if you are ready to spend all your time working on it. But it is rewarding - you learn a lot.","The topics explored in this class are very current and interesting. Even if you're not interested in biology or public health, Jerusha portrays the topics of this class in a way that everyone feels involved and affected by them. She does a good job of choosing daily-life issues to discuss and research in depth. Her style of teaching is also superb; she's very approachable, friendly, and knowledgeable. Moreover, she has structured the conference\/workshop aspects of the class to be very effective and efficient in feedback. You will leave class after a workshop or conference knowing exactly what you did wrong, how to fix it, and how to avoid it next time even if your paper wasn't the one being workshopped.","One of the best exposes. The framework is unfortunate, but Jerusha does her best to make it valuable.","This class is a decent expos class.  It was challenging and the pace was fast, but this ended up being good in the long run since we were finished with the class before reading period started.  I can't say that I enjoyed the class, in fact I really didn't like it at all, but that was because of the heavy writing component of the class, and not because of the class material or preceptor.","Fairly manageable class if you schedule yourself out and stick to it. Sometimes it seemed that the sources were baiting you to one particular \"side\" of the debate (especially in Unit 1), but I think the course is not too bad. It's Expos so it's hard to generate any interest in students. To that end, Jerusha does a great job though.","it was an interesting expos class with a topic that I had not previously known much about; the writing style is more scientifically oriented which was a plus for me; the instructor was helpful, consistent, and conscientious about providing feedback and returning work\/papers","It seems like one of the harder Exposes and you should be interested in science if you take it.","I've heard from some peers that they did not enjoy the topic of \"public health\". I personally enjoyed this topic very much. So how much you enjoy this class very much depends on whether you like the topic."]}},"mostRecentQ":{"overall":"3.60","workload":"2.40","difficulty":"3.60","recommendation":"3.90","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.244","course_id":"11356","cat_num":"89896","1s":"0","2s":"2","3s":"4","4s":"5","5s":"3"},"QDifficulty":{"number":"EXPOS 20.244","course_id":"11356","cat_num":"89896","1s":"0","2s":"0","3s":"7","4s":"6","5s":"1"},"QWorkload":{"number":"EXPOS 20.244","course_id":"11356","cat_num":"89896","1s":"2","2s":"7","3s":"4","4s":"0","5s":"1"}},"success":true}