{"scores":{"Fall '14":{"course_score":{"overall":"5.00","workload":"5.50","difficulty":null,"recommendation":"4.00","enrollment":"2","response rate":"100.00","QCourseOverall":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"0","2s":"0","3s":"0","4s":"0","5s":"1"},"QDifficulty":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"0","2s":"1","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 2661r","cat_num":"63561","course_id":"11382","year":"2014","term":"1","id":"60dcc53d0f44dd5ebc27a241cff1674e","first":" Amy J. C.","last":"Cuddy","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"2.00","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '14":{"course_score":{"overall":"5.00","workload":"2.00","difficulty":"1.50","recommendation":"5.00","enrollment":"3","response rate":"66.67","QCourseOverall":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"0","2s":"0","3s":"0","4s":"0","5s":"1"},"QDifficulty":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"0","2s":"1","3s":"1","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"3.80","workload":"2.50","difficulty":"2.20","recommendation":"4.20","enrollment":"4","response rate":"100.00","QCourseOverall":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"0","2s":"0","3s":"0","4s":"0","5s":"1"},"QDifficulty":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"0","2s":"1","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Fall '13":{"comments":["Amy Cuddy is brilliant, and her lab staff is great. This is a great lab course to take if you're interested in the material, you want to work with (slash under) a famous researcher on of the minute research, and you want a lab course that won't be too much time or effort. Keep in mind, though, that you will not get to work with Cuddy much. She's in the twice monthly lab meetings, but other than that I never see her. But that could just be me.","Take this class if you think you'll be able to make most of the lab meetings. The research is interesting, but you'll likely be doing classic RA grunt work. The best part of the class were the lab meetings with Amy, talking about her research ideas, and actually seeing life as a behavioral scientist.","If you are interested in power posing, nonverbal behavior and social psychology in general, you should consider applying to work in Professor Cuddy's lab! The RA:s are all very well organized and I got to work on multiple projects within the lab and learn a lot about different research tools."]},"Spring '14":{"comments":["If you're going to work in a lab, this should be the one. The work I did was interesting and tailored to my specific interests; the workload is very low; and working with Nico and Professor Cuddy is a pleasure. They both care A LOT about what they're studying and about the students that work with them, and although you probably won't get a ton of face time with Cuddy, the lab meetings every other week are surprisingly laid back, and I got the feeling that had I made the effort to get more personal interaction with her, I could have.\r\n\r\nThis is a real opportunity to work with a leading researcher in the field of psychology. Professor Cuddy is extremely well-known in the world of psych (TED talk!), and the opportunity to work in a lab with someone like her is rare. It's nice to feel like when you give an opinion in the lab meetings, she genuinely considers it. If you have the chance, take it! You will not regret it!"]},"Fall '14":{"comments":["This a great opportunity to get a sense of what behavioral psychology research looks like, especially at the business school. Amy Cuddy is a rockstar in her field and you get to interact with her and all the other interesting lab members at lab meetings, and there are various projects to get involved in. Keep in mind, however, that because Amy is such a powerhouse and is so busy, you probably won't get too much personal mentorship if that's what you're looking for.","There was a lot of reshuffling happening this semester so I didn't do too much and did not have too much contact with Professor Cuddy. However the lab manager that I worked with was excellent and cared a lot. When I did have to do things they were interesting and engaging."]}},"mostRecentQ":{"overall":"5.00","workload":"5.50","difficulty":null,"recommendation":"4.00","enrollment":"2","response rate":"100.00","QCourseOverall":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"0","2s":"0","3s":"0","4s":"0","5s":"1"},"QDifficulty":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"1","2s":"1","3s":"0","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 2661r","course_id":"11382","cat_num":"63561","1s":"0","2s":"1","3s":"1","4s":"0","5s":"0"}},"success":true}