{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"1.20","difficulty":"2.20","recommendation":"4.50","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"FRSEMR 46k","course_id":"11447","cat_num":"19962","1s":"1","2s":"0","3s":"2","4s":"2","5s":"7"},"QDifficulty":{"number":"FRSEMR 46k","course_id":"11447","cat_num":"19962","1s":"2","2s":"6","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 46k","course_id":"11447","cat_num":"19962","1s":"9","2s":"3","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 46k","cat_num":"19962","course_id":"11447","year":"2013","term":"2","id":"1b46ccef1c5d4b39274e44cedd8d1e5d","first":" Jessica E.","last":"Stern","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"3.20","ReturnsAssignmentsinTimelyFashion":"3.50"},{"number":"FRSEMR 46k","cat_num":"19962","course_id":"11447","year":"2013","term":"2","id":"d761d6de7c2a4bc2f2ceba66bb657882","first":" Ronald","last":"Schouten","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"2.70","ReturnsAssignmentsinTimelyFashion":"3.00"}]}},"comments":{"Spring '14":{"comments":["You will not find a better seminar.","One of the best freshman seminars on campus. You won't regret signing up!","This class is great if you are interested in terrorism, violence, American foreign politics, international relations etc. The professors are really smart and interesting, but occasionally they spend most of the class talking to each other rather than facilitating discussion. However they are really accessible and both clearly experts in their fields.","The professors are incredible and know so much about the subject matter. If you are at all interested in government or national security issues, this is a fantastic seminar.","This is an excellent freshman seminar with stimulating discussion amongst the TWO esteemed professors and the students in the class. Interesting material in a constantly evolving field","It's really interesting and both Dr. Stern and Dr. Schouten are extremely knowledgable. Just be prepared to do a lot of reading (all of which is worthwhile).","This class is really amazing. The professors bring amazing experience and insight to the topic, and I looked forward to hearing all of the interesting stories and anecdotes that they supplemented the reading with every week. Be sure to do the readings, or at least skim them because it makes discussion so much more interesting. We went on some really cool field trips and a lot of current material was synthesized with our coursework. All in all, it was a great experience and I highly recommend it.","This is more about psychology than it is about terrorism.","this is a great class! This class will teach you about terorism, its history, its complexities and its nuances. highlights included our field trip to the FBI counterterrorism unit as well as watching Dr. Stern and Dr. Schouten have such great chemistry!","If you are interested in terrorism, this is a great seminar for the readings. However, overall, the course got boring after the third week because there was not much of an environment of conversations\/discussion that you typically expect in a freshman seminar. Also, unlike other freshman seminars, the professors do not lend to an environment where everyone is close to each other. Also, there are too many readings. Overall, I liked the material and would never have learned about terrorism. Note that this was their first semester teaching the course and they are improving for future semesters."]}},"mostRecentQ":{"overall":"4.20","workload":"1.20","difficulty":"2.20","recommendation":"4.50","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"FRSEMR 46k","course_id":"11447","cat_num":"19962","1s":"1","2s":"0","3s":"2","4s":"2","5s":"7"},"QDifficulty":{"number":"FRSEMR 46k","course_id":"11447","cat_num":"19962","1s":"2","2s":"6","3s":"4","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 46k","course_id":"11447","cat_num":"19962","1s":"9","2s":"3","3s":"0","4s":"0","5s":"0"}},"success":true}