{"scores":{"Spring '14":{"course_score":{"overall":"3.70","workload":"2.10","difficulty":"3.30","recommendation":"4.10","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.245","course_id":"11480","cat_num":"31391","1s":"1","2s":"1","3s":"1","4s":"9","5s":"2"},"QDifficulty":{"number":"EXPOS 20.245","course_id":"11480","cat_num":"31391","1s":"0","2s":"0","3s":"10","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.245","course_id":"11480","cat_num":"31391","1s":"0","2s":"13","3s":"1","4s":"0","5s":"0"}}}},"comments":{"Spring '14":{"comments":["Interesting readings that are also easy to talk about even if you just read the title. Yascha is a great teacher and provides honest and concrete feedback.","Great material covered--I really enjoyed writing about this topic.","This is a great expository class for students who just want an interesting topic. Everyone in my class enjoyed the topic because it was very applicable to today. Writing about it was also fairly enjoyable because of the current debates that are occurring over digital democracy.","interesting topic, bad preceptor. although the topic is pretty relevant and interesting, the preceptor (Yascha) is a grad student who is new to teaching expos and is still working on his own writing.","Since this was the first time teaching the class there were roadbumps early on.  The class improved by the end of the year, and I have hopes that this will be a good class in a few more semesters.  It is very lacking on any sources besides boring 20 page texts.  Yascha will help improve your writing but only take this class if you actually like the material.  I mean it is no sports and the law but it isn't nearly as bad as body in art","This is an excellent class for intended Gov concentrators, there is a lot of overlap with Gov 20. It's great way to both fulfill your Expos requirement and take a Gov related course.","This course is probably one of the most painless Expos courses available, with little focus on readings and relatively fewer pages of reading overall.  However, it still requires a lot of work to get an A (as it does in all Expos courses).","If you've ever been suspicious or wondered about the true role that social media is playing in social movements and democracy, then this is absolutely the class for you! You'll get to dig deeply into political theory and factual evidence, and you come out learning something concrete about the changing world you live in today.","this class is extremely interesting because it is so relevant to our modern day. Not only do you get to read about other people's ideas when it comes to democracy in the digital age, but you ultimately use everything you learn to formulate your own proposal.","This class will teach you to approach democracy itself in a new manner, and its subject matter is fresh and relevant to current affairs."]}},"mostRecentQ":{"overall":"3.70","workload":"2.10","difficulty":"3.30","recommendation":"4.10","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"EXPOS 20.245","course_id":"11480","cat_num":"31391","1s":"1","2s":"1","3s":"1","4s":"9","5s":"2"},"QDifficulty":{"number":"EXPOS 20.245","course_id":"11480","cat_num":"31391","1s":"0","2s":"0","3s":"10","4s":"4","5s":"0"},"QWorkload":{"number":"EXPOS 20.245","course_id":"11480","cat_num":"31391","1s":"0","2s":"13","3s":"1","4s":"0","5s":"0"}},"success":true}