{"scores":{"Spring '14":{"course_score":{"overall":"3.60","workload":"1.90","difficulty":"3.20","recommendation":"3.90","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"EXPOS 20.249","course_id":"11499","cat_num":"36066","1s":"0","2s":"0","3s":"7","4s":"4","5s":"2"},"QDifficulty":{"number":"EXPOS 20.249","course_id":"11499","cat_num":"36066","1s":"0","2s":"0","3s":"11","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.249","course_id":"11499","cat_num":"36066","1s":"4","2s":"6","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"EXPOS 20.249","cat_num":"36066","course_id":"11499","year":"2013","term":"2","id":"3c64e27e7baf5b79d775c07dd3bd2d00","first":" Lindsay","last":"Mitchell","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"3.60","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Spring '14":{"comments":["Take it","The problems with this class are really just problems with Expos in general. They succeed in weaning you off of the 5 paragraph essay. Sure, your papers will still be formulaic and bland-- but they damn sure won't be 5 paragraphs.","I would tell future students that this is among the best Expos 20 courses available. The material is fascinating and actually interesting, and therefore make the course overall more enjoyable.","This Expos class was great! I was dreading Expos but Lindsay made it fun! The course material is interesting and Lindsay gave great feedback. Definitely try to get this course!","American Criminals was a relatively fun class with minimal work beyond the three papers. For the first paper, you get to choose one out of three short stories to closely read and write about.  For the second paper, you compare a murder mystery fiction novel to its film adaptation.  For the third paper, you independently research a crime in your hometown.  For each paper there are two short response papers that help you to start your draft. In class we usually work in small groups or have relaxed class-wide discussions. Lindsay has a dry sense of humor and you can usually get a good laugh during the discussions.  Overall, expos exposed me to a painful writing process, but I'm glad I had the fun knowledge of American Criminals to reduce the pain as much as possible.","It is definitely a good class, but is fairly difficult at the same time.","The topic was fairly interesting, the work and readings were interesting and not difficult. But the feedback on the essays is vague which makes revision much more difficult","This course was probably one of the better expos classes.  Lindsay was a great preceptor who was not obnoxious and gave helpful feedback, which is really all you can hope for from expos.","the final assignment is a lot of fun but the class is quite dry and somewhat boring.","Take conference drafts seriously!","Can't really get around taking expos, but this class definitely eased the pain of it. Lindsay is super cool and gives great feedback. A great expos class!"]}},"mostRecentQ":{"overall":"3.60","workload":"1.90","difficulty":"3.20","recommendation":"3.90","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"EXPOS 20.249","course_id":"11499","cat_num":"36066","1s":"0","2s":"0","3s":"7","4s":"4","5s":"2"},"QDifficulty":{"number":"EXPOS 20.249","course_id":"11499","cat_num":"36066","1s":"0","2s":"0","3s":"11","4s":"2","5s":"0"},"QWorkload":{"number":"EXPOS 20.249","course_id":"11499","cat_num":"36066","1s":"4","2s":"6","3s":"3","4s":"0","5s":"0"}},"success":true}