{"scores":{"Spring '14":{"course_score":{"overall":"3.90","workload":"1.50","difficulty":"2.60","recommendation":"3.80","enrollment":"20","response rate":"80.00","QCourseOverall":{"number":"APMTH 141r","course_id":"11473","cat_num":"46959","1s":"0","2s":"0","3s":"4","4s":"9","5s":"3"},"QDifficulty":{"number":"APMTH 141r","course_id":"11473","cat_num":"46959","1s":"1","2s":"5","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"APMTH 141r","course_id":"11473","cat_num":"46959","1s":"10","2s":"4","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"APMTH 141r","cat_num":"46959","course_id":"11473","year":"2013","term":"2","id":"3c036054b5af0d3992677dc2c68a626b","first":" Elizabeth R.","last":"Chen","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.60","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Spring '14":{"comments":["Fun class, sometimes a bit unstructured with the flexibility","The class is a ton of fun. Beth is really nice and lenient, and she makes learning quite exciting. However, Beth and Evelina tend to make the assignments harder than they should be because the topics and materials are very scattered. I didn't know much music theory coming in, and I don't know much about it afterwards, but there are a lot of music and math relationships that I've learned through this class. This is a great class if you are looking to understand the math behind music, but if you don't get music theory, this will be a bit more challenging. Beth is great though, so it's worth it! and you get to build an instrument too!","If you want to learn more about how music theory works at a fundamental, mathematical level, take this course.","This course is great! I will admit that I was initially skeptical when I walked in and experienced Beth Chen's teaching method for the first time, and I didn't think I would learn anything. However, this course has taught me so much about the mathematical basis behind music, and has completely changed the way I approach music. While there is no work outside of class, do not think that this means there is no work at all; all you will be doing for the 6 hours a week you have this class will be in-class assignments. For the first half of the semester, this will be exclusively Mathematica assignments, where you learn as you go. After the halfway point, half of your class time will be split between writing Mathematica programs and building your own instrument. By the end of the semester, we were able to convert a stream of note letter names and durations into sheet music using only Mathematica code, and each of us had built an instrument. This course may not be offered again in this format, but if it is, it's a great elective or fourth\/fifth class!","It's a crazy class but a lot of fun looking back.  Not sure how much I grasped but in the end, it was a great experience.","From speaking with the instructors, seems like it'll be fairly different next time the class is taught. That aside, the topic itself is very interesting and something that one may not get much exposure to in other math classes.","All of the teaching and assignments were very scattered, off-the-cuff, and improvised, but the course was a lot of fun and there wasn't much work out of class. It also ended up being a useful introduction to Mathematica.","I thought this class was a great way to blend music theory with math. I took it as a math elective and enjoyed building upon my basic knowledge of music theory using math. The teaching staff is terrific and very helpful if you run into any problems along the way. Some background in coding (mostly Mathematica, some MATLAB) is advantageous.","It could be a really awesome course if it had a little more organization","This course is probably unlike any other course you've taken. It's incredibly open-ended and collaborative, and really forces you to think outside the box and admit your weaknesses, while helping others with areas that are your strengths. I had a lot of fun and learned some very interesting things about music! Definitely take it -- you will grow as a student and as a learner."]}},"mostRecentQ":{"overall":"3.90","workload":"1.50","difficulty":"2.60","recommendation":"3.80","enrollment":"20","response rate":"80.00","QCourseOverall":{"number":"APMTH 141r","course_id":"11473","cat_num":"46959","1s":"0","2s":"0","3s":"4","4s":"9","5s":"3"},"QDifficulty":{"number":"APMTH 141r","course_id":"11473","cat_num":"46959","1s":"1","2s":"5","3s":"10","4s":"0","5s":"0"},"QWorkload":{"number":"APMTH 141r","course_id":"11473","cat_num":"46959","1s":"10","2s":"4","3s":"2","4s":"0","5s":"0"}},"success":true}