{"scores":{"Fall '14":{"course_score":{"overall":"4.80","workload":"5.60","difficulty":null,"recommendation":"5.00","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"0","3s":"0","4s":"2","5s":"6"},"QDifficulty":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"2","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"6","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 53ar","cat_num":"1360","course_id":"5161","year":"2014","term":"1","id":"5129580f56c96835f723b5918b802955","first":" Ruth Stella","last":"Lingford","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Fall '13":{"course_score":{"overall":"4.80","workload":"3.40","difficulty":"3.00","recommendation":"4.80","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"0","3s":"0","4s":"2","5s":"6"},"QDifficulty":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"2","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"6","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 53ar","cat_num":"1360","course_id":"5161","year":"2013","term":"1","id":"5129580f56c96835f723b5918b802955","first":" Ruth Stella","last":"Lingford","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.90","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '12":{"course_score":{"overall":"4.67","workload":"3.08","difficulty":"3.00","recommendation":"4.58","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"0","3s":"0","4s":"2","5s":"6"},"QDifficulty":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"2","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"6","3s":"2","4s":"0","5s":"0"}}},"Fall '11":{"course_score":{"overall":"4.78","workload":"3.22","difficulty":"3.00","recommendation":"4.78","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"0","3s":"0","4s":"2","5s":"6"},"QDifficulty":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"2","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"6","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 53ar","cat_num":"1360","course_id":"5161","year":"2011","term":"1","id":"2de0e4affad4ebbf8ea1ce639eed2c89","first":"Terah L.","last":"Maher","InstructorOverall":"4.89","EffectiveLecturesorPresentations":"4.67","AccessibleOutsideClass":"4.78","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.89","GivesUsefulFeedback":"4.89","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Fall '11":{"comments":["It's amazing!","Terah is an excellent professor and I strongly recommend this course. I learned so much and am very very glad I took the course.","You get the chance to produce a lot of great work in all types of media. It's a great introductory course.","Terah is a great animator, and the products you create will surprise yourself!","This is a really great course to learn animation either as a beginner or someone with more experience!  There is a good mix of assignments, screenings, and independent project work!","LOVED this class. Perhaps I'm biased because I love art and have always been interested in animation, but as a science major, I found myself being challenged in just the right amount. The final project was my first animation project and I'm so proud of it! I felt that this class was very well taught, and if you're really interested in art, it will be something you look forward to each week."]},"Fall '12":{"comments":["This course is fantastic!","This class is great, but very time consuming.","This class is a little difficult because animation is time-consuming and a pain, but I had an awesome time and will definitely keep animating.","This course was a ton of fun, and Terah is great.  Expect to put a lot of work into your animations, but you will be greatly rewarded.  The final project was a bit exhausting, but it was really awesome to have it screened at the Carpenter Center in the big room.  Also, the Friday screenings are fantastic.  Terah picks a great bunch of animated films, and some of them are incredible.","really good for starting animation","Great and fun course!","This is probably the best class I have taken at Harvard.  It was challenging, and I lost tons of sleep, but it was a great experience. The final project is one of the most satisfying assignments you will ever have."]},"Fall '13":{"comments":["This class is the ideal introduction to animation and will allow you to find out which mediums you enjoy the most and give you the experience you need to produce something to be proud of by the end of the semester.","This is an amazing class and both Ruth and Dylan are great teachers and people. It is a lot of work outside of class, especially with the final project, but you learn a ton and help is readily available.","The change of pace from other courses is so fantastic","This course is a large time investment, would not recommend simultaneous enrollment with another studio. I also don't know if it's very worthwhile unless you plan to continue doing animation. That being said, the work is fun.","Because I took this class on a whim (I'd always been interested in animation beforehand), I'd say that you should definitely not be afraid to try new things. In fact, although I had originally chosen this class as one of my more relaxing and \"for fun\" courses, I am seriously considering changing my concentration to VES in order to have the luxury of continuing on in animation.","This class is amazing! It is so much fun and very different from any other class I've taken.  We were given total free reign creatively and a lot of constructive criticism from our peers and Professor Lingford and Dylan Ladds.  I love it.  The final product is so fulfilling."]},"Fall '14":{"comments":["This class is a blend of fun and commitment. Nowhere else do you get the chance to make your own animated film in one semester! However, that does mean taking the time out of the class to work on your film and be able to take criticism in order to improve. Animation is a hard and long process, but the final product can be one of the most reward experiences you receive! As long as you commit extra hours to this class much like you would a sport or extracurricular, you too can become an animator filmmaker!","This is a really fun class! You have a lot of creative freedom so the assignments are a great way to take escape papers and other classes. You have a lot of time for the final project but you have to structure your time. You'll tend to slack off early on, but if you don't then you won't have to work as hard when other classes also decide to pick up.","TAKE THIS CLASS!! Ruth is funny, down-to-earth, approachable, and amazingly talented. I thoroughly enjoyed having her as a professor this semester. Dan is also great as a TF, and knows his stuff really well. I loved getting to experiment with different types of animation such as stop motion, sand art, etc. in addition to drawing on the computer. My only hesitation is recommending this course is for students to realistically look at their semester schedules and see how much time they can commit to this class. Animation (even though it's awesome and fun) takes a very very long time to do. I cannot stress this enough. If you have other classes with lighter courseloads, go for it!! I wish I had taken this class another semester--not because this class had anything wrong with it, I absolutely loved it--but so that I could have had more time to work on assignments. Taking this as one of five classes was extremely stressful. But overall, Ruth is wonderful and was very understanding and supportive while I was going through a hard time this semester, and I recommend anyone who is even remotely interested in animation to get to know her\/learn from her. This has been one of my favorite classes at Harvard in my four years in here. I am so happy that I took this class; my one regret is taking it during a semester that was very difficult for me in many ways.","You get out of this class what you put into it and it can be incredibly rewarding if you're willing to take the time to do the assignments to the best of your ability and explore the realm of animation.","It is a lot of work. But if you put the time in and choose a project you like you will be very happy with the results."]}},"mostRecentQ":{"overall":"4.80","workload":"5.60","difficulty":null,"recommendation":"5.00","enrollment":"10","response rate":"80.00","QCourseOverall":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"0","3s":"0","4s":"2","5s":"6"},"QDifficulty":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"2","3s":"4","4s":"2","5s":"0"},"QWorkload":{"number":"VES 53ar","course_id":"5161","cat_num":"1360","1s":"0","2s":"6","3s":"2","4s":"0","5s":"0"}},"success":true}