{"scores":{"Fall '14":{"course_score":{"overall":"3.80","workload":"7.70","difficulty":null,"recommendation":"4.10","enrollment":"45","response rate":"73.33","QCourseOverall":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"2","3s":"7","4s":"14","5s":"9"},"QDifficulty":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"7","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"0","2s":"14","3s":"11","4s":"2","5s":"2"}},"instructor_scores":[{"number":"COMPSCI 182","cat_num":"0134","course_id":"1246","year":"2014","term":"1","id":"5358e0ee0d214f2be1b059c6c1a5bd82","first":" Barbara J.","last":"Grosz","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Fall '13":{"course_score":{"overall":"3.50","workload":"2.90","difficulty":"3.00","recommendation":"3.60","enrollment":"46","response rate":"78.26","QCourseOverall":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"2","3s":"7","4s":"14","5s":"9"},"QDifficulty":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"7","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"0","2s":"14","3s":"11","4s":"2","5s":"2"}},"instructor_scores":[{"number":"COMPSCI 182","cat_num":"0134","course_id":"1246","year":"2013","term":"1","id":"5358e0ee0d214f2be1b059c6c1a5bd82","first":" Barbara J.","last":"Grosz","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Fall '11":{"course_score":{"overall":"3.71","workload":"3.07","difficulty":"3.29","recommendation":"3.86","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"2","3s":"7","4s":"14","5s":"9"},"QDifficulty":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"7","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"0","2s":"14","3s":"11","4s":"2","5s":"2"}},"instructor_scores":[{"number":"COMPSCI 182","cat_num":"0134","course_id":"1246","year":"2011","term":"1","id":"5a48e4e06e3dece44781a13510b69216","first":"Radhika","last":"Nagpal","InstructorOverall":"3.43","EffectiveLecturesorPresentations":"3.36","AccessibleOutsideClass":"3.00","GeneratesEnthusiasm":"3.64","FacilitatesDiscussionEncouragesParticipation":"3.54","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"3.44"}]},"Fall '10":{"course_score":{"overall":"3.08","workload":"2.69","difficulty":"3.08","recommendation":"3.08","enrollment":"16","response rate":"81.25","QCourseOverall":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"2","3s":"7","4s":"14","5s":"9"},"QDifficulty":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"7","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"0","2s":"14","3s":"11","4s":"2","5s":"2"}},"instructor_scores":[{"number":"COMPSCI 182","cat_num":"0134","course_id":"1246","year":"2010","term":"1","id":"5a48e4e06e3dece44781a13510b69216","first":"Radhika","last":"Nagpal","InstructorOverall":"3.17","EffectiveLecturesorPresentations":"3.08","AccessibleOutsideClass":"3.78","GeneratesEnthusiasm":"3.67","FacilitatesDiscussionEncouragesParticipation":"3.89","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Fall '09":{"course_score":{"overall":"3.56","workload":"3.37","difficulty":"3.26","recommendation":"3.56","enrollment":"29","response rate":"93.10","QCourseOverall":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"2","3s":"7","4s":"14","5s":"9"},"QDifficulty":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"7","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"0","2s":"14","3s":"11","4s":"2","5s":"2"}},"instructor_scores":[{"number":"COMPSCI 182","cat_num":"0134","course_id":"1246","year":"2009","term":"1","id":"5a48e4e06e3dece44781a13510b69216","first":"Radhika","last":"Nagpal","InstructorOverall":"3.41","EffectiveLecturesorPresentations":"3.22","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"3.85","FacilitatesDiscussionEncouragesParticipation":"4.06","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.25"}]},"Fall '07":{"course_score":{"overall":"4.19","workload":"3.31","difficulty":"3.19","recommendation":"4.06","enrollment":"26","response rate":"61.54","QCourseOverall":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"2","3s":"7","4s":"14","5s":"9"},"QDifficulty":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"7","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"0","2s":"14","3s":"11","4s":"2","5s":"2"}},"instructor_scores":[{"number":"COMPSCI 182","cat_num":"0134","course_id":"1246","year":"2007","term":"1","id":"b023f4580b03208372b9df7b3c6f8c6f","first":"David C.","last":"Parkes","InstructorOverall":"4.44","EffectiveLecturesorPresentations":"4.38","AccessibleOutsideClass":"4.54","GeneratesEnthusiasm":"4.19","FacilitatesDiscussionEncouragesParticipation":"4.11","GivesUsefulFeedback":"3.67","ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Fall '07":{"comments":["Take it if you have an interest otherwise it maynot be worth the difficulty","Before you decide to take it, find out whether all of the programming assignments have been replaced.","Amazing material, taught well, and not an absurd amount of work like most classes","In the first half of the class, you learn about all the awesome ways that computer can appear really smart. Then you hit the unit on Logic, and back they go to being stupid, stupid machines.","Only take this class if you're comfortable with LISP.  Also, it's not a class on \"cool,\" stereotypical AI (robots and such), so don't expect that.  It is very interesting, though, and it's not too difficult as CS classes go.","Class teaches some very interesting parts of A.I. However, some parts seems impractical such as SAT problems.","The emphasis in this class is on AI concepts, rather than the act of coding.  While code is a large part of the assignments, a lot of time should be devoted to understanding the underlying algorithms."]},"Fall '09":{"comments":["This is a good Introductory Artificial Intelligence class.","Lectures and problem sets are the weak point of the course. Unless they make some major changes to the course, think hard before taking it.","Ok-interesting material. Think about and start working on your final project early.","It's an interesting intro to some AI concepts, but not the most practical in terms of what you think about as AI.  Generally an easy and manageable CS elective.","awesome. Take it early because it might really interest you.","Be prepared to be frustrated with the arbitrary grading system and start early on the final project","great material. teaches how to take a real world problem and to formalize it.","I would recommend this course for anyone who feels interested in artificial intelligence and wants to get a solid background on the fundamentals. There are much in this course, that one could benefit from: a) the people of the course are great  b) there are interesting lectures on applied AI  c) there are interesting assignments and the chance to try some independent research during the course final project","Not particularly difficult, well taught, and very interesting!","If you are really interested in AI, this is probably a good course to take, but if your primary interests lies elsewhere in computer science, it is not as suitable.","Take the class if you are interested in AI, but realize it's not going to be quite as awesome as building robots... it will be more applied algorithms and learning about algorithms that would specifically be useful for AI.","For a CS class at Harvard this class is not hugely difficult, but still take it seriously.  The lectures didn't add much to the experience, but the book makes up for this, it is great.  The project could be an excellent culmination, but only if you make sure you have a good partner and topic and give it plenty of time."]},"Fall '10":{"comments":["I think \/ hope that CS 182 is going to get refreshed.  It really needs to be.  Professor Nagpal is a very nice person and means very well, but this course is just lousy.  The material is dry and uninspired.  It needs to be spiced up!  I hope that the assignments are more interesting next year, and maybe even the material itself gets tweaked.\r\n\r\nIf it is exactly the same as it is this year, I am unlikely to recommend.","This class is not for serious students of computer science.","Consistent amount of work every week, but the class more difficult as it goes on. Good introduction to AI with interesting material.","Good class with strong material and good teaching staff that is helpful. But be ready for somewhat lackluster reference material in the form of textbooks, lecture notes, and pset solutions","good class, somewhat difficult","When I signed up for the class, I was expecting a much more technical introduction into AI, not simply a qualitative coverage of the different approaches. The lectures were not informative either - while the professor can hold your attention for a little bit, soon the lack of detail or specific content makes the material seem uninteresting. Problem sets don't seem to really test the ideas being taught in the class, and while the exams cover everything, it seems that they take off for small things so the grade doesn't really reflect how well you know the material. The \"boringness\" of the presented material made you unwilling to spend much time on the assignments because they weren't very educational and were rather tedious actually. So most of the time spent on this course was forced, just to get the assignment done.\r\n\r\nAs for the final project, having a good partner is vital, as always. It's an educational experience doing the project, but surprisingly the class doesn't require that you submit any code at all. Instead, the evaluation of your final project is based off a presentation and paper that you have to spend your reading period on, instead of what your project actually accomplished. This sort of emphasizes how the class doesn't really look at the technical side of AI but only the qualitative component - how well your paper is written and how good your presentation was. I put a lot of work into both the presentation and paper but I'm sure people could fake their results and still get away with it because no code was really required. In the end, I put in a lot of time but don't feel that I got much out of the final project.\r\n\r\nThis course is probably good for people who are looking for that sort of qualitative overview, but not for those who are interesting in the technical rigor of the approaches used in AI.","I regret taking this class. It's badly organized; there isn't that much actual material in the course (especially towards the end); and the assignments were tedious and menial. If you're at all interested, go for the first 5 weeks and then read AIMA on your own.","Useful class: lots of solid techniques. Kind of need to take this to proceed in study of AI.","Think about what your interests are before taking the class. If you want to go on in AI, this is a good class to take."]},"Fall '11":{"comments":["Decent class, a bit dull at times though. final project is a lot of fun but get started early.","The textbook presents material effectively. Lots of programming problem sets, so allocate time to debug. \r\n\r\nI wish I had taken this class earlier, it's a great introduction to a lot of potential research topics (especially senior theses)","The lectures are fun and light, and the material is easy conceptually, but it's not easy to nail the material practically, so make sure you really digest the material.","Good course overall; I learned a lot and it was interesting. The requirement that you work in groups is a little strange; in such a small course it's likely that you'll be unable to find someone with the same interests.\r\n\r\nAnyway, I can foresee a lot of people criticizing Prof. Nagpal for sometimes seeming to have only a shallow understanding of the material. While it's true that there are many parts of the course she seems less certain about, it's also true that this course doesn't directly align with her area of research, so I'm willing to cut her some slack. She seems to have the ability to see the material from an outsider's perspective, which allows her to present information in a clear way that makes sense to outsiders. As someone who tries to do the same when teaching, I can appreciate this, and it's surprising how rare this is among the faculty.\r\n\r\nIt should be noted that the course swings heavily toward robotics at the end, so take that into account.","Quite hard, but really useful.","I loved this course, but I know not all of my classmates did.  Lectures are sometimes disorganized, but the text more than makes up for it.\r\n\r\nThis course is more of a course on AI TECHNIQUES, which include basic algorithms, propositional logic, first order logic, and how to model problems.  All of these things are applied to AI for examples in class and in the text, but the class focuses on the techniques rather than AI itself.  To me, this is super useful, because a lot of these techniques can be applied to other fields.","Learn about perhaps the most exciting areas of computer science, with clear presentations in lectures and an excellent textbook.","The material is interesting, but you may be better off just reading the book.","Awesome and useful course. Teaches you more practical knowledge about algorithms than CS124 ever will. By far the hidden gem of the CS department.","It requires some previous programming skills, but you learn a lot of algorthms."]},"Fall '13":{"comments":["Though the lectures and assignments could be improved somewhat, this was still a great course and a solid introduction to artificial intelligence. The course staff could have put in a little more effort preparing the lectures \/ assignments, but both Prof. Grosz and the TFs do seem to genuinely care that students 1) understand the material and 2) enjoy the course. If you want to learn a bit more about AI, take it.","Read the book.  If it's the same prof and TFs (Ming\/Ofra), you will not be getting a great instruction. Awesome topics, mostly for the first half.  Very easy, almost (but not quite) easy enough to be a 5th class.","The course was pretty disorganized. That being said, it was cool to learn about all these AI concepts, and I felt like the class as a whole was pretty close. But yeah -- I really hope the organization improves next year, because that was a huge drawback of the class. Grading seemed very arbitrary, and I wasn't really sure why I got points taken off from some assignments, as it wasn't clear. It wasn't an extremely difficult CS class by any means, but was somewhat painful at times because you would find yourself debugging something very silly, even when you understood the concepts themselves fairly well... TFs were knowledgeable but somewhat difficult to understand as well. If you're interested in AI, you should definitely take the course -- just be aware of its weaknesses.","It's a fun class that provides a great introduction to some of the AI algorithms of today.","This class is very well-organized. Professor Grosz is a good lecturer and a very very nice person. The material is incredibly useful, even outside of AI, especially the graph search algorithms. One of the best CS classes I've taken!","CS182 teaches you all the useful algorithms you didn't learn in CS124.","A great class if you are interested in any sort of Artificial Intelligence field and good setup for future classes such as Machine Learning","If you have taken 181 this class probably isn't worth your time. Some of the parts are interesting and new but not sure those parts are enough. All in all though a very well run CS class that doesn't kill you on workload.","The material is in theory interesting but the class just was not.","Grosz is a good lecturer, although at times the slides (inherited from Nagpal?) may be a bit disorganized or the pacing may be off. You'll learn a lot of practical knowledge about search and knowledge representation. Get started early on the final project.","This class isn't that hard, but there are a lot of pieces that made this class a headache. Lectures are ok, but the professor tends to skip over the more important material in favor of simple examples. I found that lecture tended to lose its effectiveness after the first half, because the material became complex. Watch the stanford lectures from an open courseware type site, they are really helpful. Most of the lecture slides are copied from elsewhere, and are not that easy to follow sometimes. The berkeley based psets were fairly straightforward, but the psets from the 2nd half were a pain to understand and debug. The final project was somewhat of a joke, as most people clearly were presenting the same material for their intro and final presentations (though this was over Thanksgiving...). Section was really helpful; the notes were fairly straightforward and Ofra and Ming were able to answer questions well. This was the saving grace of the course; start psets early if possible and work with other groups later on, because the second half psets are definitely much harder to understand.","Very hard and time-consuming if your programming skills are weak.","Very interesting course, but lectures are sometimes unhelpful. There's so many new \/ ambiguous terms on every slide, and it seems like you are just expected to catch on, which doesn't really work out. The book is okay, very encyclopedic, but if you read it very carefully you will eventually understand it. \r\n\r\nProblem sets are interesting, and the teaching staff seems genuinely interested in the material, as well as teaching it.","This course covers a lot of concepts in AI. If you are interested in the topic, definitely take it. If you are not really interested in the topic, the course might bore you because a good part of it is thinking about AI conceptually.","This class was awful in a very sneaky way. At first, I thought it was so cute and fun - the professor seemed dedicated, the topic interesting. However, the course staff was able to make a fascinating topic incredibly mundane in lectures and homework assignments. It was impossible to pay attention to lecture and assignments were poorly designed and taught me nothing. The class wasn't rigorous, yet at the same time wasn't easy - it was the worst possible kind of class difficulty-wise. At the end of the day, it felt like a bad gen-ed.","Start the assignments early, they are worth most of your grade","Although the material in this class is extremely interesting, the material was presented poorly by the teaching staff. In addition, little effort was put into creating problem sets - the problem sets were borrowed from the Berkeley version of the course.","artificial intelligence","A great CS course that isn't too difficlt but very interesting.","very interesting course material, but probably not taught any better than an equivalent online class (ie, berkley course 188 on edx, of which some of the lecture materials and problem sets were based off of).","The topics are interesting, but many of the lectures were difficult to follow and made simple material  overly complicated at times.","this class is a good way to gain exposure to planning and decision-making via artificial intelligence. prof. grosz is an absolute sweetheart and really motivates\/cares for her students, and the tfs ofra and ming are also very kind and helpful. the assignments could be improved, but the concepts gained are as interesting as they are applicable to so many fields of ai. all in all a good class!","Not very hard, you could read the textbook on your own.","You don't have psets every week, but when you do, be prepared to spend many hours on them. Find a good partner to work with, it will make things so much easier.","It's a pretty nifty course.  You should definitely consider taking it. The first half is a lot cooler than the second half."]},"Fall '14":{"comments":["The material is fairly interesting, but be aware that it's somewhat of a hodgepodge\/overview of the field. I'd recommend it to freshman and sophomores who want an overview of AI before taking more specific courses like CS181, CS187 etc. Don't be scared by the prerequisites, you don't need them in my view.","This class is a great intro to AI. It delves into several different areas, with interesting discussions about the current state of AI. Coursework is very manageable, and assignments are actually fun to do.","This is a terrific class! You learn a lot and you get to work on a great project! Professor Grosz made the class very interactive and tried hard to foster a sense of community. The class has a reasonable workload, and it is what you make of it in terms of how much you can learn. Great introduction to AI!","I don't understand why so many people told me this class was \"meh\" or \"bad\". I loved this class! If you think beyond what you're being told in lecture, the material can be applied to a huge variety of problems. For example, if you can turn your problem into a graph problem, you'll have a toolbox of algorithms to apply. If you figure out a function that tells you how \"good\" a given solution to your problem is, you'll have a bunch of algorithms for finding an optimal solution.  I directly used some material from this class on interviews I had for software positions as well.\n\nThe only part that was difficult to apply was First Order Logic, but most of the other material was very useful. I'd definitely recommend this class for anyone interested in efficient and applicable problem solving techniques. If you're looking for lots of theory and proofs of algorithms, however, then this isn't the class for you.\n\nThe guest lectures are great.\n\nAlso, I'm pretty sure you don't need CS 121 (I didn't take it, and many others didn't when we had a class survey). I don't recall having to prove anything by induction in this class. The only CS 121 material we really used was logic (I think that's covered in CS 121 or CS 20?), but it's not too difficult to pick up if you go to office hours or spend some time self-studying it. The CS 20 textbook (it's free, just look at CS 20's website) covers the basics pretty well.\n\nThe final project is fun. Just give your group time to finish it and DO NOT try to do it all in a couple of days. The writeup matters as much as if not more than your implementation. Make sure you spend time on it and read it over so it makes perfect sense.","This is a great introduction to AI. The professor is a great lecturer. Sections are pretty helpful but not mandatory. Assignments are pretty fun.","Reasonable workload, fun project. Don't expect to learn a ton of interesting theory though.","This course is based on really interesting subject material and can be extended in a lot of interesting and cool ways. Being comfortable with Python will be helpful but not necessary when you are coming into the class.","The first part of this class is what I had hoped CS124 to be. They take you through different algorithms like BFS, DFS, A*, UCS, IDS, IDA* and make sure you can implement them. Then you get to learn some of the newer algorithms used in AI. These were explained pretty well and if not, material was available to us to learn them. The lectures were a bit too dry and theoretical in my opinion. The high point of lectures was when we actually got a chance to apply what we were learning and do practice problems in class. Prof. Grosz then walked us through the solution. I think more CS classes should try this out as this is what actually helps students learn more than lecturing. Fair warning about the class: after the first half, the class becomes pretty abstract and it is hard to see where the applications are. If you are looking to get into research, this would be a great class to take.","This is the most applicable CS class I took - I could really see how it relates to real world problems. It made for a fun and meaningful project as well. The course staff is so supporting and Prof. Grosz really cares about her students! Take it!","Not sure why this class has historically gotten mediocre Q-reviews. It is organized, not crazy in terms of workload, and the material is very interesting and relevant. Would especially recommend taking this as one of the CS electives. Also, Ofra is an awesome TF!","This course is pretty easy and not that challenging. The hardest part is dragging yourself to classes which move pretty slowly and don't let you use your laptop or do anything to break the monotony. That being said, Grosz is fantastically nice and the course staff genuinely care about the material.","CS182 provides a great overview about Artificial Intelligence.  The teaching staff is great and the content is good.  On the other hand, the pacing of the course is a bit awkward and I do not agree with some of the course policies  (e.g. no laptops in class) but the teaching staff is receptive to ideas and I believe the course will improve overtime.","Very interesting course with a great lecturer (Gosz) and a very helpful and engaged teaching staff. The course is not too difficult but some of the assignments can take a long time to finish. In any case, a great course that include many important and interesting topics from introductory artificial intelligence.","You get to program Pacman!","This was an amazing class--take it!","If you thought CS 124 gave you a lot of computational \"tools\" to add to your computational \"toolbox,\" you should definitely see CS 182 as a course that will help you do the same! As an Applied Math - CS person, this was kind of a part 2 of CS 124 for me; a lot of algorithms that in 124 you see run in exponential time, you will explore better ways of improving those algorithms and tackling those problems in this class. The class was a bit of a reach for me in terms of difficulty, but if you're confident you can find a partner who will help you get through those bumps, you will grow a lot in this class!!","definitely not a grueling cs course, and you learn some interesting basic AI concepts. a lot of course materials are borrowed from the berkeley curriculum, which is pretty solid.","I decided to take this course because AI seems like a really interesting topic. When you complete the course you'll probably find AI to be fairly tedious and realize that most of the solutions we have so far aren't particularly good. The course is taught pretty well, but the material just isn't that interesting, so I can't recommend this class highly.","CS 182 is great class! I learned a lot about the theory and practice of AI, and enjoyed my experience the course. I think it is accessible to students with a wide range of backgrounds and comfort with CS.","Have a strong CS background because a lot of previous knowledge is assumed.","Decent class. The professor and the TFs care a lot and are pretty available. \n\nThe lectures are difficult to stay present for the entire time. \n\nThe midterms are pretty time-crunched.","Interesting material and Prof Grosz is such a passionate teacher. :-) It's also not so difficult for a CS course.","While the ideas in this course are engaging and fascinating, especially for those interested in Artificial Intelligence, I found myself disappointed by the consistent lack of support and disorganization in this course. The problem sets were perhaps my favorite aspect of the course, and many of them were slight modifications of assignments from another intro to AI course. While the iSites had a page for assignment solutions, none were ever posted. Lectures and lecture notes were quite helpful in summarizing and as an overview of the material, but were never particularly engaging or exciting. Students were generally left to fill in the details through the readings, which was perfectly reasonable, but again quite dry. I would suggest that those who choose to take this course be certain they are interested enough in the material to engage themselves."]}},"mostRecentQ":{"overall":"3.80","workload":"7.70","difficulty":null,"recommendation":"4.10","enrollment":"45","response rate":"73.33","QCourseOverall":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"2","3s":"7","4s":"14","5s":"9"},"QDifficulty":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"1","2s":"7","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"COMPSCI 182","course_id":"1246","cat_num":"0134","1s":"0","2s":"14","3s":"11","4s":"2","5s":"2"}},"success":true}