{"scores":{"Spring '13":{"course_score":{"overall":"4.52","workload":"2.18","difficulty":"2.91","recommendation":"4.48","enrollment":"25","response rate":"88.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"instructor_scores":[{"number":"LING 107","cat_num":"1336","course_id":"2786","year":"2012","term":"2","id":"7fc3a8f9e1f2f186aae77dee6082d010","first":" Jay H.","last":"Jasanoff","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.68","AccessibleOutsideClass":"4.33","GeneratesEnthusiasm":"4.64","FacilitatesDiscussionEncouragesParticipation":"4.44","GivesUsefulFeedback":"4.60","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '13":{"comments":["Probably more fun that Historical Linguistics","Professor is very fair and looks out for the students. The homework can get tedious at times, though it is only a week problem set. I got lost in lectures sometimes as the professor does not use the chalkboard in an organized manner.","If you have any doubt that linguistics is the greatest thing ever, take this course. Jay is a fantastic lecturer, able to sprinkle fascinating tangents into an already entertaining class. You will come out with a much better understanding of Indo-European languages and the processes that have created them from their common ancestor.","A fun class for language lovers, this course is a joyride through all the main branches of the IE family.  It is primarily focused on the IE families, rather than on PIE itself, but still touches on the latter for a few (retrospectively brief) weeks.  The psets are consistently enjoyable and Jay has an amusing sense of humor and a mastery over the pedagogy of the material from years of teaching the course.  If you're at all interested in a survey of ancient IE languages and in their relationships and evolution, this class is very much worthwhile.","This is undoubtedly the best class I've taken at Harvard. Professore Jasanoff is an excellent lecturer--he is engaging and incredibly knowledgeable. He presents the material in a logical order and takes as much time as is necessary to ensure that the students understand the important concepts.","Take this class if you love languages and want a low-stress survey of the Indo-European language family.  This counts for my concentration, but I think this is still worth taking as an elective.","Jay Jasanoff is a baller. He knows everything there is to know about Indo-European languages, and it's frightening at times. He'll casually list vocabulary words in 10 ancient languages on the board, and then apologize for having forgotten the word for \"cat\" in the ablative case in Old Norse...or something to that effect (he probably knows it by heart). The psets are fun, and for the most part aren't too tricky. There's no midterm, and only a few quizes, so the work load isn't bad at all on a weekly basis. The take-home final was pretty extensive and a bit stressful, but also fun - you get to analyze a made-up language, and it's like cracking a code! Be prepared to set aside a whole 24 hours during reading period though.","Please take this class. You will walk out with an immense understanding of how every Indo-European Language is related and language learning will never be easier.","If you are interested in languages or the development of different languages, you will enjoy this course.","If learning about Tocharian gets your gears turning, then take this class. Just remember, take notes on your reading, and be sure to test yourself on those questions to be found at the end of each chapter: doing this will get you three semesters worth of information out of one.","This class is excellent. The assignments definitely help you prepare for the final exam, and everything is presented to you up front and honestly. Although the final exam is take-home, be prepared to spend most of the allotted time on it. Laura is also a fantastic TF!","If you are interested in Indo-European philology, this will be a very interesting course. However, for a comprehensive introduction to the comparative method in general, you are much better off taking Rau's historical linguistics course.","One of the best classes I've taken at Harvard! Prof. Jasanoff knows so much, and he knows how to teach this material. Also, the textbook, Fortson, is worth spending a whole semester on. Great fun, and a great chance to deepen knowledge of languages you already know something about...and be tempted to learn many others. If you have the preparation, take this class!","This is a great class. Jay is one of the most knowledgeable professors I've ever had as well as an interesting, engaging, and funny lecturer who will make you excited to come to class. Most of the class consists of learning sound laws, so some basic knowledge of phonology is useful. The problem sets are challenging but fun. However, be warned that the final exam is very difficult and prepare to spend most of the allotted 24 hours working on it. Still, take this class. You will learn so much, especially just interesting, random facts from Jay, and will really feel like you're learning for the sake of learning and enjoyment.","This class gives you all the fun of historical linguistics without any of the nasty details. I always walked out with a smile.","Super interesting and informative about Proto-Indoeuropean and its derivative languages"]}},"mostRecentQ":{"overall":"4.52","workload":"2.18","difficulty":"2.91","recommendation":"4.48","enrollment":"25","response rate":"88.00","QCourseOverall":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null}},"success":true}