{"scores":{"Fall '14":{"course_score":{"overall":"3.30","workload":"9.99","difficulty":null,"recommendation":"3.40","enrollment":"99","response rate":"81.82","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"instructor_scores":[{"number":"STAT 139","cat_num":"1450","course_id":"4837","year":"2014","term":"1","id":"c0fba82f809c81eb1638c04a5054a84c","first":" Viktoriia","last":"Liublinska","InstructorOverall":"3.20","EffectiveLecturesorPresentations":"3.10","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"3.30","FacilitatesDiscussionEncouragesParticipation":"3.30","GivesUsefulFeedback":"3.20","ReturnsAssignmentsinTimelyFashion":"3.50"}]},"Fall '13":{"course_score":{"overall":"3.00","workload":"3.20","difficulty":"3.30","recommendation":"3.10","enrollment":"92","response rate":"92.39","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"instructor_scores":[{"number":"STAT 139","cat_num":"1450","course_id":"4837","year":"2013","term":"1","id":"c0fba82f809c81eb1638c04a5054a84c","first":" Viktoriia","last":"Liublinska","InstructorOverall":"3.00","EffectiveLecturesorPresentations":"2.60","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"3.40","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"3.40","ReturnsAssignmentsinTimelyFashion":"3.50"}]},"Fall '12":{"course_score":{"overall":"4.18","workload":"3.12","difficulty":"3.32","recommendation":"4.10","enrollment":"55","response rate":"90.91","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"instructor_scores":[{"number":"STAT 139","cat_num":"1450","course_id":"4837","year":"2012","term":"1","id":"069cdfda95614d84d87a2684c61ce7a4","first":"Cassandra Wolos","last":"Pattanayak","InstructorOverall":"4.41","EffectiveLecturesorPresentations":"4.51","AccessibleOutsideClass":"4.37","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.28","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.35"}]},"Fall '11":{"course_score":{"overall":"3.70","workload":"3.32","difficulty":"3.51","recommendation":"3.64","enrollment":"78","response rate":"96.15","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"instructor_scores":[{"number":"STAT 139","cat_num":"1450","course_id":"4837","year":"2011","term":"1","id":"069cdfda95614d84d87a2684c61ce7a4","first":"Cassandra Wolos","last":"Pattanayak","InstructorOverall":"4.08","EffectiveLecturesorPresentations":"4.08","AccessibleOutsideClass":"4.63","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.35","GivesUsefulFeedback":"4.11","ReturnsAssignmentsinTimelyFashion":"4.39"}]},"Fall '10":{"course_score":{"overall":"3.73","workload":"2.48","difficulty":"3.13","recommendation":"3.79","enrollment":"49","response rate":"97.96","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"instructor_scores":[{"number":"STAT 139","cat_num":"1450","course_id":"4837","year":"2010","term":"1","id":"aaf992f44908c1d6ea9f337b56582ab6","first":"Yoonjung","last":"Lee","InstructorOverall":"3.73","EffectiveLecturesorPresentations":"3.72","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.41","FacilitatesDiscussionEncouragesParticipation":"3.76","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '09":{"course_score":{"overall":"3.73","workload":"2.53","difficulty":"2.97","recommendation":"3.87","enrollment":"40","response rate":"82.50","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"instructor_scores":[{"number":"STAT 139","cat_num":"1450","course_id":"4837","year":"2009","term":"1","id":"aaf992f44908c1d6ea9f337b56582ab6","first":"Yoonjung","last":"Lee","InstructorOverall":"3.82","EffectiveLecturesorPresentations":"3.73","AccessibleOutsideClass":"4.23","GeneratesEnthusiasm":"3.91","FacilitatesDiscussionEncouragesParticipation":"4.08","GivesUsefulFeedback":"3.94","ReturnsAssignmentsinTimelyFashion":"4.29"}]},"Fall '08":{"course_score":{"overall":"4.29","workload":"2.59","difficulty":"3.12","recommendation":"4.24","enrollment":"29","response rate":"62.07","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"instructor_scores":[{"number":"STAT 139","cat_num":"1450","course_id":"4837","year":"2008","term":"1","id":"d506559e536d2af4faed17cf9ed12b9f","first":"Richard J","last":"Cleary","InstructorOverall":"4.47","EffectiveLecturesorPresentations":"4.29","AccessibleOutsideClass":"4.43","GeneratesEnthusiasm":"4.59","FacilitatesDiscussionEncouragesParticipation":"4.31","GivesUsefulFeedback":"3.81","ReturnsAssignmentsinTimelyFashion":"4.18"}]},"Fall '07":{"course_score":{"overall":"4.22","workload":"2.22","difficulty":"3.22","recommendation":"4.11","enrollment":"18","response rate":"50.00","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"instructor_scores":[{"number":"STAT 139","cat_num":"1450","course_id":"4837","year":"2007","term":"1","id":"aaf992f44908c1d6ea9f337b56582ab6","first":"Yoonjung","last":"Lee","InstructorOverall":"4.22","EffectiveLecturesorPresentations":"4.11","AccessibleOutsideClass":"4.11","GeneratesEnthusiasm":"4.22","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.25"}]},"Fall '06":{"course_score":{"overall":"3.00","workload":"2.44","difficulty":"3.67","recommendation":"3.11","enrollment":"13","response rate":"76.92","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"instructor_scores":[{"number":"STAT 139","cat_num":"1450","course_id":"4837","year":"2006","term":"1","id":"aaf992f44908c1d6ea9f337b56582ab6","first":"Yoonjung","last":"Lee","InstructorOverall":"3.67","EffectiveLecturesorPresentations":"3.56","AccessibleOutsideClass":"3.89","GeneratesEnthusiasm":"3.44","FacilitatesDiscussionEncouragesParticipation":"3.62","GivesUsefulFeedback":"3.33","ReturnsAssignmentsinTimelyFashion":"3.33"}]}},"comments":{"Fall '07":{"comments":["I would recommend with reservations only because most students in my department have little mathematical or statistical background.  For those with some math or statistics, I think this is a great course.  It really helps one understand different statistical testing tools, and can be directly applied to datasets in any discipline.","Helpful if you want to pursue stats"]},"Fall '08":{"comments":["After this course, you'll finally be able to understand all the statistical language in scientific papers, and you'll be able to spot shoddy statistical analysis in the news as well as in scientific studies.","very practical stat course!","Interesting material, but with a different professor and TF may be less engaging.","It's a great statistics class with an applied emphasis that I really enjoyed, and it's a good class to take even if your primary field isn't statistics!","I wish Cleary were teaching this course again. He generates a lot of enthusiasm, and understands well how to get students to learn what they need to learn. He clearly puts a lot of thought into teaching, and I greatly appreciate that.","Course is extremely useful and Cleary is a great instructor"]},"Fall '09":{"comments":["The material is very important, but the class is extremely dry.  You'll really learn stuff though, so I guess it's worth the pain.","A very nice course teaching how to apply statistical knowledge to real life problems.","extremely applicable material that everyone in social or natural sciences should know. the teaching, however, sometimes fails to make the material as interesting and relevant as it in reality is","Stat 139 provides a great foundation for understanding and communicating applied statistics.","knowledge of R program will greatly reduce the time spent on homework","You spend a ton of time learning about the t-tests, and not nearly enough time working on multiple regression, like the course description suggests. It seems extremely easy as you're going along, and then you kind of get slammed at the end of the semester. The project was extremely frustrating because I felt like we hadn't learned any of the information required to complete it.","This was a really lucky course for me to take, as an Applied Math concentrator who took Math 23a\/b, because they'll count it for the Analysis requirement.","It's a decent introduction to statistics and R, as far as I could tell, but it does not leave one with much confidence in his\/her statistical abilities. Probably take it as 239 (slightly more work that forces you to understand more of the theory rather than just blindly inputting data), or don't take it at all.","The class is taken mostly by graduate (often AM) students. The class is taught at two levels simultaneously. It is not always clear what of the material is required from which group of students (139 vs 239). Many of the grad students are actually in the lower level class and so will make your life tougher on the curve. The most difficult part of the material is covered very hastily, while the easier, early part is prolonged for no reason.","This course will give you a good, solid background on linear models and is useful even if you have had other courses that touched on linear models in the past. One possible downside (or upside depending on your point of view) is that much of the course can be learned directly and easily from the book."]},"Fall '10":{"comments":["Not a bad class. Watch out for the exams--they are less about showing what you know than showing how quickly you can work.","This class is very interesting and very useful, if you read the textbook. Lectures are a waste of time - a definite sleeper. Exams are trivial, but watch out for the project at the end of the semester!","This is an useful course which introduces the methods widely used in research and industry.","Great course. The material is so relevant to everything, especially econ. You learn so much about statistical tools, and the professor is great. She's very clear, knowledgeable, and pretty funny too. there's a decent amount of work, but it's very appropriate for what you're learning and I dont' think the class moves too fast. psets are relatively straight forward and the exams are relatively difficult. Great class to learn statistical tools for research, thesis, or anything else.","Regardless of your background from economics to political science, if you are planning on doing statistical studies of any kind, this class provides a good background for that.","Solid class, not too much work, valuable skills, good professor.","Simultaneously a fairly easy, and incredibly useful, course.  This past year it was paired with 239, which makes lectures confusing (not always clear what 139 is responsible for), but you can learn just about all of 139's material straight from the textbook, which is a great resource.","This class can get extremely intimidating if you are an undergrad (who is not a statistics concentrator). Most people in the class are very quantitatively oriented (either they are advanced undergrads or PhDs, often in statistics). The TFs (Andy, especially!) are great, but lectures are absolutely unnecessary if you are a 139 student. In fact, they confuse you even more than you were originally and are not necessary for the exams. Expect a HUGE time pressure for both exams.","The problem sets will not prepare you for the exams at all.","You really don't have to go to lectures, just read the book and go to Andy's section.","Important applications but probably take stat 239  if you really want to learn a lot.","it's not that difficult, but important to be on top of the material.","Well taught, focused on data analysis.  Tough but not unreasonable.","This is a relatively easy but helpful class.  The material is not the most interesting, but it is extremely practical, because it teaches you statistics that you can actually use, and gives you lots of practice analyzing actual data.  If you do the problem sets and study for the tests, there is no reason you shouldn't do well.  Lectures are well-taught, and sections are helpful.","This is a great statistics class with real world applications."]},"Fall '11":{"comments":["The course is useful and practical. It gives some good insights on basic statistical tools.","While the professor is extremely intelligent, kind and enthusiastic, the material is very complex and there are not enough resources available to assit in understanding, ie. the lecture slides could have been more detailed. Also, the assignments were too long, and some problems were more complex than suggested in the beginning of the course (it was mentioned that the course prerequisite was only Stat 100).","Definitely keep up with the material by reading the book, because the class goes pretty fast and it's good to supplement what we learn in lecture.","Boring material, terrible textbook, lectures weren't all that organized.","Useful material but the psets are tedious.","This course is great!  The coding exercises really helped to practice the course material in an applied setting, and I really learned a large amount of very useful and interesting material.","If you have only taken stat 100 or 104, be aware that nearly everyone else in the class has taken much higher stats courses and that you will be graded against them on exams.","This class is very important in learning data analysis.  The problem sets were really long and time consuming.  You will become much better at R but it takes a lot of time to learn all the codes.  The material is interesting but mostly just useful.","The material is interesting and applicable, and so the class has potential to improve into a great stat course. Unfortunately, it suffered from serious homework-related issues (primarily devilish tediousness) that made the class unbearable at times.","ask for less homework","It's great material but a bit tedious.","This is a hard, time-consuming class. That said, you will learn tons and feel really good about yourself. Be ready to work hard though - the problem sets are hard","Great class, but be prepared to spend forever doing some of the homeworks.","Take this class. Dr. Pattanayak is a very effective teacher and very open, and this class really helps you understand the theoretical basis of material covered in earlier classes. You come away with the ability to do real data analysis - the class has practical significance too! One word of warning - be prepared to devote a lot of time to problem sets.","great class! you'll learn a lot. be prepared for some long and boring psets though...","If you're looking for Econometrics, this isn't it.","Get ready to pull all nighters\/late nights regularly for homework. The people I talked to in the course also all had this problem. Hopefully this issue will be resolved next time it is offered. Dr. P is awesome. She's extremely invested in both the course and her students, its wonderful. The material is somewhat dry but I guess its useful.","Absolutely phenomenal. Practical yet theoretical in ways that I didn't think were possible in a single course. You use theory to get behind all of that hand-waving from intro stats classes while at the same time feeling like everything that you are learning could be applicable the next time you go to use statistics for something. A must-take class!","Not an easy class. Psets will take hours and hours--most of the psets are done in R, but you do not actually learn R in the course. Thus, you will spend a lot of your own time trying to figure out how to code in R properly, which is useful but also takes a lot more time than you think it will. Did not think the workload for this class was going to be nearly as bad as it was, and was surprised by how many hours I ended up putting into it. That said, Casey is great and the TF staff is good.","It's a double-edged sword. A useful class, but homeworks were tedious.","This class is great but very time-consuming. It teaches a ton of material, and ends up taking 10-ish hours a week. A major commitment, but worth it if you'll be applying for jobs with heavy data analysis emphasis.","Think of this course as a rigorous version of Stat 104, to be taken after Stat 110 and Stat 111. That said, the course is relatively easy if you have that background.","The course material is good. Cassandra is most probably the best Statistics lecturer I have met- she is full of energy, and she communicates her love for stats to the students very easily. She is also very cheerful and seems happy in the class all the time. But the psets take a long time, and the course is more difficult than it sounds. Take with caution.","good that you can learn a lot, but workload can be really heavy","Motivating course on Linear Models.  Some theory, but mostly applied.","Pay attention in lecture and take very good notes.","Great class, even if you are not a Stats Concentrator. The class focuses on using real-life examples, which really helps in understanding the material.","It's a lot of work, but you'll learn a lot of practical things.","Good class.","Stat 139 is a great course if you want to learn R and strengthen your toolbox for applying statistical methods to real-world data. This class is no joke. Be prepared to work hard and spend a lot of time on psets.","Interesting to those truly interested in statistical techniques and underlying theories, but only if so.","Be ready to work a lot, but you will learn a lot too.","Extremely useful class --- just beware it might be time consuming","You learn the foundations for data analysis in this class - so it is a must take.  Actively participating is key. Although the homework assignments are extremely long and sometimes tedious, you learn valuable things from the homework (which are extremely helpful when preparing for the exams).  On that note, to prepare for the exams, do practice problems!  Just knowing the concepts is not enough.  You must know how to apply them.","Really useful course, but there can be some improvements to make teaching more effective.","Do not take if same teacher.","This is one of the better taught Stat classes that I have taken.","Useful class!! I actually feel like I know how to do statistical analysis now. It's really good at emphasizing practicality and applying the knowledge, but it also gives you an idea of where the procedures come from. Homeworks are a bit long if you don't know R. Good class though.","Problem sets are extremely tedious and repetitive. Material is dry but necessary. Casey is a great professor though. She really cares about her students and will take absurd amounts of time during OHs to talk to you.","Very heavy workload, but worthwhile.","If you put in the time to talk to the professor at office hours about any confusing concepts and devote enough time to the homework (I'd say 8-15 hours depending on the week) then the midterm and final will not be a big deal. Not as flashy or cult-like a class as Stat 110 but it is still well taught and the teaching staff cares.","This is a great class and helps you solidify your understanding of statistical methods in real life applications. It can get tedious though and you may find yourself spending lots of time on the homeworks. Also, if you hate R, you may not like some of the homeworks that require you to run simulations. The best part of the class is that though the material seems a lot, it's not too difficult to understand compared to other classes like stat 110. One can say this course is just an extension of 104\/100 with just more analysis.","Excellent class that teaches the theoretical foundation to regressions.  Quite useful in gaining insight to why and how statistical tests are conducted.","Going to lecture is VERY helpful.","The psets are pretty long. Don't think this is an easy course in terms of courseload. The lectures are great, but take notes. Don't depend on the powerpoints.\r\n\r\nCassandra is a great lecturer though."]},"Fall '12":{"comments":["It is a good course to learn about regression.","This class was interesting and very applied to real life. I felt like I learned more skills in this class than in any other class I've taken at Harvard.","Very useful for thesis writers working for datasets and also just in real life when evaluating studies.","Great class! Casey is a fabulous teacher, clear and persuasive. The material you learn in this class is both interesting and useful. Take it!","This class is interesting and straightforward.  Professor and TFs are knowledgeable and enthusiastic.","Cassy is an excellent teacher. And her assignments are great and helpful.","This is a good class, but not too challenging.  Casey is a great professor and you will learn a lot about how to do statistical analyses.  Be prepared to be frustrated by R coding though.","be careful","Overall, I would recommend this course. As with most math classes, my recommendation would depend on what the person hopes to get out of the course. This is a foundation course, but not for people without a good math and statistics background already. For people with that background, I think this is class is good both for the information you can learn in it and the other courses it sets you up to take.","I strongly recommend this course as long as you have the requisite background described above.  It was a great class but way too much work (over 20 hours a week) if you lack the background in any of those areas.","Casey is a great instructor (engaging, clear, good slides, etc...), so if you need to learn about T-tests and the basics of simple linear regression, I'd recommend this class. This may not be the best choice of class for non-stat majors who need to acquire more specific and specialized statical skills (it seems obtaining this goal requires taking several different stat courses- at which point, I might as well just collaborate with a statistician... well played, stat department).","Good class, valuable for learning inference methods and R. I did just fine without Stat 111. If anything, wish it had moved a little faster.","Spectacular course, work hard on the final project and you will feel really fulfilled if you didn't have much time during the semester!","Lectures are great, homeworks take a while but are useful","Stat 139 is an amazing class.  Casey is one of the best lecturers on campus, and the entire teaching staff was so knowledgeable and helpful.  The final project is a great applied opportunity for you to apply the (very useful) tools you will learn in this class.","I would highly recommend this class. It is a significant amount of work, but not terribly difficult. You will learn about so many different things, and more importantly, you will learn how to apply them in practical scenarios to practical data sets. Additionally, you will learn to use R, which is incredibly powerful and will prove invaluable for any future statistical analysis you will ever do.","Favorite class this semester despite the fact that it was the most challenging; that said, the course is easier than Stat110 due to its greater focus on application\/coding as opposed to theory & proofs.  The material is interesting and applicable, but there is a lot of it.  Casey is an excellent lecturer and demonstrates her desire to help students understand and succeed both by her availability outside of class and her attitude in general.  The course has an abundance of excellent materials from lecture slides to lecture videos to helpful section notes\/code to past exams to a great textbook.  The TF's were great, as well -- very helpful.  Nothing about the course itself will get in your way of succeeding; just be a good student, go to lecture, go to section, and study hard.  For your final project, keep your group size to 2-3 people if you can.  My group size was 4, and the result was that I was not able to contribute in many ways.","yes","This course is a great and comprehensive class on statistical tools that can be used in many real-world problems. It covers material from what constitutes an informative graph to constructing predictive models using regression. I highly recommend this class, especially if Prof. Pattanayak continues to teach it.","The course has problems with the lecture notes, homework assginments, and expectations of students. I suppose the class seems more like a graduate student's course (which is true since there are alot of grad students) so it really expects the students to be very independent. I would say that it's not difficult but very tedious and need to be very diligent with the material.","Amazing statistics class that teaches you how to work with actual data and evaluate different approaches to analysis.","Ever wondered why researchers use the tests they do? Ever wondered what exactly regressions do, and what they mean? Ever wondered what you would do if you had a small sample size for your experiments? This is the class for you. \r\n\r\nIf you're looking for a proof-based, mathematically-intensive course, you should probably avoid this one. But if you're looking to learn *how* to use statistical methods in almost any real-life situation you can encounter, this course is awesome!","Prepare to work a lot and learn a lot","Stat 139 encourages students to think deeply about the assumptions, sometimes implicit, that underlie what we think we know about data after conducting statistical tests. Gaining experience in using R can be painful at first, but is ultimately very useful for future work.","Hey, if you wanna learn practical and the theory too behind the statistical tools we use today, how to have fun with stats in a practical application. This is your class. Be prepared for the assignments: go to section and start early. Not difficult, just lengthy.","This course was a very good introduction to statistical testing and regression.  Take it if you are a Stat concentrator or are interested in statistics.  Good introduction to R programming.  Much easier than 110, more difficult than 104.  Not too difficult if you did well in 110 and have some programming background.","Stat 139 is a fantastic course! Not only did I gain a strong theoretical understanding of the various tests we conducted, but I also learned how to use R effectively for data analysis. The problem sets were not tedious!","Very Good","Problem sets are tedious, lecture notes don't help with anything. See if you like the professor before you sign up for the class.","My main problem with this course is that the material seems rather irrelevant. However, if you're interested in delving into statistics, this is a good class.","In terms of understanding how statistical tests should be done (and how they're often not done properly), their assumptions, and their robustness to these assumptions, this course is excellent. Professor Pattanayak breaks down the material very nicely and makes it interesting and applicable.\r\n\r\nToo bad if you get Nikola Andric as TF though. He went through the trouble to demonstrate in section that his grading being harsher than the other two TFs' was not statistically significant. Seriously? (Here, by the way, is where statistics being an \"art\" really manifested itself... it didn't really look like the grading distributions were similar but if your TF says so, you better believe so.) Not to mention, if your TF is consistently grading lower than the other TFs, but he claims he's just as fair, we can only conclude either that there is something wrong with how he teaches, or that he is not in fact fair.\r\n\r\nThe above has been written with some restraint. We've been asked to review as our own work might be evaluated, but while his would have more than a hint of condescension and unconstructive criticisms, I've chosen instead to be straightforward and frank, and hence retain respectfulness.\r\n\r\nAll in all, a course full of good material, but with suboptimal execution.","You will learn many of the concepts in statistics that you'll need for data analysis. The subject matter is especially useful for those in social sciences, but some of the first half of the class and most of the second half are useful for natural sciences as well. The problem sets can be quite time consuming but are generally useful. Casey Pattanayak is a great lecturer and is a large part of what makes this class great.","Be wary of the workload especially the homeworks, they will take a lot of time if you want to complete them each week. Midterm is also very challenging despite being allowed to use some notes."]},"Fall '13":{"comments":["I would recommend this class because you do learn R code and that will most likely be necessary for later stats analyses. However, it would be helpful to familiarize yourself with R code prior to taking the class, since the homework requires a lot of R code that is never discussed in class or section.","Very useful and somewhat interesting material.  First time statistics clicked for me.  Not terribly difficult but a lot of work (psets, project, final, mini assignments).","I was extremely disappointed in this course.  The professor fails to communicate, and is also unable to answer about 90% of questions either on class material or the homework.  The beginning of the semester requires a TON of work, though it lets up slightly.  However, at the end of the course, I don't feel that I've gained hardly anything... My R skills improved nominally, but most homework assignments require you to do test with a pencil and paper instead of learning anything practical.  Without exaggerating, I could have taught myself everything I know about regression from this course by studying on the internet for 3-4 hours.  AVOID","Take this if it's revamped. Victoria as a person is super nice. As a teacher, she makes a lot of mistakes when lecturing, makes lectures awkward with questions. The fact that there was a final project and a final exam seemed unnecessary and a hassle.","Overall, Stat 139 is a solid course. There is a lot of busy work with problem sets, mini-assignments, a final project, AND a final exam - but the statistical methods you learn in this course are widely applicable to any field.","Really interesting material, lectures are a bit dry but going to class definitely helps, long problem sets (do them with a group), exams are pretty straight forward.","If you want to know statistics and how to use statistics in the real world, this is the class to take.","This course gives you some great insights for linear regression analysis.","Stat 139 actually teaches some pretty interesting material, but it wasn't my favorite class this semester for a couple of reasons. First, it was Victoria's first year, and that was pretty obvious; the lectures weren't particularly interesting and typos weren't an uncommon occurrence. Also, be prepared to work on the psets; they could be annoyingly long and often you'd get them back with ten points taken off for seemingly insignificant points of the problem. If you're a stat concentrator, though, you should take this class, because you should know how to do this stuff.","Be prepared: there are a lot of assignments. Not only are there weekly problem sets, you also have six \"Mini-Assignments\" throughout the semester, a midterm, a final project, AND a final exam. However, it's never really an overload of work... I would say the class is pretty straightforward. If you REALLY want to understand the material, then that's time you have to put into it (and you won't necessarily get that understanding from lecture) but you can totally get by only understanding 20% of what's going on. But that's really your loss, because I think these concepts are important - and interesting if you understand them!","This class taught me almost everything I will need to apply daily in an industry position.","I disliked this class.","Too much work, be careful!","This was Professor Liublinska's first year teaching this course and that came through.  She seems to care about the class, so I'm sure that it will improve as time goes on and she gets the hang of things.  This year, the problem sets were tedious, the book was crappy, and lectures weren't very instructive.  I feel confident, though, that, in a few years, this will be a very good course.","This is a good course, and you will come out with a much better understanding of the proper uses of a really important set of statistical tools.","There is a lot of work involved with this class, weekly assignments, bi-weekly assignments on top, midterm, final project, final presentation, final exam.","Students should be prepared to do a lot of work outside of class to learn the material. The assignments were frustrating at times and the material was not presented as well as it could have been. Overall, this is very important material to statistics, but the way in which this course is taught, it does not emphasize a flexible understanding of the material (i.e. a lot of memorization).","Knowing R will help you a lot in this course! The material is very interesting and exciting, and the professor is extremely nice and welcoming.","I would recommend this course because of the sheer importance of the material. This class teaches you what you need to know on the job and how to explore\/make meaning out of big data sets. When your boss hands you a dataset with thousands of entries and says \"make some meaning out of the data,\" you need to know what tests\/models\/assumptions to use in order to determine relationships within the data (exactly what 139 is all about). The course gives you great materials such as an excellently written textbook, HWs, and lecture slides. The reason I \"recommend with reservations\" is that this course is not taught in an engaging manner and I often felt bored during lecture even though I found the material interesting when learning it on my own. Maybe that's just the nature of the material, I don't know, but I feel like this sentiment was shared by many students. If you take the course you will learn a lot however! Oh and you become pretty good at R software!","It focuses on applicaiton of the models rather than derivation.","Good course if you don't have much background in regression techniques. Course could've benefited from more theoretical topics. Lectures mostly repeat material in the book \"The Statistical Sleuth\", which is very good. If you don't have time to enroll in this course, self-studying the book should be possible and prepare you roughly equally well for higher level courses (if you look at the psets on the course isite). The course and the psets are very useful for getting a practical understanding of the statistical techniques and R.","Unless the teaching staff, the teaching method, and the available resources are drastically changed, this course is not worth taking.","You will learn very important things about data analysis in this class, though it is not taught very well.","I found the book most helpful. The lectures are good but often a bit disorganized.","If you are looking to find basic statistics tools to apply to your research or field of interest, this is the class you should take. You will learn all the skills you need to publish papers or even do Nate Silver kind of work. I actually think this should be REQUIRED of every science (including social science) concentrator. Victoria is a passionate teacher, and it pays off. This was the first time she ever taught a class, and it was already great, and next year, with the extra experience she will make the class even better. Take it instead of stat 110; that class, while fun, is NOT going to be useful for almost anyone. It is intended for people who will concentrate or get a secondary in statistics. I would also recommend taking this over stat 104; the two classes are broadly similar, except 104 is easier. But any person who is not bad at math can definitely start with 139.","Don't expect anything incredible from lecture, but it's really interesting and important material that you can learn well from the textbook","Viktoria is, overall, a poor professor. She isn't able to provide clear answers to questions asked in lecture, and office hours aren't any better. The textbook and the material are valuable though, and the subject matter is important and interesting for anyone interested in statistics. I would recommend the course for the material, but have grave reservations about the teaching staff. Lo-hua was very helpful, definitely attend her section, but it is difficult to get help outside of office hours. Problem sets are also a bit tedious.","Take it if you need it. It's better than 110 or 111...but requires one or both of those. Basically, this was the first stat class I took where I felt like the material was presented well enough for me to realize I actually don't like statistics (as someone who was considering a stats field of application for applied math\/secondary) and not just chalk it up to poor teachers. It still could have been done better, though.","This class is awesome! You will learn a ton, and I found myself enjoying the problem sets even though they did take a while. It is super helpful to collaborate with your peers and talk through the problems. Utilize the course to learn R and LaTex well. The material is applicable in all sciences. I would highly recommend.","It is a really useful class, but sometimes the materials can be a bit dry. Victoria was extremely helpful and was accessible, but a lot of people just never went to lecture because reading the textbook was enough.","The material taught in the class is interesting and seems extremely useful for anyone using statistical methods in research or some other pursuit. The problem I had with the class is that it was poorly taught and organized.","There are some cool topics in the course but sometimes the course is taught in a very unorganized matter. Further, a lot of the homework sets are not very satisfactory.","Although the topic was very interesting, I feel that it was fairly poorly taught. The topic itself, however, was not that difficult.","The material is super boring and it's pretty much like a glorified Stat 104. If this interests you then take it. Otherwise if you are looking for a more theoretical Stat class (like Stat 171 or 111) then skip this one.","This course is in the realm of Stat 104\/107 (which I found annoying) rather than Stat 110 or 123 (both of which I loved). The class is more about memorization and tedious application rather than teaching a new way of thinking. If you want to be able to bang out a linear model, then I suppose this course does the job, but don't expect additional cognitive stimulation.","You do learn a lot from this class, but if you want to know more about the underlying of each test, you need to go beyond this course and learn by yourself (or from other classes).","If you are a stats concentrator, I would definitely take this course, regardless of how poor it may be. The material is absolutely necessary for all stats concentrators (and people interested in statistics). To many in the outside world, this material is what it means to know statistics. With that said, this class is poorly taught and very unmotivating.","This class was really tedious and took way too much time. Psets were annoying and lectures weren't that straightforward sometimes. Not too conceptually difficult, but too time-consuming.","Useful material but not well organized and you waste a lot of time jumping through hoops","The teaching wasn't as good this year, but if you read the book and slides you should be fine.  Now I have a good idea of more advanced statistical techniques (than Stat 104) and linear regressions.","This is what you would imagine every statistics course would be. If the only test you know of is the good, old t-test, this course will teach you why t-tests are applicable in many situations and teach you ~30 different methods to go about it. This is an \"applied statistics\" course, which means that the \"theoretical aspect\" of Stat110 or Stat111 will not be an issue. If you are someone who does research and needs to be well-learned in the methods of statistical testings and linear regressions, take this class! As for myself, I did economics research over the summer and found myself lacking in the statistical methods used in ec research papers. However, now after having taken this course, I feel a lot more comfortable and feel like I can conduct my own research! Take this instead of Ec1123!","You really have to take the time to learn R on your own time. Also, being extremely well versed in the mathematical aspects of this course is essential to doing well in this class.","Just be ready to feel confused about how the work you are doing really applies to learning statistics.","This is a pretty straightforward class; however, it would be nice to have more conceptually challenging topics. It is a good background class to understand certain assumptions and issues with certain statistical tests.","This was Liublinska's first time teaching this class, so it wasn't spectacular. The material is kind of boring by nature, but maybe with a different instructor it would be more interesting. That being said, it is still a useful course to get an applied statistical background.","The professor definitely tries very hard, but in the end she is absolutely a horrible professor. Her slides are not clear and lecture is mostly unenlightening. She is hard to approach and there is not a lot of outside support for the class. Problem sets are long and tedious, and not in a rewarding way, and grading is extremely inconsistent.","This course covers important material for anyone wishing to perform analysis of variance and linear regression. It does however require students to spend significant time working from the textbook to decode some of the lecture notes, and some topics (e.g. Linear combinations) are not as well explained as they might be. Also beware the long homework assignments, which will either take up most of your weekend or will require you to divide and conquer with friends."]},"Fall '14":{"comments":["You learn important things which are very crucial for any interviews, etc. However, I was quite unhappy in the course. There were many factors responsible for this, including the fact that we had a final project, final presentation, AND a final exam (in addition to a mid term and regular psets). I'd recommend taking Econometrics in the econ department (the less theoretical one) where you'd learn about the same things, and learn them in Stata, which is what most researchers in econometrics use anyway.","It's not difficult if you are a stat concentrator who has taken 110\/111, but it's annoying.  Section is unorganized so you're better off using the textbook and google to help get through the psets.  The project had absolutely no guidance, and there's a final too which is annoying. They write the tests too long so be sure you skip ahead and do the easy parts to get points","Read the text book instead of taking this class unless there is a better lecturer.","Sometimes a bit dull, but overall this class covers very useful material.","Really great class as an applied look at regression but the professor is AWFUL. Seriously. Utterly unpleasant in person who is incredibly inept at explanation while setting bizarre and pointless homework assignments. Regression material is way more useful than econometrics 1123\/1126 but it's such a shame she teaches it","This course is well-paced and well-taught. Prof. Liublinska is great at making time to talk to students to help them understand concepts (I definitely recommend making use of office hours and Piazza), which was helpful when there were details that needed to be clarified. I also liked the structure of the class: I felt that Prof. Liublinska designed it well, with the final project and the level of difficulty of the problem sets, for instance. It is clear that she truly values whether her students understand the material, and I liked her approach to teaching this course. I personally learned a lot and felt like I had a good understanding of linear models after completing this course.","An useful class to take, especially for people who are interested in doing research or writing thesis. Some departments don't take statistics and methods seriously, even though research is a big component of their works. So if you are just looking for a class that is not too difficult and useful, this is the one.","The content of this class is very interesting and incredibly useful. Though, I didn't feel like it was taught particularly well. I could learn almost as much from just looking at lecture slides as I could from attending class. Victoria was nice and clearly meant well, but she seemed quite out of touch with the students (the incredibly long midterm that she wrote is a prime example of that). The final project is pretty easy for a final project, and doesn't take too much time to do a satisfactory job. This is one of those classes that you sort of have to take if you want to have a solid knowledge of data analysis. I'm not really sure how it will be in the future, as Victoria is leaving after this semester.","Take it if you really like statistics.","This course is the quintessential example of how the whole is not equal to its parts; the individual concepts discussed in class, the intentions of the professor, and even course logistics all have a good intention behind them, but put together, they yield a course that tries to be everything but ends up being very little. Yes, videotaping lectures is helpful and cool, but not when clicker questions still require everyone to come to class. Yes, final projects are cool, but not when the course also has a final project and a midterm! The list goes on and on. \n\nCourse book: Written both like a reference manual, and in a horrible style. Utterly void of mathematical proofs or rigor, and full of useless \"case studies\" which crowd out all the technical details. By taking out duplicate content, the entire book of the course could be distilled into a couple of Latex handouts. \n\nLecture slides borderline illegible -- at best, they regurgitate theorems and results verbatim from the book, at their worst they are a messy blob of arithmetic completely unintelligible to anyone looking at them later. \n\nProblem sets are extremely tedious, taking up upwards of 12 hours apiece, yet filled with either meaningless exercises (think t-tests done by hand over and over again) or meaningful problems, whose true value, however, never becomes apparent to the student due to poor wording of problems, and the reasons why they are assigned in the first place. Grading is harsh and inconsistent. \n\nThe format and difficulty of exams was communicated unclearly, and the practice exams were both shorter and way easier than the actual exam. Be sure to study a lot for both the midterm and the final. \n\nStat 111 and 110 should definitely be prerequisites, as should R programming skills. Frequent references were made to concepts not taught in the introductory level courses like Stat 104, even though it was the only listed prerequisite. R skills were assumed rather than taught, so the R component of Stat 111 would be helpful for every student. \n\nOnly take this course if not taught by the same professor, or if you absolutely need it for your concentration credit.","It was definitely the most practical and useful class I took this semester. Victoria is leaving next semester and Kevin is taking over so I can't comment on how the class will be structured\/taught. Fingers crossed that Kevin will be good at teaching linear models.","This course is extremely useful for anyone in a data-driven field. You will learn when and how different statistical tests should be used and how to build simple linear models given a set of data. This course helps students develop and build intuition for data analysis.","No need to take this class. It's important material, but you can learn it on your own in 3 days or so.","If you're interested in a class that actually teaches how to work with data and extract meaning from data, I think that this class does a very good job of providing you with those tools. It uses R quite extensively, so having some background in the software or some sort of coding background would be helpful. Even though I don't believe it has any formal requirements, stat 111 and stat 104 level material is helpful.","This course is really good in teaching you concepts and techniques which are really applicable to using statistics in the real world. As in, given a dataset, you'll understand the pros and cons of using different testing approaches by the end of the course, and you'll have a wide repertoire of them.","I was not satisfied with the teaching in this course. The professor's lectures were not engaging and she doesn't do a good job making the concepts intuitive. Most of the learning is done with reading the textbook (which is really good) and doing the psets. The material is not difficult, but it's hard because the teaching is horrible.","While Stat 139 covers incredibly useful and important techniques in statistics (you also learn an incredible amount of statistical assumptions in a wide range of test methods), it is not taught very well. Exams are incredibly long and hard to finish. Problem sets did not take as long as Stat 110 or 111 problem sets.","Very good and useful class! A thorough treatment of basic applied statistics. The workload is very reasonable. Victoria is a very nice person and teacher.","The class can be tiresome at times, you go through all of the material you cover in Stat 104, but with greater depth.  You should have some prior knowledge of different distributions before you take it, but definitely not a deal breaker if you're shaky on the notation and the characteristics.  The tests are fair, and generally not too difficult.","STAT 139 does a good job of covering simple and multiple regression in the context of real world examples and data. The final project is a great way to explore a concept or topic that is personally interesting to you - make sure that you have a good group!","This course was yet another stat course that made me wish I hadn't concentrated in statistics.  I don't really think I learned anything that I didn't already know from 104 and 111, but it still managed to be somehow difficult.  Also, WHY IS THERE A PROJECT AND AN EXAM.  No, just no.","Take it with Rader. Stay away from Victoria","The first half of the course is a nicer version of Stat 111. That aside, I think I grasped the concepts much better here since Stat 139 went at a slower pace. The latter of the course is all linear models so if you were hoping for something besides Stat 111 + linear, look somewhere else.","This was definitely one of the best classes I took in terms of applied statistics. Learning the considerations and assumptions that go into different statistical models is a vital skill for any stats major. The workload was moderate and the assignments were interesting. The midterm was a bit unfair because of how little time we had but hopefully that won't happen again in future years.","As it was taught this semester, I would strongly recommend that you not take this course and read the textbook instead.  The Statistical Sleuth is an excellent (though expensive) book with rich online resources to help you on the R component.  I would go to lecture understanding the material and walk out confused.  I would start a pset excited about the material and finish frustrated at the disorganization of the assigment.  What makes me maddest of all, though, is that I still can't bring myself to hate this class!  The teaching staff works so hard.  They are seriously online answering our questions around the clock, and they put themselves to such high standards in giving us detaied comments on so many assignments.  Simply put, the teaching staff is spread too thin, and for that matter, so are we the students across the different aspects of this course.  There is no reason that good faculty, good students, and good material should come together in such a sad, frustrating way.  All that having been said, if you have the tolerance for some course disorganization, this is material you really ought to learn one way or another if you are looking at courses in the Statistics department, and with so much potential in the course, hopefully your experience next semester\/year will be better than mie!","It's unfortunate that Victoria might not be teaching it next year.  Q comments from previous years had remarked that the course was disorganized.  That was not the case this year.  This year it was a well-oiled machine.\n\nFirst half is hypothesis testing and second half is regression.  TFs were good, feedback was good, lecturing was solid, and assignments\/assessments were very fair.  It's a useful course and overall painless.","Linear models is def an important topic. The class was just kind of boring. Doesn't really make you excited to be a stats concentrator","Don't take this class unless the professor is changed. Terrible organized class, which is a shame given how important the material is. Areas for improvement are countless. The grading for psets was arbitrary, the final project fair was inefficient and a waste of time, the midterm was way too long and hard, the teaching of the topic was poor, there were countless typos on the practice finals and the solutions for the finals (!!), the psets were way too tedious and R oriented, and just in general, a poorly run class. There are more things wrong with the class, but frankly, this alone should make you look for another class.\n\nDon't take this unless the teaching staff is changed or there is a huge overhaul.","The material is very in depth and comprehensive. I learned a lot about tests and regression. This course emphasized the assumptions and interpretation, which would be very helpful for my job.","Fairly straightforward linear models class. I recommend that you take it if you're interested in doing any kind of applied statistics \/ research involving the use of statistics because the techniques you learn pop up ALL THE TIME (ANOVA, linear regression, t-test, etc). You want to be a knowledgeable user of these techniques. You want to check the assumptions behind these techniques and know how to interpret the results without spin. This class teaches you how to do all of that and I think if you pay attention you will be prepared to do actual research applications with statistics. \n\nA word of warning: The psets can be really tedious. They seemed like busy work sometimes. Just be aware of this before you take the class. Also, having a final project and a final exam meant a lot of work during reading period. I hope the course staff considers less tedious psets next time.","This class was an excessive amount of work and it was difficult to really get an understanding of the material through lectures. Although useful topics were covered, the material was presented such that it wasn't easy to make connections or to understand the bigger picture. The subject might be better depending on the professor, but I would not recommend the class as I took it.","As long as Victoria is teaching this class, I would look elsewhere.  The material itself is quite interesting, and the class has potential to be a good class, but in it's current state, it is not worth it.  Psets are extremely long (20 pages typed), and the midterm was quite unfair (it was 22 pages worth of problems).  There is also very little support for the students in such a class.","Super useful for analyzing experimental data.  I'd recommend grad students in biology to take this class!","be careful! It's wildly difficult and requires so much work outside of class that those who have outside commitments (i.e. graduate work) will find it hard to balance","read the textbook.","This course teaches you some very applicable skills, but a lot of material will be repeated from Stat 111. Overall, dry but useful.","Good material in there, but this is definitely not the best class out there that teaches it.","This course is analogous to Applied Math 105 (Ordinary and Partial Differential Equations) when it was taught by Michael Brenner: both courses are foundational courses in their respective departments\/fields, both lean towards methods more than theory, and both are relatively disorganized.","As someone from a non-statistics background, I have mixed feelings about this class. On the one hand, I learned a lot from it and feel much more confident about the statistics methods I plan on implementing in the future. At the same time, however, the class covered a lot of theory, manifested especially in derivations. Although we aren't really tested on these aspects of the course, they can be strenuous during class-time or in the homeworks if one doesn't have a whole lot of math or statistics background.","Not very well taught - really boring material. Much preferred Stat 110.","This course will give you a very practical foundation off which to build for data inference. Be patientâ€”the first couple weeks of the course are not fascinatingâ€”and then you will be rewarded, as the back half, when you learn a variety of very interesting regression techniques.","Victoria is often criticized for how she teaches this course. I disagree with people who criticize her - I think she is a solid professor and teaches the material well. The material, by nature, is rather dry, but also interesting at the same time since it is so applied. I think this is a great extension and a must take for anyone who wants to really understand data. A great follow-up to Stat 104.","More than anything, this course teaches valuable skills for analytical occupations. I and many of my peers (in an engineering graduate program) are interested in analytics and data science careers, and most agree that this course is extremely useful for such work.","This class is very, very useful in your statistics education!  Be aware that the problem sets can be rather long and emphasize R a lot.  In addition, Victoria isn't the best at lecturing.","This course is useful but I would not take it if Liubliuska is teaching it. She is really nice but just do not take the class if she is teaching it.","This class is useful but the lectures are a little dry and there is a lot of random stuff to remember","Spend all the time necessary on problem sets and you'll be good to go. The book and lectures are good resources","The material is useful. Unfortunately, Victoria is a horrible lecturer. Often the concepts are simple but after she attempts to explain, things are more confusing. TF Jameson explained things much more clearly in section. I would recommend this course if taught by someone more competent. Do not take this or any other course taught by Victoria. I regret taking this course this semester."]}},"mostRecentQ":{"overall":"3.30","workload":"9.99","difficulty":null,"recommendation":"3.40","enrollment":"99","response rate":"81.82","QCourseOverall":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"9","2s":"8","3s":"27","4s":"25","5s":"12"},"QDifficulty":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"7","3s":"51","4s":"23","5s":"4"},"QWorkload":{"number":"STAT 139","course_id":"4837","cat_num":"1450","1s":"0","2s":"12","3s":"33","4s":"9","5s":"12"}},"success":true}