{"scores":{"Spring '14":{"course_score":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":null,"response rate":null,"QCourseOverall":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"1","4s":"14","5s":"10"},"QDifficulty":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"4","4s":"11","5s":"11"},"QWorkload":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"7","4s":"9","5s":"9"}}},"Spring '13":{"course_score":{"overall":"4.60","workload":"3.03","difficulty":"3.71","recommendation":"4.58","enrollment":"65","response rate":"95.38","QCourseOverall":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"1","4s":"14","5s":"10"},"QDifficulty":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"4","4s":"11","5s":"11"},"QWorkload":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"7","4s":"9","5s":"9"}},"instructor_scores":[{"number":"MATH 25b","cat_num":"1590","course_id":"2842","year":"2012","term":"2","id":"f1e7055050b99585093c11ed057ec099","first":" Benedict H.","last":"Gross","InstructorOverall":"4.85","EffectiveLecturesorPresentations":"4.84","AccessibleOutsideClass":"4.06","GeneratesEnthusiasm":"4.92","FacilitatesDiscussionEncouragesParticipation":"4.34","GivesUsefulFeedback":"4.54","ReturnsAssignmentsinTimelyFashion":"4.67"}]},"Spring '12":{"course_score":{"overall":"4.36","workload":"4.08","difficulty":"4.27","recommendation":"4.19","enrollment":"29","response rate":"89.66","QCourseOverall":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"1","4s":"14","5s":"10"},"QDifficulty":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"4","4s":"11","5s":"11"},"QWorkload":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"7","4s":"9","5s":"9"}},"instructor_scores":[{"number":"MATH 25b","cat_num":"1590","course_id":"2842","year":"2011","term":"2","id":"e8a347d19aea9a0e68ab8360414dc4a5","first":"Sarah","last":"Koch","InstructorOverall":"4.65","EffectiveLecturesorPresentations":"4.79","AccessibleOutsideClass":"4.48","GeneratesEnthusiasm":"4.84","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.17","ReturnsAssignmentsinTimelyFashion":"4.31"}]},"Spring '11":{"course_score":{"overall":"4.85","workload":"2.79","difficulty":"3.74","recommendation":"4.82","enrollment":"34","response rate":"100.00","QCourseOverall":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"1","4s":"14","5s":"10"},"QDifficulty":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"4","4s":"11","5s":"11"},"QWorkload":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"7","4s":"9","5s":"9"}},"instructor_scores":[{"number":"MATH 25b","cat_num":"1590","course_id":"2842","year":"2010","term":"2","id":"f1e7055050b99585093c11ed057ec099","first":"Benedict H.","last":"Gross","InstructorOverall":"4.94","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.68","GeneratesEnthusiasm":"4.97","FacilitatesDiscussionEncouragesParticipation":"4.86","GivesUsefulFeedback":"4.87","ReturnsAssignmentsinTimelyFashion":"4.62"}]},"Spring '10":{"course_score":{"overall":"4.13","workload":"4.57","difficulty":"4.63","recommendation":"3.77","enrollment":"32","response rate":"93.75","QCourseOverall":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"1","4s":"14","5s":"10"},"QDifficulty":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"4","4s":"11","5s":"11"},"QWorkload":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"7","4s":"9","5s":"9"}},"instructor_scores":[{"number":"MATH 25b","cat_num":"1590","course_id":"2842","year":"2009","term":"2","id":"9dd19ce242fb365014af6171e2e2edb7","first":"Nir David","last":"Avni","InstructorOverall":"4.07","EffectiveLecturesorPresentations":"3.97","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.87","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.36","ReturnsAssignmentsinTimelyFashion":"3.92"}]},"Spring '09":{"course_score":{"overall":"3.22","workload":"4.31","difficulty":"4.19","recommendation":"3.69","enrollment":"37","response rate":"86.49","QCourseOverall":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"1","4s":"14","5s":"10"},"QDifficulty":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"4","4s":"11","5s":"11"},"QWorkload":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"7","4s":"9","5s":"9"}},"instructor_scores":[{"number":"MATH 25b","cat_num":"1590","course_id":"2842","year":"2008","term":"2","id":"9366a088614831bb6334a7b9f0c2fe10","first":"Lydia Rosina","last":"Bieri","InstructorOverall":"2.72","EffectiveLecturesorPresentations":"2.59","AccessibleOutsideClass":"3.37","GeneratesEnthusiasm":"2.45","FacilitatesDiscussionEncouragesParticipation":"2.59","GivesUsefulFeedback":"2.78","ReturnsAssignmentsinTimelyFashion":"3.18"}]},"Spring '08":{"course_score":{"overall":"3.81","workload":"4.23","difficulty":"4.35","recommendation":"3.88","enrollment":"37","response rate":"70.27","QCourseOverall":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"1","4s":"14","5s":"10"},"QDifficulty":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"4","4s":"11","5s":"11"},"QWorkload":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"7","4s":"9","5s":"9"}},"instructor_scores":[{"number":"MATH 25b","cat_num":"1590","course_id":"2842","year":"2007","term":"2","id":"38b1cbbb9ccf989ce4883c8867180b76","first":"Benjamin","last":"Weinkove","InstructorOverall":"3.96","EffectiveLecturesorPresentations":"4.12","AccessibleOutsideClass":"3.96","GeneratesEnthusiasm":"3.38","FacilitatesDiscussionEncouragesParticipation":"3.38","GivesUsefulFeedback":"3.67","ReturnsAssignmentsinTimelyFashion":"3.71"}]},"Spring '07":{"course_score":{"overall":"4.19","workload":"4.19","difficulty":"4.37","recommendation":"3.89","enrollment":"31","response rate":"90.32","QCourseOverall":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"1","4s":"14","5s":"10"},"QDifficulty":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"4","4s":"11","5s":"11"},"QWorkload":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"7","4s":"9","5s":"9"}},"instructor_scores":[{"number":"MATH 25b","cat_num":"1590","course_id":"2842","year":"2006","term":"2","id":"59904b659eb44512386bd81aab1c0178","first":"Andreea C.","last":"Nicoara","InstructorOverall":"4.46","EffectiveLecturesorPresentations":"4.15","AccessibleOutsideClass":"4.73","GeneratesEnthusiasm":"4.52","FacilitatesDiscussionEncouragesParticipation":"3.33","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.29"}]}},"comments":{"Spring '08":{"comments":["If you aren't considering pure math as a major, don't take it.  If you aren't willing to spend the vast vast majority of your work time on this class, don't take it.  That said, if you're a major math nerd, it's an awesome class.","Only take it if you are committed to doing a lot of work, and like math.","It is a fantastic course for you to take if you are interested with the formal basis of mathematics, that is, if you are interested in knowing how we know what we know about the mathematics you were taught, or if you are interested in seeing a thorogh and mature approach to new material with minimal hand waving and \"trust me's\" during lecture.","It's a class you take if you are very serious about mathematics and are very willing to put in a lot of time and effort. It will be incredibly rewarding if you put in 20 hours a week.","This class is difficult - find a good study group and do it early. The class will take up a big part of your life, but it's amazingly rewarding.","If you have the time in your schedule, this is a very useful course.  Beyond the material, it helps your analytic thinking and logic; very useful.","It is a hard class.","This is math hazing. Don't take it unless you're willing to sacrifice other things (I had to quit a major extracurricular activity in order to focus on math)","If you're serious about math, but you still want a life, take Math 25! If you're not serious about it, go to 23, and if you don't care about having a life, go to 55!","If you are committed to mathematics but are too reluctant to take 55, this is the course for you.","If you like Maths, take it.","Only take this class if you're at least a little masochistic.","Attend every lecture, keep on top of the lecture material, and apply yourself to the homework vigorously and rigorously.","If you are willing to work VERY hard, this course will pay off enormously. I've never learned so much in one class before.","DO NOT take this class unless you find there is some inherent beauty and truth in mathematics. There are very few applications of the subject matter and the gratification is hard sought. Also, do not take this class if you need to maintain a high GPA for law or medical school. Do not take this class if you a DI athlete.","It's hard. But it's fun. Don't take it if you're heavily into computation rather than proofs - it does teach some computation, but far less than 23b. Also, multivariable calculus is only really taught proof-wise and at the very end of the course, so if you're worried about other classes requiring multivariable calculus that term and don't feel you could teach yourself, this might not be the right class.","Math 25b is much more difficult than 25a, as well as less inspiring.  The amount of time required just to complete the problem sets is very difficult to find if you are also enrolled in another very demanding course.  If you want to learn multivariable calculus (and be able to use it in the future), do not take 25b.","The class is a huge time commitment","Chances are the professor next year will do a better job of integrating the problem sets with the lectures, so don't be put off by negative comments specific to this semester. \r\n\r\nIf you've ever thought that you're good at mathematics, and you've taken AP Calculus BC or the equivalent, take a shot at Math 25. It was the most life-changing class I've ever taken -- I made my best friends here over problem sets at 3 AM. Besides, you can always drop down if you change your mind.","Requires a lot of work"]},"Spring '10":{"comments":["Only take this course if you are willing to make it the one course that you spend hours on. When your friends are out on Friday and Saturday nights, you will be in the library, in your room, or somewhere else working on the problem set. If this sounds like something you want to do, then think again. If it still sounds like something you want to do, then sign up for the course.","Its hard.","It is alot of work, but you will learn alot.","The course material is very neat, and the course often goes in depth.  But really, I can't tell you much about how it'll be, since you'll have a different professor.  You'll know more about the tenor of the course from 25a (although I've certainly found that it can really change between semesters).  All I can tell you is, be prepared for a serious workload.","If you're interested in this course, definitely shop it. If the style or approach doesn't suit you, take something else. I found the most valuable resource in this course to be a study group. If you're interested in maths and proofs or how maths works, you should consider this course.","Expect this class to dominate your workload. It can be brutally difficult and brutally rewarding. I'm very, very happy I took it.","DON'T TAKE IT!!!!!","If you did well in 25a or 55a, then go for it. It's a lot of work, of course, but worth it.","You have to spend a lot of time on the problem sets, but you obviously know that already. The # of hours is on par with 25a, so no surprises here really.","Personally, I didn't like Math 25b as much as Math 25a, which seems, as far as I can see, to be the general consensus among 25ers.  However, the class is still certainly worth taking, and you still learn quite a lot of math, and you learn it well, assuming the class is well-taught as it was this year.  In the latter portion of the course, I would recommend taking a look at texts other than Rudin, which is frequently the required text for the course.  Spivak's Calculus on Manifolds or Munkres' Analysis on Manifolds.  If Math 25 in future years is anything like it was this year, one should expect this course to be significantly harder -- I generally had little trouble in Math 25a, but Math 25b was much more of a strain.  Nonetheless, I still recommend this class highly over others: if you can handle Math 25 and aren't quite at 55 level, then take this course.","You will work very hard but the rewards will be proportional.","If you feel more confident about math, take Math 55: the problems are less tedious and often clever, while the instructor is much better (or at least was my year).  If you do not feel as confident about math, take Math 23: the problems are designed to gain an inherent understanding of the material.  Math 25 is a midway class, often not well-taught, and has tedious, un-insightful homework problems.","The class is intense.  Expect to devote lots of time to the problem sets.  It's rewarding, but only if you don't give up.","Fully understand multivariable calculus before you enter this course.","Learn the material as you go along. Do not wait until the week before the final to try to learn all the theorems. It will be impossible, and you will cry.","Be ready for very time consuming problem sets and very difficult material. However, you will leave this course feeling smarter.","You'll get a lot out of this class, but don't expect it to be easy.  I probably would have enjoyed the 21 series, but after taking 25a, I decided it'd be better to finish the year out.  There's not too much reason to change midway.  Good luck!","if you like math, then this is definitely the course for you.  You get to really understand what things work the way they do.  Developing intuition for the higher dimensional stuff as well as stuff like uniform convergence is incredibly important and this course definitely does that.","It's difficult but we learn a lot of interesting ideas.","This class was one of the most memorable experiences of freshman year. The problem sets are really hard, but every week you learn more in this class than you will in your other three.","Math 25b is a great class- it'll really strengthen your grasp of calculus in particular. However, it is significantly more difficult (and more frustrating) than the material in 25a. Keep in mind that psets will start to take longer, especially as you get into the later Rudin chapters.","Though the difficulty of the class changes with the professor, this class is an extremely rewarding class. Be prepared to work for more than 20 hours a week in this class and to put this class before any other class you take."]},"Spring '11":{"comments":["Worth it.  And if you have a knack for rigorous mathematics, not too hard a course, but you learn a lot.","Like he was first semester, Professor Gross is an excellent instructor, one who has absolute mastery of the material and is a great mathematician and person. The course is taught quite well considering how much \"hand waving\" had to be done in order to prove various theorems that invoked concepts from topology and complex analysis.","While I cannot comment on how the class would be without dear Prof. Gross, I can say that the material covered is really quite interesting. While there are moments of confusion, overall it is a very understandable course that really got me excited about more abstract concepts in analysis. If you are choosing between this and 23b, there is no question you should take this.","This class defines the Q score \"5\". It is even harder and faster than 25a, but also even more interesting.","Was much less of a time commitment than 55a since 55 covered so much material, and as a result I understood the material we did cover a bit better this semester.","Prof Gross is an amazing lecturer (although it will be a different person next year).  The book used brought the rigor of homework down, but lectures were sufficient substitute for the textbook anyways.  Overall, a great course where you learn a lot.","Take it! This class is very challenging, but in the end you will become a better mathematician. It's the natural follow-up to 25a, though it oftentimes gets harder and more convoluted. It's a nice \"club\" to be in, along with your classmates, although Prof. Gross (who is a baller and an awesome professor) won't be teaching it next year.","This class is great. It's a pretty difficult course, but it's a lot of fun (and its definitely manageable).","This courses offers a great rigorous treatment of what may be to some familiar calculus concepts. It's great to finally be able to build up calculus from the ground-up. Oh and definitely take this class if Professor Gross is teaching.","This class is truly epic. I would take it again if I could, and some of my best friends have come out of the group experiences we've had together tackling problems and hanging out in the aftermath. If you're interested in math (or a related feel), and really want to be part of a group community, this is one class that will make your freshman year worth it.\r\n\r\nThe material is challenging, and I will say that I didn't get the best grade (but it wasn't terrible either!) -- but it's so worth it.","I would compose an ode to Professor Gross's magnificence here, but I fear mere words would fail to capture the sheer scope of his grandeur. Simply put, Gross is the best teacher I've ever had: he lectures with an obvious passion for the subject, and at times goes on amazingly entertaining tangents that our entire class loved. What's more, Math 25 wasn't just a class: it was a family. Bonding through shared trials, many of us became close friends, finding more in common than just our love for mathematics. Take this class--you won't regret it.","If you enjoyed Math 25a, then definitely stick with 25b.  It's somewhat more difficult--probably because more students find analysis less intuitive than algebra--but still well worth it.","This class is difficult, but it is easily worth the work you will put into it. The lectures are phenomenal, although the textbook is not great.","This course was one of my favorites this semester, due primarily to Professor Gross. His lectures are always so full of energy and enthusiasm that you cannot help but be engaged in the material. The problem sets and exams are very reasonable and only moderately difficult with the help of your fellow classmates (on problem sets only, of course).","This class is amazing.  Professor Gross made this the best class I have ever taken.  It teaches you to do math rigorously, and it is extremely fun.  I would highly recommend this course.","Make sure you don't miss class, because Edwards is not going to help.","I loved this class!  Calculus and analysis are a lot different from the linear algebra we learned in Math 25a, but again Professor Gross is an awesome teacher.  He completely deserved the teaching prize he won this semester.  The CAs, and especially the other students, are\/were great as well.  If you want a tough class with a great community, take 25b!","AWESOME COURSE WOULD TAKE AGAIN A+++++++++++++++++++++. In all seriousness, the class is engaging and Professor Gross is absolutely superb (although I don't think he's teaching it again next year) in his explanations. You do cover a whole lot in a short time and I would highly recommend this class. There is a lot of available time to get help from the CAs and the midterms and the finals are written very fairly. FRESHMEN INTERESTED IN MATH, TAKE THIS COURSE!","I personally did not enjoy real analysis as much as linear algebra, but this was still a worthwhile class to take. Under Professor Gross, the class was not too painful -- the psets did not take too long, and the test were not very hard. The material is definitely very abstract, and I often found myself questioning the applicability of what we were leraning. If you're interested in trying out abstract, theoretical math, this is definitely a good class to take.","Very difficult course if you have never tried theoretical math before. If you can understand the topics however, the course is very fun.","This class along with 25a are the best math classes I have ever taken, thanks in no small part to Professor Gross. The material is difficult, but rarely incomprehensible, and the collaboration aspect of the homework is wonderful.","It's a whirlwind tour through the vast array of topics under the umbrella of multivariable calculus. You go through a lot, and spend too much time on computing integrals and not enough time on learning interesting theorems. But it's with Professor Gross, whose mere presence should be enough to convince you to take the class , and is by virtue of its theoretical approach much better than any other multivariable calculus class Harvard offers (assuming you have the requisite sophistication and prerequisites).","First and foremost: if you EVER have a chance to take a class with Dr. Benedict Gross, DO IT.  He is one of the best teachers and most fabulous lecturers out there.  He took the amazingly dense material covered in this class and structured and explained in a clear, understandable, and exciting way.\r\n\r\nAs to the class itself, it is a wonderful introduction to proof-based math for those who are unfamiliar with it.  It is a difficult class, but either you will be able to do it, or you will find people that will help you.  You make some great friends through this class, and it really does kindle a scholarly spirit.  Recommend with extreme enthusiasm.  This class defined my freshman year."]},"Spring '13":{"comments":["The material may not be as refreshing as Linear Algebra (Math 25a), but Gross and the textbook make it a great time.","The textbook was terrible, but otherwise a great class. Fascinating material, and Professor Gross is incredible.","If you did okay in 25a, I recommend continuing with 25b. The class felt easier than 25a, although this may be the result of experience instead of actual easier material.","25b, in my opinion, was much less enjoyable than 25a. I still thought the class was interesting, and Benedict Gross was a great professor, but the material is hard to understand and messy. Make sure you have a foundation in either abstract math or multivariable calculus before you take this class.","Gross is an amazing professor. He really cares about his students, and his lecture are funny, yet informative. The assignments and tests for this class are not insanely difficult. Try to go to lectures, early as it is. If Gross is teaching, definitely worth taking!","Rewarding course.","2nd semester is MUCH harder than 1st semester. Many of my friends who moved up from 23a struggled for this reason and I was completely unprepared for the increase in difficulty. I had a solid A in 25a and I feel like I would be lucky to get an A- in 25b.","This is an amazing class. Prof. Gross is by far the best lecturer I have ever had.","This is simply an all around great class. Professor Gross is an amazing teacher and a really great guy. The problem sets tend to be more on the computational side compared to 25a so they don't take as much time. I moved up from 23a and found the material to be manageable. Having made this transition, I would recommend that anyone considering 23\/25 definitely take the full 25 sequence. It's slightly more work but you get a much deeper understanding of the mathematical concepts. All around this is a great multivariable calculus class.","If you took 25a, take this class. It shows you how useful the material in 25a is and really teaches you the calculus you thought you knew.","25b is similar to 25b but not quite as challenging and the material isn't as cohesive. If you're interested in pure mathematics and want a well-taught and interesting introduction, this is a great course. Watch out for the hour exams though - you need to go very fast on them.","If you are interested in proof-based math and have some background but are not ready for or wanting to do Math 55, this is the course for you.","This class is everything a math class should be--beautiful, elegant, well-taught, fun, and challenging without being overly difficult. Personally I found it easier than 25a, but depending on your exposure to linear algebra versus multivariable calculus, you might disagree. The psets were more computational than proofy and the exams more regurgitative than proof-based, which was admittedly frustrating. Nevertheless, Benedict Gross is one of the most fantastic professors you'll ever have, you'll be best friends with your pset group, and your understanding of calculus will be completely turned on its head in the best way possible.","The homework is more computational and straightforward than in first semester. The difficulty of the tests is about the same.","This is a great class that everyone with the right background should take.","Math 25b is a challenging course, which often forgoes intuitive understanding for mathematical rigor - be prepared to spend time parsing and internalizing symbolic notation, especially for the more heavily analytic portions of the material. The lectures are at times difficult to follow, but the problem sets are generally gentle, and Professor Gross is an amazing lecturer. Highly recommend.","I didn't take 25a, but still found this class worth taking because Professor Gross's lectures were awesome and conveyed just how beautiful math is.","This would be a weird elective, since it has minimal real-world application. So, I assume you have to take math, meaning you're debating between 23, 25, and 55. My advice would be to start in the higher level and move down. Also, take a look at the Q scores of that year's professors. It makes a big difference.","This was awesome! Professor Gross is a wonderful teacher, and any flas in my understanding of the subject is entirely my own fault.","1. This class is way harder than math 25a. Take it with some easy classes\r\n2. Do go to lectures.\r\n3. Probably go to sections.\r\n4. Think twice if you are moving up from 23a. If you do want to do so, borrow some math25er's Axler and look at the orthogonal complement and spectral theorem. Learn those proofs.","You really shouldn't need the Q to tell you whether or not you'll enjoy 25b. Make the decision based on your enjoyment of last semester. That being said, 25b is substantially less work but markedly less fun than 25a. Analysis is much less elegant than linear algebra.","I write this for 25 a and b. \r\n5 on Calculus BC? 800 on SAT Math? 800 on SAT II Math? And a 36 on ACT Math? Chances are, this course is too difficult for you. You need to have had exposure to mathematical proofs, which in my high school could not be found in any course it offered. If this doesn't describe you, 23 is your best bet. If it does, this course will be difficult but doable. If you have had exposure to linear algebra or multivariable calculus, then the respective portions will be moderately difficult, maybe somewhat easy. If you have done competitive math on a state or national level, this will likely be a good fit.","Take it, especially if Professor Gross is teaching it again!","Really, really good class partially because Professor Gross is a boss and partially because of the community of students and the interesting material. Definitely don't take if you don't really like math and have a solid calculus background as well as either a strong proof writing, competition math, or linear algebra background.","This class is great if you know you're into theoretical mathematics. Be sure you're comfortable with the pace of the class though. Professor Gross is amazing, and he really loves mathematics.","The proofs in this course can seem hand-wavy at times, but that's only because we're dealing with pretty hard material. When I finally understood the material at the end of the course, I found it to be a very rewarding experience. But during the semester I often felt lost and confused.","Professor Gross is fantastic, and the course material is very well paced. It's a difficult class, but it's well worth it","Take Math 25! Just do it. You won't regret it, I promise.","worth","Even though lecture is early, attend! Professor Gross is a great teacher, and you can learn a lot from him.","This class applies all of the linear algebra concepts which we learned first semester to multivariable calculus in a rigorous way.   Multivariable is extremely important in every discipline so I think that everyone who takes 25a should take b as well.   The course load is comparable to the first semester, although the material is often more challenging to understand.","If 25a was the right choice for you, so is 25b. By now, you've realized that Gross is a fantastic professor, and he's almost as good at teaching analysis as he is at teaching algebra. (take that with a grain of salt; I really don't like analysis as much as I like algebra)\r\n\r\nIn short, though, this course is a fine, theoretical introduction to real analysis. It is less theoretical and more applied than 25a, but not by too very much. The problem sets are easier and less interesting, and the Edwards textbook is nowhere as great as the Axler from 25a, but all in all, it's a very nice course.","This course is tough, but if you're up for it, it's definitely worth it.","Gross is a fantastic instructor. This really is a must take course for prospective math concentrators. Gross is able to show the connections between all the topics and his \"stories\" provide context for the material. Additionally, his lectures are very effective and you will find yourself wanting to go to lecture because they are very engaging.","Math 25 is a phenomenal course, and Prof. Gross is probably the best teacher I've ever had for any course, ever. The math is interesting and the lectures are incredibly entertaining (as well as being clear and actually teaching the material). Psets take 10-15 hours a week; so worth it, though.","If Gross is teaching (and you think you can handle the level of mathematics), take this course. Do it. Seriously. Do. It.","Math 25b is a great course, especially with Professor Gross. If you're willing to spend time with the material, you'll definitely get a lot out of it.","Real analysis is harder than linear algebra, but Gross does a wonderful job of making it more manageable and presenting a general overview of important concepts. Do not expect a completely thorough covering of the main theorems this semester, but expect that you will have a good general understanding of a variety of important concepts in real analysis by the end. The problem sets and exams actually seemed more manageable and straightforward than those of Math 25a, despite the significantly harder material.","Learn each concept as you go along. There's nothing worse than having to cram\/understand a bunch of theorems right before an exam","If Professor Gross is teaching, and you might be interested in deeper math, but Math 55 sounds too daunting, or Math 23 is too flaky, take this. If Professor Gross is teaching, and you might find multivariable calculus useful, take this. Actually, if Professor Gross is teaching, take this.","You should definitely go to class and stay on top of the material! The homework isn't actually TOO bad, and it is indeed possible to \"get by\" with a vague understanding when it comes to the psets. However, this isn't what you should do to get a good understanding of the material. Professor Gross is a great person and a wonderful lecturer, so it's totally worth it to go. Also, the exam isn't THAT easy to cram for, so just be attentive.","Professor Gross is fantastic! And the material is interesting. It is a lot of work, so be prepared to put the time into the class.","Like Math 25a, 25b is not a class for the faint of heart. It suffered this semester from a rather unfortunate textbook that was both typo-ridden and occasionally incomprehensible (if the course uses C.H. Edwards, consider supplementing with something like Rudin). That being said, Professor Gross is an absolute delight to have in lecture, and if you enjoyed 25a, or if you're coming from 23a and looking for a little more rigor, this class is a wonderful one to take!","This class is great for learning real analysis at a high level. Students with the proper interest and background should absolutely take this course.","If you see Professor Gross listed on any math class, take it. His clear and entertaining teaching style is unparalleled in my experience. If he is teaching the 25 sequence, I would highly recommend that you take it. You will feel like you have deeply learned a subject and be prepared for the classes to come.","Take this class for Professor Gross: he is an engaging and effective lecturer (and has a great sense of humor), and is always looking out for his students inside and outside of class.","If you are somewhat comfortable with proof-based math and are willing to put in the hours, this class is awesome! Gross' lectures are very engaging, and he is very good at giving intuitive explanations of complex notions.","I took 23a and bumped up to this class for my second semester. I never really took the time to look over and catch up with the linear algebra material that was not covered in 25a, and I feel that hurt my performance in midterms and finals. For those planning to bump up, do it if and only if you're able to and are willing to put in the time to cover 25a stuff IN ADDITION TO all the 25b stuff you have to do which is a lot of work alone.","If you took 25a or if you have experience with linear algebra, and if Prof. Gross is still teaching it, you should take it. Lectures are awesome, don't miss out."]}},"mostRecentQ":{"overall":null,"workload":null,"difficulty":null,"recommendation":null,"enrollment":null,"response rate":null,"QCourseOverall":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"1","4s":"14","5s":"10"},"QDifficulty":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"4","4s":"11","5s":"11"},"QWorkload":{"number":"MATH 25b","course_id":"2842","cat_num":"1590","1s":"0","2s":"0","3s":"7","4s":"9","5s":"9"}},"success":true}