{"scores":{"Spring '13":{"course_score":{"overall":"3.81","workload":"1.59","difficulty":"2.73","recommendation":"3.78","enrollment":"45","response rate":"84.44","QCourseOverall":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"1","2s":"3","3s":"8","4s":"15","5s":"10"},"QDifficulty":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"3","2s":"10","3s":"18","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"18","2s":"16","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1661","cat_num":"2115","course_id":"998","year":"2012","term":"2","id":"572b5f0ac1c20198b6ab3e74138c4a93","first":" Robert","last":"Stavins","InstructorOverall":"3.94","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.78","GeneratesEnthusiasm":"3.86","FacilitatesDiscussionEncouragesParticipation":"3.87","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '12":{"course_score":{"overall":"3.62","workload":"1.81","difficulty":"3.00","recommendation":"3.60","enrollment":"99","response rate":"85.86","QCourseOverall":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"1","2s":"3","3s":"8","4s":"15","5s":"10"},"QDifficulty":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"3","2s":"10","3s":"18","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"18","2s":"16","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1661","cat_num":"2115","course_id":"998","year":"2011","term":"2","id":"572b5f0ac1c20198b6ab3e74138c4a93","first":"Robert","last":"Stavins","InstructorOverall":"3.83","EffectiveLecturesorPresentations":"4.01","AccessibleOutsideClass":"3.55","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.33","GivesUsefulFeedback":"3.62","ReturnsAssignmentsinTimelyFashion":"3.75"}]},"Spring '11":{"course_score":{"overall":"4.14","workload":"1.83","difficulty":"2.83","recommendation":"4.22","enrollment":"45","response rate":"80.00","QCourseOverall":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"1","2s":"3","3s":"8","4s":"15","5s":"10"},"QDifficulty":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"3","2s":"10","3s":"18","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"18","2s":"16","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1661","cat_num":"2115","course_id":"998","year":"2010","term":"2","id":"572b5f0ac1c20198b6ab3e74138c4a93","first":"Robert","last":"Stavins","InstructorOverall":"4.29","EffectiveLecturesorPresentations":"4.43","AccessibleOutsideClass":"3.94","GeneratesEnthusiasm":"4.28","FacilitatesDiscussionEncouragesParticipation":"3.85","GivesUsefulFeedback":"3.62","ReturnsAssignmentsinTimelyFashion":"4.10"}]},"Spring '10":{"course_score":{"overall":"4.04","workload":"1.93","difficulty":"2.98","recommendation":"4.11","enrollment":"66","response rate":"83.33","QCourseOverall":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"1","2s":"3","3s":"8","4s":"15","5s":"10"},"QDifficulty":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"3","2s":"10","3s":"18","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"18","2s":"16","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1661","cat_num":"2115","course_id":"998","year":"2009","term":"2","id":"572b5f0ac1c20198b6ab3e74138c4a93","first":"Robert","last":"Stavins","InstructorOverall":"4.07","EffectiveLecturesorPresentations":"4.22","AccessibleOutsideClass":"3.65","GeneratesEnthusiasm":"4.06","FacilitatesDiscussionEncouragesParticipation":"3.72","GivesUsefulFeedback":"3.76","ReturnsAssignmentsinTimelyFashion":"3.76"}]},"Spring '09":{"course_score":{"overall":"3.98","workload":"1.98","difficulty":"2.92","recommendation":"4.18","enrollment":"65","response rate":"76.92","QCourseOverall":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"1","2s":"3","3s":"8","4s":"15","5s":"10"},"QDifficulty":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"3","2s":"10","3s":"18","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"18","2s":"16","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1661","cat_num":"2115","course_id":"998","year":"2008","term":"2","id":"572b5f0ac1c20198b6ab3e74138c4a93","first":"Robert","last":"Stavins","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.28","AccessibleOutsideClass":"3.87","GeneratesEnthusiasm":"4.22","FacilitatesDiscussionEncouragesParticipation":"3.43","GivesUsefulFeedback":"3.22","ReturnsAssignmentsinTimelyFashion":"3.73"}]},"Spring '08":{"course_score":{"overall":"3.75","workload":"1.92","difficulty":"2.95","recommendation":"3.92","enrollment":"98","response rate":"67.35","QCourseOverall":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"1","2s":"3","3s":"8","4s":"15","5s":"10"},"QDifficulty":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"3","2s":"10","3s":"18","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"18","2s":"16","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1661","cat_num":"2115","course_id":"998","year":"2007","term":"2","id":"572b5f0ac1c20198b6ab3e74138c4a93","first":"Robert","last":"Stavins","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.11","AccessibleOutsideClass":"3.07","GeneratesEnthusiasm":"3.91","FacilitatesDiscussionEncouragesParticipation":"3.26","GivesUsefulFeedback":"2.59","ReturnsAssignmentsinTimelyFashion":"3.10"}]}},"comments":{"Spring '08":{"comments":["If you want to think intelligently about environmental issues - which will become increasingly important - you should take this class.","Very interesting material that everyone should know! Not too much work. Funny professor.","Difficult. Must take good hand written notes. Computers not allowed","Good way to see how powerful economics can be. Super important if you are interested in actually being a politician. not too hard. good senior class. repetitive but as a result very thorough and deep. funny professor.","Wonderful course, I highly enjoyed it.","should have an interest in environmental issues and a background in economics","This is an interesting survey of how economic tools can be applied to environmental problems... I'm not sure I'll ever really trust economics, though.","If you're at all interested in economics and \/ or the environment, or even if you have no prior interest, I highly recommend this class.  Lectures are fun to go to, and the subject material is really interesting and highly relevant in today's world.","an interesting foray into material that provides a kinder look at the uses of economic analysis in guiding environmental policy","Take it!","It's fun and interesting. TAKE IT.","only take it if you have to.","It has interesting subject matter and has a relatively light workload.","There is no guidance in terms of how to improve on problem sets or exams.  They are way to harsh in their grading. They never use the textbook so you can't supplement the lectures with outside information.","It's boring, but it's fairly easy. The material and applications are quite cool though.","Grading is relative to everyone else in the class, so you should be on your A game!","Relevant and important perspective for understanding current events and politics, including but not limited to environmental issues","\"Too bad you didn't take the course when Ms. Jack and Ms. Rostapshova were course assistants!\"","Take this course if you REALLY enjoy economics, no matter how mundane the particular subject.","Prof. Stavins makes these topics very interesting.","The class covers a daunting amount of material and getting it all down on exams is nearly impossible.","Such an interesting way to look at environmental problems - will change your perspective on regulation and policy.","This course is a great way to apply basic economics to environmental policy.","In today's world where environmental problems have multidimensional consequences and implications, this course serves as an excellent introduction to the economics of the environment that helps us think critically about what is happening around the world.","not necessarily an easy class, but worth it - learn important concepts about environmental economics, professor is very good","Very good class that is extremely useful and not too difficult.","The information taught in this class is fascinating and very pertinent to world issues today.","well organised, great instructor, interesting material","Prof. Stavins says that one goal of the course is to convince students that it is not a contradiction to be both an environmentalist and an economist, and he succeeds.  But the teaching staff needs to do a better job of supporting that.","fun, interesting, and not confusing even for non-economics concentrators","An interesting class that is pretty low-stress.","If you are interested in policy applications of economics, this is a great class."]},"Spring '11":{"comments":["Great survey course of everything going on in environmental ec and policy","A perfect course for someone who is interested in a broad overview of environmental policy and economics, particularly on air quality and climate change.","Even though the lectures are sometimes dry, this class has a very light work load and still presents very interesting arguments about various environmental regulations from different standpoints and culminates with climate change policy which is very relevant and up-to-date to what is going on today in both the economic and political spheres.  This course requires no science background.","If you are going to work for either government or non profit organization where you design or evaluate environmetal policy, this is a must course.","This class is like Economics 10 and ESPP 78 smashed together into one class. It's a hard class if you aren't an Econ concentrator, so keep on your toes with the concepts since the course seems deceptively easy at first.  If you're taking this class because you're interested in economics and the environment (i.e. you aren't taking this class because you have to), it's a good class, but be prepared to put in work for it. The material is interesting, although all of the economic concepts can get pretty dry at times.  Oh, and beware of the midterm, it's hard and worth a large percentage of your grade as is the final... If you don't like structured harvard courses (i.e. not having to attend section and not worrying too much about the grades you get on your problem sets), this class is for you.","This is a must-take class if you are interested in Environmental issues and really want to make a difference.","Ec 1661 is a truly great class. It teaches you about a really interesting subject, and professor Stavins is incredible.","Stavins is a fantastic lecturer, seems a little dry at first but wait until he starts cracking jokes--you'll laugh at least 5 minutes a day. The no-laptop policy really helps you stay focused in class and it actually flies by because he adds one or two of his own stories (usually pretty funny) each class.","If you would like to understand what is going on in the real world in regards to environmental policy and climate change policy on a deeper level take this course!","More policy than number oriented - does a great job of telling you what you need to know.","It's a great class and Stavins is a wonderful professor.  He is both funny and engaging, and is also very clear when explaining concepts.","The class is great! The lectures are entertaining and interesting and you will learn a lot. If you feel like you've been learning the same stuff over and over in Ec 10 and Ec 1010 and other economics courses, this class will be a breath of fresh air. Yes - concepts from Ec 10 keep appearing, but you will learn a lot more than that.","great foundational class for learning about climate change and the economics behind it. a very straightforward class with most of the material you need coming from lecture","This class is extremely organized - there are no surprises. Material is presented at a reasonable pace and Stavins does a good job keeping to the syllabus. Stavins is a solid lecturer who can intersperse dry humor into the lecture to keep things interesting. The workload is very manageable.","Interesting material and a good way to get exposure to environmental economics","It's exactly what it advertises: fundamentals in environmental economics and policy. It's interesting, practical stuff, and Stavins is a good lecturer.","come prepared","Not too difficult conceptually\r\nHour and a half Lectures are somewhat long"]},"Spring '12":{"comments":["Great lectures, interesting content, and modest workload.","Not much new knowledge about economics if you've taken Ec10, the material is not well-organized, lectures are too long for the amount of information that you are getting, and the exams and homework are not really fair (demand a lot of memorization, office hours can get overcrowded, etc.).","This class is basically a government class, not an economics class. It is not very quantitative, and will be a disappointment to people expecting to learn substantial economic analysis (you learn nothing above Ec 10 level analysis). Better suited to gov\/ESPP people than Econ or Applied Math.","The class is not a lot of work, but the midterms and final were deceptively difficult, in that the grading was harsh though the questions were easy. The lectures are also very dry, unfortunately, given that the topics covered warrant much more enthusiasm and discussion. I would only take it if you are required to.","Most ESPP majors have to take this class, but I loved it- I actually learned a lot from Professor Stavins and he can be pretty sassy in class, which is always entertaining. The lectures are long but not too bad and I thought the subject matter was really interesting!","This class is an excellent introduction to environmental economics, and familiarizes students with some of the most interesting research areas in the field.","great econ elective","It's a great course and gives you a solid understanding of the main topics in environmental economics. However, it is very much a hands-off, impersonal, big lecture course. If you are looking for a more intimate learning setting, this is not it. The material is mostly fully absorbed when studying for the exams.","The content was interesting, but I didn't enjoy the powerpoint based lecture format.","This course is accessable from all backgrounds, but definitely will require active engagement in lecture because things move fast. The assignments can be a little tricky but if you print out the section notes they are definitely doable. OVerall the workload for the course is pretty light, and while the midterm caught a lot of people by surprise the final was surprisingly general and easy. Stavins is a funny guy is his own dry way, and I ended up enjoying this course a great deal. Just don't get your hope up for a lot of discussion time or student input.","It's a standard economics policy based course. It's interesting, but I think to get an A in it you really need a genuine interest environmental policy.","It was an easy, but very interesting class. The support structure was in place for those that needed more help, but going to sections and office hours were not necessary to doing well in the course. Stavins was a very funny, knowledgeable, and engaging lecturer. The class felt more like a policy, and less like an economics course though.","Concepts you learn are very useful and applicable in life, the teaching style is great because it is focused on fundamental methods and intuitions derived from those methods.","This course is pretty straightforward, Stavins is a good lecturer and a very clear presenter.  Shouldn't require that much effort to do well on, but Stavins makes a point that the curve in this class is slightly more rigorous than normal.","I had high expectations for this class, but the first half of the class is pretty boring. It just does very heavy micro stuff and is rather dry and technical at times. The class picks up in the second half when we started talking more about policy and climate change.","readings aren't necessary, just pay attention in lecture. any lingering concerns should definitely be addressed to the TFs, because they know a lot and cover the required material in the review sections. Stavins comes out with unbelievably harsh comments, but as long as you're not caught off guard (ie stay focused and understand the class topics), you'll have a lot to learn from him - the guy has a lot of practical experience","Boring and Professor is arrogant. straightforward though.","I think this class is very interesting!  The topic is really cool and gives an interesting lens for looking at environmental issues and policies.","the professor is engaging and you'll want to go to every lecture.","It's a great class if you're interested in solving environmental issues through policy. Although it can be frustrating at times, you come out of it with a well-informed perspective on the economics behind current environmental issues.","This is a great class! You should take it--Stavins tells great stories and at the end you'll feel like you have a better grasp of the concepts behind environmental policy and form a more informed opinion of what legislation is necessary to address global climate change.","Professor seems interesting at the beginning but the class is very fast paced, some things are not explained as thoroughly as they should for midterms. Overall, its not an easy course, be careful when choosing it.","Kennedy school students are frustrating to have in class. Teaching staff is very lazy, but people find Stavins entertaining.","An excellent introduction to the topic, capably delivered.","Great overview on important issues and methods used in Environmental Economics.","this course gives you a good understanding of how economists evaluate environmental problems and provides a strong background on climate change policy. the course lacks in interesting questions and discussion.","Go to lecture...its easy to get lost. Pretty tough.","Fun class, very moderate workload, midterm\/final are weighted a lot so watch out; Professor Stavins is fantastic and lectures are interesting, informative, and well-structured.","The lecture material is interesting and Prof Stavins is kind of funny. Beware that you'll have Kennedy School kids in the class who ask tons of dumb questions and who really hold up the class. The exams are pretty straight forward and are very reasonable if you've been going to class.","I was excited about this course but it wasn't what I expected it would be. I often felt out of place or not prepared with other students that study this topic as their main focus. It was more difficult than I thought it would be and less interesting.","Good to learn this material, but the course was not very well polished, and the structure was confusing.  Too much jargon, too little integration of concepts into a broader scheme.","This course is not as easy as it seems and requires you to keep up with readings.","The professor's charisma made a huge difference to this class. The TFs were amazing people too. THe final involves a lot of memorization.","Great class! Makes me wish that I had concentrated in Economics sometimes and not environmental science and public policy. I really enjoy Stavins's anecdotes, the TF's are great, the assignments are good, and the mid-term exam wasn't too hard.","Not the easiest class, but I definitely enjoyed it. It is taught in a straightforward manner, even if the material is sometimes difficult, and it is on you to put the time in to understand it.","Please don't take this class. You would be better off just reading the Markets and the Environment textbook by Keohane that is assigned for this class. Prof. Stavins in his lectures essentially repeats the same material but in less clear language. In addition, he is rude and disdainful of the students and actively discourages you from asking questions and would give very short and unhelpful answers to any questions you do get to ask. Finally, the grading in this class is very harsh and they take points off arbitrarily on the midterm, psets, and final. Even though I ended doing well in this class, I definitely regret taking it, and should have just spent the time I devoted to lecture just to reading the Keohane textbook.","Only take this class if you've already taken an intro-level economics class (like Ec. 10)","Interesting look at how to solve real world economic problems; one of the most applicable classes I've taken. I didn't love it. Stavins is the quintessential Harvard douchebag professor","This course has a very reasonable workload and has good material, but the lectures can get monotonous.","The class moves to slow and is not mathematical enough to be a good ec class.","Very annoying class.","This is a really interesting course and Professor Stavins is a great lecturer. The amount of course material can seem overwhelming at times. I also object to courses that determine your grade based almost exclusively on 2 exams (the problem sets are worth very little).","This class is confusing and can be pretty boring. It provides a basic overview of environmental economics but ultimately I do not feel like I learned a great deal of information.","Professor Stavins does a great job presenting the material.","Great economic intuition in this area, taught by a professor who has been â€œat the tableâ€\u009d and knows the realities that exist.","Not a bad way to fulfill and ec requirement without much work. Interesting topic","This class has really good subject matter and I'm going into the environmental sector and am really happy I have had this.  Lectures are pretty dry but the Powerpoint slides are helpful.  I'd recommend taking it the year after you take Ec10.  I took it two years later and it was hard to remember the stuff, although there were review sessions at the beginning of the semester to help with that.","Yes, very interesting material and great resources. Really improved my interest in economics and learned a lot about presidents' history with the environmental movement, which was really beneficial. Stavins is kinda rude, but he knows it, and it's entertaining,"]},"Spring '13":{"comments":["This class was very well taught, very interesting, and very easy. Stavins is engaging and the material will be interesting for anyone with basic economic background and the slightest interest in the environment.","At first, I hated Stavins because I thought he was just another economist. But as the weeks progressed, his humor and realistic\/straightforward\/non-partisan attitude was very refreshing and engaging. The psets were not hard; they were always taken from the lectures, so it was easy to do well on them. Same for exams, but the class is graded on a curve, so watch out. He goes quickly through the material, but as long you pay attention and attend class, you'll be fine. As for the readings, they are useful for some questions on the psets, but they were also nice supplements to the lectures. Overall, this class was amazing, would highly recommend!","This class is challenging because it is not curved and you are competing against at least half grad students and the midterm\/final are nearly all that factor into your final grade.","This class is quite easy, but not boring. I highly recommend as an elective if you want interesting lectures and not too much work.","Really, really easy and gets quite interesting towards the end. Stavins clearly knows a ton about the topic.","Definitely attend office hours and talk with TF's about what they feel is important throughout","This course will be hard and easy all at the same time.","This class is unbelievably dry and useless.  I took this course because of the writing requirement and I am now regretting it.  This class is not only boring, but useless because of how dry the professor is, how many Kennedy School lecture heroes attend this course, and essentially the material is forgettable.","Fun, engaging and relatively easy way to learn about the environment. Very heavily weighted to the midterm and final though so be ready for that.","Good class, be sure to attend the lectures.","This class illustrates well how decision-making is made in the US. Prof. Stavins is the archetype of the Harvard professor, \"frequently called by journalists and the White House\" to make comments on about anything. It is strongly biased and discussion is not really encouraged unfortunately.","This course helps put environmental issues into an economic framework, a necessary context in which to understand environmental policy.  It helped me to rethink how I approach my own passions and allowed me to analyze environmental issues from an economic perspective.  The lectures are engaging and the workload isn't too heavy, but do the readings because they are worthwhile.","The material is pretty dry, but Stavins is a funny guy and an expert in the field.  Pretty low workload, but psets and exams will be tough if you don't put in any effort.","This class was very straight forward and not too much work. I hardly went to the optional section but the TFs were all very helpful and I enjoyed Stavins's lectures. The reading material was great as well and it wasn't overwhelming! Take the class if you're at all interested in environmental\/econ policy.","Definitely make sure you have a decent background in microeconomics before you take this class. I was going to take this course last year without having taken EC 10, and I realize now it would've been a lot of catching up if I had. Anyway, Stavins is a fantastic man in his field, and is a great professor.","If you are at all interested in either environmental policy or economics as it pertains to the environment, take this class! The workload is do-able, and the methods you learn are easily applicable in other economics courses.","Professor Stavins is hilarious and a really entertaining lecturer.  I'm sure people will comment here that he is really pompous but if you just accept it it can make the class a lot more fun.  Also, don't expect a rigorous course from a technical perspective.  It is more focused on teaching you the basics.  You should expect to be able to follow all of the important news about environmental policy after taking this course.","Lecture was interesting and engaging and lots of guidance was provided on the problem sets.","The course material is difficult but it is extremely interesting, especially if you are interested in the subject matter. It is pretty laid back (structure-wise), almost to the point of being too lax.","Reading the 'markets and the environment' book is a good addition to the lectures. That said, just focus on doing well on the midterm and finals (85% of your grade). For psets, working would others would be best--though the homework isn't too bad.","The amount of content will catch you off-guard towards the end.  Also, keeping each class's material in context by looking at the slides beforehand will keep it engaging."]}},"mostRecentQ":{"overall":"3.81","workload":"1.59","difficulty":"2.73","recommendation":"3.78","enrollment":"45","response rate":"84.44","QCourseOverall":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"1","2s":"3","3s":"8","4s":"15","5s":"10"},"QDifficulty":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"3","2s":"10","3s":"18","4s":"6","5s":"0"},"QWorkload":{"number":"ECON 1661","course_id":"998","cat_num":"2115","1s":"18","2s":"16","3s":"3","4s":"0","5s":"0"}},"success":true}