{"scores":{"Spring '14":{"course_score":{"overall":"2.90","workload":"1.60","difficulty":"2.80","recommendation":"3.10","enrollment":"57","response rate":"80.70","QCourseOverall":{"number":"GOV 1360","course_id":"11313","cat_num":"22949","1s":"10","2s":"8","3s":"11","4s":"11","5s":"6"},"QDifficulty":{"number":"GOV 1360","course_id":"11313","cat_num":"22949","1s":"4","2s":"13","3s":"21","4s":"6","5s":"2"},"QWorkload":{"number":"GOV 1360","course_id":"11313","cat_num":"22949","1s":"26","2s":"14","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 1360","cat_num":"22949","course_id":"11313","year":"2013","term":"2","id":"21d2a79c6eb1f2912c18d3ec9c0c6521","first":" Mark J","last":"Penn","InstructorOverall":"3.30","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"2.90","GeneratesEnthusiasm":"3.50","FacilitatesDiscussionEncouragesParticipation":"3.10","GivesUsefulFeedback":"2.50","ReturnsAssignmentsinTimelyFashion":"2.50"},{"number":"GOV 1360","cat_num":"22949","course_id":"11313","year":"2013","term":"2","id":"eaf85013fcd34b027638a1a32dd83502","first":" Stephen Daniel","last":"Ansolabehere","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.60","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"2.50","ReturnsAssignmentsinTimelyFashion":"2.30"}]}},"comments":{"Spring '14":{"comments":["Terrible class, do not take it. It is disorganized and this makes the whole course almost unbearable. The topic is interesting and it could be a good course, but this course lacks a basic structure. Mark Penn is interesting and is a cool guy, but find a way to connect with him without taking this class.","This class is very poorly organized with no grading scheme or class structure. There seems to be a lack of communication between all the instructors and course materials and assignments were random and not very instructive. If you are hoping to know what you will learn from this class before you take it, you will not be able to figure it out before or after. The class content was interesting and had a lot of potential to be a great learning experience but poor organization and the little thought that was put into this class ruined it.","Perhaps because this was a new course, this class felt rather disorganized. I think it had so much potential to be a really awesome class, but it felt very hands-off, and I felt rather on my own in terms of figuring out how to apply what the professors were teaching us! Hopefully it will be better in the future.","Don't take class until a syllabus and class schedule is fleshed out.","This is the worst class I have taken at Harvard. I was so excited to take this course, in hopes of learning something substantive about public opinion in the U.S., but all I learned was how a class should not be taught. Professor Ansolabehere and Mark Penn are obviously two very impressive individuals in their own right, but the lack of structure in the course, comprehensive explanations of assignments, and adequate guidance, left us to fend for ourselves. I just don't understand why we never had a real syllabus or why the final MEMO was 25 pages (who has ever heard of a 25 page memo????). I also don't understand how you can teach data analysis on a new statistical program, poll question writing, poll analysis, and memo-writing in one semester. YOU CANNOT! Instead of learning how to do anything well, we learned how to do each of these things terribly. I don't want any other poor lad to endure this class in the future unless there is a massive restructuring of the class.","Take this class. The workload is light, the professors are excellent, and the class overall is a good time. No section, few readings, what's not to love?","If you have some background in statistics (preferably with Stata) and are very interested in government in politics, this could be an amazing course for you, as Ansolabehere and Penn are very knowledgeable and willing to answer questions and seek to give a picture of the public opinion polling process from start to finish with a lot of hands-on and group work. If you do not have much background in one or both of those things, you might feel overwhelmed and as though you cannot make as much use of the class as you would like. Regardless of your background, Penn's lectures about his advising President Clinton are fascinating. This may change next year, as this was the first time the course was offered, but there doesn't seem to be a way to know what your grade is shaping up to be over the course of the semester, as I had only one graded individual assignment, which was on a value scale of 1 to 7. The final project was very demanding (20-page campaign strategy memo relying on your own data analysis), but there was no final exam.","Interesting class, interesting subject, taught haphazardly","Stay away. The class on the whole was massively disorganized, the lectures scattershot, the teaching staff either remarkably incompetent or (as I suspect is more likely) left confused by the professors' inconsistent instructions. It was a hugely disappointing experience, given Mark penn's really interesting background.","Unless they seriously get their act together this course is not worth taking. The professors are great but the confusing assignments, unorganized feel and horrendous group projects made this class a disappointment. It is cool that we actually submitted a real poll into the field and got data back, but the lack of direction and guidance was frustrating. It was easy and I feel like I didn't do any work for it until all of a sudden I had to write a 20 page paper with no idea if what I was doing was right.","I think the course has potential, especially if it's going to be run again, but in its current state, I wouldn't recommend without some serious reservations.  Don't expect to get any direct feedback or any assignments from the course staff.  Mark and Steve are both clearly passionate about what they do, but logistically had a lot of kinks to work out.  The material also felt very disjointed at times.","I mean we were the first semester that they ever did this class so it can pretty much only get better but the grading was incredibly unclear during our semester, the lectures had nothing to do with the readings and neither had anything to do with the assignments. It was a poorly run class. Hopefully they improve. The one cool thing that will be done is that you'll be able to put a real poll out into the world.","If Mark Penn is here again, I would recommend taking the course just to hear his stories about the Clinton campaign and presidency.","This class was disappointing. I was really excited about it, as I find public opinion fascinating, but it quickly became my most frustrating class. It was very disorganized, which made the class hard to deal with. Some of Mark Penn's lectures were interesting, but they really weren't worth the headache the class caused. I did not really learn much from this class.","This class has potential, but this being the first time it was taught, it wasn't organized at all. We never got a syllabus. Both of the professors are some of the absolute nicest people I know, and they are clearly so excited about the material, but I felt frustrated most weeks because I never knew what was going on. Without a section, no one had any way to know what we should do each week. Suddenly, at the end of the semester, having written one 2-page memo prior, we were asked to write a 25-page one, without a lot of guidance. \r\n\r\nTake this course if you're willing to be patient and clarify a bunch on assignments, and you may get lucky and enjoy an amazing small class with great professors, but do make sure you're organized!","This is the worst class I have taken at Harvard. I love polling and was really looking forward to it, but it was disorganized, incompetently run, I learned nothing, lectures were painful, there was clearly no planning by the teachers.","This class should have been really interesting, but due to things (that I do not at all blame on Prof. Ansolabahere or the TFs) it was a disaster. It became basically an introduction to Stata, which was frustrating. Lecture was pretty boring even when Mark Penn was there, and the class lacked focus. I felt bad for Prof. Ansolabahere because I don't think he knew how much weight he was going to have to carry in the class, but Mark Penn was basically totally absent. If this class is around in 3 years, I'd take it then, but right now it's just too unstructured.","This course is an excellent opportunity to learn from an experienced campaign hand (Mark Penn) and learn skills that aren't often taught elsewhere at Harvard (namely memo-writing and polling data analysis). That said, the course was disorganized. There was only one assignment that we received grades on before the final paper.","Wait a year or two before taking this course so they can work out the kinks. It has a lot of potential, but a lot of work to do before it runs smoothly.","REALLY cool idea - really fun to make the survey and be able to analyze your own data. Be prepared to spend most of your time organizing huge groups to work on group projects, that is very frustrating. Also be prepared to hear about assignments only a few days before class. However, a lot of times the reading is kind of irrelevant to the coursework so you don't actually have to do it.","Not even a real class. No section meant that you never had to do readings, and there were barely any assignments. This was basically just a vehicle for Mark Penn to boast about (admittedly impressive) accomplishments from two decades ago. It would have been nice to actually question him about, say, 2008.","I came into this class excited about the opportunity to learn about polling, surveys, and American government from one of President Clinton's top strategists. I left disappointed by the class's disorganization, dearth in meaningful assignments or feedback, and ineffective lectures. During the semester, we were never given a syllabus and instead had readings and assignments emailed to us oftentimes only days before class. We were given an incredibly exciting opportunity to put our own survey into the field but weren't given the proper guidance to do so. Too many of the lectures seemed unplanned and disorganized. Unless the curriculum is entirely re-hauled with a completely new structure and teaching staff, I'd strongly recommend against taking this class.","great class, not a lot of work"]}},"mostRecentQ":{"overall":"2.90","workload":"1.60","difficulty":"2.80","recommendation":"3.10","enrollment":"57","response rate":"80.70","QCourseOverall":{"number":"GOV 1360","course_id":"11313","cat_num":"22949","1s":"10","2s":"8","3s":"11","4s":"11","5s":"6"},"QDifficulty":{"number":"GOV 1360","course_id":"11313","cat_num":"22949","1s":"4","2s":"13","3s":"21","4s":"6","5s":"2"},"QWorkload":{"number":"GOV 1360","course_id":"11313","cat_num":"22949","1s":"26","2s":"14","3s":"6","4s":"0","5s":"0"}},"success":true}