{"scores":{"Spring '14":{"course_score":{"overall":"3.10","workload":"1.40","difficulty":"2.60","recommendation":"3.20","enrollment":"84","response rate":"71.43","QCourseOverall":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"7","2s":"6","3s":"27","4s":"14","5s":"5"},"QDifficulty":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"11","2s":"13","3s":"28","4s":"4","5s":"3"},"QWorkload":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"38","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1818","cat_num":"3029","course_id":"1006","year":"2013","term":"2","id":"3956ad677c785efeb9c52792efe7afff","first":" Richard B.","last":"Freeman","InstructorOverall":"3.30","EffectiveLecturesorPresentations":"3.10","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"3.90","FacilitatesDiscussionEncouragesParticipation":"3.10","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"3.20"}]},"Spring '13":{"course_score":{"overall":"3.16","workload":"1.35","difficulty":"2.28","recommendation":"3.47","enrollment":"78","response rate":"87.18","QCourseOverall":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"7","2s":"6","3s":"27","4s":"14","5s":"5"},"QDifficulty":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"11","2s":"13","3s":"28","4s":"4","5s":"3"},"QWorkload":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"38","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1818","cat_num":"3029","course_id":"1006","year":"2012","term":"2","id":"3956ad677c785efeb9c52792efe7afff","first":" Richard B.","last":"Freeman","InstructorOverall":"3.45","EffectiveLecturesorPresentations":"3.29","AccessibleOutsideClass":"3.39","GeneratesEnthusiasm":"3.85","FacilitatesDiscussionEncouragesParticipation":"3.20","GivesUsefulFeedback":"3.12","ReturnsAssignmentsinTimelyFashion":"3.60"}]},"Spring '11":{"course_score":{"overall":"3.62","workload":"1.25","difficulty":"2.54","recommendation":"3.87","enrollment":"30","response rate":"80.00","QCourseOverall":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"7","2s":"6","3s":"27","4s":"14","5s":"5"},"QDifficulty":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"11","2s":"13","3s":"28","4s":"4","5s":"3"},"QWorkload":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"38","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1818","cat_num":"3029","course_id":"1006","year":"2010","term":"2","id":"3956ad677c785efeb9c52792efe7afff","first":"Richard B.","last":"Freeman","InstructorOverall":"3.92","EffectiveLecturesorPresentations":"3.75","AccessibleOutsideClass":"4.22","GeneratesEnthusiasm":"4.29","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"3.42","ReturnsAssignmentsinTimelyFashion":"3.73"}]},"Spring '10":{"course_score":{"overall":"3.84","workload":"1.46","difficulty":"2.54","recommendation":"3.95","enrollment":"65","response rate":"86.15","QCourseOverall":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"7","2s":"6","3s":"27","4s":"14","5s":"5"},"QDifficulty":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"11","2s":"13","3s":"28","4s":"4","5s":"3"},"QWorkload":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"38","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1818","cat_num":"3029","course_id":"1006","year":"2009","term":"2","id":"3956ad677c785efeb9c52792efe7afff","first":"Richard B.","last":"Freeman","InstructorOverall":"3.89","EffectiveLecturesorPresentations":"3.86","AccessibleOutsideClass":"4.18","GeneratesEnthusiasm":"4.41","FacilitatesDiscussionEncouragesParticipation":"3.94","GivesUsefulFeedback":"4.19","ReturnsAssignmentsinTimelyFashion":"4.05"}]},"Spring '09":{"course_score":{"overall":"3.61","workload":"1.45","difficulty":"2.30","recommendation":"3.73","enrollment":"45","response rate":"73.33","QCourseOverall":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"7","2s":"6","3s":"27","4s":"14","5s":"5"},"QDifficulty":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"11","2s":"13","3s":"28","4s":"4","5s":"3"},"QWorkload":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"38","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1818","cat_num":"3029","course_id":"1006","year":"2008","term":"2","id":"3956ad677c785efeb9c52792efe7afff","first":"Richard B.","last":"Freeman","InstructorOverall":"3.79","EffectiveLecturesorPresentations":"3.52","AccessibleOutsideClass":"4.14","GeneratesEnthusiasm":"4.15","FacilitatesDiscussionEncouragesParticipation":"3.53","GivesUsefulFeedback":"3.20","ReturnsAssignmentsinTimelyFashion":"3.00"}]},"Spring '08":{"course_score":{"overall":"3.86","workload":"1.29","difficulty":"2.71","recommendation":"3.93","enrollment":"47","response rate":"29.79","QCourseOverall":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"7","2s":"6","3s":"27","4s":"14","5s":"5"},"QDifficulty":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"11","2s":"13","3s":"28","4s":"4","5s":"3"},"QWorkload":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"38","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1818","cat_num":"3029","course_id":"1006","year":"2007","term":"2","id":"3956ad677c785efeb9c52792efe7afff","first":"Richard B.","last":"Freeman","InstructorOverall":"4.07","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.08","GeneratesEnthusiasm":"4.14","FacilitatesDiscussionEncouragesParticipation":"3.33","GivesUsefulFeedback":"2.67","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '07":{"course_score":{"overall":"4.12","workload":"1.18","difficulty":"2.41","recommendation":"4.24","enrollment":"35","response rate":"51.43","QCourseOverall":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"7","2s":"6","3s":"27","4s":"14","5s":"5"},"QDifficulty":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"11","2s":"13","3s":"28","4s":"4","5s":"3"},"QWorkload":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"38","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1818","cat_num":"3029","course_id":"1006","year":"2006","term":"2","id":"3956ad677c785efeb9c52792efe7afff","first":"Richard B.","last":"Freeman","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"3.82","AccessibleOutsideClass":"4.14","GeneratesEnthusiasm":"4.18","FacilitatesDiscussionEncouragesParticipation":"3.73","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"2.75"}]}},"comments":{"Spring '08":{"comments":["It is a fun and interesting class, and prof. Freeman is such an enthusiastic teacher.","The subject material is very interesting but it takes some effort to understand what is being taught","light workload; not always certain what direction the class was going in","Minimal workload, but your grade is unpredictable","The course doesn't require much from you, but to really get something out of it you should go to lectures and talk to the professor. If you have an interest in new and different methods for answering economic questions, this is the course to take.","Relatively painless way to fulfill the writing requirement for Economics concentrators.","The course was fairly painless other than the final paper. The course covers material not found in traditional economics.","Keep up with the eading and lectures and you will enjoy the class.","If you have trouble understanding data this class might not be right for you.  Otherwise Dr. Freeman is great and the course is not too hard."]},"Spring '09":{"comments":["It's a nice overview, but don't expect to learn topics in depth.","take it if interested in the topics and willing to pursue one or two that interest you","great class to fulfill the econ writing requirement, lots of interesting material and a great professor","not the most interesting, but not hard","It is a great class to take for the economics writing requirement.","Very interesting material and easy way to fulfill writing requirement.","its going to be hard to pay attention in Lecture.","You really do not need to show up to class, you just need to read the lecture notes prior to both exams. Meet with Professor Freeman about the final paper, not the TF.","Very easy, very little work. Teacher is great.","Really interesting, different material. Great professor.","Start working on the final paper early."]},"Spring '10":{"comments":["The two biggest reasons to consider this class is for its low workload and for its interesting collection of topics that you will probably not see in any other class, but will also probably never see again unless you specifically want to study one farther. The lack of assignments was nice, but ultimately hurt understanding of the material. Final project was also incredibly flexible, but there isn't much support for writing it, so don't take this class if you haven't yet taken the econ sophomore tutorial. Professor was enthusiastic and knowledgeable, but ultimately this class has too many people who are taking it just because it doesn't require much work.","Zero workload but the material can be difficult at times.","It's a good way to complete the writing requirement, but the topics are not very useful or interesting.","really cool course, you learn a lot and it's low work load, except for the essay, but that was pretty cool too. A survey of a lot of topics, and professor freeman was super cool.","What a great class!! This is like the black sheep of the economics department. It talks about all the maverick ideas and techniques that you won't hear about in the other econ classes -- so it's particularly refreshing if you're an upperclassmen. \r\n\r\nThe material is super fascinating. A lot of it is the stuff you'd find in popular science magazines: genetic algorithms, data mining techniques etc. \r\n\r\nProfessor Freeman is wonderful. Funny, enthusiastic. Passionate about the material. He is a wealth of knowledge about the topics he covers with first hand experience in many of the techniques. \r\n\r\nThe requirements of the course are also really easy to manage. All really reasonable. Workload is light. \r\n\r\nIt's really tempting to just not do much for this class b\/c of the set up, but you should really give it a chance. The course basically covers new methodologies for thinking about and solving problems. It's refreshing to think about economics in a non-standard way. There is an alternative out there to building models and running regressions on trying to explain the world, and the course covers just that. \r\n\r\nI'd recommend this to anyone who might have gotten disillusioned by econometrics or is tired of theoretical modeling in economics. I also recommend this to anyone with the light background needed to take this class. It's extremely reasonable in terms of time commitment.","You'll probably learn lots of new, strange concepts that seem unrelated. You will also not be able to explain the theme of this class to your friends.","Good course that doesn't involve weekly problem sets that allows you to explore topics you like.","there are some interesting ideas buried in the contents of the lectures but overall the class doesn't seem very relevant to most other ec classes","painless, interesting economics class","Take this course if you want to fulfill your ec writing requirement.  The material is interesting and the Prof is hilarious!","The topics are very engaging, but the class is overall very laid back.  The few assignments that do come up tend to cause a lot of stress but once they pass, it's back to the same laid back flow.","This is a nice, low-pressure economics course.","I loved this class -- I definitely recommend it!","Great class with very interesting reading and material and great lecture notes.","Its a great course and a fun professor!","Get ready to have fun in a good class. Don't wait too long to write the final paper.","Good senior pass\/fail elective","If you like sitting through 2 hours of rambling nonsense each week, this is the course for you.","It's a great class to hear about some interesting topics for a couple of hours each week. It is not a course to take for the sake of intellectual rigor, curiosity, or discovery. But it's very little work, and Richard Freeman is an interesting guy.","Interesting overview of simulations and modeling.","This class is very easy and interesting. The topics are random and are based on what the prof is interested in. Very little work, although expect the majority of it at the very end of the semester, which is annoying. Start your paper early!","The course is fairly interesting and rather low on requirements, though you still need to learn everything by the midterm and final even if not through problem sets."]},"Spring '11":{"comments":["The class covers very interesting material and Professor Freeman is great. Just make sure that you take time to really learn the material because its stuff that you really should know and should want to know.","This is a very interesting and easy course, which is a combination you do not often find at Harvard. Professor Freeman's lectures ramble at times, but the subject matter is extremely interesting and is not found in other ec courses at Harvard. I wish we had delved more deeply into a few topics instead of broadly covering a lot of topics.","Very interesting real-world and practical applications","need to go to class and sections otherwise the midterm will ruin you. there's also ambiguous grading.","The class requires little in terms of workload, but much in terms of knowledge load and ability to digest information. Each lecture is different and almost not related to material presented before. Lectures can be dry and the professor will throw everything he knows at you, and you might get lost in the woods. The material is not the most interesting stuff in the world, but useful in some ways. You will find yourself mindblogglingly frustrated at times but relaxed generally because there's no expectation of you memorizing or remembering exactly how to do things. The paper requires a lot more guidance though, so make sure to elicit feedback on ideas and seek help.","Interesting material, opened my eyes to a wide range of models and research that economists, etc are currently doing.  Easy exams and lots of flexibility with the final project in terms of your topic.  The professor is very nice and flexible with deadlines.  The TF isn't too helpful.  Especially good for people who are into cs, modeling, data mining, or game theory.","This is a weird class. Almost no one was ever at lecture, Freeman sorta just rambles about for an hour and the tests are open-laptop.....it's not hard it just makes no sense. So it doesn't take any time, but you don't really learn anything....also the paper at the end is a pain.","It isn't that hard usually but the midterm was challenging. Weeks you have stuff do can be a lot of time, otherwise not. Can be all of the place. Pretty interesting."]},"Spring '13":{"comments":["The professor clearly loves what he is teaching about. It really seems like if he didn't have to assign work then he wouldn't.","Low work load, but the lack of organization can be a headache and a half. You absolutely have no idea how you're doing in the class the entire time.","take this class. best for econ writing requirement","Amazing course!  The material is very interesting, and Professor Freeman is a stunningly good lecturer.","It's kind of a strange class in terms of the subject matter, and is probably better for those interested in logical analysis\/stats (ie ultimatum games). However, the exams are open note and straightforward as long as you go to section and seek out help","You may love this class for the really interesting lectures. However, you may also hate the class because you never delve too much into one topic.","Very interesting and filled with real-world applications.","In terms of workload, the course may seem like a joke. Note, however, that much of the material is actually fairly complex, and if you don't understand at least some of it well you're going to be in dire straits for your financial paper (i.e. half you grade). And you're going to have to put in time to understand the material well, as there's just not enough time in lecture to cover anything in depth. Don't let the dearth of assignments make you think that this is a throwaway class.","Professor Freeman is very knowledgeable about the material but is sometimes hard to follow in lecture. Open-note exams with good lecture notes made them not as stressful though it still took some time (midterm was take-home). The final paper seems like a fairly easy way to fill the writing requirement for Ec but still requried a decent amount of work. Overall a somewhat interesting course, very manageable with little work throughout, and generally easy to do well.","The topic of this class is super interesting, but I think the professor is too smart to be teaching this class at an introductory level. If you have an ec background and need an easier workload class, then maybe this is for you. But if you don't have too much background in ec, you won't get too much out of the class.","Interesting class that covers a lot of topics one wouldn't cover in other econ classes. Well-suited for people who like to think outside the box.","It is a great class with interesting material. Not too much work, so makes for a nice elective.","This class is nice for senior spring because there are only two exams and a final paper. But paying attention in lecture was a constant battle (one I often lost), section was entirely useless, and I still have no idea what the title of the course even means.","Literally no work between (take home) midterm and final so you don't learn anything at all. The concept is weird too, which is to teach you a bunch of models with no math backing. That being said, it's really easy if you need an Ec class.","Pay extra attention during class and go to section. Professor Freeman is not always very clear when he explain each concept or theory.","Super, super easy class. Just be ready to deal with a class with little to no organization.","Fun class, you get out what you put in. Really learn through final project, so don't take this if you're just getting an Ec requirement out of the way; take it if the material sounds interesting and you want to get in-depth about one of the topics covered.","You cover a range of topics not in typical economics courses. Not very demanding. Good elective to take if you have workload concerns or just want something different.","Course doesn't involve a lot of work at all, but it isn't easy. Grading is actually pretty difficult.","freeman is great, interesting material, go to section!","Lecture is interesting but Section is where you really learn the material.  Easy writing requirement for Econ.  Papers pretty short and the class briefly covers so much stuff it's easy to write a paper on a topic that is interesting to you.","There are no weekly assignments, and lecture attendance is really poor. I would have preferred a work-heavy class if I could get more out of that.","Great senior spring course. Easy economics elective. Only 3 assignments ever: take-home final, in-class 1-hour final, and a final project. I highly recommend this for anyone who needs an easy course to balance out their schedules, especially if you need another Econ elective. The course material is not as interesting as I would like, but honestly no one goes to lecture or section and they all still do fine. Take it!","It is a very easy class.","If you don't mind confusing lectures and sections, this course is for you. I'm not sure I got all that much out of it on the whole though.","Pretty much no work the entire semester except around the two exams and the final paper at the end, but the class can be hard to follow and not entirely sure what I got out of it. It's interesting material but lectures just ramble on.","The material is totally fascinating. You can get away with doing no work and do well, but why would you do that with such interesting information.","lectures are pretty interesting you should go to them","No psets, and not alot of work till midterm\/final gets here. Final paper determines your grade. \"Easy\" but really boring at times. First lectures are really interesting","They try to cover too much and you end up not learning much. However, basically no work required, so it's an okay class","The class is interesting and the workload is light. To help prepare for exams, it is helpful to attend lectures and sections."]},"Spring '14":{"comments":["Be prepared for material that you will need to spend time mastering yourself, outside of the professor's lectures, since they are pretty hard to understand","Be prepared to learn about interested topics without any sort of structure.  Freeman is wonderful though- thoughtful and kind.","I took this class because it was rated \"easy\", felt completely miserable and even violated as a student the entire time, and then myself rated it \"easy\".","This class is very different from your average Harvard economics class.  Professor Freeman essentially reads off his lecture notes each class about complicated game theory and other models of \"discontinuous change.\"  There are relatively few assignments, and section helped to clarify what we should know, but it was very hard to gauge what material we were responsible for.  The final project counts for the majority of your course grade but there was very little guidance .","A fine class with some interesting topics along the way. The super open-ended paper at the end can be a blast if you want to put in the effort since it can be on pretty much whatever you want it to be.","The take home midterm took FOREVER and was pretty tough to complete. Though the TFs may say \"sit down for 4 hours and that'll be plenty of time\" -- multiply that by 5 at least.\r\n\r\nEven though Prof Freeman has really detailed lecture notes you can find online, go to class or youll slip behind on the course material really quickly","I see a lot of students taking this class thinking that it will be really easy. In fact, it is. This course was really helpful for me especially in exploring more options in research methods and statistical\/machine learning approaches at general level, in connection with economics.","Not a ton of work and decently interesting if you can handle a class with little structure","Very laidback course and a great choice for an Ec requirement. However, this course is very unorganized. The course-load is very light, but the material is actually quite confusing. The lecture slides are jumbled with no sense of organization.","If you make yourself go to class and pay attention, this class is a breeze. Otherwise, be prepared to flounder on exams.","Do not take this class. Yes, this class takes minimal time per week, but taking this class is one of the biggest mistakes in my college career. You learn ABSOLUTELY NOTHING, and the class is structured and organized in the worst imaginable way. The assignments are unfair, and the professor and TFs do not care about the class. Your grade is probably picked out of a hat.","No structure, didn't understand what anything had to do with anything else","It is easy to not keep up with the material, but this will only hurt you in the end. Start your term paper early especially since there is little other work in the class.","there is no flow to the course and it can be difficult to keep interest up through the semester","Fantastic class but you must go to lecture! Lecture is fantastic!!","This is the worst class I've taken at Harvard. It is horribly taught and I still don't know what discontinuous change is. The take-home midterm and the finals were incredibly hard and you don't learn anything in lecture.","Great class. Not a lot of work and very interesting and applicable to problems in today's society. Prof. Freeman is the man","You learn everything from the lecture notes and section.","great class. easy, interesting professor, fun lectures, take home midterm and in class final are both open book. final writing project can be on any topic of interest to you","Confusing material but easy course if you go to class and don't fall behind.","This class is a joke. The amount of work and critical thought required is comical. You shouldn't take it if you hope to learn anything substantive beyond a couple of interesting facts. A perfect class for the jaded second-semester senior. The entire course could be boiled down to an interesting 90 minute lecture. I am completely serious. The fact that it counts as an ENTIRE course is an embarassment. This class does not meet the standards of Harvard and, more importantly, it shouldn't meet your own.","This class was pretty disorganized, and I'm not sure how much I took away from the course. The topics weren't covered in much detail.","This class required almost no work. There was a take home final which took a bit of time, an in class final (open notes) and a final project\/paper which is very open ended. Professor Freeman is very helpful, extremely flexible and entertaining. Easy, great class. Also, fills the writing requirement for ECON.","This is absolutely one of the courses I've ever taken at Harvard. Please steer clear of it at all costs. Don't let the low workload and difficulty fool you. Unless you're ready for quite possibly the worst, vague assignments, gibberish lecture notes, uninterpretable lectures, and the worst section leaders in the world, then don't take this course. Do yourself a favor and choose another economics class.","It is an easy course","Organization of the class needs work and therefore requires you to connect a lot of dots."]}},"mostRecentQ":{"overall":"3.10","workload":"1.40","difficulty":"2.60","recommendation":"3.20","enrollment":"84","response rate":"71.43","QCourseOverall":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"7","2s":"6","3s":"27","4s":"14","5s":"5"},"QDifficulty":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"11","2s":"13","3s":"28","4s":"4","5s":"3"},"QWorkload":{"number":"ECON 1818","course_id":"1006","cat_num":"3029","1s":"38","2s":"16","3s":"5","4s":"0","5s":"0"}},"success":true}