{"scores":{"Fall '14":{"course_score":{"overall":"4.40","workload":"4.20","difficulty":null,"recommendation":"4.10","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"1","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1640","cat_num":"5844","course_id":"152","year":"2014","term":"1","id":"bf8a114fc4429cf23897a57f991bd63f","first":" Nicholas H.","last":"Harkness","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Fall '13":{"course_score":{"overall":"3.80","workload":"2.20","difficulty":"3.60","recommendation":"3.60","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"1","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1640","cat_num":"5844","course_id":"152","year":"2013","term":"1","id":"be7849d3617ae4605b3a67dc96a4491e","first":" Steven C.","last":"Caton","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '12":{"course_score":{"overall":"4.33","workload":"2.29","difficulty":"3.13","recommendation":"4.42","enrollment":"32","response rate":"96.88","QCourseOverall":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"1","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1640","cat_num":"5844","course_id":"152","year":"2012","term":"1","id":"bf8a114fc4429cf23897a57f991bd63f","first":"Nicholas H.","last":"Harkness","InstructorOverall":"4.77","EffectiveLecturesorPresentations":"4.81","AccessibleOutsideClass":"4.36","GeneratesEnthusiasm":"4.77","FacilitatesDiscussionEncouragesParticipation":"4.35","GivesUsefulFeedback":"3.72","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Fall '11":{"course_score":{"overall":"3.77","workload":"2.38","difficulty":"3.31","recommendation":"3.77","enrollment":"13","response rate":"100.00","QCourseOverall":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"1","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1640","cat_num":"5844","course_id":"152","year":"2011","term":"1","id":"bf8a114fc4429cf23897a57f991bd63f","first":"Nicholas H.","last":"Harkness","InstructorOverall":"4.23","EffectiveLecturesorPresentations":"4.15","AccessibleOutsideClass":"4.38","GeneratesEnthusiasm":"4.46","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"4.42","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Fall '10":{"course_score":{"overall":"3.60","workload":"2.00","difficulty":"3.45","recommendation":"3.45","enrollment":"25","response rate":"80.00","QCourseOverall":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"1","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1640","cat_num":"5844","course_id":"152","year":"2010","term":"1","id":"be7849d3617ae4605b3a67dc96a4491e","first":"Steven C.","last":"Caton","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.06","GeneratesEnthusiasm":"4.35","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Fall '09":{"course_score":{"overall":"3.60","workload":"2.20","difficulty":"3.02","recommendation":"3.67","enrollment":"48","response rate":"93.75","QCourseOverall":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"1","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1640","cat_num":"5844","course_id":"152","year":"2009","term":"1","id":"a14471bef9b8cda7e7fa9184b388dfd5","first":"James P","last":"Herron","InstructorOverall":"3.56","EffectiveLecturesorPresentations":"3.31","AccessibleOutsideClass":"4.03","GeneratesEnthusiasm":"3.73","FacilitatesDiscussionEncouragesParticipation":"3.85","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"3.80"}]},"Fall '08":{"course_score":{"overall":"3.90","workload":"2.06","difficulty":"2.97","recommendation":"3.90","enrollment":"41","response rate":"75.61","QCourseOverall":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"1","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1640","cat_num":"5844","course_id":"152","year":"2008","term":"1","id":"be7849d3617ae4605b3a67dc96a4491e","first":"Steven C.","last":"Caton","InstructorOverall":"4.16","EffectiveLecturesorPresentations":"4.47","AccessibleOutsideClass":"3.62","GeneratesEnthusiasm":"4.32","FacilitatesDiscussionEncouragesParticipation":"3.44","GivesUsefulFeedback":"2.50","ReturnsAssignmentsinTimelyFashion":"2.50"}]},"Fall '06":{"course_score":{"overall":"4.37","workload":"1.84","difficulty":"2.84","recommendation":"4.50","enrollment":"31","response rate":"64.52","QCourseOverall":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"1","2s":"7","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1640","cat_num":"5844","course_id":"152","year":"2006","term":"1","id":"be7849d3617ae4605b3a67dc96a4491e","first":"Steven C.","last":"Caton","InstructorOverall":"4.61","EffectiveLecturesorPresentations":"4.67","AccessibleOutsideClass":"4.09","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"4.25"}]}},"comments":{"Fall '08":{"comments":["I would recommend this class to an anthropology concentrator, specifically interested in linguistic anthropology.  Otherwise, I would only cautiously recommend it.  The lectures are good and enjoyable, but the syllabus is not streamlined enough for someone just taking it for general interest.","Unfortunately, if you want to learn anything, you are responsible for it. Prof. Caton is not going to scaffold it or give it to you on a platter. People come to the class with lots of language experiences and the class does not capitalize on those at all.","If a student is honestly, really interested in the subject matter, the class is very valuable.","Teaches one to look at multiple aspects of the world (history, politics, and of course language) with a totally renewed mindset. The coursework is not too unwieldy, but it is very easy to fall behind. Professor Caton's teaching style will make you look forward to lectures.","Be prepared to spend a lot of time re-reading the same things. It takes some time to fully understand some of the readings.","Awesome class, Steve Caton's a really talented lecturer!","The material is difficult, but Professor Caton does an excellent job of helping you to digest the readings and he really wants his students to succeed.","This course is not a general introduction to anthropology, it is very much focused on the \"language\" part of the title.","Only take this if you love linguistics (or passionately are curious about it) if you want to read a lot, and if you want to work rather diligently to keep up.","This is one of those classes that has the ability to radically change the way you look at the world.","Do as much of the reading as possible, although it does not all appear in depth or detail on the examinations. Most of what can be learned from the course appears outside of the ethnographies, although the ethnographies provide a great application of newly-gleaned knowledge. Professor Caton is a fairly consistently great structured lecturer, at times quite enthusiastic. I greatly enjoyed most portions of this class, and learned a whole lot.","This class presents very abstract topics regarding linguistic theory, but it challenges you in a way that you may never have been challenged academically. I feel as though this is a very rewarding class and that Professor Caton's cheerful spirit invigorated the lectures.","Be prepared to encounter strange but awesome ideas!","It was a really interesting class. I loved the lectures. The readings are long but you don't really need to do them. A good introduction to both anthro and linguistics.","Lots of reading, but great Professor and course overall","The material is fascinating, but the readings are miserable. It also feels very badly organized--it's difficult to tell what reading is actually due, and how that corresponds with what we're doing in class.","If its design is straightened out (more time to discuss readings, more focus on the topic of language and culture, etc.), then Anthro 1640 could become a really great class. Until then, I wouldn't be likely to recommend it.","Be ready to delve into a lot of theory and have some type of interest in linguistics and\/or anthropology."]},"Fall '09":{"comments":["The course really delivers what it promises. The title is language and culture, and the course through a wide range of readings attempts to bridge the language and culture idea.","course is good if you're interested in linguistics but was unpersuasive in application","The course material is interesting enough to outweigh any administrative issues that may be encountered","you can't get as much out of this course unless you get enthusiastic about your readings but it will be worth it.  because do you know what the heck is coming out of your mouth when you talk? exactly.","This class is a really great overview of anthrolinguistics.  You'll gain a lot of knowledge and be exposed to a lot of really interesting ideas.  The readings and section are where you really learn in this course - I'd say lecture is pretty much optional.","Interesting, very theoretical at turns. Would be interesting for somebody interested in linguistics or anthropology who wants an introduction in either field.","If you want a general overview of linguistic anthropology, this might be something to consider.","The structure of this course heavily depends on who is teaching it.  This time around, it happened to have a heavy political bent.","If you're looking for an introductory anthro class, you can do better. This is a class only for those with a genuine interest in linguistics--even then, you might regret it.","This course is excellent for those interested in majoring in social anthro OR for those with an interest in semiotics.","With some exceptions, the readings are interesting and fairly easy to understand; the material covered is extremely interesting, and the combination of linguistics and anthropology is fascinating. A great intro to social theory or social anthropology for someone with no background in either. This course will make you want to become a Social Studies concentrator.","It's an interesting class and a good way to fulfill the Core requirement, but you should be interested in the material for you to enjoy the class as well.","Keep up with the readings and participate actively in section.  It really helps you engage with the material so that you can write better response papers.","If you are interested in linguistics and\/or anthropology, then this will probably be a good class.","You will learn so many interesting things about how language constructs your world\/view. Please take it!","It is a pretty specific field of knowledge - but still interesting if you are interested!","Don't get too intimidated by all the readings. Just understand the main points and examples.","There's a lot more philosophical thinking about linguistics than you'd think -- if you're not a fan of philosophy, this course might not be for you.","If you're looking for an introduction to anthro, look elsewhere."]},"Fall '10":{"comments":["it is a good class, but do not take this as an introduction to anthropology. the readings are all hard (but for the most part good). I would have been a lot better off if I had more experience with theoretical texts before I took this class.","Professor Caton is very clever and entertaining and his overview of linguistic theory is quite useful.","The first half of this class was nearly impossible to get through, with lots of long, dense and purely theoretical readings, and was only partially redeemed by the three ethnographies read in the second half, which were quite interesting. Do not take this class unless you are seriously interested in linguistics and linguistic theory - the emphasis is definitely on language more than culture.","It's a good course with an interesting subject and an extremely engaging professor.  That being said there is a lot of reading, and it is therefore difficult to catch up if you fall behind.","This class was really interesting and engaging.  Make sure you go to lecture!!  Some of the readings (the theory articles...) can be difficult, but as long as you go to lecture\/section and read the ethnographies you'll be fine.","This class is very interesting but requires a lot of reading and understanding philosophical ideas. I feel that less emphasis is placed on the studying of cultures and more is placed on these philosophers.","Professor Caton is very evidently enthusiastic about the course. Give this course the time and effort it deserves. I thought it would be a light and easy course, however, if you take it as seriously as it deserves to be taken, it is considerable work (not at all unreasonable though). These readings are things you want to delve into, not just skim for section. Just plan accordingly.","Professor Caton's lectures are great. There's room for improvement in everything else however.","Don't take this class if you are kind of curious about linguistics like I was--you should be genuinely interested. Prof. Caton is a great lecturer and the TF's are pretty good, but you will be assaulted with more socio-linguistic, aesthetic, and political theory than you ever bargained for.","I just don't think it's really a good representation of an anthropology course. I'm surprised that it would be considered an entry level course. It's not that the material is not interesting, but it is not what I was bargaining for. I anticipated more emphasis on ethnographies and the actual impact of language on cultural relativity. I thought Sapir-Whorf would have set that up very nicely, but instead the class just got increasingly convoluted after that.","read silverstein!","You get a great grounding in different theories of language, even if you come in with absolutely no knowledge.","i love prof. caton, but make sure the tf is good...otherwise...be prepared to be ON YOUR OWN!!","The ethnographies at the end are interesting, but the theory is pretty tough and dull throughout.","The material is difficult but it's all stuff that's really useful to know for other classes and life in general. The professor is very good and the lectures engaging, but the exams aren't really adequate assessments of your grasp of the material even though they're 80% of your entire grade.","Its a good class. It challenges the way you think, and its a good class to get you thinking about Anthro","Definitely audit the course!  The lectures are amazing!  If you're taking it for a general education requirement however, be forewarned: the reading at times is very dense and long--only take it if you are truly interested in the subject matter."]},"Fall '11":{"comments":["The class is a very interesting opportunity to learn about how language interacts with culture.  You start to see the similarities between our everyday lives and those of people around the world because of the similar ways in which all people use language.  I think because it is a class that teaches linguistic anthropology specifically, I would recommend a broader introductory course if you just want to learn more about what anthropology is.  That being said, you should take it if you have any interest in language and people at all!","Put a lot of time in for readings because you won't get much out of section. Go to office hours with specific words you need definitions for or that are confusing you. Make extensive notes.","This course is heavy on the theory and sometimes it is hard to see the point of the readings in relationship to others. I did find myself thinking about this course and the role of language frequently outside of class and enjoy the small class environment.","This course presents a lot of interesting material, and you will get as much out of it as effort you put into it.","HEAVY on linguistics. You apply linguistics to what you already know about culture, not really learning anything new about culture (except that it is part of language).","Professor Harkness is funny and engaging. The class is challenging intellectually, but fair in terms of workload. A true academic experience. Take it.","If you love linguistics or want to understand a theoretical approach to linguistics or anthropology, this may be the course you want to take. But you will have to be dedicated. The material is very difficult to understand and Professor Harkness prefers the hands-on approach to teaching, meaning that he doesn't want to teach you how to understand the materials, but prefers to construct an argument assuming that you already read and thoroughly understand everything.","This class changed my perspective on everything. The readings were fantastic - it was challenging and enlightening to work through the theory, and we got to dig into those texts because we weren't taking time to slog through long-winded ethnographies for the sake of reading ethnographies. I'm not an anthro concentrator, but I think it was so valuable and important to discuss the framework through which anthropology is done and the filter of language that all anthropological discourse has to go through, beyond just \"social action x and y are done in these ways in cultures a, b, and c\". Don't be scared off by the dense readings- they get easier and easier, and it's not actually that much reading in terms of page numbers. It's great that this class is in the morning, because the lectures will leave you jazzed for the rest of the day. Prof. Harkness is a fun performer and a great mentor.","A good class to take if you want to learn more about the history and methodology of linguistic analysis. Not recommended as an entry course to anthropology, however."]},"Fall '12":{"comments":["I would not recommend this class to freshmen or anyone looking for an introduction to anthropology (even though the class counts as intro requirement and is suggested to freshmen). Linguistic anthropology is a very specific sub-field of social anthropology, and it is quite possible to like the latter and have no interest in the former. You will learn about language in relation to culture, but you'll barely learn anything about anthropology as a discipline. I would suggest taking this class in your sophomore or junior year, once you have a better sense of the big picture, which should enable you to get a lot more out of it.","TAKE IT. Don't be scared off by the readings. Take good notes, and get into Dilan's section no matter what. It's not a breeze if you want to do well in it, but it's not going to kill you (either with the workload or boredom).","This class is a great introduction to linguistic anthropology. Though some background in linguistics is sort of assumed, it's manageable without it. The assignments are fun and fair tests of whether or not you have engaged with the materials. Great.","This class causes you to look at language in a whole new light. The readings are fascinating and lecture is always thought provoking. Once you take this class, you will unconsciously start analyzing language throughout your daily lives - it's wonderful!","This course is more technical than some other anthropology courses - it is almost somewhere in between social anthropology and linguistics. The subject matter is really interesting and the papers are fun, though some of the readings might be a bit dry.","This is one of the best classes I've taken at Harvard. I really view the world in a different way now, and I'm inspired to learn more about the topics I was exposed to in this class. I highly recommend this class. Do all the readings too! They are each important and eye-opening.","This class will change the way you read, and will make every other class you take at Harvard immeasurably better.  Although the concepts are sometimes difficult, Professor Harkness and the TFs are engaged, helpful, and accessible.  This has been my favorite class so far, and I recommend it without reservations.","This class is absolutely wonderful. Harkness is an entertaining lecturer, and the content of the class itself is very interesting.  The readings can be dense, but Harkness does a great job of helping to flesh them out during lecture. Harkness also does a great job of linking the theories we learn to the ethnographies we read. If you are willing to do the readings and think about what you've read, then this class will be very fulfilling. It is undeniably worth the few hours of work every week. Take this class!","Try to do all the reading. If you are not used to anthropology, it's hard to get through the ethnography at first, but the theories are very interesting and you really need them. If you really can't get yourself to do that, really pay attention in lecture since Harkness will explain very well.","Take this class because it teaches you to be aware of conversations around you, and to think critically and in a detailed way about everyday utterances.","Make sure to keep up, stay engaged, and you may just gain a new lens for looking at the world. I know that sounds hackneyed but I'm not exaggerating.","This class is truly a gem at Harvard. It was my favorite class this semester because it completely changed what I thought culture was and the role of language in my life. Every conversation I hear, now I see it as the driving mechanism for culture creation and it's really changed how I analyze and see the world. It has a bit of theory but it is very applicable and it was manageable. If you love different languages and different cultures, this is a class for you! Especially if you know more than one language!","Fun course if you have a base in linguistics or social theory and can do dense readings.  Lectures are interesting, Professor Harkness is brilliant, and a lot of the readings are great.  However, many seem pointless, section (for me) was a painful experience, and it definitely would be too dry for most.","At times difficult, but definitely worth it to understand an atypical yet important medium through which world views are expressed.","This class is a great introduction to anthropology. I enjoyed the lectures thoroughly","Choose a TF wisely. The readings are dense and hard to understand, and a section might make them even more confusing, if you get unlucky with your TF.","Challenging yet rewarding introduction to anthropology for anyone interested in its exploration. A great exercise of viewing language and its relationship with culture in both abstract theory and practical application. Intellectually rewarding; gives you a new perspective. Prof. Harkness is humorous, knowledgeable, and personally engaging in students' learning.","It's really much less interesting and more theoretical than you'd think from what you get out of the description and the first couple days.  It's not all fun stories about Indian place-names.","Be prepared to a read a lot. It's all interesting subject matter, but it's theory heavy. Though, Prof. Harkness is an awesome lecturer! Explains things thoroughly, gives great examples, and answers questions effectively. Also a pretty funny guy.\r\n\r\nI would say don't take this an an intro to Social Anthropology course unless you are prepared to read and dive into linguistics.","Take it, but only if you are prepared to read a lot and be very confused for some of the time. The epiphany moment that you will have about language during the course of the semester is very much worth it. Keep in mind, however, that this course is not representative of the anthropology department overall.","I didn't care too much for this course at first - the first of our three major units was heavy on semiotics (which was very dry to most of us) and case studies that seemed rather isolated in the larger scheme of the class, but I later realized that the fundamentals were necessary for us to get more out of the later readings and topics, which where much more global\/more interesting.","This has probably been one of my favorite courses at Harvard, and will change the way you experience the representation of the world through language. The readings provide a variety of perspectives on the intersection of linguistics and anthropology, and include some classic works that are must-reads for anyone interested in either field. Professor Harkness has a fascinating academic background - go talk to him in office hours! His lectures can be a bit esoteric at times, but they are pure poetry and performance, so go if only to experience the aesthetics. In short, take this class! You'll gain a new appreciation for language and the way it allows humans to shape and be shaped by what surrounds us.","This class changes how you look at the world, so it does what an introductory class to a concentration should do. You begin to look at the world like an anthropologist. It's great. You'll have little insiders with your classmates about the indexical relationships and semiotic free fall. That being said the learning curve is a bit steep but very worth it. Professor Harkness's lectures are great. Dilan is awesome and great. The teaching staff is very supportive.","Be prepared for a lot of theory and fewer ethnographies. The readings are complicated but interesting.","It will be hard to do, but take notes on the readings. Print them out if you can, so you can underline\/highlight specific passages or definitions, which will all come in handy for the assignments."]},"Fall '13":{"comments":["This course was disappointing in many ways. There was too much reading, and it was often so dense that it was impossible to get anything out of it. Also, the ethnographic element of the course was too close to the end--because this is an anthro course, I would have liked to see the anthropological elements (and not just the theory) appear earlier on. Finally, we were always off-schedule in terms of the syllabus so I NEVER knew what I was supposed to be reading for the next class! We also had NO graded written assignments and only 2 tests, which counted for 80% of our grade together and consisted of true-false and fill in the blank questions. To me, this is ridiculous in a discipline that is supposed to be writing-based.\r\n\r\nHowever, Professor Caton gives good lectures that explain the material well, and Benny is a readily available and supportive TF.","Do the reading. Stay on top of it. If you get behind, further readings will become more difficult.","You learn a lot of interesting things but it's a lot of reading and feeling kind of lost. It seems like a good alternative to the other intro class because it has a lot to offer, but you need to be prepared for it to be focused on linguistic theory with lots of dense readings that you may struggle with if this is the first time you've experienced a linguistic or literary theory course. That said, it does offer some enriching views on language that will not only enhance your own ethnographies, but change the way you think about language in your own life.","This class was hard. A lot of stuff doesn't make sense, but you learn some cool things about language nonetheless."]},"Fall '14":{"comments":["If you have even the slightest interest in the relationship between language and culture, then this is the course for you. Professor Harkness is an amazing lecturer and you will feel like you understand the universe on a deeper level when you hear him speak. Sections with Vivien are tons of fun and she is amazing at facilitating discussion and enthusiasm (seriously, one hour is not enough time when you talk with Vivien). The readings are super interesting (SO READ THEM) and I am not exaggerating when I say that I totally have left this class with a new-found understanding of language and culture. Assignments can be a bit difficult (there were only three essays) but totally forces you to think about everything you have learned in the course.","I loved this class. It was challenging, but I learned so much. Professor Harkness is brilliant! He is incredibly knowledgeable about this material and his passion for it comes through in every lecture. He is always engaging and will make sure that you are engaged too. The readings are crucial and not overbearing, so they are not hard to do. Overall a great class that I wish I could take again.","The good: fascinating topic, great readings, fun papers, pretty useful lectures.\n\nThe bad: a professor who doesn't always seem to want to help you to understand what he is saying (i.e. lots of jargon, defensive answers to probing questions, obscurantism, use of language to form a hermetic seal against the possibility of being proved wrong), along with many readings full of inflationary language.","Very difficult course but the material is interesting. The lectures can be very eye opening if you have read the texts carefully.","Make sure to do the readings every week, and come to section prepared with specific questions. This class is very much dependent upon your own commitment -- if you put a lot in, you'll get a lot out.","The reading can be very very confusing. I feel like the way I view language and culture has changed in this course, but still in a way I don't fully comprehend myself. There is a ton of complicated vocabulary in this course that the teaching staff seems to combine and throw out at random which can extremely difficult to grasp.","I would say that the only way to really enjoy the class is to have a genuine interest in the connection between language and how people see its function in different societies. The readings can be really technical and almost impossible to get through, but I would say that it's been the most rewarding course I've taken. Vivien is a great tf, and helps make the material much more accessible. Prof. Harkness is great, and his lectures are fantastic.","This class was challenging, but fantastic, enlightening, and well worth the effort.  Don't be scared by the challenge--this class is introductory, and though previous experience in anthropology helps, it is definitely not necessary (I didn't have any).  I enjoyed it immensely and recommend it to anyone at all interested in anthropology."]}},"mostRecentQ":{"overall":"4.40","workload":"4.20","difficulty":null,"recommendation":"4.10","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"1","4s":"4","5s":"5"},"QDifficulty":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"0","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"ANTHRO 1640","course_id":"152","cat_num":"5844","1s":"1","2s":"7","3s":"1","4s":"0","5s":"0"}},"success":true}