{"scores":{"Spring '14":{"course_score":{"overall":"3.70","workload":"1.60","difficulty":"2.90","recommendation":"3.70","enrollment":"67","response rate":"58.21","QCourseOverall":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"1","2s":"1","3s":"14","4s":"12","5s":"9"},"QDifficulty":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"0","2s":"10","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"18","2s":"16","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"SCI-LIVSYS 16","cat_num":"0470","course_id":"2006","year":"2013","term":"2","id":"e601975271ed3c7237ec7c934fdf7882","first":" Daniel E.","last":"Lieberman","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '12":{"course_score":{"overall":"3.82","workload":"2.04","difficulty":"3.24","recommendation":"3.69","enrollment":"49","response rate":"91.84","QCourseOverall":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"1","2s":"1","3s":"14","4s":"12","5s":"9"},"QDifficulty":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"0","2s":"10","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"18","2s":"16","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"SCI-LIVSYS 16","cat_num":"0470","course_id":"2006","year":"2011","term":"2","id":"e601975271ed3c7237ec7c934fdf7882","first":"Daniel E.","last":"Lieberman","InstructorOverall":"4.31","EffectiveLecturesorPresentations":"4.36","AccessibleOutsideClass":"4.45","GeneratesEnthusiasm":"4.44","FacilitatesDiscussionEncouragesParticipation":"4.12","GivesUsefulFeedback":"4.55","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '11":{"course_score":{"overall":"3.88","workload":"1.50","difficulty":"2.91","recommendation":"3.76","enrollment":"41","response rate":"82.93","QCourseOverall":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"1","2s":"1","3s":"14","4s":"12","5s":"9"},"QDifficulty":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"0","2s":"10","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"18","2s":"16","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"SCI-LIVSYS 16","cat_num":"0470","course_id":"2006","year":"2010","term":"2","id":"e601975271ed3c7237ec7c934fdf7882","first":"Daniel E.","last":"Lieberman","InstructorOverall":"4.29","EffectiveLecturesorPresentations":"4.32","AccessibleOutsideClass":"4.41","GeneratesEnthusiasm":"4.41","FacilitatesDiscussionEncouragesParticipation":"4.29","GivesUsefulFeedback":"3.88","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '10":{"course_score":{"overall":"4.00","workload":"1.74","difficulty":"3.06","recommendation":"4.00","enrollment":"32","response rate":"96.88","QCourseOverall":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"1","2s":"1","3s":"14","4s":"12","5s":"9"},"QDifficulty":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"0","2s":"10","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"18","2s":"16","3s":"2","4s":"0","5s":"1"}},"instructor_scores":[{"number":"SCI-LIVSYS 16","cat_num":"0470","course_id":"2006","year":"2009","term":"2","id":"e601975271ed3c7237ec7c934fdf7882","first":"Daniel E.","last":"Lieberman","InstructorOverall":"4.42","EffectiveLecturesorPresentations":"4.45","AccessibleOutsideClass":"4.66","GeneratesEnthusiasm":"4.68","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"4.11","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '10":{"comments":["At the time of midterms and finals, it takes a ridiculous amount of preparation, and ultimately, with such a vast amount of material covered for the test, you can study for hours and still do poorly on the test because it might not ask what you focused on in your studying. Lectures are fun and interesting, but the final assessments are brutal.","Don't skip the lectures.  They're really enjoyable, and all you need to know for the exams is on the slides.","Very good introduction to human evolution, broad, clear lectures, insightful.","It is a great, interesting class and Professor Lieberman is enthusiastic, knowledgeable and engaging. Don't be fooled by how funny and nice he is - the class is not especially easy.","If you like the material, this is a great course. You will be handling bones in lab as well as measuring teeth and cranial capacity. If you are not interested then labs may be a bit boring, but still MAY help you understand material better.","It is an interesting class, but more demanding than it might initially seem.","Study the details.","Professor Lieberman is phenomenal, but the course is new, and I would wait a few years for the Q scores to morph the class before recommending it with enthusiasm","There's a lot to memorize","pretty good but gets a little repetitive...good core nevertheless","The material is very interesting, but for someone with no background on the subject, all the memorization requirement is daunting. Having a background on concepts in biology (metabolism, DNA) would also be helpful because the twenty-minute overviews given in lecture might not be enough to help you grasp the material.","It's interesting and fun to learn about how humans evolved.","This class is a great way to fulfill your SLS requirement, because the professor is engaging, the topic material is fascinating, and it is laid out so well that it is hard to not follow along. A great way to answer the big questions of human evolution. The class is also constantly evolving itself as human evolution is a dynamic field of discovery. Lierberman is FANTASTIC!","Great class! You should take if you would like a background on how we evolved and how our evolutionary past is relevant today","Course is more difficult than it appears at first - lots of emphasis on memorization, and there's a lot to memorize.  Otherwise pretty painless course on interesting material that sheds light on our own bodies, with a team of very dedicated and enthusiastic teaching staff.","The lectures are interesting. Lieberman is excellent, and the TFS knowledgeable, available, and friendly. There is little week to week work, but heavy studying is needed for the exams. It is easy to do poorly in this class, but with some memorization, it is easy to do well.","Make sure you study the specifics that the professor goes over because the tests are highly based on memorization.","This is a great course for those in the HEB department or those in need of a good GenEd.  The lectures are interesting and the lab sections are fun.  There is not excessive work; however, when there are assignments be prepared to spend a lot of time on them.  As for exams, be sure you memorize everything!  That is not a complaint but very important if you want to do well in this course.  Also, Lieberman is amazing and be sure to go to his office hours if you are in this course even if you just want to talk.  He is always willing to talk to you and keeps you interested in the subject matter.  If this course interests you whatsoever, take it!","It's a good class to take for your gen-ed. It is more heavy on the science than the anthro, which shouldn't be that surprising, but it's something to keep in mind.","This is a good way to satisfy a core or GenEd, and the material is deceptively fascinating.","Go to the lectures.","There is interesting material to be learned, but it is buried under a lot of unnecessary information and details.","I think what you learn is really cool! If you run, take the class. If you are a pre-med, this class is super cool - you learn why our bodies are the way they are. If you want to cure (or to avoid) cardiovascular disease, Type II diabetes, fallen arches, etc then this class gives interesting perspectives. If you want to go to the zoo and be able to tell your kids many cool things about the animals, especially gibbons, gorillas, and chimps then take the class."]},"Spring '11":{"comments":["Hands down my favorite class this year. Professor Lieberman is both a gentleman and a scholar. I now more passionately want to be a Homo erectus hunter-gatherer than I did before.","Interesting, painless, good professor.","Very interesting class","lectures are good, but disorganized and hard to do well","This is an incredible class, everything that Harvard can suggest. You have a leading professor and top tf's. You have material that influences how to live life. You have classmates who want to have conversations about this material. Lastly, this class provides a base for lots of self-reflection on the world, humanity, and humanity's role in the world. This class doesn't end at the close of lecture; this is the kind of Harvard class that arms you for the world.","This class isn't hard but isn't exactly interesting either.  I was really excited to take it because of the subject matter, but I found Prof. Lieberman to try too hard during lectures to be funny, making it seem tedious and uninteresting.  Labs were mostly fun and informative, but could also be tedious because we had a lot of tables to fill out. Also, they grade really hard for no reason.","The class is fascinating and generally accessible. Further, the course requires minimal work to succeed.","RUN.\r\nUnless you want a little nap time in the middle of your schedule, in which case apply away.","Be prepared to do work. It may seem useless to do the readings sometimes, but really, they do help clear up big picture ideas, especially the sourcebook and ESPECIALLY the articles Professor Leiberman himself wrote. The class has a lot of interesting ideas and useful information, so try not to get caught up in the little details. You do have to memorize A LOT, but once you get passed that, you really can gain a lot from the course. You will have to put in a lot of studying for the mid-term and final though to synthesize all the information.","The professor is truly excellent, but you'd do well to find a core with more consistently meaningful material.","Make sure you keep up with the readings and ask lots of questions.","Before I took the class I read that it was entertaining, pretty easy, and that an annoying amount of memorization was required for the final. This was my experience. You learn a lot of cool stuff, lab and lecture are good, and you will probably end up cramming some details before the midterm and final. It was a good class.","Great class that delves in depth into the evolution of the human species. Requires memorization of a lot of specifics, but is worth it.","This is an easy class to take even if you think you aren't good at science. It is fun AND relevant to many current issues.","This course gives a great overview of human evolution while going into pertinent details giving students a new perspective on life.","Very interesting lectures and pretty cool labs (get to see real fossils and stone tools) but the midterm\/finals are impossible. It's a very large amount of memorizing very small facts so that you'll never remember it all. Concepts are only scratching the surface, you need to know all the nitty-gritty details.","Be prepared to memorize a lot of years.  Professor Lieberman gives the impression that you don't need to memorize many of the details he gives in lecture, but they will appear on exams.  Knowing details are crucial--I went into the midterm with a good grasp of the major concepts and evolutionary trends stressed in the lectures, and found that much of the test was devoted to a few years and numbers that had only briefly been touched upon.","Comprehensive and fascinating explanation of human evolution, but very tough for a gen ed","A painless way to fulfill your Science of Living Systems requirement."]},"Spring '12":{"comments":["ONLY and I mean ONLY enroll in this class if you are prepared to memorize, amongst the main body of the class, dates and figures. Do not take if you want a class you can breeze through. You need to enjoy learning about australopiths, homo erectus, hunter-gatherers etc. because the 1.5 hour lectures are unbelievably easy to sleep through. And you cannot just watch the lecture videos because they do not release them until a day or so before the midterm. I really thought I would enjoy this class but I ended up despising it with a passion.","It's a good gen ed, but it does involve WORK. and labs are graded harshly. Have heard its well curved but not sure how well that's gonna turn out... basically misleads you in how much work it is and how SPECIFIC the test questions will be.","This class is cool! Prof. Lieberman is a very good lecturer and the labs are a lot of fun.","The topic is very interesting but the lectures can drag and the grading is kind of rough.  But Prof. Lieberman is SO great!","there is a huge focus on early human evolution, and only focus on modern issues in light of this evolution in the last lecture or two","You learn a lot of interesting materials about humans evolved to have the body we have today. However, the class is very dense with materials and the exams are unnecessarily difficult. Really prepare well for them if you want to do well.","You learn some fascinating material from a really engaged and wonderful professor.  Downsides: it's hard to study for the tests and they are difficult.  This is not an easy gen ed, but I absolutely loved everything I learned and I think a lot more people should take it. I think it's totally worth it.","While the class is a great introduction to many crucial aspects of evolutionary science, it takes on a lot of material for a gen ed or elective course.  The exams require a lot of study time. Lecture is pretty enjoyable though, besides the immense amount of material that's covered.","The material is SO interesting, and Professor Lieberman is a pretty good lecturer! The labs are also really cool and interesting. If you're looking for an SLS course, this one isn't too difficult and the workload is very reasonable in my opinion !!!!!","The class is very interesting, but too intensive for a general education class.","Lieberman is a good teacher, but unless you really like fossil hominins, this would not be that interesting for you.","Don't take this course unless you enhjoy science, are ready to memorize, and have a good background to work from. You also have to be ready to look for help elsewhere. Be prepared to sit through lectures that are entirely too long yet rushed so you miss the information that comes up on  a test that the staff truly refuses to prepare you for. Lectures seem even longer because the professor tries to be funny and is petty and biased in regards to his own research and stance on a material. Don't take this as a gend ed, there are easier ways of doing this and much mroe enjoyable ones.","The course is interesting, but is harshly graded.","Very interesting and well-taught course but near photographic memory is required.","Although the material may seem to be tedious at times (teeth, toes, pelvis, repeat) at the conclusion of the course I found that I had learned an incredible amount, and the course was really worth it.","It's really interesting material, and useful life knowledge, but section is very frustrating.\r\n\r\nThe other problem is that they continually claim that they want you to understand concepts more than anything else, and then test you on extremely specific details for everything they've talked about.","The lectures are interesting, with very cool material (if you find evolution intriguing). You'll also like a lot of the course if you are a runner (and will like talking to Professor Lieberman even more).\r\n\r\nHowever, labs are painful (not hard, but painful); they consist of measuring skulls for an hour and a half each week, which turns into mindless, tedious work. In addition, your labs will be graded harshly, even if there was no reasonable way for you to have known the information. Some of the labs are awesome though: we did a lab on running mechanics where we hooked students up to measure their metabolic rates in different running gaits; in another lab, we looked at actual Paleolithic tools (very cool). With the exception of those two labs, I found lab to be monotonous and frustrating, which was really a damper on the course. \r\n\r\nLikewise, I found the exams to be painful (not hard, but painful). While, with a fair amount studying, I knew most of the material, the final was brutally long and difficult to finish. The midterm involved a lot of annoying memorization. \r\n\r\nWe obviously do not have our grades yet, but the course was constantly graded pretty harshly for a Gen-ed, leaving non-science students at a big disadvantage. \r\n\r\nOverall, this is a good course and you will leave with a lot of knowledge about human evolution. The highlight of the course is Professor Lieberman; he is a fantastic instructor and individual. My biggest advice: if you take this course, take FULL advantage of the professor at your disposal- talk to him, ask him questions, run with him. I am very glad to have gotten to know Professor Lieberman and look forward to staying in contact with him in the future.","The subject matter is interesting, but it's also a pretty difficult gen-ed since the course covers an enormous amount of detailed information you likely have not encountered before. Nevertheless, if you're interested in why humans evolved into the way that we are, it's a good survey\/introduction to human evolution.","There are some interesting points about the relevance of evolution to our modern day lives and bodies, but unless you are a science person this class will be mind-numbingly boring. Probably 2\/3 of the information you will \"learn\" and be expected to know is slight differences in the sizes of various bones in various species and in the food they may or may not have eaten.","This class offers a very interesting perspective on human evolution and modern society. Although some of the details can be difficult, as a whole, this course is very interesting and the broad themes are valuable.","Take only if you are an HEB concentrator. This is a tough SLS gen ed and unfair to those who aren't concentrating in HEB. However, Lieberman is terribly smart and a great lecturer. A privelege to study under him.","This class requires a LOT of memorization.  When you go into the midterm be sure to memorize the dates, locations, and brain sizes of all those species you will have learned.  Know your life history chart!","The course covers some interesting material, and the workload is pretty light. However, I found the grading to be a little nitpicky at times, and also some of the questions are not very well formulated. Nonetheless, I think I ended up learning some interesting things by the end of the semester.","You'll learn a lot!","You have to memorize a lot of numbers and facts for the exams. Otherwise, the course is great.","This is a really great course.  Not very easy at first, but if you're willing to keep up with the material, it's definitely possible to do well, and I think it's worth it.  I found the material fascinating, and even though it's an introductory course, I really did get the sense that it allowed me to engage in a serious way with the topic.  Professor Lieberman is an excellent lecturer and the TF's are very kind and willing to offer one-on-one assistance.  I highly recommend taking this course.","SLS 16 is an awesome class, and Professor Lieberman really makes it worthwhile. This is not the easiest gen-ed you will ever take (it's actually pretty rigorous), but you learn a lot! Lieberman's lectures are engaging and the labs for the course are fun (lots of looking at skulls!). That being said, the midterm and final were very tough, and count for a good portion of your grade, so you have to memorize all the details and really understand the concepts if you want to succeed. The teaching staff is always eager to help or answer questions, so take advantage of that! And go to Professor Lieberman's office hours--he's the coolest.","I thought that this class had a really interesting look at the way our bodies work, particularly in regards to the evolution of our locomotion.  Lieberman is a really good lecturer and you'll learn a lot of material that's relevant to our daily lives.","Ah, first midterm is about the first half of the course, final is about the second half. Its just a bunch of memorization. All the graduate students are really creepy\/weird\/eccentric. Make a point to see the fossils and things offered in class. It's really cool. Good luck!","I took this class as a Gen Ed. While it didn't require that much work on any given week, the exams require pretty intense studying, and the material is pretty esoteric. You have to memorize australopith brain sizes and discovery locations. Most of the class focuses on minute evolutionary details; the last couple weeks show how evolution relates to modern day phenomena, like various diseases and the apparent distinction of race. THAT part is fascinating, but the rest of it? Not really relevant for a humanities concentrator just trying to fulfill the SLS requirement."]},"Spring '14":{"comments":["Really interesting subject matter, great professor, lectures can get a little boring and expectations for the midterm and final are a little unclear--you have to know a lot of minute details that aren't made clear. Good way to fulfill SLS though","Great class and teaching staff. Exams are very detail oriented and demand a lot of studying.","There is definitely some nitty gritty, but it provides a really great overview of human evolution. Great for HEB-ers who haven't had that basic \"what actually happened\" class, especially in light of most of the courses in the department that are highly specific (i.e. Primate Social Behavior, Hormones and Behavior, etc.) Dr. Lieberman is a phenomenal lecturer who loves to talk about this material.","The later portions of the class that focus on evolutionary medicine, and how culture has shaped the selection of homo sapiens is fascinating, but the vast majority of the course is focused on very pedantic detail.","This course is the best course I have taken that manages to integrate biology, evolution, and APPLY it to modern day life. The material is fascinating, I feel like I came away with a greater knowledge about human history and a better understanding of disease in today's world. The assignments are fulfilling and lectures are fun to go to because Dr. Lieberman is passionate and enthusiastic about the material, which shows in his teaching. I would absolutely recommend this course, even if you are not an HEB or other science major, because the material is interesting and accessible to everyone.","Don't take this class unless you have to. It is boring and you have to learn a ton of boring details that you forget as soon as you take the midterm.","Despite what they tell you, they are VERY DETAIL ORIENTED.","This class is great!  The first half is a pretty heavy on memorization, but once you have a good foundation of the major steps throughout human evolution, it really is a cool thing to how those steps have a major impact on our current lives.  Bear in mind that this class satisfies an HEB requirement, so most of the class are HEB concentrators, but you really don't need any background to make this a great class to take.","Don't take the class if you need to fulfill a GenEd.  The material gets really interesting at the end of the year but is pretty boring for the first half of the semester.","This class is a very hard gened.  There is A LOT of material covered very quickly but it is all interesting and the teaching staff is very nice and willing to help!","I really enjoyed the lectures and thought it gave a great overview of human evolution and evolutionary medicine.  I'd recommend over-preparing for the midterm and final because, although they will assure you that they are interested in the big picture and not the minutiae, some very obscure trivia will appear on the test to separate those who really know it well.","Lieberman is a boss, and this class it really entertaining.  It can be a little stressful because he covers a lot, but if you pay attention to the major themes you should be fine!","If you're looking for a quick and painless Gen-Ed, then this course is not for you. However, if you want to put in work and learn about the implications evolution has on our health today, then I recommend it! Although Prof. Lieberman insists that overarching themes are what we are to learn (and later be tested on), it is these details that matter quite a bit for the midterm and final. That being said, there's definitely lots of memorization to be done!","This is my favorite class I've taken at Harvard. The content, professor and TFs are top notch. Take this class.","This is a very dry and boring course unless you are specifically interested in memorizing information about fossils, dates species of hominins and genetic evidence of their existence. The labs in particular are very painful although mostly short.","The lectures are really long and full of material, but you really just need to focus on the big picture. Lieberman's lectures can be somewhat \"preachy\" so be prepared to be lectured on your eating and exercise habits (if they don't match his!). Pretty repetitive and oversimplified for HEB concentrators, but doable. Exams are worth a large percentage of your grade so don't blow them off!","This was a good Gen-Ed.  I feel like I learned a lot that's relevant to stuff in the news and modern life.  There is a lot of memorization for the tests, but the labs are relaxed and not difficult.","Not a bad class but the staff makes the course seem deceptively easy. It's a lot of memorization so if you're not into knowing the dates, brain sizes, and locations of fossil hominins walk away now. Lieberman is a great guy though, you should get to know him.","It's a fun class and good to take for a gen-ed.","Although this is a fabulous course that I highly recommend, it is much easier if you have some background in evolution\/HEB. I would take the course even if this is your first exposure to the material, just expect it not to be a throwaway class.","Take this course! aside from being very interesting and infromational about our history as humans on earth, it also is very important to understanding how our history\/evolution contributes to our health now a days. Very interesting!","It is incredibly interesting. I learned a lot about why we are the way that we are and how we got there.","Everyone needs to learn about current health problems like obesity and cardiovascular disease in the context of evolution - I took a lot away from the class that will affect my own lifestyle. \r\nEarly material is tough, a lot of memorization; later material is the interesting stuff\r\nLabs are fairly straightforward, exams are fair\r\nLieberman is a great lecturer","It is what it is.  Prof Lieberman is quite funny and has great insights.  Soooooo much memorization for the exams, which made it really tedious to study.  Kind of odd final, but otherwise fine.","Lieberman is snarky at times, but on the whole a very good lecturer and very esteemed faculty member. Also, very helpful to take if you have any interest in the authenticity of evolution as opposed to creationism."]}},"mostRecentQ":{"overall":"3.70","workload":"1.60","difficulty":"2.90","recommendation":"3.70","enrollment":"67","response rate":"58.21","QCourseOverall":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"1","2s":"1","3s":"14","4s":"12","5s":"9"},"QDifficulty":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"0","2s":"10","3s":"21","4s":"6","5s":"1"},"QWorkload":{"number":"SCI-LIVSYS 16","course_id":"2006","cat_num":"0470","1s":"18","2s":"16","3s":"2","4s":"0","5s":"1"}},"success":true}