{"scores":{"Fall '12":{"course_score":{"overall":"3.54","workload":"1.83","difficulty":"2.88","recommendation":"3.71","enrollment":"29","response rate":"86.21","QCourseOverall":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"2","2s":"2","3s":"7","4s":"7","5s":"6"},"QDifficulty":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"0","2s":"6","3s":"15","4s":"3","5s":"0"},"QWorkload":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"6","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"US-WORLD 11","cat_num":"4045","course_id":"2063","year":"2012","term":"1","id":"799899c42ba2678ebd0dbd49daa00c3f","first":"Richard","last":"Frank","InstructorOverall":"3.54","EffectiveLecturesorPresentations":"3.42","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"3.33","FacilitatesDiscussionEncouragesParticipation":"3.89","GivesUsefulFeedback":"3.46","ReturnsAssignmentsinTimelyFashion":"3.50"}]},"Fall '11":{"course_score":{"overall":"2.89","workload":"1.63","difficulty":"2.79","recommendation":"2.98","enrollment":"134","response rate":"94.78","QCourseOverall":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"2","2s":"2","3s":"7","4s":"7","5s":"6"},"QDifficulty":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"0","2s":"6","3s":"15","4s":"3","5s":"0"},"QWorkload":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"6","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"US-WORLD 11","cat_num":"4045","course_id":"2063","year":"2011","term":"1","id":"799899c42ba2678ebd0dbd49daa00c3f","first":"Richard","last":"Frank","InstructorOverall":"2.89","EffectiveLecturesorPresentations":"2.72","AccessibleOutsideClass":"2.80","GeneratesEnthusiasm":"2.82","FacilitatesDiscussionEncouragesParticipation":"3.18","GivesUsefulFeedback":"3.08","ReturnsAssignmentsinTimelyFashion":"3.04"}]},"Fall '10":{"course_score":{"overall":"4.32","workload":"1.40","difficulty":"2.34","recommendation":"4.56","enrollment":"170","response rate":"95.29","QCourseOverall":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"2","2s":"2","3s":"7","4s":"7","5s":"6"},"QDifficulty":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"0","2s":"6","3s":"15","4s":"3","5s":"0"},"QWorkload":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"6","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"US-WORLD 11","cat_num":"4045","course_id":"2063","year":"2010","term":"1","id":"3de518dd43892118ad61de600cae59d8","first":"Michael Esman","last":"Chernew","InstructorOverall":"4.51","EffectiveLecturesorPresentations":"4.54","AccessibleOutsideClass":"3.39","GeneratesEnthusiasm":"4.64","FacilitatesDiscussionEncouragesParticipation":"4.15","GivesUsefulFeedback":"4.11","ReturnsAssignmentsinTimelyFashion":"4.06"}]}},"comments":{"Fall '10":{"comments":["This class is really fascinating if you are at all interested in health policy or want a fairly unbiased view on how health reform will affect us","The material is pretty dry, but I think it's important information to know. Chernew was really generous about what he expected you to take away from his lectures, acknowledging that everything he was teaching is likely to change before it ever affects us, and he was also very generous in his grading. The class is not easy if you want to MASTER the material, but if you want to come away with sufficient knowledge of health care for a dinner table conversation (which is why I took it), then attending the lectures is pretty much all it will take.","The course provides you with the basics of the US health care system and the problems it entails, as well as gets you thinking about how to solve these problems and the further issues with the solutions.","It's a painless GenEd.  And it's topical.  I'm not sure how much you'll really get out of the 2nd half of the course though.","This class was a great introduction to healthcare in general, as well as the current issues that are going on in the United States.","I really enjoyed this class because Mike is probably the best at making the information accessible and interesting. After having David Cutler lecture one day I was amazed at how much more I preferred Professor Chernew. Cutler is supposed to be a great figure in the health care study, but Professor Chernew is definitely the better lecturer.","Although the class can occasionally be a little dry, the material is very timely and it was probably the most important class I have taken here. I finally understand how nuanced and complicated the health care debate really is.","A good introduction to health care policy and how complicated it is.","hands down the best health policy class at harvard! I've taken a bunch and this wins. great lectures, fun assignments, and I know I'm going to remember everything i learned. he really drills the core concepts into you.","This is a great course for US-World category and teaches you something you need to know about in today's world.","Not overwhelming, interesting Gen Ed.","Though the Professor admits he is unorganized, it can still be a bit frustrating when the due dates and assignments of things are always changing from the original syllabus. There is almost no outside reading required, and it is a great introduction into the economics of health care. I learned a lot about our system and  the changes that are trying to be made. Hour and a half lecture can be a bit much...","good intro course on health policy. take this instead of cutler's class.","I think this course would be very satisfying for economics concentrators as well as premed students who are interested in acquiring a greater understanding of the complex economic and social challenges that are regularly confronted in healthcare policy.","Take this course. It is not difficult, but unlike most easy courses, you will learn a lot from this class. If you're planning to be a physician, or in any way involved with the U.S. healthcare system, this class is worth it. In addition, Prof. Chernew is thoroughly engaging and an excellent lecturer.","This class is probably one of the most practical courses I've taken at Harvard. This course is extremely useful for pre-meds or those looking to go into public health, and it's also really fun! Chernew is hilarious.","There is a lot of information covered, but it is all very applicable and worth knowing.","TAKE THIS CLASS.  This has by far been one of my favorite classes taken at Harvard.  Chernew is a FANTASTIC lecturer, and section is generally really enjoyable.   This is one class at harvard NOT designed to make everyone fail, and you can get an A if you put in a little effort.  I never thought I'd be this interested in health policy, and its a gen ed. More reason to take it!","The course deals with subject matter that is timely, relevant, and more simply good to know. Professor Chernew is incredibly knowledgeable on the topics and for the most part does a very good job of explaining it in terms that are easily understood.","USW-11 is an awesome class, you learn a lot about health policy and the American health care system from different perspectives.","USW 11 is an outstanding introduction to health policy. Professor Chernew is really clear and really hilarious, and while the class is not too hard you will learn a ton about the US health care system, the major challenges facing it, and the major solutions that have been proposed. An incredibly relevant and real-world class, and an incredibly useful one to everyone I think.","This was a very interesting class that was also very little work.","You learn a lot about the American health care system, and Chernew is fun.","This class was my first introduction to health care policy and the state of health care in America, and now I have decided to pursue a secondary in health policy!","An easy and fun gen ed that you'll actually enjoy going to and learn something from about a topic tat - whodathunk - effects your daily life.","This was an incredible class if you're interested in learning about our heath care system with an enthusiastic, entertaining professor.","Really good class to learn about American Health Care. Not too much work, and cool professor.","take a bit of economics before (high school econ would satisfy) and then be open to just listening and trying to absorb as much as possible.","Great class!","Attending lecture is the most important thing. Some lectures are unfortunately boring.","This is an awesome class. In the beginning the economics can be a little hard if you haven't taken economics before. But after the beginning, it all makes a lot of sense and the ec is actually really important to understand the entire course.","This class is a relatively painless way to learn a lot of really relevant and interesting information about healthcare - an important topic in modern society!","Chernew is one of the best professor's I have had at Harvard.","for a class with very little work, you learn a lot. Chernew is the funniest professor i have ever had and he has great stories for every topic","I feel that what we learned is very important to know, especially if you're actually American. I loved it at the beginning, but that feeling really waned towards the end, where I found the material much less interesting. Class average on most assignments and things was above 90. Chernew is generally fun to hear lecture.","Borrow someone's ec 10 book and read about moral hazard and adverse selection. You'll be set.","An extremely important class to understand one of the most important and complex problems facing our country. Definitely take this class! The professor and TFs are wonderful.","Really great introduction to the health care system. Will be beneficial for students going into any number of professional fields.","It's a good class and Prof. Chernew makes the material interesting; it has some unnecessary assignments, but overall, it is low-work and fun","This was a great class which provided a good overview of the healthcare sector. At times it was a bit challenging to synthesize a lot of information, and 1.5 hour lectures made it a bit difficult to focus, but the staff does everything to accommodate the students(online reading, take home final, open book quiz, taped lectures, professor giving some answers away for free before the tests,etc.). I would definitely take this class.","Health care is a huge problem in the country and it affects everyone.  Take this class if you have any interest in health economics and health care reform, or even if you're just wondering what the health care bill is all about.  It's a great class, the professor is funny, and the workload is light. You'll learn a lot, and it's very relevant.","pay attention!!","Professor Chernew lecture's are definitely the best I've experienced at Harvard. He's funny and incorporates his personal experiences and opinions into the policy concepts and allows us to develop our own thoughts about the health care system in general without influencing us from the politically-biased perspective. No homework for this class, the assignments are low-moderate difficulty and by the end of the class you will know more about the health care system than many physicians. Definitely take this class .","This course is great! It doesn't require much work outside of class but you still get a lot out of it.","enroll in this course if you have an interest in health policy. i definitely learned a lot about the health care system in general, and the changes that obamacare will bring.","worth taking if you're interested in health care, even if you don't want to anything related to admin or policy. you will finally be able to chime in and at least sound intelligent when people starting debating about health care. easy and useful way to fulfill a core","I'm happy to have taken this class because the subject matter is relevant and useful, but the material taught in class was not always incredibly interesting. Understandably, the fundamentals behind the health care system are complex, and they're good to know, but know that the subjects can get boring. The workload was very light though.","Very interesting and very little work.","The class is great in exposing you to the issues surround health care and health care policy.","It is the best class I have taken here so far. Professor Chernew is hilarious and a great lecturer. Also, the material is very practical and interesting.","One of the best classes I have taken at Harvard. I loved the lectures and the material. The professor is excellent, as are the TFs.","It's super easy, but pretty dry and boring. A lot of the material gets covered in different classes in a more exciting way. This class definitely won't be life altering, but if you're looking for a straight-forward class with no surprises and easy exams, this might be a good class for you.","Professor Chernew is an amazing lecturer and you will never get bored in his class!","Don't overconsume health care","I highly recommend this class. The professor is interesting and tells lots of stories. The work is easy. The exams are mostly multiple choice and T\/F, with some short answers on the midterm. It'll be really easy for you if you've taken Ec10.","Very good class, you learn a lot and it is not a ton of work","This class does not have a lot of work and it is easy to let it fall by the wayside. Don't do it though!  Professor Chernew is a great lecturer (although he sometimes speaks too quickly for comprehension) and there is a lot of useful, practical knowledge that you can gain from this course.","Ec would be useful, but the course does a great job of introducing you to concepts you wouldn't know","This course is awesome - it really helps dissect the particulars of the American healthcare industry and why it has become what it is today.","Chernew is hilarious, and lectures are worth going to, even if just for his awesome stories! He really cares about the students' concerns. The material is also very important and relevant for anyone who wants to have a good discussion about healthcare problems in the US.","Both an enjoyable and useful class.","this is largely a health economics class, not a health reform class. Chernew rambles a lot, but he is likable.","This is a great informative class that doesn't have too much work! :) Plus lectures are so much fun!","This is an amazing course to take if you're at all interested in health policy\/the state of healthcare (and its reform) in the United States.","Be prepared for your typical large lecture-class experience.","I felt like I learned a lot about current health care policy without having to read the 2000 page PPACA bill and without having to do a ton of work.  Also got to enjoy funny lectures.","This course is amazing and you learn a lot.","Very interesting class, low workload, great gen ed, elective, or health policy secondary requirement. Prof. Chernew is laid back, funny, and knowledgeable.","This is a really excellent class - Professor Chernew is a clear and engaging lecturer, and the material is extremely relevant. The workload is also not heavy.","Really useful way to understand the underlying issues in health care. Not only relevant, but Professor Chernew is entertaining and really a pleasure to listen to.","Awesome class. Great introduction to health policy and health care reform. Professor Chernew is hilarious.","interesting and well designed GenEd course that uses the good parts of Ec10 to engage students in the complicated aspects of HCP","This is a very chill class; the workload is light. The professor is both entertaining and engaging. It's a great introductory course for people interested in public health, health economics, and premeds! If you're a pre-med, you'll learn how much money you won't be making!","Great class. Chernew's lectures are great!  Minimal reading.  Evaluations are generally low stress and easy.","It's a great class if you want to learn more about health care and the health care crisis of today. It's taught by a great professor, is a laid back class but you still learn a lot if you want to.","take it...it's a great course.","One of those classes that opens your eyes to some information you may never have found yourself.","Take this if you want a secondary field in Health Policy.  Chernew is great, but the assignments are ever-present.","If you are interested in health economics more than health care policy, this would be a course that you could do well in with little to no effort.  If you are from a different background, be prepared to work very, very hard.","A great class for anyone interested in health policy.","This class was the best: I learned a great deal about the American health care system, but at the same time, the course was not terribly taxing.  Prof. Chernew is really fun and has a great sense of humor.  The course is large, but very well-organized (mainly because the head TF, Sam, is amazing).","Interesting subject matter.","The information in the course is relevant and the course load is light. Take this course!","A great overview of the American health care system, its problems, and the source of the problems. Very enjoyable class!","Professor Chernew is great--the material is interesting and well taught. The lectures are very entertaining and sections are very helpful.","It is an interesting class.","I LOVED this course. It was interesting and the lectures were very engaging and funny. The work was fairly graded and very easy to complete. It was the perfect opportunity to learn about health care in a low stress environment.","This class was fantastic.  Professor Chernew is funny, engaging, and makes health economics really enjoyable.  If I could take this class again, I would!","This is a great class. The information is incredibly pertinent and presented in a way that everyone can understand. Readings are interesting, but not necessary (purely reinforce concepts). Coursework is limited, yet you will still learn a lot."]},"Fall '11":{"comments":["need to have interest in subject matter","This class if good if you want an easy US in the world or if you're interesting in Health Policy. If you are after neither of those things than I wouldn't recommend the class. The lectures really boring and hard to focus on.","If you want to be an informed citizen, this is a great class. The lectures are kind of boring but if you can force yourself to engage with the material it's definitely worth it. Health care reform is such a relevant topic today that taking a boring class is worth it just to know more about the subject.","If you are looking to fulfill your \"foundational course\" GHHP requirement, I would not recommend this class. There are other better taught, more organized, and interesting classes you can take for this requirement.","This class is unfortunately very biased in the sense that almost no perspective is given towards the negative aspects of Obamacare.  With that said, it does provide a good overview of the current health care system, despite too much of a policy focus which ignores the business or physician perspective.","A great way to learn about healthcare policy! especially if you know very little!","Take this course. It's topical and easy, not Ancient Novels-Childhood Lit easy: easy in the way that you'll actually learn a lot and not have to stay up until 5 every night.","Interesting material that was made dry by the lecturer.","If you like economics, this is for you. If you don't you'll be frustrated, bored, and probably skip most lectures. But, the paper\/midterm isn't that hard.","Frank's lectures were boring-very hard for me to pay attention to his voice-but very nice man\r\n\r\nIf I had not had an amazing TF, I would have been confused and disappointed the majority of the course","I think there are better ways to fulfill the USW GenEd requirement. I was just very disappointed in how little I learned and how harshly I was graded. I was really excited about this class for the first 2 or so weeks, but then it kind of seemed to go downhill once it began to seem that there was not really a clear learning objective.","Class in general required very little work, but don't let yourself fall behind on the readings or you will find yourself unprepared for the small number of high-stakes assessments.","Do not take this as a gen-ed. This could be an awesome class because the material is interesting and applicable to our lives. Unfortunately the class is poorly run and the assignments are terrible. Feedback is non-existent, and with only 3 assignments there is no room for improvement.","Last year this course received very high ratings because of the professor. This year it will likely receive low ratings, because of the different professor teaching. Honestly the course content is ok, but the lectures are so dry that they seriously impede the course. Overall low workload, unexciting","Not what you expect","This course was not helpful. I learned very little, lectures were not engaging, and readings were unhelpful without a broader context being established in lecture. The one benefit of the course is the light\/generally nonexistent workload.","With a class that doesn't test you on lectures but on READINGS, it is hard to find reasons to go to class at all.","If you like thinking about health policy from a policymaker's point of view, this is the class for you.  If you like a broad overview of the subject with little preparation in econ or gov, this is the class for you.","This class will not inspire you in any way. Find another course that covers similar material with a different lecturer.","If you are interested in what's currently going on in all the health debates, then this is definitely a class to take. You walk away much more informed about the details of ObamaCare and the stakes behind health care reform. Lectures can be dry, but sections are good.","This class was quite boring during lecture; the material itself is relevant and important to know, but I could not stay awake during lectures.","This class is a rather simple way to fulfill a US-World requirement, but I believe that GER could be fulfilled in better ways. Be ready to do a lot of learning on your own and deal with vague assignments. You do, however, learn a good bit about health policy.","Take this course if you are really interested in US healthcare policy issues--otherwise, you can get bored easily.","This is the worst class at Harvard. At least in the Fall of 2011 it was. The lectures are horrible. No incentive to go to class. Ever. I couldn't stay awake let alone pay attention. If you're looking for an easy class this might be what you want. That was my logic for taking it. However, I didn't realize that I wouldn't actually learn anything in the easy class. There are SO many better GenEd's than this one for USW -- take one that you don't hate. This was the worst class I've ever had here and I couldn't stress it more. Please seriously consider why you'd want to take this.","If you are pre-med, it is somewhat relevant. However, the writing assignments are confusing, ask a multitude of questions, have strictly enforced page limits, and are graded with zero feedback and mysterious standards. For this reason, I would urge you to skip this course.","class blows.  it requires no work, but the grading often is random and it really couldn't be much more boring.  however, quite easy and literally do nothing aside from reqs.","if they have any remote interest in health care or cutting costs in general, they should take this class","Be on top of readings, can be confusing at first. I would say take this class only if you are very interested in health care policy.","You don't need to go to lecture. What you need to do is read all the readings; thats what the exams and memos are based on. (You can read the lecture slides later if you want... he puts alot of info on them)","I learned a lot about health care policy in this class and Professor Frank is very knowledgeable, but it was also disorganized and sometimes frustrating.","Class is structured much like the health care system- ambiguous, vague, overwhelming, complicated. Assignments had very little clarification or instruction and we weren't allowed to ask questions. Lecture could definitely be cut down to an hour too.","The assignments in this class were the worst. Grading was ambiguous and overly subjective. The Head TF Ariel is extraordinarily competent and knowledgeable, as is Professor Frank.","This class presents an extremely one-sided, biased view of the health care system in America.  Professor Frank presents data and makes an effort to explain the data.  Where this begins to stray is when he offers solutions to the problems.  It is not a problem for him to offer what he believes should be done and the explain the work he has done in the past; what is a problem is that he does not present any other views on the issue.  The closest he ever got to doing this was when he had Michael O'Grady, a Republican who did some health policy for Bush.  Of course, all O'Grady talked about was how health-policy decision making works in Congress and was not given an opportunity to talk at all about controversial issues.  And, the following class Professor Frank said, \"He [O'Grady] behaved himself.  He clearly knows what the political views of this class are.\"  So not only does the professor present a one-sided view of health policy, but he also assumes that the whole class carries the same political views that he does.  Here at Harvard, students should be provided an unbiased view of the issues at hand and a two-sided view of the proposed solutions.  I am disappointed to say that Professor Frank does not do this.","I believe that the topic is something all Americans should know about, and so that's why I would strongly encourage you to take this class. However, having a good tf is very important because lectures can be a little difficult to sit through. If Professor Frank doesn't have a microphone, I would highly suggest you ask him to get one because it will help you not fall asleep. He seems like a nice guy and I wish I had gone to his OH, and so I would recommend you do that. If you're interested in econ or mental health, he's a great resource.","I recommend taking this course very interesting.","Interesting and relevant material.","didn't take anything out of this course. very unrewarding. arbitrary and ridiculous marking with virtually no comments. interesting subject but class was horrible in several areas","This class is absolutely horrendous- the professor has absolutely no idea what he is doing. The TFs are all terrible at grading exams and papers. I don't even mind them being harsh, but they offer ZERO feedback on our assignments. Course is an epic waste of time and I have not met a worse and boring lecturer than Professor Frank","The course material is very interesting and relevant.  Great class for anyone thinking about going into the medical field as it gives a whole new perspective on health care.","it's not terribly exciting, although it doesn't require much work. be wary of the memos and the grading- if you don't put what they want, points will be taken off","The assignments are few but they are hard.","Honestly, this course would have been much better under the previous professor. Although I never had him, I heard there was less work, less reading, better lectures, and better understanding. However, despite the drawback of not having this professor, this course is still worth your time. It gives you a very thorough background in American health care that genuinely enhances your understanding of it and your ability to engage with it and debate it with others. This course, in the end, will prepare you for the real world. There's little work, still, and the information you'll learn can be learn only through very limited contexts elsewhere.","The class material was interesting, but the lectures could be a bit dry.","I was misled by last year's Q evaluations that this was a very interesting, engaging, and informative course, but that was under a different professor and course structure.","you better like the subject to enjoy the course.","Worthwhile taking this class, but be prepared to never go to lecture and please take advantage of study groups and study guides before the midterm. Don't count on learning things in class. You will only learn in section.","Make sure you shop this class before taking it. If Professor Frank is the teacher, he is entirely too boring to keep you awake during lectures. If someone else is teaching, the subject material is interesting and useful to know.","The course is very unorganized and some of the readings are redundant.","Great to learn more about thinking about health policy and learning basics of the health care system. Sections are highly educational in that the TFs encourage much student discussion and thought about issues. Assignments were a bit ambiguous and the big picture was hard to keep track but further improvement would make this a great course.","It's OK. It's interesting material if you want an overview of the health care system. I wasn't blown away, but it definitely wasn't a bad class. My TF (Ariel) was amazing and I learned new things every lecture. Healthcare just isn't my passion.","you have to be interested in things like insurance and medicaid","The information is relevant. but dry","The assignments in this course are quite difficult. If you are able to understand economics and are able to take a stand on a position and defend it you will do fine.","I am super interested in health policy and was excited to take this class. The topics of the lectures seemed varied and professor Frank has experience doing policy on the field.\r\n\r\nThat being said, I was extremely disappointed with the class. I just did not get the impression that the heads of the course wanted students to succeed. Rather, it felt like they had a general distrust in the student body. It seemed like they were constantly trying to make sure we would not try to cheat or work our way around the rules. For example, they once called two students out for leaving in the middle of lecture. They would not let us ask any questions about assignments to our TF (we had to ask them through an online portal and they would end up not answering or answering way too late). They waited until the middle of lecture to have us turn in our midterm papers, and the impression I got from it is that they did that because they did not want anyone to turn the paper in before lecture and then leave. They were extremely inflexible about extensions. \r\n\r\nAlso, the lectures were boring. The whole class was disorganized, with order of lectures and readings changing frequently. I did not get any feedback on my midterm paper except for a letter grade and two sentences in the margin. The midterm paper was assigned super last minute and the instructions were super vague. The syllabus says you do not need any background, but I did not understand some parts of the class because I did not know anything about economics.\r\n\r\nIn short, the material was interesting, but it was just a terrible class. Take it if you have no idea how the US health care system works. Otherwise, you can probably find a better class.","Material is very relevant to daily life.","The course itself was a pretty good introduction to current health reform and health policy, but the few assignments were not clear, were confusing, and made up the majority of your grade.  Also, the policy of not being able to ask your TF questions before assignments were due was frustrating.","The course provided an in-depth analysis of the Affordable Care Act and the U.S. health care system and how it could be improved. It showed how the U.S. government functions, with interesting guest speakers.\r\n\r\nNot enough time was allowed for students to think about how the health care system could be improved. Although improvement methods like coordinated care were considered and discussed in-depth, there was not enough freedom given to the students to think outside the box.\r\n\r\nThere were so many readings that I could not handle them all, even though most of the readings were quite informative, interesting, and relevant.\r\n\r\nEssay topics were narrow and allowed little variety of responses from students, and didn't really challenge one to think enough.","If you genuinely want to know more about American healthcare, the policy-process, etc this class should be quite exciting!  Readings appear daunting, so try to stay on schedule and develop a study guide as you read (and still study\/swap with a group near midterm season). The moment you have questions, don't hesitate to go to office hours--you could go from knowing nothing about the course to having a good handle on major terms\/principles.  Health policy is all about logic and being able to reason through complex issues, thinking of all the possibilities.\r\n90 minutes worth of lecture can sometimes be a bit long, but try to interact with the professor as he lectures--he loves to ask practical\/thought questions, and as always, ask if you have a question about something mentioned; by being more engaged in class, the information becomes more applicable.\r\nBut generally for this class, you really get as much as you put into it; if you do a bit more work\/thinking, you'll enjoy it more.","It is a good way to satisfy GE requirements. Some people thought Prof. Frank is boring, I didn't think so. I guess it is a personal opinion thing.","Beware the Gen Ed curve","This class is very useful for anyone interested in healthcare. Also in becoming a doctor, you should take the time to really understand the healthcare system and how it affects you and your patients.","If you want an easy intro to US health policy, it's this or EMR20. This has more on government, EMR20 has more on economics. Both are pretty much painless.","For a class that ostensibly covers some of the most interesting and current material in health care economics, this class was one of the most boring experiences I have ever encountered. What a disappointment.","The workload is quite manageable, and the material is generally fascinating and topical.  However, Professor Frank's lectures are often monotonous and difficult to follow.  Grading for this course seemed notably inconsistent and unfair.","Lectures are abominable","Every pre-med should take this course. I used the material I learned A LOT in my med school interviews. As a future physician, this is information you NEED to learn. I think doing the readings for this course really had a big effect on me - I now plan to take a year off during med school to get an MPH.","I hesitate to recommend this course. It was informative. I took the course to learn about health care policy, the Affordable Care Act, Medicare\/Medicaid, etc. I did learn about those things. \r\n\r\nThat said, the course was not engaging, lacked structure, and fell short of my expectations based on the rave reviews I heard last year. The lectures were pretty boring. The assignments (two policy memos) were worth 60% the grade. That is 60% that for which we were not allowed to consult TFs or collaborate with other students about. I don't have a pre-med or economics background, so I had to teach myself the majority of the information to produce a slightly intelligible memo. It was not completely unmanageable, but I found the lack of instruction\/guidance really startling. The midterm was pretty ridiculous. It was 10 true\/false questions, based on 18 lectures of health policy material. It was easy, yes. It was also a huge waste of time. \r\n\r\nThe only really positive part about this course was the section component. My TF was great - really accessible, organized. I wish I could have interacted with her more to get help with my memos, etc.","If you want to learn about health policy in the US, take this class. Be prepared for frustration about ambiguous assignments and tons of reading, but you will learn how the system works, and Professor Frank is the person to learn this from.","lectures are very, very boring but if you pay attention in lecture and section it'd help tremendously in writing the papers.","I would recommend with the reservation that a course in economics should probably be taken first, to get the most out of this course.","The professor has a tendency to mumble and did not respond to several suggestions from students to be miked in lecture. The teaching fellows were phenomenal and you do learn to think carefully about health care policy. Definitely worth taking.","This course is an excellent introduction to U.S. health care policy. You learn a great deal about the the most controversial piece of legislation in our lifetime - the Affordable Care Act. I highly recommend this course to any pre-med or student interest in public policy.","bad course policies that discourage learning, such as the \"don't talk about this assignment with anyone\" and \"don't ask your tf's questions\" policy. additionally, it is very discouraging when paper extensions aren't allowed for very legitimate excuses. the policies in this class truly discouraged me from even caring about the class and i found it to be a joke.","You have to have some interest in the material for the course to keep your attention. If you want to learn about the state of health insurance \/\/ understand what's going on with the ACA, take this class! If you're just looking for an easy gen-ed, you'll be bored.","If you're truly interested in medicine and health policy, this course is essential since it will provide you with everything you need to know to understand health policy and develop your own opinions on reform. Be prepared, however, for bad lectures. The professor has a lot of experience but is not very enthusiastic and does not connect the material between classes. You have to be very independent and take it upon yourself to synthesize the wealth of information the class provides through class, sections, and reading assignments. While it wasn't the best class I have taken, the material was relevant and I learned many valuable things.","If you are interested in the way health care works in the United States or anywhere, especially the politics and economics of it, you will find this class really interesting and make the effort to go to lecture.  If not, you will dislike this course because it could feel like you are learning a lot of dry material that is not always intimately connected to you.  Having the entire grade based on 3 assignments is stressful at times.","Seriously, it is not worth your time.","You need to have a strong interest in health care policy and be ready to deal with a lot of economics. Professor Frank is an economist and often approaches health care issues with a strong bias in this area. In addition, he is not an exciting lecturer, so once again make sure that you really are interested in learning about health care policy otherwise you will be unsatisfied."]},"Fall '12":{"comments":["be ready to read","It's a great intro to US health care! You'll definitely learn a lot.","Very very glad I took this course. The material and discussions themselves are useful and insightful in light of major current issues in politics and health care. But the best is that Professor Frank has so many connections on Capitol Hill that come and lecture and engage in conversation with us. It's fascinating. A little dry at times, but overall a very insightful course with a very manageable workload.","This course needs to really improve to teach interesting material without making it really really boring.","dry material, you have to be interested in healthcare.","Do the readings. Very worthwhile. Also talk to the teaching staff outside of class. They are very interesting people!","Although not the best speaker, the professor really cares about the class and by teaching such an important topic I do recommend it.","This class does a great job teaching you the basics of healthcare, from the ACA to Medicaid and Medicare. As a pre-med, the information that I learned in this class has shaped my perception of medicine in a completely new way, since it has made me aware of the implications of insurance on health care. In addition, I have had countless conversations with my peers about American health care, especially in light of the recent elections, where I have been able to draw on the information taught in this class. In a way that is especially pertinent to the pre-med, when I have been asked to talk about the ACA or about health care in the U.S. during medical school interviews, I believe I come across as much more aware and informed having taken this class. While this class is definitely great for giving you a bigger picture of what health care is like and for inspiring pre-meds to be more socially aware and responsible practitioners, this class is excellent even for the non-premed. Health insurance is an issue that affects everybody. Even if you have no interest in health care itself, your tax money contributes to federal programs that subsidize insurance for those who cannot afford it. Consequently, it is important to understand the basis behind taxes as well as the premiums that you pay for your own insurance.  A great class overall, but you will only learn as much as you are willing to put into it.","This course is excellent. I would highly recommend it. You will learn a lot about health and health policy. If you are interested in dynamic, changing, markets, where there is a lot of opportunity than this is a good course for you. Things to be aware of: there are only three assignments, this is a gift and a curse. It means that most weeks you do not have to devote as much time to this course but when the big things come up you will not have a lot of data points in your grade to account for mistakes (note I haven't received received my grade yet). In addition, while Prof. Frank is extremely knowledable and tells cool stories from his time in government class can be a little slow. Other than that everyone involved in the course is happy to help you out if you reach out to them.","If you're interested in health policy at all, then this class is definitely worth taking. However, if you're only curious or looking for an easy grade, then this just isn't worth it.","This course is not too challenging, but is definitely not about the most interesting subject. Therefore, lectures are boring and the readings are hard to do in large quantities. Don't slack on this as preparing for exams will be difficult, especially if you haven't read anything yet.","don't listen to any of the comments last year. professor frank is an extremely knowledgeable and fun teacher, just hope that not too many people hear that this is a good class because you can learn so much more if the class is small. ask him about the class act if you want to hear interesting and funny stories about his time in washington. the guest speaker lineup is actually amazing. take this class if you want to know how to make health care more accessible, affordable, and efficient","You have to be interested in the way policy is made as well as what those policies are. This is not just an overview of the policies that are created, but also what process the bill went through.","Great general education course.  The professor and tfs really care about students and the course doesn't take itself too seriously.  Perfect work load for a gen ed."]}},"mostRecentQ":{"overall":"3.54","workload":"1.83","difficulty":"2.88","recommendation":"3.71","enrollment":"29","response rate":"86.21","QCourseOverall":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"2","2s":"2","3s":"7","4s":"7","5s":"6"},"QDifficulty":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"0","2s":"6","3s":"15","4s":"3","5s":"0"},"QWorkload":{"number":"US-WORLD 11","course_id":"2063","cat_num":"4045","1s":"6","2s":"16","3s":"2","4s":"0","5s":"0"}},"success":true}