{"scores":{"Spring '14":{"course_score":{"overall":"3.20","workload":"2.00","difficulty":"2.30","recommendation":"3.50","enrollment":"30","response rate":"76.67","QCourseOverall":{"number":"COMPSCI 144r","course_id":"1234","cat_num":"5415","1s":"3","2s":"4","3s":"5","4s":"5","5s":"5"},"QDifficulty":{"number":"COMPSCI 144r","course_id":"1234","cat_num":"5415","1s":"3","2s":"11","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"COMPSCI 144r","course_id":"1234","cat_num":"5415","1s":"6","2s":"13","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"COMPSCI 144r","cat_num":"5415","course_id":"1234","year":"2013","term":"2","id":"ab8407c04815d5cc75e496a62d13b31b","first":" H.T.","last":"Kung","InstructorOverall":"3.20","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.10","GivesUsefulFeedback":"3.40","ReturnsAssignmentsinTimelyFashion":"2.80"}]}},"comments":{"Spring '14":{"comments":["Great elective computer science course to take for concentrators and non-concentrators alike.  Most of the semester is spend discussing latest technological developments (think articles on Engadget\/The Verge).  Then you get to propose a final project using IoT technology you like (phones, raspberry pis, smartwatches, etc.).  This class is very flexible and low workload.  I highly recommend this class to take as an additional CS course.  Low time commitment with outstanding results.  I felt I learned more about the practicalities\/applications of CS than ever before.","Pretty easy CS course, it doesn't require too much work until the ifnal project then it requires a good amount of work.","Interesting topic, but very poorly organized. Professor was difficult to understand and didn't say many interesting things in class. Class was mostly rereading the papers (out loud) which we read for homework the night before. Final project has the potential to be very interesting though.","The class had a fairly low workload and the topics that we covered were interesting.","This class is fine in the most literal sense. It is probably the most disorganized class I have taken (and thats saying something) but it does not require too much work. The material is interesting too. Take it if you want, but don't expect too much from it. Expectations will be everything.","This class is laid back in response to other CS classes and is very doable.  The first half consists of lectures about a given topic (in this case it was the Internet of Things) and there are pretty comprehensive, difficult \"midnight questions\" that quiz your understanding of the readings, lectures, and concepts. Then the second half of the course is really focused on developing a final project. There is a ton of freedom in regard to the execution of this project, but also guidance if you need it.","This class was great! Covered good topics about the general cutting edge \/ future of computing.","This class is awesome if you have a project in mind for the Internet of Things. It give you a great opportunity to spend a lot of time on a project, and the resources are good. The workload outside of the project is very manageable as well.","This is a great course to learn about and work with cool tech gadgets.  For the group project, make sure you pick team members with a lot of experience in development so that you can implement features quickly and accurately.","This class was really easy. Besides the final project which consumed a fair amount of time in April, it is a really low workload each week. The course was somewhat poorly organized and so if you don't like classes like that then stay away. If you want to learn a lot you need to put in the effort yourself since the minimum requirements of the class are very low.","This course was poorly organized, and the teaching staff were very un-enthused about the entire course. We learned nothing during class that was applicable to our projects.","Very fluffy course with light course load. TF's are extremely disorganized.","This course covered the newly emerging area of IoT. It took a high-level approach to a broad range of theoretical material, and enabled students to get an overview understanding of some of the new innovations that we expect to see in the future of IoT. It also encouraged students to pursue one such idea in a final project which was the focus of the second half of the course. Having more CS background would enable you to have a much more ambitious project. You get as much back from this course as you choose to put in.","Take this class! HT, Brad, and Marcus are all extremely nice."]}},"mostRecentQ":{"overall":"3.20","workload":"2.00","difficulty":"2.30","recommendation":"3.50","enrollment":"30","response rate":"76.67","QCourseOverall":{"number":"COMPSCI 144r","course_id":"1234","cat_num":"5415","1s":"3","2s":"4","3s":"5","4s":"5","5s":"5"},"QDifficulty":{"number":"COMPSCI 144r","course_id":"1234","cat_num":"5415","1s":"3","2s":"11","3s":"8","4s":"1","5s":"0"},"QWorkload":{"number":"COMPSCI 144r","course_id":"1234","cat_num":"5415","1s":"6","2s":"13","3s":"3","4s":"1","5s":"0"}},"success":true}