{"scores":{"Spring '14":{"course_score":{"overall":"4.80","workload":"4.60","difficulty":"4.50","recommendation":"4.80","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"2","5s":"11"},"QDifficulty":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"7","5s":"6"},"QWorkload":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"1","4s":"3","5s":"9"}},"instructor_scores":[{"number":"MATH 55b","cat_num":"3312","course_id":"2844","year":"2013","term":"2","id":"fb653ee20d661589495e62c335eaa13a","first":" Dennis","last":"Gaitsgory","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '13":{"course_score":{"overall":"4.83","workload":"3.92","difficulty":"4.17","recommendation":"4.92","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"2","5s":"11"},"QDifficulty":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"7","5s":"6"},"QWorkload":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"1","4s":"3","5s":"9"}},"instructor_scores":[{"number":"MATH 55b","cat_num":"3312","course_id":"2844","year":"2012","term":"2","id":"aad0ec5cb56cf1893c61c0327c85fc79","first":" Wilfried","last":"Schmid","InstructorOverall":"4.73","EffectiveLecturesorPresentations":"4.64","AccessibleOutsideClass":"4.91","GeneratesEnthusiasm":"4.82","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '12":{"course_score":{"overall":"4.14","workload":"5.00","difficulty":"4.93","recommendation":"4.36","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"2","5s":"11"},"QDifficulty":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"7","5s":"6"},"QWorkload":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"1","4s":"3","5s":"9"}},"instructor_scores":[{"number":"MATH 55b","cat_num":"3312","course_id":"2844","year":"2011","term":"2","id":"80d12e5368e47ce0480832555eb3f7e0","first":"Yum-Tong","last":"Siu","InstructorOverall":"3.57","EffectiveLecturesorPresentations":"3.43","AccessibleOutsideClass":"4.23","GeneratesEnthusiasm":"3.86","FacilitatesDiscussionEncouragesParticipation":"2.20","GivesUsefulFeedback":"3.20","ReturnsAssignmentsinTimelyFashion":"3.25"}]},"Spring '11":{"course_score":{"overall":"4.22","workload":"4.78","difficulty":"4.33","recommendation":"4.33","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"2","5s":"11"},"QDifficulty":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"7","5s":"6"},"QWorkload":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"1","4s":"3","5s":"9"}},"instructor_scores":[{"number":"MATH 55b","cat_num":"3312","course_id":"2844","year":"2010","term":"2","id":"1f7da66a99112381a3867580cb405436","first":"Noam D.","last":"Elkies","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"3.67","AccessibleOutsideClass":"4.67","GeneratesEnthusiasm":"3.67","FacilitatesDiscussionEncouragesParticipation":"3.83","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '10":{"course_score":{"overall":"4.92","workload":"4.58","difficulty":"4.58","recommendation":"4.58","enrollment":"12","response rate":"100.00","QCourseOverall":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"2","5s":"11"},"QDifficulty":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"7","5s":"6"},"QWorkload":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"1","4s":"3","5s":"9"}},"instructor_scores":[{"number":"MATH 55b","cat_num":"3312","course_id":"2844","year":"2009","term":"2","id":"16bc4f605a0f5ccc7546ddfbf7d36c88","first":"Curtis T.","last":"McMullen","InstructorOverall":"4.92","EffectiveLecturesorPresentations":"4.92","AccessibleOutsideClass":"4.83","GeneratesEnthusiasm":"4.92","FacilitatesDiscussionEncouragesParticipation":"4.67","GivesUsefulFeedback":"4.83","ReturnsAssignmentsinTimelyFashion":"4.86"}]},"Spring '09":{"course_score":{"overall":"4.73","workload":"4.73","difficulty":"4.45","recommendation":"4.45","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"2","5s":"11"},"QDifficulty":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"7","5s":"6"},"QWorkload":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"1","4s":"3","5s":"9"}},"instructor_scores":[{"number":"MATH 55b","cat_num":"3312","course_id":"2844","year":"2008","term":"2","id":"16bc4f605a0f5ccc7546ddfbf7d36c88","first":"Curtis T.","last":"McMullen","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.91","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.82","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '08":{"course_score":{"overall":"3.40","workload":"4.20","difficulty":"4.40","recommendation":"4.60","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"2","5s":"11"},"QDifficulty":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"7","5s":"6"},"QWorkload":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"1","4s":"3","5s":"9"}},"instructor_scores":[{"number":"MATH 55b","cat_num":"3312","course_id":"2844","year":"2007","term":"2","id":"b8922615bd93ce02f558172c234d7543","first":"Samit","last":"Dasgupta","InstructorOverall":"3.20","EffectiveLecturesorPresentations":"3.00","AccessibleOutsideClass":"3.75","GeneratesEnthusiasm":"3.40","FacilitatesDiscussionEncouragesParticipation":"2.00","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '07":{"course_score":{"overall":"4.00","workload":"5.00","difficulty":"4.80","recommendation":"3.40","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"2","5s":"11"},"QDifficulty":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"7","5s":"6"},"QWorkload":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"1","4s":"3","5s":"9"}},"instructor_scores":[{"number":"MATH 55b","cat_num":"3312","course_id":"2844","year":"2006","term":"2","id":"fb653ee20d661589495e62c335eaa13a","first":"Dennis","last":"Gaitsgory","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.75","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.80"}]}},"comments":{"Spring '08":{"comments":["The quality of the class varies heavily with the professor who is teaching it, but nonetheless you are likely to be challenged like you never have been challenged before. It can be quite rewarding.","This class is very difficult but the rewards are totally worth it.","If you can survive it, it's a really fun experience.","It's a good, but hard, life experience - it will build character. Try to work with others - otherwise you wont survive."]},"Spring '09":{"comments":["If you are willing to put the necessary time and effort into the course, it can be very rewarding.","This will be a very rewarding experience if you're able to keep up with the reading and the work.  If you can't put in the effort, don't bother.","It is intense, but also interesting, and you will learn a lot of math.","You will meet some of your best friends at Harvard in this class. But beware: it's not going to be easy.","If you want an awesome, but also very demanding, math experience, take this course.","It's very challenging and requires a big time commitment, but is most definitely worth it (especially if McMullen is teaching it).","McMullen goes at a reasonable pace, and you're likely to learn a lot if you put in the effort. However, you will be able to get more out of the class if you already have some experience with real and complex analysis.","If you are very strong in math, give a try. But at the same time, consider math 25b if it is too hard."]},"Spring '10":{"comments":["If your are wondering whether you can handle this course, remember this: it isn't just a matter of whether you are smart enough, but of whether you are willing to put in the time. That said, being \"smart enough\" is the main requirement. If you can do it, go for it. We became a very tight-knit group of friends, and this class contributed toward making this year the best year of my life (up to this point).","Try not to be scared away the course's reputation, but also be aware the class is very hard. By the end of the year, you will be very happy with how much you have learned.","People who have taken 55a probably know whether or not they should take 55b or can, at least, figure it out on their own. As for other people, if you've found 25 unfulfilling then don't be afraid for a second to give 55b a shot. New blood is welcome and there's nothing to lose by sitting-in on a couple weeks. As for 55, in general, it's as awesome a math course as you can hope for and it can be the greatest part of your academic year if you let it.","This class is a fantastic experience if you have the time to spend on it.","This class is great! If you believe that you have the required background are ready to spent a considerable amount of time on it, this will be a very enjoyable and rewarding experience. Just shop the class and you'll see it yourself.","This class is excellent, and I strongly recommend those who can take it to do so...with some caveats to be elaborated upon below.\r\n\r\nThese are some of the strengths of the course, and why I think you should try very hard to take it:\r\n1. The material. To be honest, I'm not a fun of the Rudin stuff, but where else can you find a course that gives a ground-up development of basic real analysis and complex analysis in one semester? \r\n2. Great professor. Unfortunately for you, McMullen won't be teaching it next year, but I hear Elkies is cool too. \r\n3. Peer group. Here you'll find the most mathematically dedicated freshmen at Harvard. \r\n\r\nSome reasons to hesitate about taking the class:\r\n1. It's hard. It takes a lot of time and will detract from the other opportunities you have here.\r\n2. It goes as breakneck speed, meaning that you'll have less time to digest certain concepts. \r\n\r\nSo what's an adequate level of preparation for this course? The technical pre-reqs are pretty minimal. There's no reason you need to know multivariable calculus coming in (I certainly forgot all of mine long  before this class). Contrary to some rumors I heard at the beginning of the year, it's not saturated with IMO medalists, or even MOPpers. Most people are USAMO qualifiers, though. Maybe the best way to see if you're ready is to just look at past course pages and the textbooks."]},"Spring '12":{"comments":["Whether you take it or not should depend on how much time you are wiling to put into math, not how good you think you are at math.","This is a tough, and very algebra-heavy class. However, Professor Siu is great to have for complex analysis, and the comprehensive notes posted on the website were amazing.","If you like the subject of analysis, ignore me. But this class was an awful way of learning analysis. If you want the glory and respect earned by taking all of math 55, then by all means take this class and suffer like the rest of your peers. But if you want to learn and thoroughly understand this subject, do yourself a favor and take math 25 instead. As a message to math 55a'ers of the future: don't let your pride get in the way of dropping to 25. It's probably a better idea for your own mathematical skills.","55b was like 55a on steroids.","This was one of the biggest mathematical challenges of my life, but I definitely savored every moment of it.  I don't think I've ever learned math at this pace before, and it was a blast.  The problem sets were always interesting, and the final exam problems were really excellent.  However, if you're not willing to sit down and have part (a) of problem 1 (out of 6) on the pset eat 6+ hours of your time, I wouldn't suggest taking the course, since it'll be really stressful.","Math 55 is quite the experience. Take this class if you have a genuine love for mathematics. Do not take it for the glory alone or because you are merely capable. That is not enough to get the full benefit of the course. Further evaluation is difficult primarily because the class is very professor-dependent. Professor Siu is intense, and as a result the class was more difficult than in years previous. However, no matter who is teaching, you will learn some beautiful mathematics. This year we took a long detour into differential geometry, prior to the complex analysis aspect of the class. My only complaint: sometimes the fundamentals are glossed over, namely I do not feel I have a particularly strong grounding in real analysis. All in all, this was the best class that I have taken at Harvard. 55 solidified my decision to concentrate in mathematics, and I grew into my own mathematically. I can't think of higher praise than that.","Be prepared to work together with others to tackle problem sets.","Totally varies with teacher .  Only take it if you want it to be your first priority","If you are want (or are at least willing) to do loads of work and you like math, try to take 55. You will meet awesome people and learn awesome things from an awesome person.","The professor changes from year to year, and so the course content may change significantly. You'll  have to shop it and find out for yourself. Professor Siu's 55b was a great class. I felt it was harder than 55a but more enjoyable too.","Depends on who asked for a reccomendation","If you're prepared enough you will succeed - the course is not impossible, and you can (and will, probably) collaborate; if you're not prepared enough you can still do it but it will be painful - so think carefully.","If you're thinking about dropping, at least give it a try! The teachers WILL respond to evaluations, so the course is likely to be even better the second term.","Well, now that you're looking at 55b, odds are that you've either already finished 55a (congrats!) or you're in 25 looking to perhaps possibly take 55, so you probably have a decent feel for how the class is going to be - again though, the class varies a lot based on who teaches it, so this probably isn't going to be of much help to you. Sorry. But yeah, shop it if you're thinking of taking it! It's lots of fun. Except for if you get really behind - don't do that; the end of your semester will be... very painful. Learned from experience."]},"Spring '13":{"comments":["This course is awesome!!  You will learn a lot of really interesting math, and will have fun on the assignments.  Be sure you have a strong math background, and be prepared to spend a substantial amount of time on the homeworks.","55 is the best thing you could ever do if you are interested in math, because the rapidfire exploration of *worlds* of mathematics at a time and the fast-paced assignments will make your heart race with excitement.","This course is somewhat more difficult than Math 55a - in Analysis, it's very easy to skip over important details if you're not careful.","By all accounts, 55b was a good bit easier this year than it was in previous years - which means it was still my primary time commitment for most of the semester.  Leave time to go over the proofs in class to make sure you understand them, because it's very easy to get lost otherwise.","As with Math 55a, this class depends entirely on who is teaching it so YMMV. Also, when the class says, \"It would be unwise to take a similarly time intensive class\", it probably means that it would be unwise to take a similarly time intensive class (or three).","This course should be regarded as the essential course for students seriously considering math, with a substantial background, and I strongly recommend taking it if it is at all possible. It is a class that transforms you from a high school student to a mathematician or math enthusiast. Even though I knew a fair deal of the material coming in, I still had a fantastic time in the class, seeing the material at a deeper, more cohesive level, and I would definitely recommend taking it. For one thing, there are usually very interesting and relevant problems, which really make you understand the material. At least this year, it was a lot more relaxed than the legends suggest, and homework generally took an average of about 8 hours. This course is basically a sampler of different areas in math. We did some topology, algebra, real analysis, differentiable manifolds, algebraic topology, and sheaf theory. Of course, the social aspect of the course is incredible. If nothing else, you will get to spend many hours with some of the brightest and friendliest people, and likely make bonds that will last beyond your college experience.","While a lot of work, it is definitely worth the investment.","Math 55 with Professor Schmid was great. \r\n\r\nRelative to other courses, it is difficult, but covers a lot of interesting stuff.","Bro class. We bro it out. Yes. We math, and then we bro. Sometimes we bro and then math, but other times we math and then bro. Great opportunity to meet future bros (I'm not being sexist: bros are gender neutral, and refers not to gender but to outlook in life)","Professor Schmid covers calculus on manifolds thoroughly and rigorously and also provides great introductions to algebraic topology and sheaf theory. Definitely take this intro class if you want to learn some cool math!"]},"Spring '14":{"comments":["Gaitsgory is an awesome professor. Math 55 is an amazing class. Take it.","Math 55b was light speed; light speed in that it covered so many topics of analysis\/topology. You will not regret exploring these amazing subjects when you take this class.","If you love math, definitely take it!  Especially if Gaitsgory is teaching it!","Gaitsgory's seemed much less passionate about the material in 55b than that of 55a, and as a result the class felt less special. It was still pretty fast and we did cover a lot though, so no real complaints. We also did cover some really interesting material at the end.","Dear future math 55ers,\r\n\r\nI know you're thinking excitedly about the challenges that lie ahead, ready to join the ranks of many who have suffered before you.\r\n\r\nStop.\r\n\r\nIs this really something you want to do? Do you WANT to spend a lot of time every week doing math? If you weren't in math 55 (and had never heard of it), would you spend your whole semester thinking about how you'd rather be doing math?\r\n\r\nIf so, then you should take this class. I did fine in the class both semesters, but I found myself a lot more frustrated than I'd ever really like to be. It's hard to do this much math; don't let anyone tell you otherwise. 55b (specifically, Gaitsgory's iteration of it) is a really brutal class if you have absolutely no background in analysis. The lectures get tougher because he has no sense for what is and isn't reasonable when teaching analysis, he's still drawing commutative diagrams all over the place, and you feel like you're in a convoluted algebra class again. \r\n\r\nOf course, there are the upsides: you're going to make some of your best friends, you're going to be admired around campus and you're going to learn a lot of math, as long as you're willing to put in the work.\r\n\r\nMake sure these positives are worth it. And be ready to work your arse off.\r\n\r\nWith love,\r\nA fellow math-lover\r\n\r\nPS: If you haven't already figured this out, SC 229 is a great room to pset.","Take this course if you are really looking for a challenge. Even if you have taken college level classes at your local colleges, take this course. It tests your mathematical ability like no other course, and it provides you with a formidable understanding of the material - non-55ers will look at you in wonder as you walk calmly through your future math classes. The material is exciting and very important for your mathematical understanding.","Like 55a, this class is very time-consuming and will likely take over your life. It is slightly easier than 55a, as the problem sets generally only take 25 hours per week as opposed to 35 hours for 55a, but there were still some weeks where the problem sets took 55 hours. The exams also generally take up nearly their entire alloted periods of 24 and 48 hours. Like 55a, though, there are ample bonus problems so you can focus more on learning the material rather than worrying about your grade. It is definitely worth it, though, for you will understand all of calculus I, II, and III far deeper than you ever thought possible, from a rigorous derivation of the power, chain, and product rules, to the definition of the dx that appears in integrals to a deeper understanding of Maxwell's equations. You also learn complex analysis and topology. Definitely take this class, it is worth the time commitment.","Once 55a seasoned you, it's not terrible. However, analysis has its moments where everything just seems contrived and incredibly counterintuitive, so stay cautioned, but you end up learning so much math and it's just such a great feeling.","Have fun!"]}},"mostRecentQ":{"overall":"4.80","workload":"4.60","difficulty":"4.50","recommendation":"4.80","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"2","5s":"11"},"QDifficulty":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"0","4s":"7","5s":"6"},"QWorkload":{"number":"MATH 55b","course_id":"2844","cat_num":"3312","1s":"0","2s":"0","3s":"1","4s":"3","5s":"9"}},"success":true}