{"scores":{"Fall '14":{"course_score":{"overall":"4.40","workload":"5.30","difficulty":null,"recommendation":"4.50","enrollment":"22","response rate":"77.27","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Spring '14":{"course_score":{"overall":"4.10","workload":"2.50","difficulty":"3.50","recommendation":"4.20","enrollment":"55","response rate":"78.18","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.30","workload":"2.40","difficulty":"3.40","recommendation":"4.30","enrollment":"22","response rate":"95.45","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Spring '13":{"course_score":{"overall":"4.14","workload":"2.39","difficulty":"3.29","recommendation":"4.25","enrollment":"56","response rate":"91.07","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.32","workload":"2.39","difficulty":"3.22","recommendation":"4.43","enrollment":"24","response rate":"95.83","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Spring '12":{"course_score":{"overall":"4.25","workload":"2.39","difficulty":"3.17","recommendation":"4.19","enrollment":"39","response rate":"92.31","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 971","cat_num":"3498","course_id":"4235","year":"2011","term":"2","id":"7af0855d882f693323e8744559fcf366","first":"Carlo","last":"Cerruti","InstructorOverall":"4.18","EffectiveLecturesorPresentations":"4.09","AccessibleOutsideClass":"4.36","GeneratesEnthusiasm":"4.45","FacilitatesDiscussionEncouragesParticipation":"4.36","GivesUsefulFeedback":"4.09","ReturnsAssignmentsinTimelyFashion":"2.91"}]},"Fall '11":{"course_score":{"overall":"3.81","workload":"2.70","difficulty":"3.19","recommendation":"3.96","enrollment":"30","response rate":"93.33","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Spring '11":{"course_score":{"overall":"4.31","workload":"2.41","difficulty":"3.13","recommendation":"4.32","enrollment":"44","response rate":"88.64","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 971","cat_num":"3498","course_id":"4235","year":"2010","term":"2","id":"7af0855d882f693323e8744559fcf366","first":"Carlo","last":"Cerruti","InstructorOverall":"4.86","EffectiveLecturesorPresentations":"4.86","AccessibleOutsideClass":"4.71","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"4.67"}]},"Fall '10":{"course_score":{"overall":"4.31","workload":"2.26","difficulty":"3.09","recommendation":"4.42","enrollment":"39","response rate":"89.74","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 971","cat_num":"3498","course_id":"4235","year":"2010","term":"1","id":"7af0855d882f693323e8744559fcf366","first":"Carlo","last":"Cerruti","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.75","AccessibleOutsideClass":"4.86","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.86","GivesUsefulFeedback":"4.71","ReturnsAssignmentsinTimelyFashion":"3.71"}]},"Spring '10":{"course_score":{"overall":"4.68","workload":"2.25","difficulty":"3.14","recommendation":"4.46","enrollment":"40","response rate":"70.00","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Fall '09":{"course_score":{"overall":"4.15","workload":"2.46","difficulty":"3.39","recommendation":"4.50","enrollment":"31","response rate":"90.32","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Spring '09":{"course_score":{"overall":"4.67","workload":"2.62","difficulty":"3.21","recommendation":"4.54","enrollment":"43","response rate":"93.02","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Fall '08":{"course_score":{"overall":"4.63","workload":"2.32","difficulty":"3.16","recommendation":"4.63","enrollment":"31","response rate":"61.29","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Spring '08":{"course_score":{"overall":"3.00","workload":"2.44","difficulty":"3.62","recommendation":"3.25","enrollment":"36","response rate":"44.44","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Fall '07":{"course_score":{"overall":"4.00","workload":"2.47","difficulty":"3.33","recommendation":"4.13","enrollment":"28","response rate":"53.57","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}},"Spring '07":{"course_score":{"overall":"4.08","workload":"2.50","difficulty":"3.17","recommendation":"4.08","enrollment":"15","response rate":"86.67","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Fall '07":{"comments":["That it is challenging, but interesting and necessary if you want to concentrate in psych","As long as you keep up with the readings and come to class ready to participate (which isn't nearly as difficult to do as in other classes), I think that the class would be rewarding for anyone who has an interest in psychology (which, assumedly one does if taking the tutorial).","It's really intensive. Prepare yourself mentally and emotionally.","really amazing way to get a great understanding of the field of psychology in a fun format that encourages you to learn, participate, do all the reading, etc.","This tutorial was great because you cover a variety of interesting areas of psychology, the workload is relatively light, sections are usually small but large enough that you become close with your peers, and the final research paper requirement is rather easy to complete because your instructor basically walks you through each step of writing the paper.","It's an interesting and fun course.","It's a nice introduction to small discussion classes, where you feel like you really contirbute something to class","Make sure you are in Sarah St Germain's class","Think about your paper topics early on in the year"]},"Spring '09":{"comments":["Nathan is a great section leader","tutorial is not the nightmare that it is made out to be. you will become very close with your classmates and will learn how to read, write, and think like a psychologist.","Well, as a psychology concentrator you have to take it. But take it with Jeff.","well, you've got to take it. but it doesnt have to be that bear of a course that you struggle through. if you like your concentration, you'll like the tutorial, because all of the hard work is totally worth it. make the most of it. really put time into the final paper and get to know your tutor really well.","The more effort you put into this class the more you will get back.","Our final essay was broken down really well and ended up being mostly painless. I felt really satisfied with the final product, not rushed or overwhelmed.","Depending on the instructor the course could be a really good experience.","That if the sections are divided into different TFs and each one teaches different topics, Sarah's topics are good ones!","Loved it!","Interesting class; how the paper is spaced out throughout the semester is really a blessing","this course is an intense sophomore tutorial for psych concentrators and really gets the students to understand how to think and write like a psychologist. this course will be very helpful for my future work in psychology.","The instructor makes or breaks this course... (I thought that my instructor was great.)","This course is amazing and you will get as much out of it as you are willing to put into it. Dedicate a significant amount of time to throughly completing all of the assigned readings. They are all carefully chosen, and you will learn about so many interesting concepts and studies in Psychology. Participate in class and take advantage of the opportunity to learn from your fellow classmates. Most importantly, have fun and enjoy it!","i can't speak for tutorial in general, but sarah's class is great.","If you like psychology, you will really love this course. It's interesting and fun.","really solidified my interest in psychology and helped me figure out more specifically what i want to study","It is a lot of work, but it's a great class.","This course teaches you about time-management for papers as well as psychology","There's a lot of reading and writing - although it may seem excessive, you can work with your tutorial leader to make it manageable."]},"Fall '09":{"comments":["excellent class that requires you to work hard but is worth it in the end","Engaging with the class is what makes it interesting. This is what generates the discussions that help you learn and truly explore the different topics in psychology","great course! highly recommend it!","you learn what you like about psychology and what you don't like.  you learn how to research and whether or not you want to pursue more research.","a lot of writing but the process is broken down to make it simpler","You will learn the skills necessary for success in Psychology.","This is a great tutorial and introduces you to a range of topics. One of the best classes ever. Classes are discussion based and will provide you a great seminar style experience.","It is extremely helpful.  I feel much more prepared to write anything for psychology.","A good way to get used to the format of psychological literature and to think and write critically about it.","You will learn how to write a good paper but you will not necessarily enjoy the process","really fun, the small class size is a huge plus!","It is a lot of work, but the work you do you can always be proud of. The topics are wonderful, and you really get to know the material. It might be a good idea to take this course along with a couple easier classes, simply because it feels better to have more time to put into this course. It never felt stressful though, because there is always clear instruction and feedback. You always know what is expected, its you're choice how much you will do. The personal contact with instructor is really great too.","Although this course has a decent amount of reading and analysis it is beneficial for writing in psychology and I wish I had taken it early in my career here."]},"Spring '10":{"comments":["Make sure you have a well-formed idea about what you want your essay to be on.","it's required but it's actually really interesting. not as much work as they say it is. helpful in learning how to write like a psychologist.","It is a great chance to look deeper into psychology and get a feel for what many of the people involved in the feel do in terms of research.","If Bethany's ever teaching here again, cross your fingers that you get her! She made this my best class at Harvard.","If you like psychology, its a great course. If you don't enjoy reading psych studies, you won't like it.","My tutorial was amazing!  Tutorials get a bad rep, but if you go in with an open mind you'll learn a lot!","I loved this course, and I was really glad to have the chance to read primary research literature, and discuss things like research methodology that has not been explored very much in my intro psych courses.\r\n\r\nThis course is so well organized that you will probably end up writing a terrific final paper painlessly over the course of a semester.","it definitely gets you to broaden your interest in psychology","keep up with the readings!","This class was my favorite this year. I actually feel like I learned a lot and improved tremendously in my writing and critical thinking skills. The articles were very interesting and I've come away from the class with a lot of knowledge about a variety of psychological topics without realizing that I was learning them (as the focus was on the analytical process, rather than the content). The workload is pretty light (until you get into the sophomore essay-writing process) which makes it a non-stressful way to learn. This class made me consider going into psychology for graduate school (and believe me, I am NOT the type to try to give myself more work than is asked of me).","This is the best class you can take!","My sense is that one's experience in PSY 971 is highly dependent on which tutorial leader one receives and whether that tutor's interests are similar to the students' within psychology.","This course will require you to put in a fair amount of work each week but it all pays off. You will come away a much better thinker not just in psychology but overall.","I heard a lot of people complain about the workload in this class and the class overall, but this was one of the best classes I have taken here in my two years at Harvard. The discussion component was great because I was able to express my opinion and got to know the other students in the class. The assignments were challenging in the beginning, but they built in difficulty and buy the end, I definitely thought I had strengthened my skills to think like a psychologist."]},"Fall '10":{"comments":["The readings can be dense, but they are always interesting.","It was a very well taught class. Really good discussion depending on your section. DO YOUR READING! Or else you won't be able to participate.","It can be annoying at times (think expos for psych concentrators), but it's great to be able to discuss psych research with fellow concentrators!","I loved it! It is a very small class size (7-8 people) and the topics range from social psychology to mental disorders and so on. It really gives you a comprehensive look at psychology in general and how to best understand psychological research and studies. People always told me it would be challenging but worthwhile and I agree 100% with this advice. It is challenging enough so that you are pushed to really dig into psychology texts, but it is still engaging and seminar based which allows you to learn from your peers as well as your TF. I definitely recommend it!!","Tutorial was awesome.  You get what you put in, and there is a lot to learn.  Lauren Conoscenti is fantastic!  Very nice, knowledgeable, helpful, and enthusiastic.","It is a very interesting class and there is not much out of class work.","If it is possible to take this course with SHL, DO it. Fantastic experience.","If you have a good instructor, this course is fantastic!! I loved Lauren Conoscenti! Hope you get her :). I had a lot of fun discussions with my class this semester and wrote a very fulfilling final paper","It was a great course, I learned an incredible amount of useful information!","The readings and discussion are great. There is a steady stream of assignments, which can be tough to juggle with other classes and other due dates.","You have to get through it, kids","It's a great course; a lot of fun having discussions with your classmates every week. Crossing your fingers for Lauren -- she's great!","I think your experience in this class depends a lot upon who you get as your tutorial leader, and luckily Stephanie was fantastic! She was nice, understanding, and personable; and chose very interesting articles for us to read, which I hear varies a lot from teacher to teacher. The class is a lot of work, particularly when the sophomore essay rolls around, but it is worth it. You feel like you can tackle any psych article or research proposal by the end of the semester, though it does take up a lot of time.","A class that teaches you how to read and write like a psychologist.","You will really learn how to think, read, and write like a psychologist.","make sure you do the readings and stay on top of the assignments","It is tough work but it is definitely worth it. One will feel much more comfortable with writing in psychology at the end.","It's a sophomore tutorial.","This class was great and solidified my interest in the field of psychology.  I didn't think I could enjoy sitting around for two hours (from 8-10pm!) and talking about readings (which aren't too long by the way), but I definitely enjoyed it a lot","this is a great course!","So, so, so good!  Lauren is awesome and great at facilitating discussions.  The small class size makes it so interesting and I learned a great deal.  Make sure you do the readings because (besides your grade) they definitely make the class worthwhile (you won't have anything to talk about without them!).  They're often really interesting, so it's not tedious to read them at all.  Looked forward to this every week!","This is a requirement, but I think I got a lot out of it. It was well-structured and well-taught, and I think my writing improved a great deal over the course of the semester."]},"Spring '11":{"comments":["Time-consuming, but worth it.","This class is awesome! You will put a lot of work into your papers, but you will be able to see concrete improvements in your writing and thinking throughout the semester. I feel prepared to take upper level psych courses. Also, Carlo is the best tutorial teacher!","I suppose the quality depends on the tutorial leader, but for us, Carlo was amazing. Definitely one of the best classes I've taken. More than perhaps all of my classes, this tutorial seemed genuinely designed to help students become better writers and thinkers, given the extensive feedback and draft-writing system. The course is a requirement, but nonetheless very enjoyable.","It's a pretty worthless class. It's not too hard though and you have to take it. Oh well.","TALK TALK TALK TALK TALK to your tutor while writing the final paper.  Email them incessantly if you have to.  The course is great and challenging but that final paper is tough and you need to be on top of it throughout the entire process from brainstorming to final draft.  Like I said, keep in touch with your tutor, go the writing center...use every resource available to you because this paper will test you.","This class is not particularly difficult but has a lot of \"busy work.\" But it is a lot of fun and provides a great opportunity to discuss psychology with your peers.","Doing the readings and coming to class prepared is important so that you can participate in discussion. Always write with your thesis in mind. Be concise and clear. Question whether or not the methods of a study actually test the construct.","Not as hard as tutorials are made out to be.  The readings are pretty light and mostly interesting.  Writing the paper is made much more managable by completing it chunks to which you receive plenty of feedback before turning in your final draft.","Tough but interesting. Be prepared to discuss the readings thoroughly in class. The final paper takes tons of research so don't leave that for the last minute. This class helped me better understand what I was learning in social psych.","This is a tough course, and it may seems dry if you only focus on the reading and writing -- discussion is where this class comes alive, so ENGAGE!  Get to know your TF and fellow students, and this class will become a favorite.  Also, if you spend time thinking about the readings (i.e. in relation to your life, in the context of the other readings, coming up with your own ideas) the class will become ten times more interesting","If you are interested in any way in writing for psychology, this is the class for you.  Make sure that you have a definite interest in psychology, though, or else writing a 15 page psychology paper will not be pleasant.","This class provides a good survey of some of the main topics of study in experimental psychology currently. Because of the small size you get to know the TF and students, are forced to speak up in class, and will participate in some really interesting discussions. Through the process of writing your sophomore essay, you will become an expert on your topic and learn more about writing in psychology. Because of the varied backgrounds of students, the class can seem basic at times, but the workload is still significant.","If you get a great tutorial leader, this is an awesome class.  Lots of really interesting discussion, and you write your sophomore essay about whatever you want, so its not as bad as it seems at first because you're (hopefully) interested in your topic.","make sure you are interested in various subject matter","You're very lucky if your TF is Adrian!","Your experience totally depends on your TF. I got superrrr lucky so I loved this class. It is satisfying to write such a (relatively) long paper in a completely new style.","It's not as scary as you think!  Class can be really enjoyable.","This was an extremely helpful sophomore tutorial that clearly prepared me in terms of writing and thinking like a psychologist. You also get an excellent overview of many different fields of research within the discipline."]},"Fall '11":{"comments":["The two hour discussion was content based from the weekly readings. The only time I feel like I improved my writing was when papers were returned very harshly graded. Then, I could correct those mistakes or requirements and receive a similarly harsh grade on the next paper. I do not feel any more confident in my ability to write for psychology.","Be ready for a lot of hard rewarding work","This class isn't too hard. For pysc concentrators you learn a lot about writing and background of psychology. Pick a good topic for final paper and your life will be alot easier.","do the readings, be prepared for class","Do it if you want to concentrate in psych. Otherwise, skip","Make sure you like your section leader","This class really does aid in the understanding of literature in the field of psychology. Even though it's a requirement, this class should not be seen as a burden.","This is a good course that is structured well and opened me to think about a lot of relevant and interesting themes and topics within psychology. I am very glad I took it, but if I could do it again I would make sure not to take it with Larisa Heiphetz. Her personal style is too detached and she was an overly strict and very discouraging tutor. This is a shame because I know I could have enjoyed the course so much more had I taken it with someone who is more concerned with the interpersonal communication with their students. Larisa was too concerned with being detached, strict, and as a result was extremely unpleasant.","Arnold is awesome! My favorite class at Harvard so far","While some others claim the tutorial to be a lot of work, I find the workload to be fair and the assignments interesting. The one-on-one meetings with Talee have been particularly helpful for constructing arguments and refining my writing.","That this class is absolutely amazing!  I learned so much about critique and research.  It's a really special opportunity when one can sit in a very small class and discuss in an open environment, and this class gives you that opportunity and a lot more.  Make sure you are committed to Psychology though!","A lot of work, but discussions can be really interesting, and the sections are really small. You can literally pick whatever topic in psychology interests you for the final paper, which is great. Start researching potential topics early, because the essay assignments start earlier than you would think.","This class is really difficult, but rewarding.  My advice: become friends with the people in your class and make sure the atmosphere is friendly and welcoming.  It makes for a very enjoyable, engaging class experience.  In addition, try your best, and take the criticism well...there's ALWAYS room for improvement.  :P","Take the class if you're ready to read and write like a psychologist. If you're lucky you'll develop great relationships with the students and the Tutor, and you'll learn a lot.","While the material presented in this course was informative, the teaching was very poor. There were no clear expectations given at the beginning of the course, and as a result, it was not as rewarding an experience as I had anticipated this tutorial to be. Don't take this tutorial unless you're very certain you want to concentrate in Psychology in the Fall of your sophomore year.","Psychology tutorial was a great introduction to reading and thinking more critically about psychological articles.  Your section leader makes a big difference in your enjoyment of the course (Arnold Ho was great and very patient with us). I really appreciated the design of the assignments, which encompassed critical reading exercises, short response papers, and a 15-page sophomore essay that had proposal, outline, and draft phases.  The structure of this last assignment definitely helps one spread out his\/her time and really develop an interesting topic to discuss in his\/her paper.  You will also have the chance to discuss multiple sub-fields of psychology, as it is geared to present diverse topics and even introduce some interesting statistical methods (Stats background not required).  This was a fantastic class and a wonderful dive into incredible group discussions."]},"Spring '12":{"comments":["You have to put in effort to actually see improvement in your understanding of the material.","I learned so much!! It was very challenging, but I improved a lot throughout the semester. Great class.","If you're interested in Psychology and willing to do a good amount of reading and writing, you'll like this course.","The tutorial depends heavily upon who you get as your sophomore tutor. It can be great, but can also be pointless, depending on how your class is structured and taught. It does help improve your writing abilities though, which is important. The 15 page research paper at the end isn't too daunting, since the course spaces out drafts at periodic intervals, which is helpful.","I loved tutorial!","It is hard but rewarding. There is a lot of work, a lot more than you expect, and it can be very frustrating to figure out what they want from you. But then when you finally figure it out, you feel like you've actually learned something that will help you for the rest of college.","This class will make you so excited to be a psych concentrator! A wonderful two hours per week, geeking out about really interesting research. You'll get to know the other students in your section quite well. In tutorial, you'll learn how to think, read, and write for the field of psychology, by doing it rather than by being instructed how to do it. You may be a bit confused as to some of the assignments at first, but you'll soon see how much you're developing the thought process of psychology.","This class is great because it really gets you to work hard on an essay and the feedback you get really improves your ability to right effective psychology research essays.","Be proactive with the Sophomore Essay. Meet with your tutorial leader whenever you want, or email, but get the answers you need early. No need to read the papers super thoroughly each week - use your time wisely. To that end, don't stress about the short papers, but do work hard on them to develop skills for the Sophomore Essay.","Somewhat difficult but one's writing does improve. Overall, worth the effort!","This a great opportunity to branch out and learn about many different fields of psychology.  It also provides you with a chance to do your own research and write about a topic that interests you greatly.","This is by far my favorite class that I have taken at Harvard and Don is a phenomenal section leader. For me, this class was a lot of work (especially the sophmore paper component), however the material was extremely interesting and discussions were always great and you get close with your classmates.","I really enjoyed the tutorial.  The topics were very interesting and the discussions were intimate.  It gives you a glimpse into a bunch of different areas in psychology.","This is a hard class. Stay up with the reading and writing.","This class is the best introductory seminar based psychology class you can take! The class covers a broad range of topics and the class is set up so that everyone is encouraged to participate and actively engage in the class readings and assignments.","Carlo is one of the best instructors I've ever had, and this class will blow your mind. The class gives you plenty of opportunities to explore the areas of psychology that you are most interested in, and to improve the way you think and write. I learned a lot about findings from psychological science, methodology, and writing.","Just hope you get a good tutor. That really determines your experience. I could see this class being amazingly insightful with a good leader. Unfortunately, mine was not.","Get ready to put an effort into your writing","Personally, this is one of the best classes I have taken here. The setting allows you to learn so much, not only from your tutorial leader, but also from your peers. You get to read tons of interesting articles, and participate in a lot of great discussions. Also, Jordan's the cooles tutorial leader.","Its awesome!","it's an awesome class. don is a great tf. i've talked to other students, and in general, most of the tf's are good. i've only heard of one person who didn't like her tf. if you put the time into class, you'll get so much out of it! take the paper seriously. and really try to do your best each time. it makes the final stage much less stressful.","Very interesting material, workload's not too bad. Start the essay before they tell you too, though.","Absolutely take this class with Don.  I learned so much and we had such a tight section.  He really cares about you learning and growing over just giving you grades.  This is so rare in teachers here--he's really amazing.","The way you think about psychology as a science will change forever.","Overall, great introduction to writing for psychology. Get Carlo as a TF if you can. He's very critical, but your writing will improve drastically under him."]},"Fall '12":{"comments":["Amazing course. Depending on your TF, this can be an incredibly formative course in terms of how you write and evaluate research papers. You also just read about some really cool phenomena in psychology. If you get Nancy Lau, you're in for a total treat. It's a hard class - they grade pretty harshly, and the workload is pretty intense. But it's well worth it.","Adena is incredible. She is so thoughtful in all of her feedback and takes so much time to make sure you have the best experience possible. I feel completely ready to take on advanced courses!","This class is amazing. It is hard from time to time, but I am so proud of the work I produced in this class. Every time we met, it felt like my interest in psychology was rekindled for a different reason. And the sophomore paper, if your tutor breaks it down as mine did, was easy to handle and even enjoyable.","Really interesting and thought provoking discussions but be ready to write and rewrite a lot for your sophomore essay","This class is engaging and interesting and will allow you to explore the field of psychology in a different way than you will in other psych courses.","you have pretty much no work except for the last month when you have to write your final paper.","Don't let the Sophomore Essay scare you! It seems daunting at first but the process is broken up so well and assistance is available at every single step from initial ideas to the final product. When your done you will feel extremely proud of the piece you've worked so hard on for half the semester","This class was great! The readings in my section were phenomenal, and Nancy was always well-prepared and was very knowledgeable about psych in general. She gives excellent feedback on assignments and I really saw myself grow (as a psychologist) over the course of the semester. Discussions were enjoyable and I loved the atmosphere. The sophomore essay is difficult, but it's worth it (and you have to do it if you're a concentrator) and you'll grow a ton as a writer.","It's really hard but fun.","Great class. Tutorial is about helping you move from someone who's consumed the information to have a basic broad understanding of psychology into someone who can actively be involved in interpreting and being involved in the field... I really enjoyed it. You do a decent amount of writing and reading papers, but it's not too much work; the sophomore paper, which is the focus of the second half of the semester, is very dependent on how much work you want to put into it. Also Donal is really chill.","Take Donal's section. He's great and you would love it!","Really a fun and inspiring course. I was nervous about tutorial before as I've heard bad things from friends, but this ended up being my favorite course I've taken at Harvard! I really developed a love for psychology and learned a ton.","This is a wonderful class! Before I took this class, I was very worried that it would be really hard and indeed all the seniors I talked to admitted that it was hard, but they also said that it was one of their best classes at Harvard. The first half of the course is rather relaxing, and just takes about two hours a week. But when it comes to the sophomore essay, the workload really depends on your topic and your passion for the topic. I personally enjoy writing my sophomore essay a lot because I found a topic I am really interested in and my tutor did a WONDERFUL job in helping me construct my paper. Overall, if you got Donal Cahill as your tutor, even if your class is from 8 to 10 on a Wednesday evening, JUST GO! Don't complain and you will never regret!!!","the class is required for psych concentrators but you will come out of it more prepared to tackle psych papers and research articles for other classes.  Also your writing skills will become more refined because you edit the soph paper a number of times and get very thorough feedback on each draft","Your experience in this course probably depends on your section leader. That said, Adena was AMAZING. I am leaving this course with a much better understanding of psychology reading and writing. The readings in this course are interesting and varied, and the process for completing the sophomore essay is actually conducive to improving your writing.","I was able to learn a lot about the field I am probably going to be concentrating in before deciding on it.\r\nYou will learn a lot and improve your writing if you actively ask for help.","Donal was absolutely wonderful as was the course as a whole! I thoroughly enjoyed every class period. The class discussions were beneficial and natural and Donal was very helpful in writing the final essay."]},"Spring '13":{"comments":["Coming into this class I thought it was going to be really hard, but it turned out to be one of my favorite classes. You really start to understand how psychology is studied, and how to write like a scientist (which contrary to popular belief is not as dull as it sounds!). As long as you stay on top of the readings, and space your writing assignments out, this class is not that hard, and it turns out to be really really enjoyable.","This course is a lot of work but absolutely worth it.","Very useful for psychology concentrators, specially if you're interested in research\/ getting published. You learn a lot about how to write psychology papers\/ journal expectations, and you get to dabble in a variety of topics.","take discussion comments seriously","It is difficult but very rewarding.","This has been my favorite class at Harvard. I wasn't totally sure if I had made the right decision in choosing Psychology as a concentration, but after taking this course, I not only felt equipped with the skills necessary to tackle research articles and my own independent research but also was reaffirmed that the department is wonderful overall. It was wonderful being in such a small group and having the chance to do a lot of discussion of articles because all of the other psych classes I've taken have been larger lectures.","A lot of work, but very rewarding!","It's tutorial - so you have to take it. But hopefully your section will be as lively and involved as mine was. Our group got along great and it really added to the experience. They break up the sophomore essay brilliantly so it doesn't feel like as much work as it ends up being because it's so spread out. Don't be afraid of being critical of the readings - if you don't buy what's being concluded - say something.","Sarah Hope is an amazing teacher! Best class ever!","My psych tutorial was pretty good. It was definitely helpful in learning to read and interpret psych studies and write in APA format. I think students would benefit from having taken a few different psych classes and a statistics class before this one. This helps for choosing a topic and understanding the psych papers.","This is a great class! Totally manageable if you stay on top of your sophomore essay drafts. Also, Sarah Hope is an INCREDIBLE tutorial leader -- she will change the way you write, and is just an awesome person all around!","This class is amazing! Especially if you have Jennifer Drake! She's absolutely amazing... Way worth the effort","Get Sarah Hope. She is absolutely amazing! Also, writing a 15 page paper in smaller increments will do wonders for your writings - take advantage of the feedback.","This tutorial is absolutely fantastic. The readings were varied and interesting and the assignments were all purposeful and clearly articulated. This course will really teach you how to think and write in psychology. By far the strongest component of this tutorial was Sarah Hope, who is a wonderful teacher. She is fair, clear, and just a really gifted tutorial leader. For those of you who get Sarah Hope in the future, you are in for a real treat.","This course was very interesting and exciting.  The material was never dull and always generated great discussion within section.","It's a very nice class. It's a requirement, but even if it wasn't one, I would still take it.","Overall, this tutorial was a good foundation course for the Psych concentration, exposing you to many diverse readings and topics available through psychology.  Plus, the small class size makes for good discussion and also a comfort that comes with knowing everyone and the tutorial leader on a more personal level.","very rewarding, and is very interesting due to the variation in material on a weekly basis","This class is great because it focuses on skills you would need as a psychologist. The focus is not so much on topics in psychology but more on reading research articles, talking and writing about psychology. Writing the sophomore essay was hard, but it was definitely a great experience.","This is an intensive psychology reading and writing course. It does depend on who your professor is. However, it is a good course, but it does require a lot of outside class work.","Tutorial is a great way to learn about different areas of psychology in more depth.  Each tutorial is different, so I think your experience will vary depending on your leader and group.  I learned a lot from the ability to be in a small group and have open discussions.","This is a great course that meets in a small group setting and can challenge you, but honestly does so in a way that makes you feel ready to take on a psych concentration with a new understanding and skill set you develop throughout the semester. Don't be scared by what anyone says, this is not a super hard course, and if you have an awesome tutor (like Arin) this will be one of your favorite psych courses in your first two years at Harvard!","This class will REALLY strengthen your skills in reading, analyzing, and writing about scientific articles. And you get to design your own study at the end, which is super fun!","You learn so much about how to write for Psychology, and the Sophomore Essay writing process is so rewarding!","To be honest, I was dreading about tutorial before it started, but it became one of my favorite classes towards the end. Sarah Hope is so awesome!! This class definitely gave me an idea of what psych writing is like and whether I'd want to write a thesis or not.","Yes, this class, is not a walk in the park. There is a lot of work, but its a process thast involves a lot of feedback and help. You are not going to fail if you put in work, in fact you'll probably do really well. But if you walk in thinking you know everything youre definitely in for a suprise and probably wont do too well.","Tutorial is an engaging experience largely through paper-writing and peer feedback. This is one of the few times where you will turn in 3 or 4 revisions of a paper and amaze yourself by how much you are able to improve one work. This course is not time intensive, but is equally not highly academically rigorous. However, this is highly dependent upon your particular T.F.\/section.","For being a required class of psychology concentrators, it is actually interesting and quite painless. It will really help you learn how to critically read psychology studies and successfully write your own.","This class is challenging but extremely rewarding for psychology concentrators. Through the course, you will learn how to effectively and confidently write a solid psychology paper, which is invaluable to the rest of your psych career at Harvard. The readings are mostly really interesting and while class discussion is sometimes forced over 2 hours, it is overall a good course.","Experience in the class hugely depends on your section leader. Jordan was great!","Good class. Helps you to separate yourself from those who take psych classes and being an actual concentrator."]},"Fall '13":{"comments":["This class may seem intimidating, but it does a FANTASTIC job of breaking down the overwhelming process of writing the sophomore essay. You really do learn how to read and write like a psychologist, which is the goal of the course. Plus, the readings are so interesting and the discussions during section are amazing. Loved this course, and you get to know your professor and other peers really well!","This course is required for all psych concentrators. Luckily, it was extremely enjoyable, and I actually took away a lot about how to write for psychology and how to structure my thinking about other researchers' papers. The sophomore essay seems daunting at first, but it is broken down into so many steps that it's manageable. If you have Paul as your TF, he gives amazing feedback and creates a great class environment. Generally the workload isn't too bad.","While there is alot of work, it is very worth it, and it was a great learning experience","Considering that it's a required course, it's actually very well organized, well taught, and pretty engaging and interesting. It would do you well (both grade-wise, but also just to get the most out of the class) to keep up with the readings and to put effort into the assignments. The class is small and is very much discussion-based, so come to each class prepared and armed with questions, comments, and thoughts. Don't worry too much about the workload--it is certainly notable, but manageable if you handle your time wisely and keep up with the deadlines and schedules set in place.","There is a lot of reading, but if you have any questions be sure to ask the TF because they are more than willing to help you understand the material.  The class is designed to teach you skills as clearly as possible.","Be prepared to work to revise your writing.  You a learn a lot about psychological studies and how they are framed.","This was my favorite psychology courses I've taken so far as well as one of my favorites overall. The intense discussions in a small group setting are fantastic (as long as you carefully do the readings) and very informative. You receive a lot of assistance on writing your paper and it's much less daunting than it first seems. I would strongly recommend this course to anyone interested even remotely in psychology.","Obviously, this class is necessary if you want to concentrate in psychology. The workload is very intense, but in the end, everyone improves a lot in their writing.","The class was very interesting and engaging, and greatly helps you prepare to enter the field of psychology.","You should be interested in research or at least know that that is what this course is really focused on.","You'll get a lot of practice with writing about, doing research on, and discussing psychology. Really put time and thought into the assigned readings, or else class discussions will just feel like a huge waste of your time. \r\nThis class has a pretty substantial work load, but none of it is particularly difficult.","It is an interesting introduction to psychological writing. The readings are all very interesting and the workload is manageable because the sophomore essay is written in steps."]},"Spring '14":{"comments":["Sophomore Tutorial was the best class I have taken so far at Harvard. It was a LOT of work, but I felt that the sophomore essay was worth every hour spent writing or researching. I wish I had had more time to devote to the class, but overall I felt that it was a great experience.","As a requirement, it's relatively painless, though not a class that I would have taken otherwise. Because it primarily works on soft skills like analyzing articles and synthesizing research coherently in a paper, you won't walk away with very much if you've already taken an upper level psych class, although it is interesting to read about a different area of research every week. One of the best-designed aspects of this class is that they make you hand in parts of your essay all through the semester: take those assignments seriously. If you put in time and thought into your outline and your first drafts, you will save yourself a lot of stress come reading period.","WOOOOO PSYCH TUTORIAL!","This is a really great class (although I'm sure this statement depends on your TF!) You get to explore a variety of psychological concepts and almost everything you do helps prepare you for your 15-page paper (which doesn't actually seem all that scary once you've gone through a 2,8, and 15-page draft!)","Well, it's required, so whether or not I recommend it to someone doesn't matter. This course has the potential to be a lot better. We should have to choose topics, or at least broad areas, early in the semester, like in the first 3 weeks. Then the assignments should be directly related to the topic. The intro and drafts should be spread out farther throughout the semester, so there's more space in between each.The intro should be due sooner, like week 4 or 5, and then space everything out by then. Maybe not put the assignments in huge chunks like the 8 page draft, which was a huge jump from the intro that was due the week before the draft was due. Your experience will largely be dependent on your TF.","Not necessarily the timesuck it's made out to be. Writing the Sophomore Essay can actually be fun if you find a topic you're really interested in.","A really great survey into psychology and into the mind of a psychologist.","It is an excellent course but be prepared to work hard.","The class is totally manageable if you do the work in advance.","Very rewarding class despite the initial crunch of studying and reading","The tutorial is a very intensive course that requires a lot of work. You will have weekly writing assignments and are asked to submit discussion comments of readings. If you put in a lot of work you will clearly see how your writing changes tremendously over the course of the semester. Dianne is an amazing tutor and make sure to meet her outside of class if you have questions on assignments or psychology in general. \r\n\r\nhuge improvement Dianne","Can't imagine anyone taking this course as an elective, so if you're a psychology concentrator, just know that it will be time-consuming towards the end and may not be the most fun\/interesting psych course you ever take, but you have to do it anyways. On the bright side, it's not difficult to do well in this course.","this class is very rewarding but also challenging","It's a lot of work but it definitely improved my psychology writing skills. It also helped me feel comfortable reading scholarly psych studies.","It is a concentration requirement, but if you put in the work you will do well.","It requires a lot of time, but it is worth it. You learn how to read like a psychologist, and the sophomore paper definitely is a huge thing, but you feel proud of yourself when you complete it","Sara is a teacher that strongly believes in every single one of her students. She never gives up, and is determined to see us all succeed, even if sometimes we may not believe in ourselves, she always believes in us. At one point this semester, I felt so challenged I feared that I would not make it over the hill and pass in the paper. But Sara's strong critique and incredibly motivational words to me inspired me to do the absolute best I could, and with a burst of energy, reach it to the top.","Although the class might start off slow and feel like busy work, after two weeks it definitely picks up. The discussions were the highlight of the class - it was great being able to build off each other's thoughts and opinions, and to be able to see the possible real life application of study results. This class allows you to take all the study results and psychological phenomena you learned in foundational courses and begin to look for deeper meaning and applications. The paper can be a bit of a struggle, but it's a great learning experience in terms of writing a real literature review, and might help with deciding whether or not to write a thesis.","This class was really great. It did not take up too much time and had a relaxed vibe but was still effective and I learned a lot.","If you have Sara Masland as a TF, you will have an amazing learning experience that will strengthen your critical thinking and writing abilities in future psychology and other research-based courses. She is an exceptionally wonderful resource and teacher, and is also very supportive and kind.  She provides detailed feedback on writing assignments, and it is obvious that she cares about her students, and their learning.  Additionally, her class is well-organized, and she facilitates really thought-provoking discussions. Sara also challenged me to grow as a writer, and I learned a lot from editing my work following her feedback.","Awesome material and interesting discussion. Great class overall.","Great class. I think that how much you enjoy this class will be dependent on your TF, and mine was great. I wish that the readings were a bit more interesting though."]},"Fall '14":{"comments":["This class can be a lot of work depending on how much work you do and how much you pace yourself. One of the most helpful aspects of this class was that you wrote your final paper in parts which really helps you reflect and build upon your work and maximize your sophomore essay, essentially the capstone of this class. Discussions can be very interesting and you get great idea of how to critically read psychology articles.","This class will teach you how to think like a psychologist, express your ideas, and engage with other opinions. It will not teach you much about psychology itself.","Fantastic course! It was great for walking us through each step of writing a really good paper and understanding\/analyzing methods. The readings were a fun sampling of different areas of psychology. Samuel Ronfard is the best TF!","This is a fantastic introduction to scholarly writing in psychology. The writing skills you gain in this course are extremely helpful for outside research and even papers in other courses. Of all the courses I've taken at Harvard, including my excellent expos class, this class actually improved my writing. Julia is the department writing fellow and her comments were always extremely helpful in the writing process.","Make sure to do all readings closely as it will provide a better experience in sections.","It is a lot of work, but if you do the readings and participate in the class, it is really interesting.  I had a great tutorial experience, but this could be due to how excellent my section leader was.","This class is essential to the psychology concentration. It is a lot of reading and writing but it is very informative and easily holds interest.","It is difficult but really interesting and helpful.","Yes","Take it as long as you can get Julia cause Julia is a boss.","Ton of reading that could probably be slimmed down because you are never tested on the material.  Mostly busy work that can be annoying on a weekly basis but not hard material.  Great feedback on the paper while writing it, and it is easy to improve.","It was a great class and I really enjoyed it."]}},"mostRecentQ":{"overall":"4.40","workload":"5.30","difficulty":null,"recommendation":"4.50","enrollment":"22","response rate":"77.27","QCourseOverall":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"0","3s":"1","4s":"7","5s":"8"},"QDifficulty":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"4","3s":"19","4s":"14","5s":"6"},"QWorkload":{"number":"PSY 971","course_id":"4235","cat_num":"3498","1s":"0","2s":"9","3s":"3","4s":"0","5s":"0"}},"success":true}