{"scores":{"Spring '14":{"course_score":{"overall":"5.00","workload":"4.30","difficulty":"3.70","recommendation":"5.00","enrollment":"6","response rate":"50.00","QCourseOverall":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"0","5s":"3"},"QDifficulty":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"1","4s":"2","5s":"0"},"QWorkload":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"2","5s":"1"}},"instructor_scores":[{"number":"ASTRON 191","cat_num":"3615","course_id":"274","year":"2013","term":"2","id":"5dff1a8ebc913e4eed96daf26e32c8c1","first":" John M","last":"Kovac","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Fall '12":{"course_score":{"overall":"4.75","workload":"4.25","difficulty":"3.75","recommendation":"5.00","enrollment":"5","response rate":"80.00","QCourseOverall":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"0","5s":"3"},"QDifficulty":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"1","4s":"2","5s":"0"},"QWorkload":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"2","5s":"1"}},"instructor_scores":[{"number":"ASTRON 191","cat_num":"3615","course_id":"274","year":"2012","term":"1","id":"5dff1a8ebc913e4eed96daf26e32c8c1","first":"John M","last":"Kovac","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.75","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '11":{"course_score":{"overall":"4.75","workload":"4.50","difficulty":"4.25","recommendation":"4.25","enrollment":"9","response rate":"88.89","QCourseOverall":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"0","5s":"3"},"QDifficulty":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"1","4s":"2","5s":"0"},"QWorkload":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"2","5s":"1"}},"instructor_scores":[{"number":"ASTRON 191","cat_num":"3615","course_id":"274","year":"2011","term":"1","id":"45ad6f6a956c1c052f6f9f6732f7a1af","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null},{"number":"ASTRON 191","cat_num":"3615","course_id":"274","year":"2011","term":"1","id":"5dff1a8ebc913e4eed96daf26e32c8c1","first":"John M","last":"Kovac","InstructorOverall":"4.86","EffectiveLecturesorPresentations":"4.57","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.71","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"3.67"}]},"Spring '11":{"course_score":{"overall":"4.57","workload":"4.00","difficulty":"3.57","recommendation":"4.71","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"0","5s":"3"},"QDifficulty":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"1","4s":"2","5s":"0"},"QWorkload":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"2","5s":"1"}},"instructor_scores":[{"number":"ASTRON 191","cat_num":"3615","course_id":"274","year":"2010","term":"2","id":"5dff1a8ebc913e4eed96daf26e32c8c1","first":"John M","last":"Kovac","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.29","AccessibleOutsideClass":"4.86","GeneratesEnthusiasm":"4.86","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '08":{"course_score":{"overall":"2.50","workload":"3.00","difficulty":"3.50","recommendation":"2.50","enrollment":"5","response rate":"40.00","QCourseOverall":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"0","5s":"3"},"QDifficulty":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"1","4s":"2","5s":"0"},"QWorkload":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"2","5s":"1"}},"instructor_scores":[{"number":"ASTRON 191","cat_num":"3615","course_id":"274","year":"2007","term":"2","id":"d815409d9a3cb23b1bd25f8696cec0dd","first":"Patrick","last":"Thaddeus","InstructorOverall":"2.50","EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":"1.00","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '08":{"comments":["Do not take this course, if at all possible.  While the small size and close proximity to researchers make for interesting exposure to live material, you will be disappointed (the same researchers do not want to put time into teaching, lecturing, grading, etc)."]},"Spring '11":{"comments":["This is a great class to take if you are an astrophysics concentrator. You get to work closely with a mentor on two astrophysics-related projects for the semester. Most projects focus on radio astronomy.","Unlike any other class at Harvard! In a good way!","I thoroughly enjoyed this class and learned a ton in it.  The projects were fascinating and a great way to try a completely new research topic.  However, the course is A LOT of work.  It is definitely a commitment to take this during your senior year.","You should, absolutely, definitely, work on the CMB detection experiment if it is available. It goes far beyond any other opportunities in lab courses - rather than working on a prescribed system and following directions, you get to design your own experiment and get results that were, honestly, extremely exciting."]},"Fall '11":{"comments":["Take this class.  How many people get to say they detected the CMB?","It is exciting, but it has a frustratingly, invariably heavy workload.  There is always more to be done.","You'll learn more in this class than you can ever learn in a lecture-style class. But, not all experiments are created equal, so choose wisely (the CMB experiment . . . always a good choice).","This course will require a lot of time; assume at least six hours on an easy week and upwards of 25 hours on a difficult week. Plan accordingly. What you get out of this course is directly proportional to how much effort you are willing\/able to put in to the course. Radio astronomy is also really cool.","This course is a very unusual class, because it consists entirely of two half-semester research projects conducted with researchers at the CfA who often have no other teaching commitments. Individual attention is plentiful, but the workload and expectations vary widely among the various experiments to choose from.\r\nThis is an intense class, and it's difficult to balance alongside a senior thesis and graduate school applications, so you may be doing yourself a favor by skipping it. That said, I think it's a much better course than Physics 191 for anyone interested in astro (and it's therefore a requirement if you want the Physics joint concentration).\r\n\r\nPut careful thought into who you choose to work with for your sub-projects, because they will dictate what kind of work you put into the class. I'd recommend emailing all of the ones with projects who sound interesting and make your selections based on whoever gives thoughtful, timely comments, given that there's no other real way to discriminate between the projects. The CMB lab is probably the most difficult in terms of time commitment, but it's also one of the main reasons why the class is worthwhile.","The course is not easy because you have to assimilate lots of material that you are completely unfamiliar with in a short period of time. Also because you need to put in a lot of time. But you will learn a lot!","It's very easy to go through the astronomy concentration without even touching a telescope, so I highly recommend the opportunity to build one and then use it."]},"Fall '12":{"comments":["This class teaches you a lot about astronomy research. If you are interested in doing astro research at any point I would recommend this class. Try to take this in a semester in which you will have a lot of free time; the more time you can put into your project the more you will learn from it. Also don't be afraid to ask your instructors questions or tell them when you don't understand. They want you to learn and in my experience they were always more than willing to explain something.","Be prepared to work extremely hard if you want to make your experiments successful.","Fun and cool class--especially the CMB experiment. The instructors are all great.","For the first two thirds of this course, you will struggle to understand the specifics of all the material that is thrown at you. You will feel like a young narwhal all alone in the immense ocean, with danger lurking everywhere just beyond where the eye can see. You will find that you know you have to swim north to meet your kind, but above, below, forward and backward, to the left and to the right, an ocean of knowledge extends forever. You could spend the whole of your natural lifetime (the length of the course) exploring along just one direction, but to succeed you must move on, toward your goal. Eventually, after reaching the northernmost latitudes, with home just beyond the horizon, you will have a sudden realization: you are no longer the young narwhal calf you thought you were. Your tusk is now long and sharp, your fins quick and strong; you will swim toward the surface and jump with pride over the waters, the setting sun illuminating your beautiful narwhal body. Then as you submerge back into the waters, at first so strange to you, but now your home, you will see it. You will see that your kind, older and wiser narwhals (your professors), were there along side you all along. Guiding you and teaching you the ways of the ocean (astronomy research). You will smile as you swim along side them towards the north pole (your final paper), understanding for the first time, what is feels like to be a narwhal (a scientist).\r\n\r\nTL.DR This class is awesome, it will make you feel like a scientist."]},"Spring '14":{"comments":["Astro 191 is a pretty significant time commitment, but it is well worth it due to the skills you gain and the fun you have. Your professor also might become famous halfway though!","This class is awesome, especially the CMB experiment. You will learn a ton and undertake real astrophysics research. The experiments seem to vary a lot in terms of time commitment. The CMB experiment in my opinion is one of the most exciting but takes a lot of time (>10 hours a week in the lab for some weeks). From what I've heard about Physics 191, Astro 191 is probably a better alternative for meeting the physics honors requirement. In any case, if you've had some physics and astronomy classes, you should just take this class!","The professors and support are wonderful. The amount of awesome information you will learn is huge. Do expect it to take time."]}},"mostRecentQ":{"overall":"5.00","workload":"4.30","difficulty":"3.70","recommendation":"5.00","enrollment":"6","response rate":"50.00","QCourseOverall":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"0","5s":"3"},"QDifficulty":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"1","4s":"2","5s":"0"},"QWorkload":{"number":"ASTRON 191","course_id":"274","cat_num":"3615","1s":"0","2s":"0","3s":"0","4s":"2","5s":"1"}},"success":true}