{"scores":{"Spring '14":{"course_score":{"overall":"3.60","workload":"2.70","difficulty":"3.70","recommendation":"3.30","enrollment":"45","response rate":"88.89","QCourseOverall":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"4","3s":"14","4s":"15","5s":"7"},"QDifficulty":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"1","3s":"15","4s":"18","5s":"6"},"QWorkload":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"1","2s":"15","3s":"19","4s":"4","5s":"1"}},"instructor_scores":[{"number":"CHEM 161","cat_num":"3575","course_id":"499","year":"2013","term":"2","id":"cff2bf77214fb1bd9b7034cc7cce2909","first":" Xiaowei","last":"Zhuang","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Spring '13":{"course_score":{"overall":"3.24","workload":"2.62","difficulty":"3.43","recommendation":"3.05","enrollment":"24","response rate":"87.50","QCourseOverall":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"4","3s":"14","4s":"15","5s":"7"},"QDifficulty":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"1","3s":"15","4s":"18","5s":"6"},"QWorkload":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"1","2s":"15","3s":"19","4s":"4","5s":"1"}},"instructor_scores":[{"number":"CHEM 161","cat_num":"3575","course_id":"499","year":"2012","term":"2","id":"cff2bf77214fb1bd9b7034cc7cce2909","first":" Xiaowei","last":"Zhuang","InstructorOverall":"3.57","EffectiveLecturesorPresentations":"3.57","AccessibleOutsideClass":"3.71","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.64","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.00"}]},"Spring '12":{"course_score":{"overall":"3.65","workload":"2.53","difficulty":"3.41","recommendation":"3.74","enrollment":"36","response rate":"88.89","QCourseOverall":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"4","3s":"14","4s":"15","5s":"7"},"QDifficulty":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"1","3s":"15","4s":"18","5s":"6"},"QWorkload":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"1","2s":"15","3s":"19","4s":"4","5s":"1"}},"instructor_scores":[{"number":"CHEM 161","cat_num":"3575","course_id":"499","year":"2011","term":"2","id":"cff2bf77214fb1bd9b7034cc7cce2909","first":"Xiaowei","last":"Zhuang","InstructorOverall":"3.93","EffectiveLecturesorPresentations":"3.97","AccessibleOutsideClass":"4.25","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.07","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '11":{"course_score":{"overall":"4.60","workload":"2.60","difficulty":"3.80","recommendation":"4.50","enrollment":"10","response rate":"100.00","QCourseOverall":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"4","3s":"14","4s":"15","5s":"7"},"QDifficulty":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"1","3s":"15","4s":"18","5s":"6"},"QWorkload":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"1","2s":"15","3s":"19","4s":"4","5s":"1"}},"instructor_scores":[{"number":"CHEM 161","cat_num":"3575","course_id":"499","year":"2010","term":"2","id":"cff2bf77214fb1bd9b7034cc7cce2909","first":"Xiaowei","last":"Zhuang","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.11","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.83","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '10":{"course_score":{"overall":"1.29","workload":"3.12","difficulty":"4.59","recommendation":"1.35","enrollment":"18","response rate":"94.44","QCourseOverall":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"4","3s":"14","4s":"15","5s":"7"},"QDifficulty":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"1","3s":"15","4s":"18","5s":"6"},"QWorkload":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"1","2s":"15","3s":"19","4s":"4","5s":"1"}},"instructor_scores":[{"number":"CHEM 161","cat_num":"3575","course_id":"499","year":"2009","term":"2","id":"6f326db60c0571bfce9c705f96182dba","first":"Eugene","last":"Shakhnovich","InstructorOverall":"1.75","EffectiveLecturesorPresentations":"1.81","AccessibleOutsideClass":"1.69","GeneratesEnthusiasm":"1.81","FacilitatesDiscussionEncouragesParticipation":"2.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '09":{"course_score":{"overall":"2.64","workload":"3.24","difficulty":"4.21","recommendation":"2.79","enrollment":"36","response rate":"91.67","QCourseOverall":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"4","3s":"14","4s":"15","5s":"7"},"QDifficulty":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"1","3s":"15","4s":"18","5s":"6"},"QWorkload":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"1","2s":"15","3s":"19","4s":"4","5s":"1"}},"instructor_scores":[{"number":"CHEM 161","cat_num":"3575","course_id":"499","year":"2008","term":"2","id":"cff2bf77214fb1bd9b7034cc7cce2909","first":"Xiaowei","last":"Zhuang","InstructorOverall":"3.67","EffectiveLecturesorPresentations":"4.28","AccessibleOutsideClass":"3.16","GeneratesEnthusiasm":"3.68","FacilitatesDiscussionEncouragesParticipation":"3.33","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"3.00"}]},"Spring '08":{"course_score":{"overall":"4.00","workload":"2.78","difficulty":"3.86","recommendation":"3.74","enrollment":"33","response rate":"69.70","QCourseOverall":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"4","3s":"14","4s":"15","5s":"7"},"QDifficulty":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"1","3s":"15","4s":"18","5s":"6"},"QWorkload":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"1","2s":"15","3s":"19","4s":"4","5s":"1"}},"instructor_scores":[{"number":"CHEM 161","cat_num":"3575","course_id":"499","year":"2007","term":"2","id":"cff2bf77214fb1bd9b7034cc7cce2909","first":"Xiaowei","last":"Zhuang","InstructorOverall":"4.17","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"3.00","GeneratesEnthusiasm":"4.23","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '07":{"course_score":{"overall":"3.55","workload":"3.27","difficulty":"4.23","recommendation":"3.45","enrollment":"31","response rate":"74.19","QCourseOverall":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"4","3s":"14","4s":"15","5s":"7"},"QDifficulty":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"1","3s":"15","4s":"18","5s":"6"},"QWorkload":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"1","2s":"15","3s":"19","4s":"4","5s":"1"}},"instructor_scores":[{"number":"CHEM 161","cat_num":"3575","course_id":"499","year":"2006","term":"2","id":"cff2bf77214fb1bd9b7034cc7cce2909","first":"Xiaowei","last":"Zhuang","InstructorOverall":"3.77","EffectiveLecturesorPresentations":"4.09","AccessibleOutsideClass":"2.94","GeneratesEnthusiasm":"3.86","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"3.25","ReturnsAssignmentsinTimelyFashion":"4.25"}]}},"comments":{"Spring '08":{"comments":["It's a good class to take pass\/fail.","Make sure to attend class and section and work on problem sets ahead of time. That will make the course quite enjoyable.","You really learn a lot and see the world differently- in the treatment of collections of many particles, this course really allows you to solve a lot of problems.","It is a hard class, but you really get an intuition for the material.","It is difficult and a lot of work, but provides a great overview to a very interesting nad important topic.","don't take it unless you have to or you're crazy and think this stuff is interesting.","Take Chem 160 and Math 21b.  Take it pass-fail if you care about your grades.","This is a great class for those with interest in the topic. It is an intellectually satisfying tour through statistical thermodynamics that brings new meaning to the results learned in general chemistry.","This course is difficult but the exams are manageable.  I recommend it as long as you are willing to put forth the time and effort to understand the material, which is very challenging.","If Professor Xiaowei Zhuang is teaching it, then it will definitely be a good experience. She is so knowledgeable and responsive to student needs. It is a difficult but still enjoyable learning experience.","I would recommend this course for as a good way to fulfill the physical chemistry requirement.","Be prepared to work hard.","Overall a great class."]},"Spring '09":{"comments":["Other alternatives to this class for a chemistry student exist - there's an engineering version, physics version and then directly crosslisted MCB 199. Shop this class, but ensure that the TFs are excellent - if not - switch!","The material can be tough, but I thought the concepts were valuable background for any of the sciences.","Painful at times, but worth it overall.","take this class if you are really interested in the subject matter of if you absolutely have to take it to graduate.","The class is interesting and extremely applicable, and the professor is great. But the section leaders were very unprepared for this class, and if they remain the same, I would not recommend this class at all.","This is a class of horror, death, doom, pointlessness, and continuous all-nighters and pain. Take the physics version, 181, instead. It will probably be more useful and well-taught. The professor was OK, but the TFs were really bad for 161 this year.","Hopefully they will change the TF's next year after everyone has torn them apart. If that's the case, go for it!","only if you need the credit; otherwise, shop carefully. it's a lot of work and may be more time than it's worth in educational value","You must be willing to work hard in this course. For a chemistry course, there is virtually no chemistry. The class is very math intensive.","The professor is good, but doesn't seem to spend much time being available for students (she didn't have set office hours...you had to email). This works against students who don't have time to stick around after class.\r\n\r\nFurthermore, a lot should depend on the TF's for the class, for better or for worse--after all, the section component can be a tremendously helpful reinforcing tool, which it sadly wasn't in our case.","Chemistry 161 is a difficult class. Be prepared to put a lot of work into it.","It's a good class (good material), but it's very difficult and there are not many resources for help, so you'd better be prepared for a difficult semester.","The professor and lectures were fantastic, but the sections and TFs sucked, which made learning difficult. The material is good to know, but not interesting.","It is easy to fall behind in this material.  You really need to keep up with it from the beginning.","hard material, good lectures, relatively lenient grading.","Probably good to shop both Chem 161 and Physics 181.","If they got better teaching fellows the course would be better, especially if the professor communicated with the tfs","The material is important, but I would recommend asking about the physics version.","I think that this class deals with the most interesting material that I've studied at Harvard. Unfortunately, the problem sets and exams are extremely frustrating, so only take it if you're willing to deal with a few nightmares in exchange for the material."]},"Spring '10":{"comments":["Unfortunately statistical mechanics is not taught well in any department at Harvard, and this course is no exception.  Hopefully the course will be taught better in the future, but for now I would avoid Chem 161 and take the Physics or MCB alternatives if you need it for a concentration requirement. This is not the easy version of Physics 181, as could be said of Chem 160 relative to Physics 143a, in fact by many accounts it was more difficult than 181 this semester.","Unless this class is drastically improved, the student will find him or herself learning much of the material alone. Stat mech, while a great topic, requires careful teaching and instruction in problem solving in high level physics. The course did not have either.","If you have to take it, take it pass\/fail.","This is not only the worst class I have ever taken, but perhaps the worst class ever offered in the history of education.","very frustrating, did not learn much, professor is out of touch with modern teaching methods","Though I have been assured that it will have a new, competent professor next year, there was assurance between last year and this year that the class would improve, too. Last year, the course was criticized for having lazy TFs who didn't provide feedback; this year, we had the same. There's no reason to believe that Chem 161 will improve this year since it didn't improve last time improvement was promised. Stay away from this horror of a class.","take the physics or the mcb version. i heard they're both easier.","if you're interested","Poorly taught, which makes difficult material even more difficult.","Difficult to follow, poorly taught.","Do not take this course. Just don't. I don't care how much you think you like the chem department (vs. taking MCB 199), how much you think you are taking the high road and challenging yourself (vs. taking Chem 60), or how much you just think the material is more interesting (vs. taking MCB 56). I thought the same thing. Don't do it. The group of students who end up taking this class are fairly self-selecting--they are the best of the Chem, CPB, and Chem\/Phys concentrations--and they all hated it. It's really frustrating to end college with your worst class in all four years. I didn't listen to the people who took it the year before. Please don't repeat that mistake. Take a class from a professor who actually cares, with a TF who can do the problems and doesn't point you in the wrong direction when you ask for help, and where wikipedia isn't your main hope for understanding the material.","I've honestly been waiting all semester to fill out this question of the cue guide. Here we go:\r\n\r\nThe professor, while brilliant, gives totally inpenetrable lectures that are filled with derivations and totally bereft of conceptual lessons and general organization. Nobody followed lecture. Nobody. The professor's favorite word is \"trivial\"... statistical mechanics might be trivial for him, but it certainly wasn't for us. Also, why is there a typo on every slide? And why must we use 5 different forms of notation across lecture slides, textbooks (yeah plural--except we were only told of 1 \"required\" book at the outset), and problem sets?\r\n\r\nIt'd be great to get an actual TF. You know, one that holds sections (\"So... do you guys have any questions?\" doesn't count as holding a section), grades problem sets (just writing scores without marking anything else doesn't count as grading; also returning 2\/3 of the psets a week AFTER the final is pretty poor form), and answers questions (I've never been in a class before where EVERY student was totally lost on the psets and wasn't able to get any help from the teaching staff).\r\n\r\nI think my experience in the class is best illustrated with a few anecdotes:\r\n\r\nThe first pset I got back, there was a number written in red ink next to each problem. Nothing else. They weren't even added up. Good lord. (The other psets were like this too, but at least there was a total at the top.)\r\n\r\nBefore the midterm, we asked Prof. Shakhnovich if we could have some practice problems so we'd know what to expect for the test. His response: \"Well you've had 2 problem sets already, so you've already seen 10 problems. And there's a 3rd problem set due the class after the exam (THE CLASS AFTER THE EXAM! what??), so really you've seen 15 problems.\"\r\n\r\nA week after the final, the teaching staff set up a time to hand back work. Couple problems here: 1) This was 4 problem sets and the final exam. Guys, 4 problem sets. Out of 6. We got 2\/3 of our feedback a week AFTER the course was over. No wonder none of us learned any statistical mechanics this semester. 2) They posted this announcement to the course website, and didn't actually email it out. Why would anybody check the website a week AFTER the course was OVER? Good thing someone did, and then told the TFs to email the rest of us. 3) The pickup time was 7-9pm in the Chem library. You need swipe access to get into there at that time. A student had to swipe the TF into there once--guys, even the TF didn't have swipe access!\r\n\r\nFinally: About a month into the semester, the professor emailed students who didn't attend every class (nb: this was in the middle of med\/grad school interviews) and warned them that attendance was mandatory (not that we knew, since the syllabus said nothing about that... or the grading scheme, for that matter). Then, he emailed people's resident deans. What! I was so terrified of this class. I am unbelievably relieved that it's over. Thank God.","Only take it if it's required.  One of the most painful classes I've taken.","Do not take this class unless it has been changed drastically by the time you read this. It was miserable. Take Chemistry 60 instead. Or perhaps try Physics 181. Or maybe even MCB 199. If you don't mind traveling, consider taking the MIT version. But don't take this class. It is disorganized, poorly taught, and graded unfairly. The material is not only important, but fundamental, which makes it a shame that it was mangled to this extent.","Avoid at all costs, unless things change significantly."]},"Spring '11":{"comments":["Way less time than Chem 165 - really good option to take pass\/fail. Also WAY better of an option than MCB 199 - Xiowei is a great lecturer!","Prof. Zhuang is a very good, clear lecturer; she really knows the material and is able to explain it well. I learned a lot and really enjoyed the class, I would definitely recommend it to other chemistry concentrators.","Take this course if Xiaowei Zhuang is the professor.","This is a great way to learn about the origins of many chemical properties that are discussed in earlier classes but are never explained. The tools of statistical mechanics are a great way to simplify these problems where large amounts of molecules are involved.","At first I was a little apprehensive about taking this class because of poor reviews from previous years. But it ended up being a great class. The lectures were great, and the TF's really helped us with understanding the course concepts and being available for help with assignments and exam preparation. The course is difficult (as you would expect stat thermo to be), but you will learn a lot, and it is definitely worthwhile.","If Xiaowei Zhuang teaches it, take this course! Taught very well and very clearly. While the material was difficult, I found the course requirements were very manageable."]},"Spring '12":{"comments":["Xiaowei was great.  Some of the problem sets were occasionally frustrating but overall the course was very good.","Awesome class. Great size. P-sets look thick. Solid. Tight. Keep us all posted on your continued progress with any new progress lectures. Show us what you got Chem 161. Wanna see how freakin' huge, solid, thick and tight this class can get. Thanks for the motivation.","It's difficult to get yourself to learn the material when you don't find it very interesting.  That said, Professor Zhuang is an interesting personality (although I'm convinced she thought we were all stupid) and the expectations are not set very high.","Statistical thermodynamics\/mechanics isn't my favorite subject in the world, but Professor Zhuang made the class relatively painless.  Problem sets and exams were reasonable and lectures were well done.  The TFs were helpful and approachable.  Professor Zhuang clearly liked what she was teaching (especially the mechanics half of the course), which helped me to appreciate the subject, too.  She also worked in examples based on biology and other kinds of chemistry, which I liked because it helped me see how the subject could be useful in my own future research.","It was alright. All chem majors have to take it.  I didn't find it particularly interesting, but the tfs were good, so psets were manageable.","Lesser of evils. Better option than Phys or Bio versions. Psets are somewhat independent of lectures. Easy grading. Don't trust high Q scores.","Professor Zhuang and the TFs were excellent for the class. The applications shown in class are great and really show the power of statistical mechanics and thermodynamics and the expectations of students in terms of understanding are reasonable. Reif is a good textbook and TF office hours, sections, and section notes are very helpful in solidifying the material.","Take the course for a letter grade! The material may seem intimidating at first, but it's actually not bad!","Xiaowei makes this course great.  Joey made this course awesome.","Focus on the general concepts, which are interesting, and try not to get too bogged down by long derivations, algebraic manipulations, and vaguely worded problems. This course includes a lot of cool biological applications and has a lot of interesting ideas, but the problem sets and exams aren't the most well-implemented.","Only take this class if you have to. It is a great class for a P\/F alternative, because the workload is relatively low. You really won't spend too much time on psets. However, if you are interested in walking away feeling like you've learned a lot from a class, this is probably not the course for you.","The reason for taking this class instead of Physics 181 is for the applications to chemical problems. I imagine the workload is a bit easier in Chem 161, but the same textbook is used, so it's all there if you want to learn it. If you got out of 160 with a good grade, don't take this course pass\/fail, it's slightly easier.","This is a very interesting course that I wish I had taken sooner.  Statistical mechanics can be used to solve a lot of cool problems in chemistry.  Professor Zhuang is a very well organized professor and great at introducing interesting applications of stat mech in lecture.   The workload was very manageable and the course material was challenging but reasonable.  As long as professor Zhuang is teaching and the TF seems to be pretty on the ball I would highly recommend this course.  Similarly, if professor Zhuang is teaching and the TF seems to be pretty on the ball I would recommend taking it for a grade.  I took it pass fail and really regretted it at the end of the semester.  Their expectations are clear and if you put in the effort there is no reason not to take it for a grade.","Take this class if you want an easier version of statistical mechanics with more biological applications and much less mathematical rigor. If you want to learn the fundamentals of stat mech but don't want to do it super intensely, this is the course for you!","Statistical mechanics and thermodynamics is, like quantum mechanics, more math than physics or chemistry. If you like statistics and wondered where general chemistry laws come from, you might like the subject. Professor Zhuang is competent and lenient, and a straightforward lecturer. As a whole, the class is probably much easier than Physics 181, if you're deciding between the two. But if you don't have to take this class for a concentration and don't particularly care for math or stat mech\/thermo, you're probably better off finding another class.","A great Stat Therm class... It's tough but with some effort, the material becomes understandable and  problem-solving very satisfying.","Very clear lecturers and enjoyable class.","Chem 161 changes the way you think about probabilities and introduces a new aspect to your worldview.","This class was a waste of my time.  The lectures were generally awful.  The teacher spent most of the time deriving equations and not teaching us how to apply them.  The section was not bad but at times Joey did not explain questions well on the first or second try.  Also the problems sets are very difficult, graded pretty harshly, and not very representative of the exams at all. \r\n\r\nHowever, the only UPSIDE of the class, is that the exams are pretty easy and if you do the homework and do well on the exams, you will earn a really good grade.  But I suggest taking the class pass-fail.","I am unsure why this course received such high Q scores last year. These scores convinced me to take the course in the first place, and I was pretty disappointed. While I appreciate that Professor Zhuang did derivations by hand, her notes were mostly uninspiring (as evident by the low attendance each class). Her lecture notes were difficult to follow, particularly when trying to refer back to them after class, because they consist largely of page upon page of math with very little written explanation of what was going on. Combining these largely un-annotated lecture notes with an equally elusive textbook (many years old, very obtuse and difficult to follow) and I literally found myself relying on Wikipedia and lecture notes from other schools to better understand the material. The TFs were helpful overall and actually fairly committed, but this did not make up for the subpar experience I had in this course. The good news though, is that at the end of the day everyone walks out happy having done well in the course. It's a manageable course, and the expectations on the midterm and final are very reasonable.","Good stat mech class!","If you're choosing between Chem 161 and Physics 181, Chem 161 is probably much easier and less-time consuming than Physics 181, but then you probably cover much more material and learn a lot more in Physics 181.  Also, 181 tends to attract the math\/physics geniuses of Harvard, so 161 might be a better choice for the less mathematically inclined and people who care about their GPAs.  Professor Zhuang is a great teacher, so take this course with her if you have the opportunity.","Probably the one of the most challenging courses I've taken. My background in physics is very limited, but there was a lot I got out from this class nonetheless. I personally feel like this course changed the way I think; about my research and also about the world in general. It also made me hungry for more physics, which was unexpected!","Chemistry 161 is the best way to fulfill your stat mech requirement.  The lectures are well organized and interesting when they can be, the problem sets aren't too hard, and the exams are reasonable."]},"Spring '13":{"comments":["The course is a nice introduction of thermodynamics and statistical mechanics, but focuses heavily on derivations and not too much on applications. You will not gain thorough knowledge of both, but you will have the exposure necessary to develop it in the future.","This course is conceptually challenging, but doable.","I enjoyed this class. Lectures were clear, although mostly derivations. Section was very helpful in understanding the relationship between material in lecture, and the (more applied) material on the problem sets. As a student with a math\/physics background (and having not taken chem at Harvard), this course was fine; although many of the examples were chemical\/biological, knowing chemistry is not required to succeed in this course.","The lectures can be a bit hard to follow at times because they are focused on derivations. Difficulty scale: lectures > psets >> tests. All-in-all, it's not too hard for a class that many students choose to take pass\/fail.","I found the class a little hard to follow.  It tends to focus a lot on derivations rather than problems and examples in lecture and section.  Grading on psets and exams was fairly lenient, though.","Chem 161, regrettably, closely resembles Chem 160 in that it is an upper level chemistry requirement whose quality falls far short of what undergrads might expect from having taken Chem 20\/30\/40. First, there were derivations during lecture where the professor had to apologize and say something along the lines of \"this will probably just confuse you and you don't have to know this.\" In fact, there were whole lectures devoted to derivations like those, which were thoroughly unenjoyable and made the course material seem needlessly inaccessible. Second, pset grading was inexcusably poor. Not only did the first pset take multiple weeks to get back (two subsequent psets had been handed in before it was returned), it was also the case that psets were simply not graded correctly. By comparison to the answer key, I was consistently getting points taken off where they shouldn't have been and getting answers marked as \"completely correct\" that were simply wrong. Finally, the difficulty of this course was hugely out of balance. Questions on psets\/exams were either laughably easily (i.e., could be answered by a high school student) or incredibly challenging (i.e., requiring multi-page derivations and significant outside knowledge). Overall, this class is a cruel trick the chemistry department plays on its concentrators, especially those interested in graduate school, as it disadvantages us all relative to others who might have taken a satisfying course in statistical mechanics.","The problem sets are extremely challenging and time-consuming, but the exams are very reasonable, so that if you do the work (which is difficult and requires a lot of time), you will do well in the course.","Only take it if you must","The topics covered in this class are pretty tough, but Prof Zhuang and Amy did a good job of presenting the basics and making everything do-able. Psets and exams were just the right level of challenging without being too hard or too easy. Class can be a little dull, since it mostly just covers derivations that can be read from a textbook.","Take it pass\/fail, do all of the problem sets, and do what you can on the exams.","The lectures of this course is often abstract and hard to follow, with many complex mathematical derivations. Essentially, there are no problem solving except on the problem sets and exams, so you are on your own to figure out how to apply the equations that are derived in class. That said, the assignments are at a reasonable level and the teaching staff are generally very willing and eager to help.","This is a fairly straightforward stat mech course. It might not be the most riveting class if you're mainly interested in chemistry, but it's probably the best class to get the requirement out of the way.  Also, while the material is difficult, the grading is fairly lenient, so don't feel like you have to take it P\/F if you feel overwhelmed during the first few lectures.","This class is super easy. Don't take it pass fail!","The course has difficult psets, but easy exams.  The lectures are thorough in derivations, which may or may not be useful for problem solving in other parts of the course.  But you do walk away knowing the essentials of stat mech.","It's a pretty hard course to begin with, but the teaching does not lend any help at all. Personally I thought the concepts were really hard to understand and the class was filled with people who either got it on their own and were very comfortable with the material or people who were not going to be helped at all by the teaching\/section\/psets. This was manifested in the exams as a very large standard deviation. I took it because I had to, and I wish I didn't have to.","If you can learn from complicated proofs, then you will do fine in this class, as the tests are fairly easy. However, if you need actual TEACHING to understand subjects, I recommend taking this class pass\/fail or getting a tutor, as you do no problem solving in class or section or on homework. This class was my least favorite at Harvard. If you can, fill your Stat Mech requirement with another class."]},"Spring '14":{"comments":["Many people take this class as a requirement, but there's a lot to be learned. The material can be difficult at times, but the class is well-organized, well-taught, and graded very fairly. Make use of all your resources.","For anyone considering this vs. physics stat mech, I would definitely recommend this class over the physics one. Professor Zhuang has been teaching this class for many, many years and even though some of the lectures can be confusing, she usually does a great job of walking through proofs and concepts in class. Don't jump to take this class pass-fail immediately because while problem sets can be confusing, they can be done if you get help from the TFs and the exams will not be too bad! Professor Zhuang also cares a lot about what her students' feedback and is willing to help, so go to her with questions and comments!","It's a required class, but it doesn't have to be painful. Follow along with the problem sets and the exams will be surprisingly fair. Also, Reif wasn't that helpful - I found that even searching online was more illuminating.","This class is well structured and professor Zhuang cares about how you do in the course. She is funny and kind, and overall the course gives you a nice overview of statistical thermodynamics while not making you worry about your grade so much that you can actually appreciate what you are learning.","Only take this class if (a) you are a very, very, very math-oriented and physicsy person or (b) if you are required to. I am a chemistry concentrator who had to take this class, and I am good at and like both math and physics a lot, but this class is so abstract and is essentially obscure theories and equations that don't make sense. The professor does not believe in making the math portion easier, therefore all of lectures are spent just going through the derivations of different equations, which is not an effective or interesting teaching method. Do not take this class unless you have to, or unless you are the kind of person who really likes abstract math and physics.","Really brush up on your multivariable calculus and general chemistry.","This class in definitely hard, but the teaching staff will help you make it work.","The course is interesting most of the time, but the material can be very difficult (conceptually and mathematically).","While the lectures and problem sets are confusing and difficult, the exams are definitely doable, and the teaching staff tries hard to help you learn. A very good senior spring class, although I didn't learn a huge amount.","This is a great course! I definitely recommend taking this course even for non-chem concentrators. You will learn quite a bit from this course. The professor and TFs do a great job of presenting the material clearly and effectively such that you don't need to worry needlessly about confusing details or spend long hours on trivial issues.","so it initially seems like youre going to drown in this course as the psets are super mathy and difficult, encouraging lots of people to switch the course to p\/f. DONT DO IT. the exams are super fair and make you realize that you DO know what youre talking about. Xiaowei is awesome and loves the material (though I didnt find it super interesting, but hey, it's a requirement)","To be successful in this course you should have a strong mathematical background. Some basic understanding of probability would be beneficial as well.","Professor Zhuang and the TFs for this class were fantastic. The material can be challenging, but section and office hours are very helpful. The problem sets are much harder than the midterms and final, but the grading is fairly generous.","This is one of the worst courses I have taken at Harvard. The vast majority of students in the class were taking it because it is a requirement for chemistry and because there were know other alternatives and that is something the professor just refused to understand. For pretty much the entire first month of class, the professor just kept saying that it's a very difficult course and that there's a lot of math and that if you're uncomfortable with that, then you should drop. Under most circumstances, this would just be a professor being honest and not beating around the bush. However, in this case, it was a professor having a fundamental misunderstanding of the structure of the undergraduate chemistry program. It's extremely upsetting to me that almost all concentrators were encouraged to take this course when it is clearly a course only geared towards people with a strong interest in math and a good grasp of abstract concepts. A course like this should not be required for all concentrators because it is much too specific. All that being said, this course is structured so that you can do well. Problem sets are very difficult, which is stressful because they're such a huge part of your grade. Lectures are boring and pretty much never make sense. Sections are helpful if you have a good TF, completely useless if you have a bad one. The saving grace of this class is the exams. The exam problems are easier than any problems you see on the problem sets and the practice exams are very representative of the actual exams. In addition, the 20 points of bonus on each exam are so key. Taking this class is really stressful because you basically always feel like you don't understand anything, but, at the end of the day, the exams are pretty easy to do well on and the professor is going to give half the class A's anyway. Moral of the story: take chem 60 instead of 161, but, if you have to take 161, you'll survive.","Obviously this course is a requirement for chem and chemphys concentrations. It probably won't be the best course you take at Harvard, but it's doable. I would actually recommend taking this course for a grade, as many students who took it pass fail still had to do quite a bit of work.","Not exactly what I would call enjoyable, but in the end, it is graded pretty generously, and the Prof is pretty good.","I personally found a lot of the material pretty boring but unlike some other math heavy classes the material is relatively easy to grasp. If you like math a lot and need to fulfill the pchem requirement this is a great option. Otherwise chem 60 is probably a better option","Pretty chill course. You learn a lot with great, great support in the class.","It's very interesting to learn about, but also requires a lot of work.","This class is interesting especially if you enjoy knowing where things come from. It's a class all about deriving the laws of thermodynamics you learned in gen chem very rigorously. If you're a chem concentrator, take it, it's the most painless way to do the requirement. Also if you're considering pass\/fail, I would take it for a grade. The grading is fairly lenient.","MAKE SURE YOU ARE READY TO WORK.  This class is not that easy, and it really takes time.  Make sure you know math, and make sure you do what you can to learn all you can.  Go to the good TF!  Don't be afraid to ask questions.","Good class to take P\/F senior year. The book isn't worth it. The class is extremely mathy--much more so than any other chem class. Bear in mind coming in that the class is more equations and derivations than anything else.","This class is a great intro to stat mech. It's one of those courses in which the material is hard, but the class atmosphere is relaxed and supportive. It's useful to have some stat background (such as stat 110) before taking the course.","It is a tough class, but the exams are very fair and you WILL do fine!  Probably shouldn't take it pass fail, but a decent option if you are stressed about it.","It is hard. It is tough. It is required. Make sure your math is solid. Its fine. Its not as bad as 160 but still isn't great.","Don't take it pass fail!! Though the material is very challenging, the teaching staff is extremely helpful and the grading is super fair.","This is a good class with dedicated instructors, but it will be of greatest interest to those with an interest in math rather than chemistry.","Overall a good class. I had some serious reservations going into it, but it turned out to be enjoyable, the exams weren't that bad at all, and although some of the material was extremely tough to get through and some pset questions were really tough, it all turns out well and Xiaowei and Winston were really helpful if they were ever needed."]}},"mostRecentQ":{"overall":"3.60","workload":"2.70","difficulty":"3.70","recommendation":"3.30","enrollment":"45","response rate":"88.89","QCourseOverall":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"4","3s":"14","4s":"15","5s":"7"},"QDifficulty":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"0","2s":"1","3s":"15","4s":"18","5s":"6"},"QWorkload":{"number":"CHEM 161","course_id":"499","cat_num":"3575","1s":"1","2s":"15","3s":"19","4s":"4","5s":"1"}},"success":true}