{"scores":{"Spring '11":{"course_score":{"overall":"3.26","workload":"2.11","difficulty":"3.01","recommendation":"3.35","enrollment":"92","response rate":"98.91","QCourseOverall":{"number":"SCI-PHYUNV 17","course_id":"2018","cat_num":"3581","1s":"3","2s":"16","3s":"36","4s":"26","5s":"10"},"QDifficulty":{"number":"SCI-PHYUNV 17","course_id":"2018","cat_num":"3581","1s":"4","2s":"15","3s":"52","4s":"16","5s":"4"},"QWorkload":{"number":"SCI-PHYUNV 17","course_id":"2018","cat_num":"3581","1s":"19","2s":"49","3s":"19","4s":"2","5s":"2"}},"instructor_scores":[{"number":"SCI-PHYUNV 17","cat_num":"3581","course_id":"2018","year":"2010","term":"2","id":"9528cb55a07148d5cbe39df4d3355578","first":"Peter","last":"Galison","InstructorOverall":"3.54","EffectiveLecturesorPresentations":"3.45","AccessibleOutsideClass":"3.64","GeneratesEnthusiasm":"3.78","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"3.39","ReturnsAssignmentsinTimelyFashion":"3.61"}]}},"comments":{"Spring '11":{"comments":["This course takes on a lot of interesting subjects but doesn't do any of them (save relativity) total justice.  A great survey of what's out there, but look for depth and a bit more coherence elsewhere--there's a little too much going on here for the course's own good!","The homework assignments are not as difficult as the problem sets. There is tons of reading and a lot of material to go over but section is really helpful","You can't just coast through SPU17, but it is worth the time you spend on the readings and attending lecture. The professor is interesting -- tells good stories and has a way with words -- and the topics are good. It's great to look at the development of relativity and nuclear weaponry in a historical context. Throw in some quantum mechanics, and you feel like you're getting a good primer on the \"cool stuff\" of modern science.","For non-science\/math students, it's a lot harder than I initially thought. There's also a surprising amount of reading, so be prepared for that","Takes a lot of time, though it's not that hard. Some dense readings, though overall taking this class has be rewarding. Galison is an interesting fellow. He loves what he does and is really earnest. They do clicker things during lecture, which I believe counts towards lecture participation. 4 psets (both short answers and physics), 1 midterm, 1 8-10 page research paper, and 1 final.","This course is quite a bit of reading but extremely fun!","This has a whole lot of reading and be prepared to enjoy all of it.  The section on the atomic bomb project is at the end and is quite entertaining, but measuring the extent of Einstein's direct influence on society was a much more fascinating and involved project that called forth my ability to analyze history, society, and philosophy.  There were four  problem sets, but this is not a real SPU class (though I am a humanities major).  Take it for its other excellent qualities.","This class was definitely interesting and informative, but was also frustrating at times with respect to the amount of technicalities in physics that we were supposed to memorize. However, the content besides this aspect is extremely interesting.","Great course. Really fun, interesting material. Great way to knock out a Gen Ed. Galison is a wonderful lecturer. Problem sets are relatively painless. Lots of freedom to do what you want with the final paper. People always talk about how great it is to attack a topic from an interdisciplinary angle. This course actually does that.","From a physics major: This class really is a history of science class. It's a good way to get your Culture and Belief if you want an easy class. However, there is lots of reading. While you can get away without doing it, you will have a much more positive experience if you actually read everything. Peter Gallison's lectures are pretty scattered and unstructured and perhaps the best way to understand the themes of the course is through the readings.","This is a very interesting and fulfilling way to fill the SPU requirement, but this class is not a \"gut.\" You must pay close attention to understand the scientific concepts, because even if they are not particularly mathematical, they can be quite confusing.","This course is exceptionally fascinating, has a very well rounded amount of course work -as in, knowledge to gain, not \"grunt work\". Highly recommended for the SPU requirement. Also, it is so great to learn about culture through a different \"side\" or \"scope\" than we are used to (history of science) -the topic covers many philosophical and especially political and ethical questions. It is a great angle to consider philosophy -I would say more holistically\/thematically, than just reading a dry text by Kant or someone.","Hindsight is always 20-20. Be warned: taking this class was a MISTAKE! Although the material was actually somewhat interesting, the way it was presented was downright awful and destroyed all the good in this class. Do NOT take this class for the SPU requirement -- take one with real science and more math, you're much better at it than you think. TRUST ME ON THIS!","Einstein Revolution is an extremely interesting class that ties together the highlights of science, history and the arts in a comprehensible and manageable way.","Be very wary.","I recommend this class as an interesting, interdisciplinary look at a particularly interesting time in national history, from both a scientific and an artistic perspective.  However, this interdisciplinary range is sometimes so broad as to encompass more material than can really be covered in depth in a single class.  This class turns into more of a survey of a wide variety of scientific, historical, and philosophical concepts, addressing few of them thoroughly enough to really be understood.","the course is too scattered and has too much reading","This is an interesting course and Professor Galison is a good lecturer, but the physics is pretty hard for someone with little background in science. The problem sets can be fairly difficult and the concepts are confusing. However, the primers are very helpful. The part about the bomb is the most interesting, and makes the class worth it.","If you have any interest in Einstein or quantum theory this is a great class. Professor Galison gets really excited about the subject matter which makes lecture interesting. If you like interdisciplinary work, this class is good for you. if you're not a math\/science major, the psets may be a bit of a challenge at times.","Professor Galison is cool but Einstein is even cooler.","Really interesting class. The reading heavy the course could be better organized but overall its a great class. I highly recommend it to anyone that is interested in the material.","Take it if you have even the slightest interest in physics and don't have the background or experience","There are two distinct groups of people who take this class: humanities majors wanting to satisfy an SPU requirement and science majors wanting to satisfy a Culture and Belief requirement.  Those in either group will find some material interesting and some material boring.  Overall, though, it's a nice and relaxed class.","This course, in many ways, contributes well and interestingly to an understanding of twentieth-century thought, the confluence of different academic fields, and the history of science.  In this respect, I would strongly recommend enrolling.  But if you're looking for an easy Gen-Ed, this is not the course for you, as this course is quite demanding, with two 90 minute lectures and a 90-minute section per week, problem sets, a final paper, as well as a midterm and final.","This course is not nearly as good as it should have been.  There's a lot of potential, and maybe in the future it'll be better, but I was underwhelmed after having come into the class pretty excited.","this experience and the things I learned in the class did not justify, in my opinion, the amount of time and energy put into the class.","There ARE psets, and they're not necessarily easy. Be sure to come into the class with an interest in Einstein ... you'll need to bring your own passion to the course to stay interested, especially given the amount of reading you're expected to accomplish.","Galison is fairly boring in lecture.","You have both a midterm, essay, four psets, and a final, but you will learn an interesting way of thinking about science.","Be careful, this class is not specifically about Einstein. It is about every bit of science and history that occurred in Einstein's time that can possibly be related back to Einstein somehow. Lecture and section can get to be boring, since I was only interested in things directly relating to Einstein, and section is a monotonous 90 minutes going over the ton of reading you were assigned to do. That said, the part of the course discussing relativity was the most intriguing and best part.","By far one of the best courses I've taken at Harvard. Lots of fascinating material and real attention to teaching it well.","A great course for those Humanities concentrators looking to fill a Science A, and an equally viable option for those Science concentrators looking to complete their \"Aesthetic and Interpretive Understanding\" requirement.","you need to know a lot more physics than is implied","It's a great way to learn some of the most important ideas and discoveries in 20th-century physics. Accessible to students with a limited background in math\/science, less so to those with a limited background in history.","This is a fun gen. ed. if you can get yourself excited about the impact of science in the twentieth century.  There were many times that I was excited about what we were learning.","You'll get tired of hearing about the ether after a while. But if you're interested in some of the political, ideological, and physics movements of the early 20th century, as well as the atomic bomb, it's a good class.","A great way to fulfill the SPU requirement if you're interested more in the humanities and social sciences. You really walk away with a sense of Einstein's significance.","Some work but managable.","TAKE THIS COURSE. It's one of the best I've taken at Harvard. Really interesting, great professor and TFs.","Very difficult, tons of work. Kinda interesting.","Science cores are pretty bad, but this one tries really hard, has lots of interesting and important material, and is doable if you put in the effort. It's far from perfect, but it's definitely one of the best of its lot.","It is a very interesting class. However, be prepared to do a lot of reading and to not really get a break on any assignments.","There's a lot of reading to be done in this course but it's well worth it. Professor Galison is an amazing professor and my biggest regret is not taking better advantage of him as a resource.","The material is interesting, easy, and intellectually satisfying if one wishes to consider it in depth.  A great way to fulfill the Culture & Belief requirement for concentrators in the physical sciences.","This class makes Einstein's main theories very accessible and easy to understand, and the historical background for each of his theories and discoveries is fascinating and helps to contextualize them. Expect to work very hard on the problem sets because it is hard to know how much detail is required for the essay-like responses. Also, there is a larger reading load than most cores","Interesting class, but one of the toughest I have taken so far.","It's an easy way to get through culture and belief, but it's definitely a culture and belief class, not SPU.","This class is really misleading.  It's titled SPU 17, but it is not a physics class at all.  It is really a history class.  Expect to do more reading than physics.  On the exams, only 20% of the points are actually for physics problems.  The rest is essays.","This class FEELS like a GEN-ED (which means you wish you didn't take it).  It is just like other gen-eds that have readings and papers and essay\/ID midterms and finals except that they throw in a few \"physics\"  \"problem sets\" which don't really involve much physics and are more like essay sets with some other stuff thrown in.  If you are humanities person taking this for SPU its good because it requires minimal science and is basically just like every other humanities gen-ed with too much reading and then lots of essays\/IDs that you are used to.  If you are a science person taking it for Culture and Belief it is probably just as bad as all of your other options except that there might be some science there somewhere.  Don't expect to cruise through if you know science and physics.  There is too much reading and section is torturous like other gen-eds.  Lecture was not used effectively and there was tons of repetition of unclear things that remained unclear no matter how many times it was repeated.  The subject material is interesting, so take the class only if you are interested in it.  It is not an easy class or one that is particularly enjoyable so if you aren't interested you are better off choosing something else.  I wish I had dropped this class when I had a chance.  DONT TAKE THIS AS AN ELECTIVE!!!","great gen ed class.  interesting.","The material is really interesting, but lectures are diluted with a lot of seemingly irrelevant material, and not organized in a particularly focused manner.","This is not a fantastic course. It's subject matter is interesting, but it really fails to fulfill its potential. The lectures are particularly disappointing. However, if you need a course that meets the Science of the Physical Universe requirement, it may be the best one available. I hope it's not, but it wouldn't shock me.","Be ready to ask for help on physics questions if you're uncomfortable with them, but other than that really fun course--great combination of history and science!","If you want to learn about the culture of the first half of the twentieth century and get a science core out of the way, this is a perfect class. It was interesting, but I was never stressed about it.","This class is so ridiculously easy that even a mudkip can do it.  You can just sit there and troll for lulz.  In fact, this class could have been on the Kentucky state science syllabus.","This is a difficult course. Bottom line. There is too much reading, the lectures move too quickly, section breaks everything down, but it's a lot to handle. If you are a humanities person take this with EXTREME reservations. They say continuously that \"we're about to get to the history party\" but it never really does--it's history insofar as you understand quantum physics, for example. Don't come in thinking this is a hist. of sci course because it's more heavy on the physics."]}},"mostRecentQ":{"overall":"3.26","workload":"2.11","difficulty":"3.01","recommendation":"3.35","enrollment":"92","response rate":"98.91","QCourseOverall":{"number":"SCI-PHYUNV 17","course_id":"2018","cat_num":"3581","1s":"3","2s":"16","3s":"36","4s":"26","5s":"10"},"QDifficulty":{"number":"SCI-PHYUNV 17","course_id":"2018","cat_num":"3581","1s":"4","2s":"15","3s":"52","4s":"16","5s":"4"},"QWorkload":{"number":"SCI-PHYUNV 17","course_id":"2018","cat_num":"3581","1s":"19","2s":"49","3s":"19","4s":"2","5s":"2"}},"success":true}