{"scores":{"Spring '14":{"course_score":{"overall":"3.60","workload":"2.90","difficulty":"3.10","recommendation":"3.70","enrollment":"56","response rate":"78.57","QCourseOverall":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"5","3s":"13","4s":"14","5s":"9"},"QDifficulty":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"2","2s":"6","3s":"23","4s":"9","5s":"2"},"QWorkload":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"12","3s":"23","4s":"4","5s":"2"}},"instructor_scores":[{"number":"MATH 113","cat_num":"0405","course_id":"2852","year":"2013","term":"2","id":"36ccc8b91473e0a3193009148bf70b20","first":" Clifford","last":"Taubes","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Spring '13":{"course_score":{"overall":"3.85","workload":"3.05","difficulty":"3.70","recommendation":"4.10","enrollment":"24","response rate":"83.33","QCourseOverall":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"5","3s":"13","4s":"14","5s":"9"},"QDifficulty":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"2","2s":"6","3s":"23","4s":"9","5s":"2"},"QWorkload":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"12","3s":"23","4s":"4","5s":"2"}},"instructor_scores":[{"number":"MATH 113","cat_num":"0405","course_id":"2852","year":"2012","term":"2","id":"58a07847929f3aad4bd1615bae111a00","first":" Andrew Walker","last":"Cotton","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.30","AccessibleOutsideClass":"4.35","GeneratesEnthusiasm":"3.65","FacilitatesDiscussionEncouragesParticipation":"3.44","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '12":{"course_score":{"overall":"3.33","workload":"2.93","difficulty":"3.93","recommendation":"3.60","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"5","3s":"13","4s":"14","5s":"9"},"QDifficulty":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"2","2s":"6","3s":"23","4s":"9","5s":"2"},"QWorkload":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"12","3s":"23","4s":"4","5s":"2"}},"instructor_scores":[{"number":"MATH 113","cat_num":"0405","course_id":"2852","year":"2011","term":"2","id":"b4b10bccf45d032bc58b86d3a28b916b","first":"Horng-Tzer","last":"Yau","InstructorOverall":"3.20","EffectiveLecturesorPresentations":"2.93","AccessibleOutsideClass":"3.46","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.00","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"3.50"}]},"Spring '11":{"course_score":{"overall":"4.36","workload":"3.43","difficulty":"3.43","recommendation":"4.35","enrollment":"26","response rate":"88.46","QCourseOverall":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"5","3s":"13","4s":"14","5s":"9"},"QDifficulty":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"2","2s":"6","3s":"23","4s":"9","5s":"2"},"QWorkload":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"12","3s":"23","4s":"4","5s":"2"}},"instructor_scores":[{"number":"MATH 113","cat_num":"0405","course_id":"2852","year":"2010","term":"2","id":"b5fd6f99bdc929d711b800110d63c1a4","first":"Antti","last":"Knowles","InstructorOverall":"4.52","EffectiveLecturesorPresentations":"4.61","AccessibleOutsideClass":"4.55","GeneratesEnthusiasm":"4.17","FacilitatesDiscussionEncouragesParticipation":"4.22","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Spring '10":{"course_score":{"overall":"3.39","workload":"2.44","difficulty":"3.25","recommendation":"3.44","enrollment":"47","response rate":"87.23","QCourseOverall":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"5","3s":"13","4s":"14","5s":"9"},"QDifficulty":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"2","2s":"6","3s":"23","4s":"9","5s":"2"},"QWorkload":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"12","3s":"23","4s":"4","5s":"2"}},"instructor_scores":[{"number":"MATH 113","cat_num":"0405","course_id":"2852","year":"2009","term":"2","id":"aad0ec5cb56cf1893c61c0327c85fc79","first":"Wilfried","last":"Schmid","InstructorOverall":"3.51","EffectiveLecturesorPresentations":"3.68","AccessibleOutsideClass":"3.84","GeneratesEnthusiasm":"3.50","FacilitatesDiscussionEncouragesParticipation":"3.55","GivesUsefulFeedback":"3.67","ReturnsAssignmentsinTimelyFashion":"3.73"}]},"Spring '08":{"course_score":{"overall":"2.95","workload":"2.45","difficulty":"2.84","recommendation":"3.35","enrollment":"31","response rate":"67.74","QCourseOverall":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"5","3s":"13","4s":"14","5s":"9"},"QDifficulty":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"2","2s":"6","3s":"23","4s":"9","5s":"2"},"QWorkload":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"12","3s":"23","4s":"4","5s":"2"}},"instructor_scores":[{"number":"MATH 113","cat_num":"0405","course_id":"2852","year":"2007","term":"2","id":"bd08804e7a8793a35f81be8402f591e7","first":"Robert Mills","last":"Strain","InstructorOverall":"3.32","EffectiveLecturesorPresentations":"3.25","AccessibleOutsideClass":"4.17","GeneratesEnthusiasm":"3.35","FacilitatesDiscussionEncouragesParticipation":"3.00","GivesUsefulFeedback":"2.80","ReturnsAssignmentsinTimelyFashion":"2.60"}]},"Spring '07":{"course_score":{"overall":"3.25","workload":"4.08","difficulty":"4.58","recommendation":"3.42","enrollment":"20","response rate":"60.00","QCourseOverall":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"5","3s":"13","4s":"14","5s":"9"},"QDifficulty":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"2","2s":"6","3s":"23","4s":"9","5s":"2"},"QWorkload":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"12","3s":"23","4s":"4","5s":"2"}},"instructor_scores":[{"number":"MATH 113","cat_num":"0405","course_id":"2852","year":"2006","term":"2","id":"80d12e5368e47ce0480832555eb3f7e0","first":"Yum-Tong","last":"Siu","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.17","AccessibleOutsideClass":"4.45","GeneratesEnthusiasm":"3.83","FacilitatesDiscussionEncouragesParticipation":"3.00","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"4.33"}]}},"comments":{"Spring '08":{"comments":["Pay attention to the professor whenever you pick a class.","interesting, cool material, chill","Don't take this class unless you're sure you want to be a math concentrator.","Math concentrators are required to take a 110-level class, and Math 113 is a popular choice. Students should select to take Math 113 depending on the level of rigor they are looking for and the kind of thinking they want to be doing. They should definitely shop the course first.","It will be taught completely differently with a different professor so see for yourself. The material is really interesting though.","complex analysis is important, cool and fun.","Very applicable math class with interesting material.  Even for students who are not mathematics concentrators, this course would enhance their integration techniques and be quite useful.","Generally interesting material; variably taught.","Strain is great. And he made the class a hundred times easier than Siu has in the past, from what I understand.","Do NOT take this course with this professor; as it was taught this year, it is a complete waste of time."]},"Spring '11":{"comments":["This class really shows the power of complex numbers. Furthermore, it is probably more readily applicable than other intro classes.","Complex analysis is a fascinating subject, and Antti Knowles is a very well-organized professor.","The lectures are very straightforward. Pay attention, do the homework (not too bad) and you'll be fine.","Complex analysis is an essential subject for any mathematics or physics concentrator. Be ready for  a high level of rigor and an almost neurotic attention to detail. This is not really a complaint but it does get painful on some of the longer problem sets.","Take at least one real analysis course before this. Also HW does not correlate to the tests.","Out of seven math classes I have taken at Harvard, this was by far my favorite.  While that is partially just a matter of preference when it comes to subject matter, it can be equally attributed to Professor Knowles.  He is an amazing teacher, entertaining and informative, very clear, and very good at answering questions.  He is by far the best professor I've had for math while at Harvard, and in the top handful overall.  \r\n\r\nI highly recommend this class, but even more, I highly recommend taking a class with Professor Knowles.","This is a horrible course if you don't like computational things or analysis. You don't really get a good grasp of what analysis is, and when you do, the class doesn't give you an intuitive feel of how analysis works. It's very computationally driven, and when it's not, it involves a lot of concepts that are not made clear in class.","Good class","You may wish to consider learning basic complex analysis on your own and taking 213 instead.","Math 113 was the best math course I have taken at Harvard. All the lectures made complete sense and information was presented in a very clear and intuitive manner. Professor Knowles is the best math professor I have had. He is very good and I would suggest taking classes taught by him. Complex analysis is also a very exciting topic. If you liked Calculus in high school, Complex analysis will be way better!","Complex Analysis is so cool. It will make you remember that you don't actually hate math. Prof. Knowles is good at making the material understandable, and the problem sets are clear and not impossible. Highly recommended.","Complex analysis is a beautiful subject with lots of applications.","This class is a great class for concentrators in math and concentrators in the sciences, such as physics and chemistry. It really broadens the scope of computability in differential and integral calculus.","good course, if you keep on top of the psets everything will be fine. make sure you have the time to seek help from other students and the teaching staff, because it is extremely difficult to do everything on your own."]},"Spring '12":{"comments":["Complex analysis is very beautiful and worthwhile to take! Prof. Yau is really chill.","April 25, 10:24 PM:\r\nthere are two problems in the final that appeared in the previous assignment.  Please dont' do those two problems yet.  I will update the final shortly.\r\n\r\nApril 26, 10:23 AM:\r\nCan some of you tell me which problems in the final were assinged previously?\r\n---\r\nAs with all math classes, the professor matters more than the material.  And the above interaction is characteristic of Horng-Tzer Yau.","It's a good class. The material is straightforward enough, and some of the results are pretty neat.","Complex analysis is - eh. Better than real analysis, but it's still analysis. It's hard, and not very rewarding. The first half is reasonable useful, though.","The early half of this course (which followed Stein Shakarchi to the letter) is great. The basic results of analyticity and continuation are very elegant, and I suppose contour integration is very useful. A lot of this course consists of very tricky bounds or analysis style limit arguments plus a hefty dose of computational calculus. It can get tiresome but I think you get some of the flavor of analysis that way. If you want to really understand complex numbers rather than hardcore analysis this is probably not the right course.\r\n\r\nAlso if you want to hear HT Yau's fun stories this class is great for that. To paraphrase an example: \"Many people in math are really weird. They are so weird, the way they think, there is no way you can compete with them. For example, ramanujan, ...\"","It greatly depends who's teaching it. While Professor Yau is a very likable man and had a lot of interesting things to say about life, his teaching was very unclear and it did not seem like he put much effort into the class, so I basically felt like I was teaching myself out of the textbook. Very interesting material, though, and certainly worthwhile to learn.","Complex analysis is pretty cool. There are some pretty magical things that complex differentiable functions do (as opposed to real functions). As a physics person, you can also see quite a few connections to E&M stuff, for instance; Yau pointed out some physics applications, but only briefly. Yau's all right as a teacher - probably went a bit fast for me, and followed the book (Stein & Shakarchi) so closely that I only sometimes felt I was gaining more out of lecture than reading the book straight-up. But he's an amusing guy.","This is a rigorous and difficult introductory course in complex analysis or a great second course in complex analysis. Either way, I learned a lot and I would recommend the course whenever Prof. Yau teaches it, although at times you may feel lost or overwhelmed.","Yau was pretty awesome prof. (both in terms of clarity of math and also in terms of hilarity of life stories\/lessons told) so if he teaches it again, definitely take it.","The material is both interesting and useful, and the professor was good.  The course was difficult, but this varies widely depending on the professor.","As with all math courses, the material is irrelevant, it's all about who is teaching it. HT Yau is a boss, but he kind of goes overboard with how much he is teaching you in just one semester."]},"Spring '13":{"comments":["Complex analysis is cool! You learn to do cool integrals, sums, and products, it's pretty sweet. Also complex analysis is phenomenally useful in other areas, such as physics. For example, in areas with no charge, the electric potential is a harmonic function, so we can define a complex potential that's holomorphic and thus a lot nicer to work with. Other properties of the potential function, which are presented without proof in Griffiths, follow straight from the Mean Value Property and Max-Mod Principle. Cool stuff. I was talking to one of my physics instructors this semester, and he told me that if supersymmetry exists, a bunch of functions all become holomorphic, things like charge become residues, and the calculations becomes much nicer. Also pretty cool.","I'd recommend this course with enthusiasm because I think that complex analysis is a very useful and important (and cool) branch of math that all math students should take, and this course hits all the important parts.","Complex Analysis contains cool stuff, and I would advise you to check out the instructor for the semester because the instructor makes a big difference!","Under Andy, this class flew through material. I felt like we got to the midterm and had already learned an entire semester's worth of material. We went so quickly that by the last few weeks, I felt like Andy was just looking for more things to teach us and take up time. Still, I learned an extraordinary amount of material. The textbook was the greatest asset of the course!","Lectures were a bit disorganized, and not always that helpful. But the lecture notes were very good as was the text book, so I would highly recommend reading both. Also section was very useful. \r\n\r\nEven though our TFs told us that it would be OK if we handed in p-sets a bit late, its still a good idea to do them on time. Having 3 or 4 psets hanging over your head going into reading period isn't too much fun.","If Cotton-Clay is teaching it, maybe wait for another professor. He's a nice guy, but his lectures are pretty disorganized and were a factor in me skipping class. The subject itself is pretty cool though.","Complex analysis, regardless of whether you like it or not, is an important part of any mathematical toolbox.","This class was very reasonable. Psets not too bad and midterm was fine. You just have to do it. The math is pretty cool once you do it.","After you've finished the 21\/23\/25 series, complex analysis is one of the more useful areas of mathematics left to take","Andy was very good, particularly considering that geometry is his speciality, and not analysis. Complex analysis is surprisingly elegant material.","Complex analysis is surprisingly beautiful, and that makes this a fun course, but take it with a different professor, Cotton-Clay should work on his teaching."]},"Spring '14":{"comments":["Good class that uses Ahlfors, which is still the best complex analysis book.","Taubes is such a great math professor - it's a shame that his lectures were attended by so few students.  Complex analysis is a beautiful field of mathematics that has some surprising results.  Make sure you review multivariable and know your line integrals, as those are pretty fundamental for the course.","Taubes is nice and communicates the material reasonably, but lacks charisma. The book is terse and could have a more coherent presentation. The material itself is fascinating and invaluable.","As with most math classes, what matters most is the professor. Taubes is pretty easy, a little of a slow lecturer, but a very nice guy. I would suggest taking a class with him.","lmao this class. I'll start with the textbook. Ahlfors's book is allegedly \"celebrated\" for its broad and rigorous discussion of Complex Analysis. Bull. The book sucks. Ahlfors is the kind of guy who will start a proof on the board, and about two statements in will say, \"and the rest is trivial, class dismissed,\" when there's still 55 minutes left in lecture and you're left packing up your bags like, \"lol wtf is math\". That's not even a joke though. His book is bad and he should feel bad.   \r\n\r\nI'm spending so much time talking about the book because I spent 95% of the class using the book to learn, since lecture wasn't much better. I LOVE Cliff Taubes, don't get me wrong. He is hilarious and an absolute sweetheart. But damn son... you need to step up your lecture game. You can't be putting me to sleep like that, ya heard? \r\n\r\nOh and I heard section sucks. \r\n\r\nBut here's the good news: THIS CLASS WAS EASY AS A MOTHER... really, it was soooo easy under Cliff-daddy. No exams, just a 6-page midterm and final lecture writeup where you summarize what's covered in 20 pages in the book. He even tells you what you did wrong and lets you fix it, so you are like, guaranteed a 10\/10 or whatever he gives it. Zero stress.\r\n\r\nIs the low difficulty worth not learning that much? Ask your GPA. Either way, the material is great, so take this with an altogether different teaching staff?","Professor Taubes is great and emphasizes learning over grades. The Ahlfors book is  not the best for learning the material the first time though, and the lack of emphasis on grades can make it difficult to be motivated enough to truly learn the material","I would not recommend this class with Taubes.   I took it because I wanted to take a moderate math class while still learning something, but in the end do not feel that I learned much.   Lectures were very slow and often had mistakes, and the textbook was dense and difficult to follow as well.   So I did not feel that I had a good understanding of the course material and would get through the homeworks without understanding the core concepts.   The incentives were set up so that pretty much everyone would get a good grade and the midterm and final are pass\/resubmit, which deincentivized me from learning anything in this class.   Do not take even if you are looking for an easy math class in my opinion, because you won't learn much.","The experience depends COMPLETELY on the professor who's teaching. Taubes was great, but be sure to check out evals on the prof who teaches this next year before you register.","With Clifford Taubes, the lack of stress about the grading really allows one to appreciate and learn complex analysis for the beautiful and powerful mathematics.","Although Professor Taubes is really nice, his lectures could seem unprepared and not engaging. Given how easy the midterm and final are, it is very easy to come out of this class having learnt virtually nothing at all--be prepared to self-study out of the textbook if Taubes is teaching again.","It's good stuff","Difficult but essential if you're interested in doing serious math.","Complex analysis is one of the cooler and more applicable branches of math after freshman year. However, Ahlfors is one of the most terrible textbooks I've ever used. Had I known earlier, I'd have relied on a different textbook from the start.","complex is really cool, and it comes up a lot in other areas of math","This course under Professor Taubes was quite good if you're not looking for an extremely fast pace and challenging complex analysis class. We took our time with the material but eventually covered most of the important topics, like complex integration, power series, etc., most of which are really cool results. The midterm and final were excellent take home projects that were graded on a scale of 100% or try again. That being said, they were serious assignments and I learned a lot by doing them. Overall, a very chill math class.","Presents what could be really interesting material in a really poor way. Ahlfors is a really unclear textbook and the class is based entirely around it. Taubes is earnest but often doesn't seem to understand what undergraduates have trouble with and what they find easy.","Given the disconnect between the homeworks and the lectures each week, and the fact that here are no tests, it's very easy to fall behind in this class and be playing catch-up. Try not to do that and your life will probably be a lot easier.","This class was pretty easy partly because of the structure of the class but also because complex analysis itself is not that difficult as a subject. Unfortunately, Taubes' lectures did not help at all and were not worth attending. The problem sets could be done just by reading the book or finding the solutions online. It was an easy class, but also a disappointing one since class itself was unnecessary.","If Taubes is teaching 113, take it. The class was extremely laid-back, and the writing projects were more helpful in understanding the material than studying for tests would have been.","Among the most interesting math courses, definitely a must-take for math concentrators.","The class has different professors every year. If you're slightly less comfortable with higher-level math, then you should take the course if Taubes is teaching it. Taubes makes the course very relaxed and, although problem sets are ocassionally very difficult, the class is a much more manageable math class than most other courses in the 113\/114\/115\/122\/123\/131 group of courses (especially if Taubes is teaching it).","This course is highly dependent on the professor. Try it out. I didn't enjoy the lectures very much, and if the textbook is Ahlfors I would recommend buying and using a different one. The material is great but I didn't feel like I learned it well this semester.","Prof. Taubes does a good job explaining material in detail, but that also means that there is often not time to cover more interesting material.","Professor Taubes is a great guy - he brought us cookies every Friday lecture.  But he also really knows his stuff, and he made this class worth it.","Didn't get much out of lecture. Ahlfors is a difficult but interesting text. Taubes assigned writing projects instead of midterm and final, which was chill and easy, and helpful for learning the specific topics assigned, but we were essentially not responsible for much of the material (especially at the end of the course).","Taubes is an OG","If you're going to take complex analysis, you might as well take it with Taubes so that you have a little wiggle room with completing the assignments perfectly. That being said, Ahlfors is not a good intro to complex analysis textbook.","Definitely take this class if Prof. Taubes is teaching it.  You will get a thorough understanding of complex analysis.  The class requires a fairly significant time commitment, but you get out what you put into it.","This is a great class, but be prepared to study the textbook (Ahlfors) in much detail before, after, and sometimes during lectures.","Take this class if you have to. Otherwise, analysis is a rather unwieldy subject so better to explore the more elegant side of mathematics.","Like any math course, the quality of this course is extremely dependent on the professor. Clifford Taubes is not the most engaging or clear lecturer, but he brings cookies, assigns reasonable problem sets, and occasionally tells great stories. Ahlfors is a classic text in the subject, though I personally wasn't a huge fan. The midterm and final were treated a bit lightly than I think they deserve--I found them to be really useful in building a very solid understanding of two extremely important topics. In general, Complex Analysis is extremely powerful and can be, at times, beautiful. The results aren't necessarily super applicable because Mathematica exists, but they are useful in understanding why and how Wolfram evaluates several integrals, etc. If you are concentrating in math or physics, you should probably take this class.","I was told that complex analysis is a very useful for other subjects (such as physics), and I can see how the topics covered could be applied to other subjects, but we were not taught exactly how to apply complex analysis to problem solving in physics or other disciplines.  In addition, the problem sets were very computational."]}},"mostRecentQ":{"overall":"3.60","workload":"2.90","difficulty":"3.10","recommendation":"3.70","enrollment":"56","response rate":"78.57","QCourseOverall":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"5","3s":"13","4s":"14","5s":"9"},"QDifficulty":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"2","2s":"6","3s":"23","4s":"9","5s":"2"},"QWorkload":{"number":"MATH 113","course_id":"2852","cat_num":"0405","1s":"1","2s":"12","3s":"23","4s":"4","5s":"2"}},"success":true}