{"scores":{"Fall '14":{"course_score":{"overall":"4.50","workload":"8.60","difficulty":null,"recommendation":"4.50","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":"COMPSCI 265","course_id":"1273","cat_num":"2083","1s":"0","2s":"0","3s":"3","4s":"3","5s":"11"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"COMPSCI 265","course_id":"1273","cat_num":"2083","1s":"0","2s":"6","3s":"5","4s":"1","5s":"2"}},"instructor_scores":[{"number":"COMPSCI 265","cat_num":"2083","course_id":"1273","year":"2014","term":"1","id":"aa7f05b3ea5892d11570772b0c4a332d","first":" Stratos","last":"Idreos","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Fall '14":{"comments":["For undergrads, this is the continuation of CS165. If you are a CS concentrator considering CS research or CS grad school, this class would be useful. Otherwise you should be highly motivated to learn about current trends in database architectures and design. As the first iteration of this class, this year was quite structure free. Be prepared to discuss about a lot of open-ended questions during class. It is quite beautiful as you can see certain themes and big questions reoccur again even as each class discussion is on a set of different academic data systems papers. For your ongoing final project, be ambitious and swing for the fences on some of these open problems, and dare to solve them!","Stratos is really passionate about data systems and spend a lot of time and energy on this course. This is a great class if you are interested in data systems research. It will cover enough breath and depth on most of the new topics and you'll get to interact with visiting scholars.","solid systems background recommended to understand the research papers. be prepared for the backgrounds of students in the class to be highly varied.","I came from HKS to take this class, so it was very difficult for me to keep up as a non-computer scientist. But I am very glad I tried! The material was eye-opening and the instructors simply excellent.","Great course, Stratos is a great professor and leads this coure really well!  Highly recommend","One of the most interesting classes I've ever taken! Lectures are really just round-table discussions on papers, and always fascinating. Take this class even if you don't have any prior database experience (I didn't, and still got a lot out of the class)","TAKE THIS CLASS! I got in the class after having taken CS165 last semester so I had some good exposure to basic database concepts, how column stores work and had read some papers in the field. Throughout the class I learned SO MUCH MORE about big data systems, databases made by Google, Facebook, IBM, about database models, techniques, data analysis, current research topics and also how to think and talk about data processing\/storing issues. So, yes, I learned a ton and on top of that got to meet really cool people. Everyone taking the class is really smart and contributed to really cool conversations in class. Also, Professor Idreos and Manos are very knowledgeable, enthusiastic and overall amazing in stirring the conversations to the right places and being inspiring when it comes to actually doing research. And that is the best part of the class. You get to work on your own research project with Professor Idreos about really cool database topics and Stratos is a great advisor. He really manages to keep you motivated, encouraged and help you learn how to go about coming up with your own ideas and explore them. Also, last but not least we had some amazing speakers in the class, including the founder of MemSQL, C. Mohan from IBM research as well as two researchers from HP Labs. That is particularly inspiring because you really get to see what cool computer scientists are doing in industry!!! Need I say more? TAKE CS265 and also take CS165 with Stratos if you have a chance!","Excellent course on big data systems. Not just an ordinary database systems course. I learned many fundamental issues that are associated with managing big data platforms and came out with a better understanding of the research and work that is being done in this area","This class was phenomenal with Stratos and Manos. They generated a real enthusiasm for topics in database research and structured the class in a very student friendly manner. Definitely one of the most interesting CS classes I've gotten to take. Overall, it will be up to you as far as how much you get out of the course, but it is possible to learn\/do a lot.","This course won't kill you if you have a full schedule but the more time you invest the more you will get out of it.","If you are interested in research or more specifically data systems research-- take this class. Stratos is extremely caring of his students and this class will help you to transition into real research work."]}},"mostRecentQ":{"overall":"4.50","workload":"8.60","difficulty":null,"recommendation":"4.50","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":"COMPSCI 265","course_id":"1273","cat_num":"2083","1s":"0","2s":"0","3s":"3","4s":"3","5s":"11"},"QDifficulty":{"number":null,"course_id":null,"cat_num":null,"1s":null,"2s":null,"3s":null,"4s":null,"5s":null},"QWorkload":{"number":"COMPSCI 265","course_id":"1273","cat_num":"2083","1s":"0","2s":"6","3s":"5","4s":"1","5s":"2"}},"success":true}