{"scores":{"Spring '14":{"course_score":{"overall":"3.60","workload":"3.00","difficulty":"3.50","recommendation":"3.70","enrollment":"42","response rate":"80.95","QCourseOverall":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"3","2s":"3","3s":"8","4s":"11","5s":"9"},"QDifficulty":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"3","3s":"11","4s":"13","5s":"5"},"QWorkload":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"8","3s":"15","4s":"7","5s":"2"}},"instructor_scores":[{"number":"STAT 171","cat_num":"4180","course_id":"4842","year":"2013","term":"2","id":"c328699631bbf19de8197afa5b09e73b","first":" Natesh S","last":"Pillai","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '13":{"course_score":{"overall":"3.60","workload":"2.66","difficulty":"3.69","recommendation":"3.77","enrollment":"64","response rate":"95.31","QCourseOverall":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"3","2s":"3","3s":"8","4s":"11","5s":"9"},"QDifficulty":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"3","3s":"11","4s":"13","5s":"5"},"QWorkload":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"8","3s":"15","4s":"7","5s":"2"}},"instructor_scores":[{"number":"STAT 171","cat_num":"4180","course_id":"4842","year":"2012","term":"2","id":"8af03553fd64efb700b2ff1923e401ec","first":" Samuel","last":"Kou","InstructorOverall":"3.82","EffectiveLecturesorPresentations":"3.83","AccessibleOutsideClass":"3.71","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.74","GivesUsefulFeedback":"3.75","ReturnsAssignmentsinTimelyFashion":"4.06"}]},"Spring '12":{"course_score":{"overall":"4.26","workload":"2.45","difficulty":"3.12","recommendation":"4.20","enrollment":"75","response rate":"92.00","QCourseOverall":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"3","2s":"3","3s":"8","4s":"11","5s":"9"},"QDifficulty":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"3","3s":"11","4s":"13","5s":"5"},"QWorkload":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"8","3s":"15","4s":"7","5s":"2"}},"instructor_scores":[{"number":"STAT 171","cat_num":"4180","course_id":"4842","year":"2011","term":"2","id":"8af03553fd64efb700b2ff1923e401ec","first":"Samuel","last":"Kou","InstructorOverall":"4.44","EffectiveLecturesorPresentations":"4.54","AccessibleOutsideClass":"4.34","GeneratesEnthusiasm":"4.43","FacilitatesDiscussionEncouragesParticipation":"4.34","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.58"}]},"Spring '11":{"course_score":{"overall":"4.09","workload":"2.58","difficulty":"3.30","recommendation":"4.19","enrollment":"50","response rate":"86.00","QCourseOverall":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"3","2s":"3","3s":"8","4s":"11","5s":"9"},"QDifficulty":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"3","3s":"11","4s":"13","5s":"5"},"QWorkload":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"8","3s":"15","4s":"7","5s":"2"}},"instructor_scores":[{"number":"STAT 171","cat_num":"4180","course_id":"4842","year":"2010","term":"2","id":"8af03553fd64efb700b2ff1923e401ec","first":"Samuel","last":"Kou","InstructorOverall":"4.27","EffectiveLecturesorPresentations":"4.29","AccessibleOutsideClass":"4.03","GeneratesEnthusiasm":"4.21","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"4.17","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Spring '10":{"course_score":{"overall":"3.51","workload":"3.18","difficulty":"3.74","recommendation":"3.89","enrollment":"41","response rate":"95.12","QCourseOverall":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"3","2s":"3","3s":"8","4s":"11","5s":"9"},"QDifficulty":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"3","3s":"11","4s":"13","5s":"5"},"QWorkload":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"8","3s":"15","4s":"7","5s":"2"}},"instructor_scores":[{"number":"STAT 171","cat_num":"4180","course_id":"4842","year":"2009","term":"2","id":"4559191edbcdc6c228d034b10baabcc7","first":"Jun","last":"Liu","InstructorOverall":"3.28","EffectiveLecturesorPresentations":"3.13","AccessibleOutsideClass":"3.41","GeneratesEnthusiasm":"3.59","FacilitatesDiscussionEncouragesParticipation":"3.57","GivesUsefulFeedback":"3.23","ReturnsAssignmentsinTimelyFashion":"3.67"}]},"Spring '09":{"course_score":{"overall":"3.57","workload":"2.54","difficulty":"3.43","recommendation":"3.62","enrollment":"29","response rate":"82.76","QCourseOverall":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"3","2s":"3","3s":"8","4s":"11","5s":"9"},"QDifficulty":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"3","3s":"11","4s":"13","5s":"5"},"QWorkload":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"8","3s":"15","4s":"7","5s":"2"}},"instructor_scores":[{"number":"STAT 171","cat_num":"4180","course_id":"4842","year":"2008","term":"2","id":"4559191edbcdc6c228d034b10baabcc7","first":"Jun","last":"Liu","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.39","AccessibleOutsideClass":"4.24","GeneratesEnthusiasm":"3.61","FacilitatesDiscussionEncouragesParticipation":"3.93","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '08":{"course_score":{"overall":"4.32","workload":"2.80","difficulty":"3.47","recommendation":"4.26","enrollment":"51","response rate":"64.71","QCourseOverall":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"3","2s":"3","3s":"8","4s":"11","5s":"9"},"QDifficulty":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"3","3s":"11","4s":"13","5s":"5"},"QWorkload":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"8","3s":"15","4s":"7","5s":"2"}},"instructor_scores":[{"number":"STAT 171","cat_num":"4180","course_id":"4842","year":"2007","term":"2","id":"8af03553fd64efb700b2ff1923e401ec","first":"Samuel","last":"Kou","InstructorOverall":"4.42","EffectiveLecturesorPresentations":"4.58","AccessibleOutsideClass":"4.22","GeneratesEnthusiasm":"4.45","FacilitatesDiscussionEncouragesParticipation":"3.88","GivesUsefulFeedback":"4.64","ReturnsAssignmentsinTimelyFashion":"4.73"}]}},"comments":{"Spring '08":{"comments":["Don't take this unless you're willing to put up with ridiculous lectures\/psets\/exams.  Easy psets, hard exams.  Worst combination.","This is a great class - if you like probability and modeling, you'll really enjoy it!","Solve many problems for the exams","This is a great class, not too difficult, not too time consuming, and you will learn a lot.","The midterm is not difficult, but you must study for it.  There were many scores in the 95+ range.","The material is interesting, but the exams and grading system are frustrating.","This is a useful class with many practical applications. Useful for people studying quantitative aspects of economics, life sciences, and so on. Well taught.","You will not fall asleep in this class, though you may run low on pencils and notebook paper.","Greate teaching staff, good book, a lot of applicatinn demonstarions, which raises enthusiasm even more"]},"Spring '09":{"comments":["Take it only if required.","Stochastic processes are interesting and increasingly relevant -- I highly recommend this class!","This class is pretty difficult primarily because it assumes cumulative knowledge of probability theory. Make sure you either passed 110 with an A or understand and remember everything from that course before taking 171.","Everyone should take it."]},"Spring '10":{"comments":["great topic, but course could be better organized.","Would recommend if taught differently or by someone else.","The class covers a host of very interesting material, although it is not particularly well taught.  Take this class if you are interested in the material and do not mind learning most of it by reading the book on your own time.","This is a very good class on one of the most exciting areas of statistics. If the material seems at least remotely interesting or relevant to you, I would strongly recommend this class. However, a good grasp of basic probability theory is really essential for success in the class. A good grasp of all (not just some) of the material from, say, Stat 110 should provide a sufficient background.","The course is really intersting and the instructor is a real expert in the field but keeping his pace can also be very challenging.","Useful material, however the instructor can make a big difference.","Grounding in probability is necessary, but more than that, solid calculus techniques. Portions of the course truly require differential equations and analysis to properly understand the material. The course has an odd flavor to it with a good fraction being grad students in statistics (apparently no grad level stochastic processes course offered this year). Collaboration with peers or consultation with TFs on problem sets is explicitly banned on the syllabus. Lectures can be impossible to understand at times (and the board impossible to decipher) except to the cognoscenti math majors who seem to be taking this as a gut class.","Important topic but requires a lot of self-study.","this course is much harder than other undergrad courses, need more than 110 knowledge to take this. Professor is not very enthusiastic in teaching, so you should be prepared to learn on your own. Material is interesting and useful though.","Don't be afraid to ask questions or justifications in class to the professor (he is a little sloppy from time to time)","Very interesting material, worth the workload.","A well taught and practical look at a very interesting area of statistics.","Interesting material, good textbook, challenging psets, but lectures were awful"]},"Spring '13":{"comments":["Class has really interesting material and is pretty manageable throughout the semester, but note that the final is very difficult.","This course has some really good materials: Markov chains, stochastic calculus, option pricing, brownian motion etc. However, the problem sets are a lot easier than the exams and they won't prepare you at all for the finals\/midterm. So be careful about that and you should learn a lot!\r\nAlso it seems that this class has many grad students in statistics and that probably makes the class more difficult.","I enjoyed this class as enthusiastically as I enjoyed Stat 110. The material flowed wonderfully from one topic to the next, and it was a great introduction to all things related to stochastic processes.  The first half of the course is quite easy (considerably easier than Stat 110), but after the midterm it gets harder (around the level of Stat 110).  Sam Kou is wonderful: his lectures are crystal clear, and he's really funny sometimes. This class is so applicable to so many real world phenomena (financial models, chemical reactions, waiting times, etc.) so in my opinion, it is a must-take for Applied Math, Math, and Stat concentrators.","The curve is always against you, the homework doesn't really teach you much. So it's just the book and you. Good luck!","Good material. but not taught so well. Kou is a difficult lecturer to follow. Book is also a struggle to read. HW problems don't really clarify course topics. Really applicable stuff, but wish it was taught better and with more passion\/applicability.","It's hard. Take it if you really enjoy probability. The material itself is very interesting and very good. But the support in the class is terrible.","The course veers into finance towards the end, and gets much less tractable after birth-death processes. Exams are also harder than psets, which can be an unwelcome surprise.","If you like STAT 110, you would enjoy STAT 171.","The lectures aren't that interesting, but the material is cool. Make sure you read the book and start the problem sets early! Difficult class, but (hopefully) worth it.","The material is kind of like an extension of the coolest stuff (Markov Chains!) from Stat 110, although not taught by Blitzstein. It gets way harder after the midterm, and sometimes lectures move very quickly. A lot of examples in the second half of the class are just set up, and we're told to solve them ourselves even though we don't really know how. While still managing to go 5 minutes over.","Take this class!  Lots of fun statistics problems!\r\n\r\nIt's basically like a continuation (in the feel) of Stat 110.","Gets a lot harder\/more mathy in the second half of the course.  Review Stat 110 before starting the course.  The problem sets are a lot of fun, and really not that hard!","Study hard. Do all the problems in your homework and in your textbook. Sit in the front row because Sam writes really small, and many times it's hard to understand him fully.","Don't be fooled by pre-midterm material. Post-midterm, this class gets HARD. Kou is an amazing lecturer, but he lectures straight out of the book. This is not a bad thing, because the book is dense and wouldn't be approachable or understandable at all without his lectures. So go to lecture. Problem sets can be long. Final and midterm were both pretty tough, but not unreasonably so.","This course covers potentially interesting and useful material but does not do so in a way that you leave the course feeling like you've learned anything interested or useful.","The material gets really hard after the midterm.  Sam is very hard in terms of his exams and also likes to start a new example at 3:59pm.","STAT 171 is a very useful class, both for computational sciences and finance. Kou is a great lecturer. Very good follow-up for STAT 110.","Regardless of how bad the teaching staff (which is by no means a given - shop it and make sure you check out all the TFs), you should take this class because the material IS interesting and extremely relevant.","This class is useful but is taught by the textbook.  You will learn a lot, but the problem sets are deceptively easy in comparison to tests.","The problem sets are easy, but do NOT let that fool you into complacency. The tests are very difficult so make sure you learn the concepts in depth way before the exams.\r\nThe lectures follow the book quite closely.","The class started out very easy, but got significantly tougher at the end. Also, the final exam was very tough - possibly tougher than any of the homeworks.","Be careful about taking this course. The material is quite fascinating and useful, but this class is far from perfect. You should be comfortable with probability theory and differential equations, and be prepared to spend a lot of time on this course. Do not be fooled by the easy pace of this course at the beginning - the second half is very difficult.","if the structure of the class is changed, this will be an excellent class. if not, the first 2\/3 of the class is awesome, but the last 1\/3 is totally rushed and very stressful","The second half was a lot more interesting than the first. I wish we got to renewal phenomenon and queueing processes. Otherwise a good course (though psets are easy and the final is really hard).","Really difficult and challenging","Very interesting material and Kou is really good. Recommend to anyone who liked 110.","It's a great introduction to stochastic processes, with applications in all fields of the sciences. Though lectures lack in depth, the material is extremely useful to know and worth the effort. Regardless of your background you should take this course, but only if you are comfortable with probability theory (STAT 110).","A very good class. Topics before the midterm are a lot easier than those after.","Great class, it starts slowly and really picks up after the midterm. Make sure to keep up.","Kou is not a good professor - brilliant, but basically reads the textbook out loud in class. Tests are comprised of small, specific examples we did in class instead of main ideas as you would expect.","It can be fun material if you liked stat 110. The second half of the course definitely is different from the beginning half. The stuff learned does come up in other classes, so you see some connection. The lectures aren't really that outstanding.","I didn't find it to be a fulfilling class. I would periodically attempt to go to lecture, but they were way too slow-paced and boring, so I would have to read the textbook, which is not clearly and rather poorly written. I did go to class in the last three weeks of the course though, starting from when sckou started brownian motion, and his lectures were definitely more clear than the textbook. Also, there's nothing scary about the intro to stochastic calculus he provides in the last lecture--it's just a riemann-stieltjes integral, what the big deal. I'm sad we didn't get to spend more time on stochastic calculus, because that actually seemed pretty cool.","Good course with quality lectures. big variation in work difficulty over semester","Be sure to stay up to pace with the material week to week - it does get progressively more difficult! Excellently taught course, and extremely important material."]},"Spring '14":{"comments":["Understand the material instead of memorizing.","This course was very difficult, but worth it when all is said and done (kind of like 110). This year, there wasn't quite the infrastructure there should have been, making studying harder than it should have been. Those problems shouldn't be as bad in the future though, because it won't be a new course anymore. Also, Pillai is really nice and accommodating with regard to extensions and other commitments.","The bad:  Feedback on assignments was poor\/nonexistent and no answers were given for midterms\/homeworks.  Sometimes wording of problems was bad due to language barriers.\r\n\r\nThe good: Plenty of 1-1 office hours if you wanted them, teaching staff is nice, material is fun and interesting and reasonably challenging without being impossible.  I also liked the textbook.\r\n\r\nOverall, recommend with reservations.","I began really disliking this course and it grew on me a lot throughout the semester. To describe it in one sentence, this course as taught by Professor Pillai is essentially a graduate course, and that comes with all of its advantages and disadvantages. The problem sets were long and difficult and probably the biggest drawback was that there were no office hours, and Piazza didn't even begin to make up for it. Also a lot of things were glossed over and assumed that you knew from prior courses probably because there were a fair number of grad students in it, which was definitely not the case as Stat 110 is the only prerequisite. Within each lecture stuff tended to be somewhat disorganized and no official problem set solutions or practice exams were provided. All that being said, Professor Pillai did a great job in generating enthusiasm for the material and the grading curve is quite good. Going through it was somewhat painful but I really do feel like I learned a ton of material related to stochastic processes.","This is a really fun class to take and it will teach you how to look at problems from a different and often useful perspective. It strikes a great balance between theory and application.","This class is fantastic. The lectures are very informative and the psets were always interesting (you'll occasionally need real analysis to solve them, but the grading is always understanding so don't worry about that). The tfs were very helpful.\r\n\r\nIf you really liked 110, this is a much better continuation than stat 111 or 123.","Hard, but worth it.","Be prepared with linear algebra and differential equations!","Natesh is really excited and knowledgeable about the material and gives great lectures. Material is very useful. Can be a bit difficult at times, but if you go to section and make use of office hours and Piazza it should be OK :)","Overall it's a good class to learn stochastic processes. Be aware that the mathematical level is higher than stat 110 and that there are not many printed resources to learn from. However, the instructor really values student learning and will help you reach your goals.","Stat 171 is a natural continuation of Stat 110, but orthogonal to Stat 111. We picked up at Markov chains, and expanded into a lot of other stochastic processes. I highly suggest this class if youâ€™re interested in learning more about a purely probabilistic area, as opposed to statistical inference in Stat 111. The professor (Natesh) cares a lot about his students and really takes student feedback into account. You should go to his office hours! Heâ€™s really helpful. The material in this course is very interesting as well. There were many times after lecture when I just sat back and admired the beautiful concepts we had covered in the past 90 minutes. My mind was blown so many times in the class, as the connection between stochastic processes and many applications is really profound. The class is not very time consuming and challenging but graded very fairly. I highly recommend this class for statistics concentrators and anyone who took Stat 110 but is wondering what else is out there. Very interesting class taught by very competent people and worth your time.","Stat 171 is a very challenging and time-consuming course, but it is graded very kindly. Professor Pillai is one of the best professors I've had at Harvard. He cares about his students so much and will do anything to help. I would definitely recommend this course if he teaches it again. Additionally, the material for this course is very useful\/cool.","Course logistics is very bad, no official homework (10 in total) solutions are given throughout the whole semester, midterm solutions (2 midterms) are not given until 2 days before the final, despite repeated requests from students. Wait till professor Kou comes back for this course, then you might actually get some consistency.","The best class so far in my 2 years here. If you love stat 110, you should definitely take this class.","The course materials are very useful for stats\/applied math majors, but do not take this course if they don't change how they teach. You might be better off find a good book and self-teach the material.","Outstanding course.  Really interesting material, and Prof. Pillai finds some really interesting applications for it.  Psets and exams are instructive and help to increase understanding of the material.  Quite possibly my favorite course I've taken.","Some fairly interesting stuff. Definitely builds a nice bridge to more advanced topics in probability theoryâ€¦Don't expect to learn what an SDE is though even if the course description says so..."]}},"mostRecentQ":{"overall":"3.60","workload":"3.00","difficulty":"3.50","recommendation":"3.70","enrollment":"42","response rate":"80.95","QCourseOverall":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"3","2s":"3","3s":"8","4s":"11","5s":"9"},"QDifficulty":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"3","3s":"11","4s":"13","5s":"5"},"QWorkload":{"number":"STAT 171","course_id":"4842","cat_num":"4180","1s":"1","2s":"8","3s":"15","4s":"7","5s":"2"}},"success":true}