{"scores":{"Fall '10":{"course_score":{"overall":"4.28","workload":"1.84","difficulty":"3.33","recommendation":"4.24","enrollment":"87","response rate":"96.55","QCourseOverall":{"number":"SOC-WORLD 41","course_id":"2054","cat_num":"4278","1s":"0","2s":"1","3s":"17","4s":"22","5s":"42"},"QDifficulty":{"number":"SOC-WORLD 41","course_id":"2054","cat_num":"4278","1s":"1","2s":"6","3s":"44","4s":"27","5s":"4"},"QWorkload":{"number":"SOC-WORLD 41","course_id":"2054","cat_num":"4278","1s":"22","2s":"52","3s":"7","4s":"1","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 41","cat_num":"4278","course_id":"2054","year":"2010","term":"1","id":"6b064b2df8489d2df57fdea2678e497d","first":"Michael","last":"McCormick","InstructorOverall":"4.49","EffectiveLecturesorPresentations":"4.63","AccessibleOutsideClass":"4.63","GeneratesEnthusiasm":"4.78","FacilitatesDiscussionEncouragesParticipation":"4.47","GivesUsefulFeedback":"4.24","ReturnsAssignmentsinTimelyFashion":"4.05"}]}},"comments":{"Fall '10":{"comments":["You will learn a lot, although more about current research than medieval daily life. Professor McCormick is a great lecturer and his enthusiasm is contagious. The course is a fair amount of work.","This is an excellent course. You will learn a lot, and you will be happy to wake up and go to lecture every morning. That being said, it is a lot of work--definitely more than I expected.","the class offers a range of perspectives on history and demonstrates well that history is a constantly evolving field. the papers, the teaching staff, and the incorporation of information from fields ranging from biology to literature to architecture to archaeology really made this course show off the potential of history as a subject matter.","Professor McCormick had incredible lectures for this course. However, be warned that this course demands a lot of work and has very high expectations.","Hardest Gen-Ed ever. McCormick is amazing and literally gets to know the entire class by the end personally. The TFs are the best anywhere. McCormick makes medieval Europe awesome. But be prepared to work for your grade and be continually disappointed by it.","Definite grade deflation, but don't let that stop you. The lectures are great - McCormick really knows and loves what he's talking about - and you'll leave each day excited about history. I'm a science concentrator, so history isn't something I do for fun, but this class does a very good job of speaking to a wide audience.","Professor McCormick's survey course provides a very engaging and groundbreaking examination of medieval history from the collapse of the Roman Empire to the novel aspirations of European navigators broadening their horizons at the advent of the Renaissance.  You're likely to learn much that you never would have expected about the origins of the modern age, of the Western civil and cultural traditions rooted in the years inappropriately labeled the \"Dark Ages.\"","The professor is fun and engaging and the course material is important to understanding both European history and many of today's social, political and economic institutions.","Interesting material, fantastic professor. Exams emphasize IDs - aka tiny details mentioned in lecture (so attendance is a must). This course is amazing but graded hard.","Professor McCormick gives great lectures.  He's very enthusiastic about whatever he's talking about, and the final paper was due before reading period started, which actually eliminated some stress for me because it was one less thing to worry about.  The reading material over the course of the term is pretty light, and they give you enough time to do the pre-paper and the final paper.  I signed up for this on a whim, and it turned out to be my favorite class this term, so I highly recommend it.","This was my favorite class of the semester. The lectures are fantastic, although rushed, but you definitely need to go to them since most of the information comes from them. The teaching staff is very friendly and has put a lot of energy into designing the course. Professor McCormick really wants to get to know students and tries to learn everyone's name. If you are considering majoring in history this may tip the scales, but I also think it would be enjoyable for anyone.","Only take this class if you have a real interest in history. It's a good class, but not an easy way to fulfill a requirement. The section TFs are pretty good and McCormick is great, if you can make his office hours. Be pro-active about your final paper from the beginning.","TAKE IT","The course itself is a great experience. Professor McCormick is one of the very best, albeit zaniest, lecturers at Harvard. His commitment to getting to know the students is also very appreciated.","This is a good class for concentrators, people needing to fulfill or core, or those just interested in the topic. It is very comprehensive.","A pleasure for any history-lover. You cover a lot of information, work quickly but thoroughly, and have a lot of opportunities for intense discussion and analysis. The lectures are an entertainment in and of themselves (although you'll sink if you can't take fast, efficient notes) and the sections exciting and challenging. But you have to be very self-motivated to do well, as there isn't a lot of guidance of assignments and you can easily sink to the back of a section discussion if you're too quiet. A lot of fun and a lot of information.","This course provides an in-depth analysis of the way civilization grew and changed in Western Europe over the course of a millenium, in a manner that encourages students to consider a variety of perspectives, as well as to put themselves in the position of the people who lived at the time being studied. It is taught with enthusiasm and has a very beautiful way of tracing how we know what we know about the events that occurred and their effect on the continent and our current civilization.","It is a great class to take, but with a final and a term paper, the work load can get a little much towards the end.","A great course that makes for an elective (make sure you take it pass\/fail). It would make a difficult requirement.","This class is a broad introduction to European history from roughly 250-1500, focusing mostly on modern-day France and Germany, but also touching on England, the Byzantine Empire, Italy, the Scandinavian countries, Spain, and eastern Europe. The course covers a wide range of topics from traditional politics and economics to disease and ecological factors. McCormick is really one of a kind and is incredibly enthusiastic about the course (some of his lectures sound like movie trailers). He really goes above and beyond to meet students and plan activities for the course, although some aren't fully communicated well ahead of time. The TFs are also great. Overall, a solid, interesting, survey history course.","Prof. McCormick is a great lecturer and you will love the atypical approach that he uses in lecture with a lot of scientific archaeology being included to present what we are learning from the cutting edge in history. In addition, Chris Gilbert is a great TF who makes section fun and engaging for all involved instead of wastes of times like in other Harvard classes. Finally, in all honesty, it's actually not very challenging, especially for anyone with even the remotest interest in history, so it's a great Gen Ed class in case you ever want to balance out your schedule's workload.","This course requires a lot of work, but it's worth every moment. The lectures are fascinating, especially because they talk about archaeology, pathology--all those ways we have to find out about history--in addition to history itself. And the exams, while on the difficult side, are strangely satisfying--at the end, you feel like you have the whole scope of medieval history firmly in hand.","This course is great if you're interested in Medieval Europe. Don't take it if you want an easy Gen Ed. This course is a lot work, but it's rewarding.","This is a really interesting course, and it teaches you a lot about not only medieval Europe but also the historical method, primary source analysis, and archeological practices. For the most part it's not very demanding, but the exams and research paper can be surprisingly difficult, especially given the more laid-back, informative atmosphere of the rest of the class, so spend a lot of time preparing for those.","Be prepared. It's fast and furious, albeit extremely interesting and well done. Professor McCormick is dynamic and fun, but he goes through the information very quickly and expects you to retain a lot of details.","This class is great for a general education course. There is not much work and the material is straightforward. You will not be up for hours working to meet deadlines. Professor McCormick is an extremely kind man devoted to his studies and that shows in his enthusiastic lectures. The teacher staff is also very friendly and always willing to lend a hand and help you out.","Only take this course if you absolutely love\/are extremely interested in Medieval History.  Otherwise it is not worth the effort.","A great introduction to a huge stretch of time in Europe.  Professor and teaching staff really care about the class, which is refreshing.","This is a great class. You learn a lot, and McCormick knows his topic well. It's fascinating to hear his perspective, especially when he brings in his own discoveries. But it goes very fast, so keep on your toes. There isn't much work until the very end, when there is a lot of work, but don't let that lull you into a false sense of security. You should be reviewing your notes all along. Also, if you can, take audio notes or consult with friends because if you're like me, you won't be able to write down nearly everything that McCormick says. He goes far too fast. Just understand that this is not an easy class. If you don't like history and need an easy Gen Ed credit, don't take this class. But if you want a fascinating, panoramic view of the Medieval period from a professor who knows his material and is active in discovering more, and if you don't mind putting a lot of work in and\/or playing Russian Roulette with your GPA, then this is the course for you.","Really great class if you're at all interested in medieval history. Professor McCormick gives engaging lectures and goes out of his way to get to know his students, which is really nice. Make sure to get an early start on the term paper so things aren't rushed in the end.","The exams are very difficult, you need to know your details extremely well. Also, the papers are graded pretty harshly.","This class is fantastic! If you're interested in medieval history. Professor McCormick is a great lecturer, and the work load is reasonable...until the term paper and final. Keep reading the assigned readings so you don't fall behind. The expectations are high, but you will enjoy this class.","This course was wonderful- McCormick's enthusiasm and clear passion for History was infectious.","Be prepared for a fantastic journey through time and space as you will be covering over one thousand years in one semester.  Never fear, though, as the professor and your TFs will no doubt help you along the way, and you will have finished the course with a twenty-page research paper and tons of new information that will absolutely be of use to you in your other academic endeavors.","I enjoyed this class, although not quite as much as I hoped I would.  Students should know that the lectures, sections, and readings are quite disconnected from each other (and their relative importance is in that order).  My advice is to make a list of term definitions and Map IDs as you go (so that you don't have to do them all right before the exam), and ideally a timeline as well, so as to keep specific facts clear in a course that often focuses more on sweeping claims about historical trends (usually with evidence drawn from archaeological and scientific finds).  And of course, talk to your TF and pick your term paper topic well in advance.  Also, if possible, have Alex More as your TF.","This is a great class to take to learn about the middle ages. If you know parts of their history well, you will get even more out of it, and if not, you'll be introduced to a wonderful period of history.  Professor McCormick is wonderful, and holds office hours after every lecture, which is an amazing opportunity to get to know a prominent professor. But it's not an easy class-there isn't much repetition-the readings, sections, and lectures all cover different materials, and they are all very important.","Professor McCormick is deceptively charming--the class isn't easy. I thought it was fun, though. You should also start figuring out your source as early as possible--I picked mine pretty much blind. I got lucky, because it was a pretty decent source, but some people did not get lucky.","It's not a bad class. The professor is engaging, and the TF's care a lot about the class. But it's a little strict for an elective.","Everything about this class was excellent!... Minus the grading scheme. Most students are fighting for a B+.","For anyone studying history (or with an interest in it), this class is essential. It covers many of the major themes and concepts of the Medieval period, showing how they changed and evolved over time. Professor McCormick frequently ties in the latest cutting edge research, often relating to archaeological discoveries, making the course quite interdisciplinary. This helps show how history is not a thing of the past but something living and evolving as our understanding of the ast changes. Though a lot of work, all the materials and assignments relate to each other and truly enhance the experience. Professor McCormick is a phenomenal lecturer, and is one of the most accessible professors at Harvard. The TFs are fantastic, and share Professor McCormick's enthusiasm.","This course was neither a rigorous analysis of history, nor was it well-taught.  The professor speaks loudly and quickly, where 90% of his effort is spent on creating a dramatic effect and only the remaining 10% on actually teaching us the material.  Many people say they like the lectures because of it, but if you want a class in which you actually learn European history objectively and analytically, do not take this class.","McCormick growls during lecture, presumably to wake up dozing students. He's fond of making up etymologies and always wears one pant leg hiked up. Take this class pass-fail if you want to enjoy it. Otherwise you'll end up agonizing the strict grading and your ever-worsening GPA.","That it is a great experience, and will help them to learn how to read primary sources.","One should be prepared to read a lot and digest a great deal of information.","This has been one of my favorite classes at Harvard. Great way to introduce you to history. McCormick is so enthusiastic and his lectures are engaging and fun. Most dedicated and knowledgeable TFs I've ever had.","I can only 'recommend with reservations' because this class is not the average gen ed. The workload in general isn't taxing, but both the midterm and the final were flat-out difficult, and the term paper is unexpected for a gen ed class. The class overall is enjoyable, but be forewarned about its requirements...","This class is a great introduction both to Medieval History and History at Harvard!","Amazing lecture, worth taking the course alone for. Every week, McCormick was dynamic and interesting. Section is good, depending on your TF.","the course is very interesting and mccormick is great, but the tests are messed up.  they test you on obscure information that he may have mentioned for one minute in one of the lectures, just to see how well you have memorized your notes.  in no part of the course did i see an emphasis on the \"big picture,\" which is how i think a history course should be structured.  be willing to memorize everything (even the things you dont care about and will immediately forget following the course) or suffer a bad grade.","Professor McCormick is amazing and you should definitely take one (or more) of his classes during your time at Harvard if you have any interest in history. This course is more of a survey than some of his other classes but I really enjoyed it. It's very little work during most of the semester, but they have very strict grading standards for exams and papers. Be prepared to work extremely hard on your papers.","This class is an excellent GenEd; very very fascinating, and really offered insight into the field of history as well.  The lectures were all memorable, and covered a diversity of topics, even ranging into the current questions of history today. \r\nThe workload is certainly manageable; lecture attendance is probably the key factor.  Keep in mind that all of the work\/points occurs in the final 2 weeks of the course.","This course is a great way to get a broad overview of medieval Europe, if you aren't as familiar with the time period as you'd like (which I wasn't). It's also a great way to learn how better to wring information out of historical documents, which is always an enjoyable exercise.","This class will definitely challenge any preconceived notions you may have have about the Middle Ages. Professor McCormick is a very enthusiastic lecturer, but sometimes it's easy to get lost in the theatricals. The class had a lot of reading and a final 15-20 page paper at the end, but I enjoyed analyzing the primary source because it was something I was actually interested in. That said, there is a lot of information to memorize and grading is a bit harsh. Furthermore, I realized a little too late that I'm not as into the Middle Ages as I thought I would be, so sometimes I really didn't enjoy it. My lack of overall enthusiasm for the material and the harsh grading made me somewhat regret taking this. However, if you absolutely love the Middle Ages and are willing to put in a lot of work (going to office hours regularly, doing all the readings, etc), you'll definitely get a lot out of it.","This course covers really neat material taught by a brilliant professor. It is, however, a fair bit of work (term paper closely followed by final exam) and lectures are sometimes confusing to follow. TFs are awesome and knowledgeable.","Definitely doesn't pull punches; only take this as a core or gen ed if you really want to delve into history. Expect to work hard- it's one of the more challenging distribution classes available. But if you do put in the work, it pays off in a fascinating coverage of the middle ages."]}},"mostRecentQ":{"overall":"4.28","workload":"1.84","difficulty":"3.33","recommendation":"4.24","enrollment":"87","response rate":"96.55","QCourseOverall":{"number":"SOC-WORLD 41","course_id":"2054","cat_num":"4278","1s":"0","2s":"1","3s":"17","4s":"22","5s":"42"},"QDifficulty":{"number":"SOC-WORLD 41","course_id":"2054","cat_num":"4278","1s":"1","2s":"6","3s":"44","4s":"27","5s":"4"},"QWorkload":{"number":"SOC-WORLD 41","course_id":"2054","cat_num":"4278","1s":"22","2s":"52","3s":"7","4s":"1","5s":"0"}},"success":true}