{"scores":{"Spring '13":{"course_score":{"overall":"4.25","workload":"2.75","difficulty":"3.75","recommendation":"4.25","enrollment":"5","response rate":"80.00","QCourseOverall":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"2","4s":"1","5s":"1"},"QWorkload":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"}}}},"comments":{"Spring '13":{"comments":["Efe is very good at making Turkish come to life in the sense that he will tell you when you sound like an Ottoman merchant using a certain grammatical construction that is \"correct\" but not ever used now. If you want to learn how people actually speak and read interesting contemporary fiction and poetry in Turkish with someone who is an active participant in the Turkish literary scene, this course is great.  I can assume that if you've invested the time to learn this much about the Turkish language already, you won't be surprised by much, but this is an entirely likable course that draws critical, dedicated students.  Regardless of the occasional exasperation of our ever-higher-standards-seeking instructor, the level of discussion in the class was always extremely high, both for an advanced foreign language course that is not a European language, and for classes in general. If Efe is your Turkish literary and cultural shepherd, it may be occasionally disorganized but it will never be dull.","This class is demanding in ways that are not always recognized; without a formal curriculum it's easy to feel like you're not seeing personal improvement. It is also somewhat disorganized but you will come out of it having learned."]}},"mostRecentQ":{"overall":"4.25","workload":"2.75","difficulty":"3.75","recommendation":"4.25","enrollment":"5","response rate":"80.00","QCourseOverall":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"0","3s":"2","4s":"1","5s":"1"},"QWorkload":{"number":"TURKISH 130b","course_id":"5322","cat_num":"4354","1s":"0","2s":"1","3s":"3","4s":"0","5s":"0"}},"success":true}