{"scores":{"Spring '14":{"course_score":{"overall":"2.80","workload":"2.20","difficulty":"2.80","recommendation":"3.00","enrollment":"35","response rate":"68.57","QCourseOverall":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"3","2s":"6","3s":"8","4s":"6","5s":"1"},"QDifficulty":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"0","2s":"8","3s":"14","4s":"2","5s":"0"},"QWorkload":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"2","2s":"17","3s":"4","4s":"1","5s":"0"}},"instructor_scores":[{"number":"APMTH 120","cat_num":"4378","course_id":"1123","year":"2013","term":"2","id":"2add28de1f08ae4b2d4f2d0bb3187122","first":" Avi","last":"Shapiro","InstructorOverall":"2.50","EffectiveLecturesorPresentations":"2.30","AccessibleOutsideClass":"3.40","GeneratesEnthusiasm":"2.70","FacilitatesDiscussionEncouragesParticipation":"2.50","GivesUsefulFeedback":"2.40","ReturnsAssignmentsinTimelyFashion":"3.20"}]},"Spring '13":{"course_score":{"overall":"3.00","workload":"2.11","difficulty":"2.89","recommendation":"2.78","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"3","2s":"6","3s":"8","4s":"6","5s":"1"},"QDifficulty":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"0","2s":"8","3s":"14","4s":"2","5s":"0"},"QWorkload":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"2","2s":"17","3s":"4","4s":"1","5s":"0"}},"instructor_scores":[{"number":"APMTH 120","cat_num":"4378","course_id":"1123","year":"2012","term":"2","id":"ab8407c04815d5cc75e496a62d13b31b","first":" H.T.","last":"Kung","InstructorOverall":"2.89","EffectiveLecturesorPresentations":"2.56","AccessibleOutsideClass":"2.71","GeneratesEnthusiasm":"3.22","FacilitatesDiscussionEncouragesParticipation":"2.71","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '12":{"course_score":{"overall":"3.92","workload":"2.28","difficulty":"2.55","recommendation":"4.03","enrollment":"70","response rate":"92.86","QCourseOverall":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"3","2s":"6","3s":"8","4s":"6","5s":"1"},"QDifficulty":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"0","2s":"8","3s":"14","4s":"2","5s":"0"},"QWorkload":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"2","2s":"17","3s":"4","4s":"1","5s":"0"}},"instructor_scores":[{"number":"APMTH 120","cat_num":"4378","course_id":"1123","year":"2012","term":"1","id":"a4786bc84105be1d45f190cff03ac766","first":"Mauricio","last":"Santillana","InstructorOverall":"4.27","EffectiveLecturesorPresentations":"4.11","AccessibleOutsideClass":"4.62","GeneratesEnthusiasm":"4.39","FacilitatesDiscussionEncouragesParticipation":"4.39","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '11":{"course_score":{"overall":"4.47","workload":"2.68","difficulty":"3.00","recommendation":"4.58","enrollment":"23","response rate":"82.61","QCourseOverall":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"3","2s":"6","3s":"8","4s":"6","5s":"1"},"QDifficulty":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"0","2s":"8","3s":"14","4s":"2","5s":"0"},"QWorkload":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"2","2s":"17","3s":"4","4s":"1","5s":"0"}},"instructor_scores":[{"number":"APMTH 120","cat_num":"4378","course_id":"1123","year":"2011","term":"1","id":"a4786bc84105be1d45f190cff03ac766","first":"Mauricio","last":"Santillana","InstructorOverall":"4.84","EffectiveLecturesorPresentations":"4.68","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.89","FacilitatesDiscussionEncouragesParticipation":"4.89","GivesUsefulFeedback":"4.55","ReturnsAssignmentsinTimelyFashion":"4.75"}]},"Spring '11":{"course_score":{"overall":"3.64","workload":"2.36","difficulty":"2.91","recommendation":"3.64","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"3","2s":"6","3s":"8","4s":"6","5s":"1"},"QDifficulty":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"0","2s":"8","3s":"14","4s":"2","5s":"0"},"QWorkload":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"2","2s":"17","3s":"4","4s":"1","5s":"0"}},"instructor_scores":[{"number":"APMTH 120","cat_num":"4378","course_id":"1123","year":"2010","term":"2","id":"ab8407c04815d5cc75e496a62d13b31b","first":"H.T.","last":"Kung","InstructorOverall":"3.91","EffectiveLecturesorPresentations":"3.36","AccessibleOutsideClass":"4.12","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.25"}]},"Fall '09":{"course_score":{"overall":"2.45","workload":"3.73","difficulty":"4.18","recommendation":"2.27","enrollment":"12","response rate":"91.67","QCourseOverall":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"3","2s":"6","3s":"8","4s":"6","5s":"1"},"QDifficulty":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"0","2s":"8","3s":"14","4s":"2","5s":"0"},"QWorkload":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"2","2s":"17","3s":"4","4s":"1","5s":"0"}},"instructor_scores":[{"number":"APMTH 120","cat_num":"4378","course_id":"1123","year":"2009","term":"1","id":"e5cdffc3915e4ec58b506c86fdd59a4c","first":"Donald G.M.","last":"Anderson","InstructorOverall":"3.09","EffectiveLecturesorPresentations":"3.45","AccessibleOutsideClass":"4.09","GeneratesEnthusiasm":"3.20","FacilitatesDiscussionEncouragesParticipation":"2.17","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.67"}]},"Fall '07":{"course_score":{"overall":"3.75","workload":"3.00","difficulty":"4.50","recommendation":"3.50","enrollment":"9","response rate":"44.44","QCourseOverall":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"3","2s":"6","3s":"8","4s":"6","5s":"1"},"QDifficulty":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"0","2s":"8","3s":"14","4s":"2","5s":"0"},"QWorkload":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"2","2s":"17","3s":"4","4s":"1","5s":"0"}},"instructor_scores":[{"number":"APMTH 120","cat_num":"4378","course_id":"1123","year":"2007","term":"1","id":"e5cdffc3915e4ec58b506c86fdd59a4c","first":"Donald G.M.","last":"Anderson","InstructorOverall":"3.75","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"3.25","FacilitatesDiscussionEncouragesParticipation":"3.33","GivesUsefulFeedback":"4.25","ReturnsAssignmentsinTimelyFashion":"4.75"}]}},"comments":{"Fall '07":{"comments":["It's not immediately clear how this class is \"applicable,\" but you figure it out eventually.","I would only recommend this course only if someone loves linear algebra and has taken at least Math 23b.","The problem sets can seem somewhat difficult, and since students are given over two weeks to complete each one, the timeline inevitably leads to procrastination.  But if you can get started on the problem sets early, and take advantage of Professor Anderson's great helpfulness during office hours, then the problem sets will seem much more easy and much more interesting.","Take advantage of Professor Anderson's office hours."]},"Fall '09":{"comments":["Although the course was not terribly difficult, I didn't learn anything really. The practice doing proofs may have been helpful for future courses, but when I look back on how much I actually LEARNED in other courses, this one may have been a waste of time. It satisfied a requirement that might have been more painful with other courses, which isn't a small consideration. It was fairly boring, I have large piles of notes I'll never read again, and I have no clue what sort of grade to expect. It's pretty typical of the applied math department, sadly.","Very hard class.","Don't take it. It's boring, tedious, and miserable. It will teach you the theory behind inverting gigantic matrices, or you could just go to matlab and use the inv command. The professor's lectures are very clear, but this class doesn't teach you how to think, and the material will most likely be useless for whatever you choose to do. Also, the class gets much harder a few weeks into the semester, so don't be fooled.","The reason why this course is called applicable linear algebra will be clear at the end of the class.","I don't know, at the end of the semester, exactly what I learned.  I know I learned a lot, but I don't think I'll ever use it.  The class was difficult but not impossible, but the annoying part was that things had to be done exactly in the professor's manner, so even if something is mathematically correct, it may not be marked as correct if you don't do it in a certain way.  I would not recommend this class unless you are actually interested in learning about Turing, Cholesky, QR, etc. factorizations.  (Go look them up first and then decide...that's all we do in this course.)","Don't take this class unless you have to! It's not a fun class. The workload is not that bad, but it's not very satisfying.","Please be prepared to work hard.  Real hard."]},"Spring '11":{"comments":["The instructors are dedicated to the students learning AND loving linear algebra. They want you to have a positive experience in the course and listen to student input, which is much appreciated. The material can be interesting if you go into the course with an open mind, and the problem sets are not trivial but not also not bad or too long.","It is definitely worth taking, esp right after Math 21b.","Start problem sets early.  Use office hours.","You won't really learn much, and it's not a grade gut either. Don't be fooled by the easiness of the first few problem sets. Take another applied math or CS class instead covering material that isn't a rehash of 21b. Maybe after you've taken all of the other classes in the department, you should consider this course. Otherwise, don't bother if you want to learn new stuff.","Professor Kung is not an entertaining lecturer and try as he might to make you enthused about what you're learning, he's not very successful at doing so, so be prepared for extremely boring classes.  But if you can make it through those, this is ultimately a fairly easy way to fulfill an AM requirement.  Plus, Professor Kung is very kind and caring and the more you get to know him as the semester progresses, the more you appreciate his quirkiness.","Professor is hard to understand. Material overlaps heavily with AM21b and AM121. Don't take this course if you have taken both or equivalents.","well organized class, not difficult as far as applied math classes go, some proofs and some applications, a lot of algorithms. useful for statistics and CS applications in particular"]},"Fall '11":{"comments":["Its a great class, professor and TF really care about students' learning. Enjoyed it a lot, highly recommend it. First couple problem sets were tough but it got a lot better.","It is a good course with overlap with AM21b but still lots of new material and a good introduction to MATLAB programming. Professor Santillana was great and i definitely recommend the course if he teaches it in the future!","It's easy, but you won't learn a whole ton.","This course ensures mastery of the basic concepts of linear algebra, as well as some familiarity with specific applications. Mauricio runs the course well and gives a lot of individual attention, which creates a great experience as long as the course size is small.","Not very demanding","Mauricio is possibly the best lecturer I have had at Harvard. He knew every student in the class and addressed the lecture towards the students as if he were having a conversation with each and every individual student, all the while being informative and hilarious.","This class was really great this year!  The professor this year was amazing and made the class really fun!  I really re-learned a lot of linear algebra, and learned some cool new applications.","Interesting class, great teacher, decent amount of work, you do learn quite a bit, important to show up to lecture","Excellent course!  Very practical, not 100% sure where I'll use it later though...","Mauricio is a superb professor.  Lectures are very effective and the final project is a real treat.  Nice change of pace from papers and cramming for exams.","Really great course depending on who teaches it; in this case, Mauricio's attention really made the class a blast in the end.","Its a good class and Professor Santillana is great, particularly one-on-one when it comes to the final project. Some of the lectures are a bit scattered and\/or repetitive, but the material is interesting and manageable if you attend class regularly. Problem sets can be tough, but on the whole are fair. The final project was my favorite part because I got to explore a topic I was interested in and got a good deal of guidance from the professor. I would say this is a relatively (notice relatively) laid back math class as far as math classes go.","A fine class. Mauricio did a great job with it.","Professor Santillana is great -- He teaches well, and enjoys being a teacher.  Linear algebra is also extremely powerful, and definitely worth learning well.","This is a math class that does a great job of connecting abstract mathematical concepts with real-world applications. If more interested in how math can be useful in society as opposed to robust proofs and calculations, this is a great class."]},"Fall '12":{"comments":["This course will teach you some important large-scale concepts in applied liner algebra and with using MATLAB and data; however, I felt this class could have covered a good deal more material. Also, The final project is very interesting (even if you think you've chosen a boring topic, as our group did), so start working on it well before the deadline. You'll enjoy it more.","The class isn't incredibly difficult, and you might not get a lot out of it.","Prof. Santillana is awesome, and this class is perfect for people who are looking for a little bit of theory and a lot of practical explanations on actually -doing- the math on real problems.","Make sure to seek help in understanding coding if matlab is a problem.","If you're coming from a class like Math 23, this will be a breeze. Midterm is a snap, final project is what you make of it. Not sure how much I got out of the class in terms of math, but it was still worth it for how well I've learned to use matlab!","Some overlap with AM 21b. Dedicated teaching staff.","Just be careful about the CUE Guide making this course seem easier than it really is.  It's not as easy as it sounds.  Some of the first psets are honestly brutal.  Then there are incredibly easy ones midway through the semester.  It's seems hard for them to find a balance between that in this course.  The project ended being a pain, but I got a ton out of it.  That being said, Mauricio is an awesome professor!  He cares about the students a lot.  He'll learn all of your names and then sometimes cold call you in class.  It can be scary, but he's probably the least scary guy that could be doing it.  Finally, the midterm was pretty much a joke, so don't expect anything of a challenge from that.  Overall though, this class does push you at times and offers more than what you might think at first.  Take this class because it's moderately easy, not because you think it's going to be a breeze.","If you're looking for an easy applied math class, this is the one. But the class is poorly-organized, with disappointingly little time devoted to actual \"applications\" of linear algebra. Most of it is largely a recap of math\/applied math 21b principles.","The entire course sort of felt like a build up to singular value decomposition, so if you already knew what that was, it was a bit slow. But Mauricio is awesome and fun to listen to","This is a fantastic course... Mauricio is a great lecturer and the course material is a perfect combination of theory and practice (and great background for an applied math thesis). Definitely take this class.","Not super demanding, nice professor and TF's, and interesting material.","tedious homework, but easy overall","If you are mostly interested in the algorithms of linear algebra, rather than the theory, this is a useful course to take.","This is a good course. The material isn't too hard, but it's presented pretty well. Mauricio is an entertaining lecturer. This class was also more computer-science focused than I expected.","The entire class is a joke. The average on the midterm was around (and possibly above) 100%.","Prof Santillana is awesome! He really cares about his students (and memorizes all 80 or so of their names).  Some knowledge of Matlab will make your life easier, but it is not required.  Even if you weren't terrible comfortable with 21b, Prof Santillana teaches in a way that you will get it.  If you took 23a or above and did well, you may find this course repetitive.","This is a fair class. If you have significant experience with linear algebra, this class will not be too difficult.","Mauricio is a good lecturer. Material is understandable.","Not a very difficult course, but useful for science, engineering and economics. MATLAB is pretty well taught, and definitely useful for any academic discipline.","Take it if you have already done 21b and you wanna do lots of exploration of the concepts in Matlab and through a final project.","Make sure you know how to code or have a friend who knows how to code","At least when I took it, it was easy and a bit time-consuming. Mauricio is great and made lecture quite enjoyable. He was very helpful with the problem sets and final project.","Great course!  Take it - Mauricio is a fantastic teacher.","you'll get most out of the course by paying attention to the applications of the linear algebra techniques (the techniques themselves are pretty easy to grasp)","This is a great linear algebra class. Mauricio is an amazing professor, and makes things very clear and is very, very receptive to questions during class. The final project is a cool way of applying what you've learned to some topic that interests you.","Great class, sometimes pacing could be better, but project is rewarding and class is not super stressful","great course, semi-tough psets, definitely come to lecture because that's where all the material comes from. mauricio is a great lecturer","great class for reviewing or learning linear algebra.  however the class does not cover everything on the syllabus (ie: diff eq) or leaves it as a homework problem.  also, comfort with programming\/matlab beforehand helps.\r\n\r\nthe final project (AM 120 Fair) is great.  definitely better than taking a final exam.  it balances out the tedium that is linear algebra.  working on an interesting project that could lead to further research opportunities is invaluable.","AM 120 is a great course because it equips you with the tools of linear algebra. It doesn't cover a ton of material but it goes in depth and takes a computational approach to problem solving, which is very pertinent due to the prevalence of computing software.","Good class to take your junior year. The final project is a good way to start exploring topics for your thesis.","The course was easy, but don't expect much beyond the level of Math 21b. The pace is very slow, and very little happens in each lecture. Tolerable as a requirement, if only because it's easy, but definitely not as an elective -- one could learn everything beyond 21b in about an hour by reading a textbook.","I didn't think it was possible to take a class in which you learn absolutely NOTHING you wouldn't already know from a previous class. this class is a dumbed down version of math21b, which is supposed to be a prerequisite (???). waste of your time. avoid avoid avoid","Mauricio is a cool guy but he really does troll in a lot of his lectures so watch out for that. I don't think this course is very applied but if you enjoy generally learning about linear algebra this may be the course for you. Additionally, its nice to do a final project and not have to take a final exam.","The class can be a little unclear sometimes, but Mauricio is the best!","AM120 was a great experience. Do not let anyone fool you though, this course is a lot of work. The problem sets take at least 10 hours, and the final project is definitely a very time-consuming undertaking. That said, I believe the work was worth it - Mauricio is fantastic, and lectures, while very far at 60 Div, are fun; the TFs are all extremely helpful. You will come away with a lot if you devote to this class. Linear algebra is extremely interesting, and while seemingly abstract, it has an extremely wide variety of applications. Take it!","Relatively easy and light workload. Final project takes up a decent amount of time, but can be fun and rewarding if you put good effort into it.","This course was amazing. You learn a lot about the subject, but at the time the course is low-stress. If you enjoy doing math problem sets that aren't insanely hard and don't make you want to cry, you'll really enjoy the course. Be prepared to use Matlab, but if you have difficulty with it, Mauricio and the TFs are a lot of help.  Mauricio is one of the most caring teachers I've ever had at Harvard. He's very invested in his students, and Harvard is definitely lucky to have him around.","This is a pretty painless applied math course. Mauricio is actually the nicest and while sometimes lectures can be a bit slow or boring he will literally do anything to help you out, understands any sort of difficult personal\/health situation, and really does care more than most teachers. To be honest, I missed at least 60% of lecture and as long as you have notes you're totally fine. Only one pset is really bad and the others are probably shorter than most AM psets. Take it, hopefully it won't be in 60 oxford street next year!","This is a great class! the Prof is great with walking you through the concepts in a thorough yet entertaining fashion and the final product at the end of the course also teaches you a lot!","Very reasonable.  Almost too reasonable... not much in terms of theory & proofs on the homework (which I was happy about), and whatever there was was manageable.  Prof. Santillana is hilarious, accessible, helpful, and understanding, and the other teaching staff were great too.","It's a great way to fulfill gened or concentration requirements. The class material is not too difficult and if you put in some time, you'll be fine in the class. Also Mauricio and the TFs have many OHs and sections for those who need extra help.","Good class for general interest in applying linear algebra to interesting problems.","Wonderful class-- I learned so many real-life math skills in a fairly stress-free environment. Mauricio is an amazing teacher and you should make an effort to get to know him. This was one of my favorite classes at Harvard and I'm not even a math\/applied math concentrator."]},"Spring '13":{"comments":["This is probably THE worst class I have taken at Harvard. This math class was incredibly unorganized, unprofessional, and I did not learn one bit. There was no section component, the homework did not prepare me for the exams, there were no practice problems for the exam, and lectures were extremely boring and difficult to understand. I hear the fall version of this class is better, so take that instead.","One of the few applied math classes that is offered in a small seminar setting rather than a boring lecture. Professor Kung is super engaging and funny. He points out every little potential application to the relevant materials we are learning. He also draws a lot of insights from CS because he is a guru in the field. Michael is a super friendly TF who answers your questions promptly. Take this class. It is one of the few AM experiences you will have at Harvard.","Prof. Kung is a very nice and smart guy. I think he would be better in lecture if we brushed up on the material a bit more. He is sometimes unorganized in the presentation of the material. The text was mostly ignored.","Good course and the instructors clearly care about the subject matter. However, don't expect anything profoundly different than the textbook.","This is mostly a repeat of basic linear algebra, so, if you have already taken a course in linear algebra, I would not advise taking this one. If not, the workload for this course is very light, and the class is pretty relaxed. However, the material is not taught in a very coherent way, and you are never really taught how to apply the concepts that are introduced. This results in the exams being very theoretical and impossible to study for, so, even though the workload is light, you will not necessarily do well in the class."]},"Spring '14":{"comments":["I think the course has the potential to do a lot more, but it fell short this year.  Psets were pretty straight-forward, first midterm was pretty straightforward.  However, a long time passed between first and second midterm, and it wasn't clear what the heck was on it anyhow.  The average of the first was 85, with stdev of 5, while the second had an average of ~62 with stdev of 12.\r\n\r\nThis was Avi's first year teaching the course, and I think that caused a lot of any of the frustration with the course.  There were no practice exams for either midterm, and no decent examples for the final projects, so no one really knew what was expected.  Avi's lecturing is okay; his lectures are well-organized (very, very clear lecture slides that are latexed), but sometimes it can become uninteresting when he goes on tangents; he does have an endearing personality though.","This course is a great follow-up to Math 21b. The project at the end can be extremely interesting, but start early because it will build up quickly.","If you took 21b (applied or not) and were interested in linear algebra, this is a great class to follow up with and not as complex conceptually as some other classes (like, AM105 was useful, but would definitely lose a lot of non-math people, where as if you could handle 21b and enjoyed it, you could definitely take this). If it's for a concentration requirement, it's definitely worth taking as it's interesting and not too overwhelming.  In Applied Math, it's especially useful, filling one of the breadth requirements.","Easy way to fulfill an APMTH requirement!","What happened in this class? I'm not sure I can answer that question after a semester of taking it. Avi is such an endearing person but not the most compelling teacher for this material. Problem sets often didn't match with what we learned in lecture, and lectures were sometimes rambly and questionable as Avi took a few minutes IN CLASS to figure out his own example problems. On the bright side, midterms were very straightforward and reasonable (for the most part) and the TF's were very cheerful and always willing to help. The final project was also a lot of fun, quite open-ended. Overall, this class was a decent review of Math 21b with some extra topics thrown in afterward - just expect to be confused a lot of the time.","The course overall is just a review of 21b with an extension of a few topics. That being said, is a pretty necessary one to continue further in linear algebra. The problem sets are very manageable, but the midterms are much more difficult than you expect. Avi is pretty dry as a lecturer, and Rohini is definitely a better TF than Michaela.","This is a relatively easy way to meet AM requirements. It's painfully boring at times during lecture and there aren't a lot of resources to help with preparation for the exams or to get help on the project.","It really wasn't taught well and I felt like I just spit out what I learned in 21b and didn't take much new info from this class.","This is a nice class to continue studying linear algebra after Math 21b. It is rather slow-paced and was mainly beneficial to me because I felt shaky on some 21b topics. It is in general kind of a disorganized course.","Lectures are 90 minutes, but the material could be covered in 60-- if this class is offered again check lecture length. Lecture isn't even necessary for doing well in the class because the slides are uploaded and it literally takes 30 minutes to read through them. the textbook is helpful but avi does not follow it in chronological order. also he gave NO preparation for the 2 exams and basically gave NO information for the final project. I found myself struggling with the final project and then everyone did poorly on both exams. avi is not approachable or helpful-- i would not take this class again, if it's a required class wait until there is a new professor teaching it although i do not think avi will teach it again next year.","Manageable but odd structure to course","Do not take this class! It was one of the worst AM classes I took at Harvard. It's incredibly boring, you don't feel like you learn anything, and it's unorganized to the point where it's unclear what the topics on the midterm will be. You don't really feel like you learn anything even if you put effort in- very frustrating class.","Avi (the instructor) makes this course something you should stay away from. He makes the material boring, gives a significant amount of busy work thinking that it will help you learn more. There is no expectation or direction for what the exams will be on other than every single topic in lecture and in the textbook. No one goes to lecture because he's so bland, and overall the class just hurts in every way that bad classes do here.","This course is a very straightforward applied math class, about equivalent to Math 21b. Excelling in this course requires reading the textbook right before exams. Lectures and section are largely irrelevant to what is covered on exams. There is also a good deal of overlap in content with Math 21b.","I have such strong negative feelings about this course solely because of Avi. The TFs are great, especially Michaela, and the material is interesting. Avi just makes the whole experience miserable.","It's a very straightforward and fair math course with the added benefit of having a final project rather than an exam. Doesn't take up a lot of time, and you get out exactly what you put into it.","The work is very manageable and the final project is a great opportunity to show what your interests are. Avi and the TFs are very nice and willing to help you in any way that they can."]}},"mostRecentQ":{"overall":"2.80","workload":"2.20","difficulty":"2.80","recommendation":"3.00","enrollment":"35","response rate":"68.57","QCourseOverall":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"3","2s":"6","3s":"8","4s":"6","5s":"1"},"QDifficulty":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"0","2s":"8","3s":"14","4s":"2","5s":"0"},"QWorkload":{"number":"APMTH 120","course_id":"1123","cat_num":"4378","1s":"2","2s":"17","3s":"4","4s":"1","5s":"0"}},"success":true}