{"scores":{"Fall '13":{"course_score":{"overall":"4.20","workload":"2.00","difficulty":"3.20","recommendation":"4.30","enrollment":"20","response rate":"95.00","QCourseOverall":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"0","3s":"3","4s":"10","5s":"6"},"QDifficulty":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"2","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"5","2s":"9","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2013","term":"1","id":"5e5f8e0c91b337ba4f1b2797daf31688","first":" Zarin Pearl","last":"Machanda","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.70","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"3.50"},{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2013","term":"1","id":"6854cc321e7b5abd5ebe58337573b282","first":" Stephanie Lynn","last":"Meredith","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"3.50"}]},"Fall '11":{"course_score":{"overall":"3.78","workload":"1.78","difficulty":"3.13","recommendation":"3.75","enrollment":"64","response rate":"93.75","QCourseOverall":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"0","3s":"3","4s":"10","5s":"6"},"QDifficulty":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"2","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"5","2s":"9","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2011","term":"1","id":"5e5f8e0c91b337ba4f1b2797daf31688","first":"Zarin Pearl","last":"Machanda","InstructorOverall":"4.59","EffectiveLecturesorPresentations":"4.62","AccessibleOutsideClass":"4.51","GeneratesEnthusiasm":"4.73","FacilitatesDiscussionEncouragesParticipation":"4.45","GivesUsefulFeedback":"4.38","ReturnsAssignmentsinTimelyFashion":"4.25"},{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2011","term":"1","id":"d6b54ba52768230b1bc2d35125b69fe2","first":"Richard W.","last":"Wrangham","InstructorOverall":"4.42","EffectiveLecturesorPresentations":"4.33","AccessibleOutsideClass":"3.98","GeneratesEnthusiasm":"4.43","FacilitatesDiscussionEncouragesParticipation":"3.93","GivesUsefulFeedback":"4.57","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '10":{"course_score":{"overall":"4.31","workload":"1.73","difficulty":"2.61","recommendation":"4.33","enrollment":"53","response rate":"92.45","QCourseOverall":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"0","3s":"3","4s":"10","5s":"6"},"QDifficulty":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"2","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"5","2s":"9","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2010","term":"1","id":"5e5f8e0c91b337ba4f1b2797daf31688","first":"Zarin Pearl","last":"Machanda","InstructorOverall":"4.75","EffectiveLecturesorPresentations":"4.73","AccessibleOutsideClass":"4.51","GeneratesEnthusiasm":"4.77","FacilitatesDiscussionEncouragesParticipation":"4.44","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.55"},{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2010","term":"1","id":"7feb5cd6e3b5a687b3ef99aeca525fd3","first":"Luke J.","last":"Matthews","InstructorOverall":"3.98","EffectiveLecturesorPresentations":"3.83","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.08","FacilitatesDiscussionEncouragesParticipation":"3.97","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"3.67"}]},"Fall '09":{"course_score":{"overall":"4.36","workload":"1.80","difficulty":"2.88","recommendation":"4.36","enrollment":"29","response rate":"86.21","QCourseOverall":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"0","3s":"3","4s":"10","5s":"6"},"QDifficulty":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"2","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"5","2s":"9","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2009","term":"1","id":"68a666527c14e00653d8a4875baccd49","first":"Ian Christopher","last":"Gilby","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.16","GeneratesEnthusiasm":"4.62","FacilitatesDiscussionEncouragesParticipation":"4.63","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.80"},{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2009","term":"1","id":"d6b54ba52768230b1bc2d35125b69fe2","first":"Richard W.","last":"Wrangham","InstructorOverall":"4.57","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.61","FacilitatesDiscussionEncouragesParticipation":"4.35","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Fall '08":{"course_score":{"overall":"4.24","workload":"2.14","difficulty":"3.33","recommendation":"4.14","enrollment":"23","response rate":"91.30","QCourseOverall":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"0","3s":"3","4s":"10","5s":"6"},"QDifficulty":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"2","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"5","2s":"9","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2008","term":"1","id":"68a666527c14e00653d8a4875baccd49","first":"Ian Christopher","last":"Gilby","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.52","AccessibleOutsideClass":"4.39","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.59","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.25"},{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2008","term":"1","id":"d6b54ba52768230b1bc2d35125b69fe2","first":"Richard W.","last":"Wrangham","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.52","AccessibleOutsideClass":"4.29","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"3.75","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '07":{"course_score":{"overall":"3.94","workload":"2.18","difficulty":"3.29","recommendation":"3.88","enrollment":"25","response rate":"68.00","QCourseOverall":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"0","3s":"3","4s":"10","5s":"6"},"QDifficulty":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"2","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"5","2s":"9","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2007","term":"1","id":"d6b54ba52768230b1bc2d35125b69fe2","first":"Richard W.","last":"Wrangham","InstructorOverall":"4.25","EffectiveLecturesorPresentations":"4.18","AccessibleOutsideClass":"3.62","GeneratesEnthusiasm":"4.29","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"2.00","ReturnsAssignmentsinTimelyFashion":"3.25"}]},"Fall '06":{"course_score":{"overall":"3.75","workload":"1.29","difficulty":"2.86","recommendation":"4.14","enrollment":"13","response rate":"61.54","QCourseOverall":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"0","3s":"3","4s":"10","5s":"6"},"QDifficulty":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"2","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"5","2s":"9","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1330","cat_num":"4332","course_id":"2723","year":"2006","term":"1","id":"3a81b58af865bcd5b926fd62c69e9e1a","first":"Alain","last":"Houle","InstructorOverall":"4.14","EffectiveLecturesorPresentations":"4.43","AccessibleOutsideClass":"3.86","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"1.83","ReturnsAssignmentsinTimelyFashion":"2.00"}]}},"comments":{"Fall '07":{"comments":["This is a great introduction into primatology and the questions that they ask.","Primate behavior is interesting, but can get repetitive, and this is a very detail-oriented class.  Be interested in the material.","if you're a HEB concentrator.","Definitely take this course if Wrangham teaches it... His knowledge and authority are unparalleled, and he's a funny and personable guy to boot.\r\n\r\nOne caution: Don't take this course if you don't want to get called out for skipping lecture or not paying attention.  I think these might be pet peeves of Prof. Wrangham's.","You'll gain a love for primates, if you didn't always possess it and if you can look beyond the details, you can learn some pretty important stuff about where our human evolution theories come from.","The material in the class is very interesting, and Professor Wrangham is knowledgable and likable. The workload is very managable, but takes some proactivity and interest in your projects. The projects teach a lot about finding interesting research questions, conducting research, and writing scientific papers.","interesting, doesnt require a lot of background knowledge, and you watch great videos!","Interesting class with funny professor","the assignments seem to have nothing to do with the material, and so exams are ridiculously difficult to prepare for.","Great course, interesting materials, enthusiastic and knowledgeable instructor, reasonable workload","I would tell them, that if they enjoy primates, it is a good class to take. It is interesting and the professor and tf are knowledgeable. The lectures aren't that exciting and are long, but there is a wide range of animals covered. It also provides an insight into research and that can be beneficial to a person in the science world.","Wrangham is the man.","Wrangham is a great professor, and the stuff you learn in the class is endlessly fascinating.","Only take it if you have to for a requirement."]},"Fall '08":{"comments":["Definitely shop it. It goes surprisingly well with a wide variety of other classes (i.e. Social Studies). I took it on a whim, and don't regret it-- I feel like it was a very solid evolutionary biology course, and primates are very cool. Great teaching staff.","little workload, very fair exams, great lecturers and engaging material","You must have a real interest in this subject matter, or you will be bored silly by the hour and half long lectures.","If you have any interest in any aspect of primatology take this class.","This is an incredible class!  Not only do you get to watch movies of monkeys giving birth and chimps hunting, you get to learn about how and why they act the way they do.","I would say that this is a good class as an HEB major. It really is the only class that focuses more on primates than humans and it is interesting to see the evolution of certain behaviors. It is also cool to learn about the different species of primates.","if you find this course topic interesting the professors and tf are very knowledgeable and can help you learn a lot in this area, they have a lot of first hand experience and are very helpful.","Take this class if you're interested in primates but be prepared to memorize the details of studies from many different articles. There is a lot of gray area and debate over primate behavior which is what makes this class so difficult.","The professors for this class are some of the best you'll find at Harvard.  Wrangham is a giant in the field, but is still personable and interesting (he's got a British accent!).  Gilby is young, energetic, fun, and smart--his views provide a nice counterpoint, which is great because this class is all about opposing theories and views anyway","even if you don't think you'd be interested in this, you probably would be after 2 lectures","Fun class!","You learn a lot  and the professors are both extremely knowledgeable and dedicated","It's good if you're interested in primates, ecology and evolution, and if you plan on doing the readings before class."]},"Fall '09":{"comments":["If you have any interest in primate behavior, this class is the definitive introduction. However, be very aware that even though this is in the Human Evolutionary Biology department, this class is about primates in general, with humans as a single instance of primate. You need a firm understanding of evolutionary theory in order to take this class.","Painless. Fun. Nice teaching staff. Interesting.","Take this course. Monkeys are cool. Ec 10 is stupid. Don't take that as your senior year elective.","this class is so representative of HEB as a concentration (read: awesome). the professors are two of the best you'll get here (so sad that prof. gilby is leaving) and if you do the work (which, why wouldn't you...it's both manageable and interesting) you will definitely learn AND do well.","Excellent class. Interesting and applicable material. I left feeling I understood so much about primate (and often human) behavior. Not too demanding, 2 midterm and one final format was nice.","It would be a great elective even if you've never taken an HEB class.  Also good for an interesting, lighter workload HEB concentration credit.","This class is pure fun, with a very interesting and important theme; it is definitely one of my most memorable classes.","This is the best class ever. I love Wrangham and Gilby. They are enthusiastic and fantastic lecturers. Take this class.","This class is really fun! You don't have to do the readings, just read your section hand-out. Also, definitely go to the lectures and take notes on what's not written on the slides so that you can prepare well for the exams.","This class made me love primates. On the other hand, this class made my roommates hate primates because I wouldn't shut up about them. Definitely take this class.","Everyone should take this course!","Even though the professors are great, this class can be a drag if you don't like the material.  So, be wary of taking it on a whim\/as an elective unless you're sure you'll like it.","this is a very straightforward class when it comes to learning factual information.","this is very well taught, and one of a kind for this subject at this school!","one of the best i've taken at Harvard","Remember to study specfic examples of every concept learned in the class and go to section."]},"Fall '10":{"comments":["This was one of my favorite classes so far!","Very fun course, more relaxed than others,great instructors.","This class is interesting and painless. It is a rare college class about how primate behavior and evolution relate to humans' daily activities.","Great class. You can tell that Zarin and Luke enjoy teaching this. Everything about it is fun and fascinating","This class is so cool!  It's interesting.","This class was very interesting, however it was deceptively difficult.","It will give you a great basis for understanding primatology, it is enjoyable but also potentially helpful for understanding human behavior as well as primates.","Go to the lectures!! This is where you get all your information for the midterms. The lecture slides don't have all the material so I highly recommend going to the lectures. They are fun and interesting. The labs are helpful for reviewing material and the whole staff for the class is very easy to contact and talk to about the material.","The class was very interesting, but you have to enjoy studying about primates for a semester!","It's not really science, but it pretends to be.  We had a whole lecture on the scientific method.  That being said, the fun facts are awesome.","Pretty easy with super amazing professors and fun sections.","You'll learn a lot of interesting things about primates that will help you in looking at humans and their behavior. It's a great, and not too difficult, class.","This class is very enjoyable and it is easy to catch up if necessary to skimp on work for a week, but don't underestimate the exams and lab write-ups.","This was definitely the highlight of my semester! If I could take this class again, I would do it in a heartbeat. Before, I didn't like primates very much, but now I feel incredibly close to them and see them through such a different perspective.\r\nThe workload was extremely manageable, you just need to spread out the readings (which are enjoyable!), do the lab assignments that same day (when you can best remember what you talked about in section), and don't forget to ask questions! The teaching staff is very willing to help you understand anything, all you need to do is make the effort to talk to them.\r\nTAKE THIS CLASS! You won't regret it. No where else on Harvard's campus will you learn about penis spines and learn how to talk to a chimp for reals!","Great class both as a concentration requirement or just as an elective. It's relatively easy, but doing the readings will actually help your understanding of the material and you'll get more out of it as a whole.","Some of the things I learned seem a bit pointless, but it was a really fun course and I was never bored! And the professors are both awesome and entertaining!","This course is fantastic. It's so much fun to talk and watch videos of primates, especially with professors who are so enthusiastic and knowledgeable about the subject.","I loved this class. It was supper fun and interesting; however, only take it if you are actually excited by the material. Otherwise, it could get frustrating.","I would tell them not to take this course unless they have a keen interest in primates and are not dissuaded by forced memorization of material of doubtful usefulness.","Take it whether you're HEB or not. Especially if you just stumbled on it, because you'll never forgive yourself if you don't. Seriously though, there's a lot to learn.","The professors are great and the material is really, really interesting! It's a fun and educational class. I definitely took a lot away from it.","you must be very interested in evolution and, if you take this class, you should be someone who enjoys drawing parallels between humans and primates.","This has been one of my favorite courses. It's amazing how differently I see humans now.","if you like animals\/monkeys\/or humans take this course!","this class was a lot of fun. it does not require much of you and the information is really interesting and easy to remember. the teachers were great","This class was definitely one of the best classes I have ever taken. The information was interesting and it was a pleasure to study for the exams.","Only take this class if you are concentrating in HEB.  Otherwise, although the material is interesting, it's pretty useless.","Very interesting HEB course, especially if you're interested in non-human primates","It was a fun class where I learned a great deal without ever feeling much pressure. I would strongly recommend it to anyone who thinks it sounds interesting.","Thoroughly enjoyed the class. Not too much work, if you attend all of the lectures and pay attention you should be pretty up to speed. The readings are helpful but you won't be nailed on details from them. A lot of fun, and a lot of cool facts. Shared tidbits with friends and roommates on a regular basis.","pretty easy, straightforward class.  don't need to do the readings","Pay attention and review the specific examples and definitions used in class!","Great course, and the professors love what they are teaching. They've all been out in the field too!"]},"Fall '11":{"comments":["Take this class if you're interested in learning about monkeys, but be aware that much of the information you will be required to know for this class probably won't be very useful long-term unless you plan to go into primate research.","The class is fascinating, teachers are great, material is comprehensive, the grading is a complete and utter mystery.","This is a great course and Zarin is an awesome professor.  However, be warned that you need to know your primate species and terminology for studying behavior to be comfortable with the concepts.","This is a fun class with interesting material. At times, it feels a  bit disorganized. We touched on many subjects and species briefly which made it hard to develop a depth of knowledge. You'll get a lot more out of the course if you do the readings.","I found this class disappointing. The material was pretty interesting and the lectures were actually quite fun. However, grading on the exams was pretty tough. The TF would take off 0.5 points on tons of questions even your answer was almost identical to the answer key. They also did not give enough time for it be possible to get full credit on the essays on the midterms. The TF herself admitted herself that she wouldn't have gotten full credit on the essay. Also the papers were frustrating. Instead of learning a lot about primates you found yourself crunching data for hours and trying to figure out how to use excel. They also didn't teach you how to use complex functions in excel until the second paper and took points off on the first paper if you didn't use complex functions on excel. It would have been far more rewarding to write a literature review instead of staring at an excel data sheet for hours. Although this class had the potential to be great, it was ruined by the assignments.","Take it! This class is my favorite class I have taken at Harvard so far. It was really interesting! Zarin and Richard were awesome and really made the class interesting! It wasn't as easy as I expected, but it definitely wasn't challenging. You don't have to do any of the readings, just pay attention in lecture (which is easy because they are awesome!) and you will be fine!","Really interesting class--I learned a lot. The exams were all unnecessarily difficult though, and they were graded harshly.","Requires a lot of independent studying -- keep detailed notes and attend every lecture to stay on top of the material. Otherwise, it's a really interesting and informative class, and a good class to take if you want a somewhat difficult HEB elective or intro class.","If you are at all interested in evolution or primates, this is the class for you.  Zarin and Richard are both fantastic lecturers, and Stephanie (who was the head TF this year) was also great.  The lab exercises are fun and interesting, and the workload isn't bad on a week to week basis.","THIS CLASS IS AWESOME.  The tests require a lot of studying and knowledge, but what your learning is so interesting that doesn't matter.  The professors are very approachable and will meet with you whenever you need to.","This class is AMAZING! Put in the necessary time, DO THE READINGS, and you will love it!","Take this class!  Exams aren't easy, but the material is awesome, and Zarin and Richard are great!!","The material is interesting but by the end of the course, the material begins to feel a bit repetitive. Also the grading on the midterms was very critical.","The class is very fun and interesting and the material is really amazing.","Form study groups to talk over the themes before tests. It really helped to cement the material. Also, make up practice essay questions based on the major hypothesis and subsequent predictions discussed in lecture.","Really fun and interesting primate course. I found myself sharing cool primate facts with my roommates all the time. Richard and Zarin are super nice. Stephanie is a tough grader, but she really pushes the students to know the material well and I find that admirable. Beware that its not a course where you are just memorizing primate facts. Tests are all on synthesizing theories\/hypothesis with primate evidence.","I did not want to take a primate course; however, this class surprised me in many ways. Understanding primate behavior reveals so much about human behavior. The material is just constantly interesting. At the same time, the readings are manageable and the professors are fantastic. They are also very accessible and love to help. Take it.","This class is not easy. Stay on top of the material because the lectures get jumbled together and it is easy to mix up the different species of primates.","The staff is great and you can tell they enjoy their work. However the material can get kind of boring so beware. This class was also a lot more work than I expected as there are a lot of stuff to remember.","Loads of fun. Every one was jealous when I talked about how awesome this class was and the cool labs and trip in this class.","Richard and Zarin are both great lecturers. If you like learning cool bits of trivia about primates, this is a good class to take.","They grade the midterms extremely hard. You will memorize so many facts about all of the major primates. This is not an easy class. I repeat, this is NOT an easy class. The labs are AMAZING, especially when you get to observe the gorillas at the Franklin Park Zoo.","Great class. the tf was a hard grader so it was a little harder than I expected.","So monkeys are great and we watched some awesome movies and did some cool labs.  However, when exam time came around, we realized how poorly organized everything was, and how we actually had to go back and weed out all the relevant material from the overcrowded lecture slides on our own.  Also, for the two midterms we had an essay question where we had to basically spit back as much as we possibly could about a particular topic, which was pretty ridiculous (luckily they figured that out and nixed it for the final).  Anyway, it's a fun class (if they figure out how to make the exams less stressful) (and never, ever schedule it mon\/wed\/fri at 10 am in NW labs again), and I recommend it if you are into monkeys or are considering that side of HEB.  As an elective, it's not for everyone - because they barely apply the material to humans, it's not the most useful stuff unless you're going to study monkeys.","I took this course because I had heard it was a fun and interesting course, but there were several changes in the course that occurred this year. Be sure to check what changes have been made to the examination structure before making a judgement on this course.","This course started out being quite enjoyable however, towards the end of the course the material became rather circular and boring. The exams were very difficult to study for and often took me by surprise despite hours of studying and a generally confidant feeling going into them. The head TF was very unpleasant and made the course much less enjoyable than it should have been.","I thought this course would be really cool - and it was, for the first month. Then the novelty wore off and I was left frustrated by the disorganized presentation of ideas and disillusioned by the fact that it was in NORTHWEST LABS (far!)...so I kind of stopped attending lecture, which was probably a mistake. Yes, it definitely was. But my other HEB class was so much better organized and more interesting! I wish we'd learned less disjointed information, though I suppose that's kind of inherent in this subject matter.","Primate Social Behavior is a great introduction to social behavior theory and ecological theory as applied to primates. The teaching staff is phenomenal, and as Professor Wrangham essentially came up with half of the concepts we learned about, it was an amazing opportunity to interact with people very much invested in primatology. I think that this class is best for HEB concentrators, but section and lecture were fun enough to take it as an elective. Primates are surprisingly complicated socially and very interesting to study. The exams were graded fairly harshly, so in-depth studying and a really solid grasp on the concepts and how to apply them is a must.","Get ready to *enjoy* coming to lecture... You will not regret taking this class!","Always a pleasure to learn about monkeys in an academic manner.","This class is more difficult than you would expect. They grade the exams really hard. It is an interesting course, but it really is all about monkeys so if that's not something that interests you then don't take it. It is not a lot of work on a weekly basis but the exams are tough.","Don't take this class unless you're exceptionally interested in the subject area. It seems deceptively easy, and even though the lectures are good, the exams are extremely hard and the labs take a lot of time to complete and aren't worth enough points.","This class is really fun.  You do really have to study a lot for the exams, though.  Definitely read all of the readings- they can actually be very helpful.  Lectures are awesome and the professors are wonderful.  Overall, a great class.","If you are interested in non-human primates, this is a great class to take. Richard and Zarin are great people and lecturers, which makes class fun to go to. I had a hard time with the class because it is a LOT of memorization and if you aren't interested in monkeys, apes, etc. then it can get pretty tedious and not seem applicable. I thought the course would relate primate behavior to human behavior more, but most of the class is strictly focused on non-human primate species and their behavior.","This was one of those classes that pretends to be concept-based, but is really detail-oriented and memorization-based. If you knew the details but not the concepts, you would do a lot better than if you knew the concepts but not the details. As I learned.","You have to REALLY want to learn about monkeys!!!","Stephanie is an incredibly tough grader, don't be too surprised by the midterms\/assignments.  Not as good of a class as it would seem unless you are REALLY interested in monkeys (which, honestly, you probably aren't)","Make sure you like learning about monkeys and apes.  There are connections to humans but not that much.  VERY WELL TAUGHT...excellent teaching staff.  THIS CLASS IS NOT A JOKE!  They completely changed structure of the coures so that it is harder now.  The exams are actually pretty difficult and you have to spend a lot of time on lab assignments.  But readings are pretty interesting and did feel like I got a lot out of the course from an evolutionary perspective.","The class was a lot of fun, but the exams were brutal.","Only take this course if you are strongly interested in primates. By the end of the semester you will have been exposed to a significant amount of information."]},"Fall '13":{"comments":["This course is a good way to get introduced to the world of primates. I would definitely recommend it to anyone who has a serious interest in non-human primates. Too everyone else, make sure you understand what you are getting yourself into when you sign up for this. The section assignments are fun and interesting, and the lectures are informative. If you go to the lectures and keep up with the material, you should have no problem.","For an overview of primates as social animals, I imagine it would be hard to beat this course unless you took it in the Costa Rican jungle.","A fun, informative peak at the behavior of primates. If you like animal behavior, or want to get a general look at where humans likely came from, it's useful and engaging.","You will have great dinner conversations!","This course is a lot of fun, in large measure because of the enthusiasm that all of the teaching staff have for primates! The professors have so much knowledge about the primates that they study (chimpanzees for Prof. Machanda and lemurs for Prof. Meredith), and it is really amazing to hear about their field experiences. Lectures are very interesting and full of information. It can be a little overwhelming going through everything in preparation for the exams, but it is presented very well and the slides are easy to understand when you go back and review. Unlike previous courses that I have taken which have dealt with primate behavior, most of the information presented in lectures was directly drawn from graphs or data. So, in addition to all the interesting facts that you learn about primate social behavior, you get good at reading graphs and analyzing them for yourself.Most of the labs were really fun (especially the field trip to the Franklin Park Zoo to study the gorillas), though most of them or more like activities or demonstrations. They're a good supplement to the lectures, though, and a good break from more intense or boring labs if those are a part of your schedule. I'd highly recommend this course to anyone who is interested in learning more about primates!","This class is one of my favorite classes I've taken here. I was freaked out a bit by the q scores from last year but I think the teaching staff really took those to heart and made the midterm and final a lot more fair. Every lecture was so much fun, and although I'm pretty positive I don't want to be a primatologist, the enthusiasm for primates, behavior, and the scientific method were contagious. Super helpful and supportive staff. Take this class!","This is a fun class! It's a lot about primates, but it's mostly presented in a fun and engaging way. The professors really love what they do and they're all fun people, which makes the class very enjoyable. The reading is interesting... but you really don't have to kill yourself to do it all (or very much at all, actually). You get to take a trip to the zoo, which is really fun.","Don't just take it to fulfill the behavior requirement. You have to actually be pretty interested in behavior to enjoy the class.","This course is an enormous amount of memorization.  If you know that you will never become a primatologist and this course is not a requirement for you, you may want to save yourself from feeling like you are cramming a ridiculous amount of information into your brain that will be almost completely useless the minute the final exam ends.  That being said, it is well-organized and well taught, so if primates are your cup of tea then go for it.","It's a wonderful course, with wonderful professors, very fun lectures, a field trip to the zoo, and fun labs.  I didn't find section too helpful, but that's the case with sections for a lot of classes anyways.  The readings are interesting.","This class is very interesting. You will learn so much about primates and if you are not truly interested in the subject it can get boring. I was not particularly interested initially but as the semester progressed I found myself really enjoying the course."]}},"mostRecentQ":{"overall":"4.20","workload":"2.00","difficulty":"3.20","recommendation":"4.30","enrollment":"20","response rate":"95.00","QCourseOverall":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"0","3s":"3","4s":"10","5s":"6"},"QDifficulty":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"0","2s":"2","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1330","course_id":"2723","cat_num":"4332","1s":"5","2s":"9","3s":"5","4s":"0","5s":"0"}},"success":true}