{"scores":{"Fall '14":{"course_score":{"overall":"4.00","workload":"2.00","difficulty":null,"recommendation":"4.40","enrollment":"47","response rate":"68.09","QCourseOverall":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"0","2s":"1","3s":"7","4s":"15","5s":"8"},"QDifficulty":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"8","2s":"16","3s":"10","4s":"1","5s":"0"},"QWorkload":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"21","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1095","cat_num":"4409","course_id":"130","year":"2014","term":"1","id":"6679bedcbc1a435d3efd2ee66adb63d3","first":" C. C.","last":"Lamberg-Karlovsky","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '13":{"course_score":{"overall":"3.80","workload":"1.31","difficulty":"2.11","recommendation":"4.14","enrollment":"35","response rate":"100.00","QCourseOverall":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"0","2s":"1","3s":"7","4s":"15","5s":"8"},"QDifficulty":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"8","2s":"16","3s":"10","4s":"1","5s":"0"},"QWorkload":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"21","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1095","cat_num":"4409","course_id":"130","year":"2012","term":"2","id":"6679bedcbc1a435d3efd2ee66adb63d3","first":" C. C.","last":"Lamberg-Karlovsky","InstructorOverall":"3.94","EffectiveLecturesorPresentations":"3.88","AccessibleOutsideClass":"3.83","GeneratesEnthusiasm":"4.18","FacilitatesDiscussionEncouragesParticipation":"3.61","GivesUsefulFeedback":"4.12","ReturnsAssignmentsinTimelyFashion":"4.35"}]},"Spring '12":{"course_score":{"overall":"4.17","workload":"1.00","difficulty":"1.50","recommendation":"4.17","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"0","2s":"1","3s":"7","4s":"15","5s":"8"},"QDifficulty":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"8","2s":"16","3s":"10","4s":"1","5s":"0"},"QWorkload":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"21","2s":"6","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ANTHRO 1095","cat_num":"4409","course_id":"130","year":"2011","term":"2","id":"6679bedcbc1a435d3efd2ee66adb63d3","first":"C. C.","last":"Lamberg-Karlovsky","InstructorOverall":"4.33","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.17","FacilitatesDiscussionEncouragesParticipation":"3.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '12":{"comments":["A good overview of early civilizations with little work.","Professor Lamberg-Karlovsky is great and very friendly. The course material is very interesting, and there are not that many assignments.","The course is fascinating and pretty painless in terms of workload. The professor is brilliant and, unlike some at Harvard, not hell bent on assigning busy work. This was greatly appreciated by all in the class."]},"Spring '13":{"comments":["Super easy class, but it really wasn't as engaging as I thought it was going to be.","I highly recommend this course.","Do not take this course, unless you take it pass\/fail. It is boring, not worth it, and you won't learn much. Complete waste of a class.","easy, fun class","This class is very informative but literally overflowing with information. Note taking in class is essential to succeed.","A great class on the beginnings of complex societies, and ancient civilizations.","No work but boring.","This class has a really low workload and the instructors are really nice and fair graders.","It's extremely easy, though lectures are kind of boring and hard to follow. It's a cool subject with an \"Indiana Jones-esque\" professor, but the lack of organization makes it hard to take good notes.","Go to class","The course load is very light and the material is interesting","This is a fabulous course if you are looking for something cool but not super intense!  The Professor has so many interesting stories to tell and the material is really cool but the work required of you is really minimal.","Keep up with the readings to make it easier to write the take-home exams. Lectures in class are also helpful, but it is important to pay attention to what professor says because the slides posted online are not helpful.","Great class if you are interested in archaeology. Definitely take it!","Take this course! It was absolutely my favorite class of the year. Professor Lamberg-Karlovsky has great stories, and he is an expert on the subject. It is low stress and was really about the material.","Great class, light workload, but be sure to only take this class if you're interested in the material!","Great senior spring course. Very little work and very interesting material."]},"Fall '14":{"comments":["Take it! Take home midterm and finals, good explanations of what they are looking for.","very easy A","It's a good class with limited work.","Great class gema","This class was very interesting and the readings, though they were long, were beneficial to the assignments.","Take this class! It was easy\/fun.  No downside.","A good class. Take it if you need a class with a low workload.","This class is a cool way to learn some basic anthro\/archaeology. I knew nothing going in and had no problems.","This class was a gem. the material can be a bit repetitive sometimes (making it easier to skip class occasionally), but it's really cool to learn about how human beings developed the complex, stratified societies we see today. Cool conversation topic. The TF is an awesome dude who is more than willing to help on the *two* assignments we had all year. We also only had two section meetings. This class is awesome.","Lots of learning about a different society","If you're looking for an interesting but easy course, this is the one for you. Lectures and readings can often be dry and boring, but the work load is very minimal and there are only a couple of essays. If you're interested in archaeology, this is a pretty cool course where you learn how different civilizations developed form an archaeological perspective.","This course was a fantastic overview of the study of ancient civilizations. Professor Lamberg-Karlovsky is not only a leading authority in the field, but he was an incredibly engaging professor who brought colorful personal insight into his lectures. Having no prior interest in the subject, I was surprised by how much I learned and how interested I was in the course material. As TF, Yitzchak did a phenomenal job facilitating the course and giving us feedback on our essays.","Very little work and difficulty comes from this class. Extremely enjoyable and unstressful.","Take course if interested in history as this class will be much more for you","This is a great class! Professor Lamberg-Karlovsky is ridiculously qualified. He has had so much experience in archeology and has traveled to so many places. He's very articulate while being down-to-earth when he needs to be. The TF was also very supportive and helpful along the way!","This is a great switch up from your concentration if you're not an anthropology major.","If you are looking for a very interesting class without a heavy workload, then this is the class for you."]}},"mostRecentQ":{"overall":"4.00","workload":"2.00","difficulty":null,"recommendation":"4.40","enrollment":"47","response rate":"68.09","QCourseOverall":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"0","2s":"1","3s":"7","4s":"15","5s":"8"},"QDifficulty":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"8","2s":"16","3s":"10","4s":"1","5s":"0"},"QWorkload":{"number":"ANTHRO 1095","course_id":"130","cat_num":"4409","1s":"21","2s":"6","3s":"0","4s":"0","5s":"0"}},"success":true}