{"scores":{"Fall '14":{"course_score":{"overall":"4.30","workload":"4.30","difficulty":null,"recommendation":"4.30","enrollment":"133","response rate":"72.18","QCourseOverall":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"1","2s":"2","3s":"11","4s":"37","5s":"44"},"QDifficulty":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"5","2s":"29","3s":"100","4s":"16","5s":"1"},"QWorkload":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"16","2s":"56","3s":"7","4s":"0","5s":"2"}},"instructor_scores":[{"number":"GOV 1540","cat_num":"4925","course_id":"2234","year":"2014","term":"1","id":"2a7e2333944e26da75f9548dd6a09f99","first":" Roger B.","last":"Porter","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.10"}]},"Fall '13":{"course_score":{"overall":"4.10","workload":"1.90","difficulty":"2.90","recommendation":"4.30","enrollment":"164","response rate":"92.07","QCourseOverall":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"1","2s":"2","3s":"11","4s":"37","5s":"44"},"QDifficulty":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"5","2s":"29","3s":"100","4s":"16","5s":"1"},"QWorkload":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"16","2s":"56","3s":"7","4s":"0","5s":"2"}},"instructor_scores":[{"number":"GOV 1540","cat_num":"4925","course_id":"2234","year":"2013","term":"1","id":"2a7e2333944e26da75f9548dd6a09f99","first":" Roger B.","last":"Porter","InstructorOverall":"4.39","EffectiveLecturesorPresentations":"4.42","AccessibleOutsideClass":"3.63","GeneratesEnthusiasm":"4.59","FacilitatesDiscussionEncouragesParticipation":"3.95","GivesUsefulFeedback":"3.87","ReturnsAssignmentsinTimelyFashion":"3.97"}]},"Fall '12":{"course_score":{"overall":"4.24","workload":"1.95","difficulty":"2.89","recommendation":"4.38","enrollment":"137","response rate":"91.24","QCourseOverall":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"1","2s":"2","3s":"11","4s":"37","5s":"44"},"QDifficulty":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"5","2s":"29","3s":"100","4s":"16","5s":"1"},"QWorkload":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"16","2s":"56","3s":"7","4s":"0","5s":"2"}},"instructor_scores":[{"number":"GOV 1540","cat_num":"4925","course_id":"2234","year":"2012","term":"1","id":"2a7e2333944e26da75f9548dd6a09f99","first":"Roger B.","last":"Porter","InstructorOverall":"4.56","EffectiveLecturesorPresentations":"4.63","AccessibleOutsideClass":"3.69","GeneratesEnthusiasm":"4.68","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"3.89","ReturnsAssignmentsinTimelyFashion":"4.11"}]},"Fall '10":{"course_score":{"overall":"4.42","workload":"1.95","difficulty":"2.93","recommendation":"4.55","enrollment":"152","response rate":"91.45","QCourseOverall":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"1","2s":"2","3s":"11","4s":"37","5s":"44"},"QDifficulty":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"5","2s":"29","3s":"100","4s":"16","5s":"1"},"QWorkload":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"16","2s":"56","3s":"7","4s":"0","5s":"2"}},"instructor_scores":[{"number":"GOV 1540","cat_num":"4925","course_id":"2234","year":"2010","term":"1","id":"2a7e2333944e26da75f9548dd6a09f99","first":"Roger B.","last":"Porter","InstructorOverall":"4.64","EffectiveLecturesorPresentations":"4.73","AccessibleOutsideClass":"3.74","GeneratesEnthusiasm":"4.75","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.35"}]},"Fall '09":{"course_score":{"overall":"4.27","workload":"1.98","difficulty":"3.02","recommendation":"4.33","enrollment":"134","response rate":"94.78","QCourseOverall":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"1","2s":"2","3s":"11","4s":"37","5s":"44"},"QDifficulty":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"5","2s":"29","3s":"100","4s":"16","5s":"1"},"QWorkload":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"16","2s":"56","3s":"7","4s":"0","5s":"2"}},"instructor_scores":[{"number":"GOV 1540","cat_num":"4925","course_id":"2234","year":"2009","term":"1","id":"2a7e2333944e26da75f9548dd6a09f99","first":"Roger B.","last":"Porter","InstructorOverall":"4.46","EffectiveLecturesorPresentations":"4.51","AccessibleOutsideClass":"3.63","GeneratesEnthusiasm":"4.59","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.04","ReturnsAssignmentsinTimelyFashion":"3.91"}]},"Fall '08":{"course_score":{"overall":"4.29","workload":"2.05","difficulty":"3.22","recommendation":"4.42","enrollment":"150","response rate":"70.00","QCourseOverall":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"1","2s":"2","3s":"11","4s":"37","5s":"44"},"QDifficulty":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"5","2s":"29","3s":"100","4s":"16","5s":"1"},"QWorkload":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"16","2s":"56","3s":"7","4s":"0","5s":"2"}},"instructor_scores":[{"number":"GOV 1540","cat_num":"4925","course_id":"2234","year":"2008","term":"1","id":"2a7e2333944e26da75f9548dd6a09f99","first":"Roger B.","last":"Porter","InstructorOverall":"4.63","EffectiveLecturesorPresentations":"4.73","AccessibleOutsideClass":"3.52","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.07","GivesUsefulFeedback":"4.38","ReturnsAssignmentsinTimelyFashion":"4.75"}]},"Fall '07":{"course_score":{"overall":"4.38","workload":"2.08","difficulty":"3.15","recommendation":"4.37","enrollment":"145","response rate":"42.07","QCourseOverall":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"1","2s":"2","3s":"11","4s":"37","5s":"44"},"QDifficulty":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"5","2s":"29","3s":"100","4s":"16","5s":"1"},"QWorkload":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"16","2s":"56","3s":"7","4s":"0","5s":"2"}},"instructor_scores":[{"number":"GOV 1540","cat_num":"4925","course_id":"2234","year":"2007","term":"1","id":"2a7e2333944e26da75f9548dd6a09f99","first":"Roger B.","last":"Porter","InstructorOverall":"4.53","EffectiveLecturesorPresentations":"4.69","AccessibleOutsideClass":"3.34","GeneratesEnthusiasm":"4.78","FacilitatesDiscussionEncouragesParticipation":"4.21","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.88"}]},"Fall '06":{"course_score":{"overall":"4.12","workload":"1.94","difficulty":"3.33","recommendation":"4.09","enrollment":"117","response rate":"59.83","QCourseOverall":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"1","2s":"2","3s":"11","4s":"37","5s":"44"},"QDifficulty":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"5","2s":"29","3s":"100","4s":"16","5s":"1"},"QWorkload":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"16","2s":"56","3s":"7","4s":"0","5s":"2"}},"instructor_scores":[{"number":"GOV 1540","cat_num":"4925","course_id":"2234","year":"2006","term":"1","id":"2a7e2333944e26da75f9548dd6a09f99","first":"Roger B.","last":"Porter","InstructorOverall":"4.46","EffectiveLecturesorPresentations":"4.58","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.57","FacilitatesDiscussionEncouragesParticipation":"4.12","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.60"}]}},"comments":{"Fall '07":{"comments":["Even if you absolutely hate sections for this class, it is still more than worth taking it since the reading material and lectures are so excellent. Best lectures I have ever had at Harvard so far","Prof. Porter is a great professor and he gives interesting lectures.  The midterm was somewhat hard.","Porter's course is amazing.","This class is heavy with reading. Only those who are considering government as a concentration should take this course.","Prof. Porter is a national treasure.","This is definitely a class you shouldn't miss taking as an undergraduate. Whatever your major might be, this class is interesting and relevant.","It's hard work, but worth it.","Professor Porter is absolutely great, a must have Harvard professor.","A great course and a lot of fun. You should take it if you enjoy American government and interesting lectures.","This is the best class I've taken at Harvard based on the information, sections and the lectures.  However, the assignments and exams are tough and could be improved.","Porter's lectures are not worth missing.","learn how to analyze an organization","The material is weak and slightly boring. The study of the presidency is not nearly glamorous as the office appears to be.\r\nHowever, Professor Porter is one of the best professors that I have had at Harvard, and it was always a pleasure to attend his lectures. He has bottomless knowledge, experience, and--crucially--STORIES! I highly recommend it to students.","Sitting in class listening to personal stories about how the White House really is, removed from the entertainment-centered media lens, is refreshing, and hope-bringing.  Professor Porter and his stories give me faith that many people in the government are far more diligent, and far more motivated by a love for their country, than I had thought.  It is an incredible experience, one that I am glad I had the chance to have.","This is only worth it for the lectures.  The actual substance of the class can be a little light sometimes.","Only take this class if you are interested in American politics or you have to take an American government class. All the American government classes are about the same so pick your poison.","Professor Porter and the TFs are excellent. Some of the material is strong, but parts of the course which were more government-theory centric were less compelling.","The grading is unfair.","Go to lectures and try to get Carlos as your TF!","Take it, especially considering that 2008 is an election year.","Be ready to a lot of readings but also take time the enjoy the course because it is one that I will always remember!","you don't learn anything. it's a waste of time","great class, not too difficult but learn a lot","This is best class I've taken at Harvard!","lectures are engaging and wonderful, there's a lot of reading and assignments aren't easy but it's all worth it","The lectures are detailed first person accounts, the sections are comprehensive, theres a lot of reading, but anyone interested in leadership would enjoy it.","Pay attention in lecture and you'll be fine.","Without doubt, one of the greatest courses offered at Harvard.  To miss out on a chance to experience a class by Roger Porter would be a shame.","TAKE IT.","The material is pretty boring.","Hope you get a good TF.  Great professor, great material.","It's an interesting and fun class, and the more effort you put into the readings, the better you'll like it.","A fascinating class with a great lecturer and excellent TF's. But despite all the fun, you won't really learn anything (whether or not you do the reading).","You will laugh, worry, question and cry in this class.  You will hear some of the most amazing stories and learn lessons that will stay with you way beyond graduation.","Very insightful. You learn a ton about the inner workings of the president.","Go to lecture. Pay attention. That's the best part about the class. \r\n\r\nAnd the readings are, for the most part, rather interesting and painless too.","It is one of the best you could possibly take as an undergrad.","Don't get Liam Schwartz as your tf.","It's very interesting and carries messages and ideas which are important to understanding how the government works.","Professor Porter is clear, funny, engaging, and all-around one of the nicest people you'll ever meet. If for no other reason, take it just to hear his stories and get advice."]},"Fall '09":{"comments":["Professor Porter's stories and life lessons are a unique experience at Harvard that can be found in no other class; one of the few professors that understands academics and politics in the context of everyday life","Roger Porter is one of the best professors at Harvard. Everyone should take a class with him before graduation.","Better hope you don't get a TF with a Napoleonic complex and a poor sense of humor.","Make sure to go to section, as this is very helpful, because there is so much information in the lectures that is easy to miss. Also, go to lecture, if not for the information, to enjoy hearing Professor Porter speak, because it truly is a treat.","Take this class only if you like Reagan","As the class is so big, grading is more strict in this class than in others.","Great opportunity to learn about the presidency from someone who has experienced it firsthand. A really wonderful course.","Probably best course I've taken at Harvard","Do yourself a favor and take this course.","Great course which provides access to a body of instructors with real inside knowledge","Harvard is about getting to interact with professors like this. So either take the class or go eat in Dunster.","It is a very fun class and Professor Porter is excellent. The sections are very good.","It's a manageable workload and make sure you go to lectures!","Entertaining lectures, interesting course material, but a heavy load of reading","Take it. You won't regret it.","Great class, boring lectures","If you know little about the Presidency and the structure of the three branches of government it is an excellent course to gain a good understanding of both.","Professor Porter's lectures are fascinating, and the material is just amazing. His real-life stories from inside the White House are unique and not to be missed.","If the West Wing were a class, this is what it would be. It's not history of American Presidents, it's about strategy, decision making, power, and politicking. It puts Obama in a much larger context and I feel I can evaluate Washington with a new lens.","This was by far my favorite class I have taken at Harvard. Professor Porter is absolutely fascinating and gives incredible lectures. You will really come away with a new understanding about the office of the presidency. The workload is a fair amount, but definitely manageable with a study group. Take the class!!!","The class might as well be called \"Storytime with Roger Porter.\" It gives a really great insight into what life is like from the point of view of the White House.","THIS is what the Harvard experience is about, someone like Roger Porter downloading invaluable knowledge and experience to you!","The materials and subject matter are both engaging, and the professor is a great lecturer, but it is sometimes difficult to determine the importance of what is being discussed, an its pertinence to a final exam or paper.","You come to Harvard to take this class. Professor Porter is just amazing. His lectures are wonderful and inspirational. the best professor I have had at Harvard so far, and I have no doubt that he will remain as the best until I graduate here. Taking this class will be one of your rare moments at Harvard. You get inspired every single moments, and he makes you want to work in a public sector, especially American government.","Usually, the lectures make the reading and the exams worthwhile.","Good class, but difficult to do well in, grading is a bit rough because of the few assignments and somewhat obscure references on tests","American Presidency is an interesting and fun course if you love American politics.  If this is not your favorite subject, this course may spend too much time on the same topic to be of interest to you.  Roger Porter's rambling lectures were great, though got a bit boring as the semester progressed.","Take it!!!","This class is very interesting and Professor Porter is fantastic!","This class is TOUGH. It is a cross roads of America's young leadership.","Watch out for which tfs you get.","Professor Porter is excellent, as are his teaching fellows. The subject matter is interesting and went beyond my expectations.","A great class, Professor Porter is awesome!","I recommend this only if you have an interest in American government and politics.","Definitely go to lectures as they're the best part of the course","It was one of the best classes I've taken.","its boring. there is a negative curve. grading is really nit-picky","This is an immensely interesting class that just feels important to take. Understanding the theory and scholarship of the presidency is an important part of being an American and appreciating the function of our relatively fair and just government. But be warned that lecture is mostly \"Storytime with Professor Porter,\" so don't expect too much out of the lectures.","Professor Porter is truly a gem - the class is great, but it is Professor Porter that really makes it excellent.","This is a great class, and you will not be disappointed if you take it.","fun class","One of the best classes at Harvard.","It's a great class! The lectures are very interesting, Professor Porter is charismatic and the readings are never boring and always well chosen.","Professor Porter is incredibly interesting.","You will not regret taking this course. The Professor is engaging, and the material is important.","Professor Porter is amazing!","Get ready to hear a lot about Reagan and the CEA.","The course is really interesting and the papers and exams really aren't very difficult but be careful because some of those hour and a half lectures can seem very, very long.","This is one of the few courses that every Harvard undergrad must take in his or her tenure!","This was a great class to take. Porter is an excellent professor and the coursework is incredibly relevant to what is happening in politics today. Most anything we study can be observed in the real world.","It is an exceptionally well-taught and well-orchestrated class, which is very interesting and a lot of fun until the exams roll around.  Then it becomes terrifying; study groups burst into bloom overnight like fungi, and it consumes your life until the [paper\/midterm\/final] is done and turned in, and you collapse, dried-out and spent, and promise yourself that you will never again allow yourself to be caught so unprepared.","Professor Porter is an incredibly intriguing individual with many experiences and advice to share with his students. He is open and willing to establish relationships and get to know the students enrolled in his course.","This is the best course I ever took.","It's tough, but you learn a ton, both about the formal presidency and the real way the world works.","Take this class! My favorite class yet at Harvard.","Professor Porter is a great lecturer (and storyteller). This course goes VERY deeply into the American Presidency, as its name suggests, so only take it if you are interested in the subject. However, if you are, there could be no better course out there.","Porter is amazing!!!!!","It's a hard class to do well in, regardless of how hard you try.","Very interesting class that gives you a great understanding of the presidency as well as politics in general.","Some of the essay prompts were kind of difficult to approach, and there was no way to attack them without adding partisanship that could be held against you if your TF didn't agree.  The readings were long, and most of them were not things you absolutely had to read.  It was a fine class, but those who say it was the best class they ever took at Harvard haven't been taking the right classes.","Be very interested in the presidency, because the entire semester delves into the particulars of this topic. Also, having knowledge of the history of former US presidents helps when learning the material of this course.","Professor Porter is a fantastic lecturer!  You will never be bored in this class, plus it makes you a much more knowledgeable citizen.  The president's role in current events will make more sense after taking this course.","This is one of the best courses offered at Harvard. Professor Porter is an incredible lecturer (and person). Don't miss the opportunity to take his course. Even you're remotely interested in politics you will enjoy the anecdotes and theories presented in lecture. The readings are challenging, but if you attend lecture you probably can avoid doing them. The papers may seem challenging but take your time with them. They're very rewarding.","it is wonderful! a harvard class you must take. porter is amazing and you actually learn a lot, not about the history of presidents but about management and decision making skills.","lectures are boring","If you are interested in American government or politics you must take this course. Professor Porter is highly knowledgeable and entertaining, and he is a great lecturer.","this class is interesting if you have no prior knowledge of the presidency. for those with a relatively good understanding of history and current events, this class gets very repetitive once prof. porter goes beyond his theoretical framework (which is interesting but can be learned in 3 weeks).","You will learn a lot of interesting perspectives on the Presidency and be able to talk more coherently about the American political system after this class.  Not only will you be a more informed citizen, but you will feel happy to have taken this class.","Heavy on theory","best professor at Harvard; be prepared to enjoy lecture","This class has a great professor but it's hard to know what the tests\/papers are looking for.","The class has an amazing professor who actually worked in the White House for over 10 years and has countless stories he can apply to every area we covered in the class. How often can you find a professor with real practical experience who's interested on sharing them with the class?","Porter is great, but I didn't come away with some great new insight into the Presidency","Interesting, but a decent amount of work","Get to know the professor, lectures can be interesting but are also long."]},"Fall '10":{"comments":["Take this class, you won't regret it. Try to participate in Sections and look at the course notes and you should be perfectly fine for exams. The essays can be time consuming but easily managable if you keep the big picture in mind and only limit yourself to answering the question.","This course is unbiased and well-conducted. Professor Porter has first-hand knowledge of the white house and his stories are quite entertaining. The readings are more interesting than your average government class.","best class at Harvard","I absolutely loved this class. Professor Porter is an engaging speaker and his obvious passion for the subject inspires his students. I looked forward to lecture every week and sections solidified the week's concepts. I also found the outlines Professor Porter at the start of each lecture incredibly helpful as they helped me organize the different concepts in the course. This is one of my favorite classes at Harvard.","one of the most engaging government courses at harvard!","Professor Porter is a tremendous asset to this class - his first hand experience in the executive branch makes the sometimes dry material all the more bearable.","This is by far the best course IÂ´ve taken at Harvard. Prof. Porter is excellent and his lecture are simply great (he always tells personal stories about his time at the White House during President Ford, Reagan and George H.W. Bush. The exams are fair. Most important for preparation is the lectures and the sections, readings are in my view just add-ons. The best prerequisite for this course is interest in politics and especially in the American government system and the President.","Great if you are interested in becoming more knowledgeable about the workings of the presidency.  Provides a strong base off of which you will be better able to evaluate presidential candidates and current and past presidents","A good Gov course. Lot of reading, but really interesting subject matter.","Useful if you intend to lead a future organization","This is a fantastic course to take whether you are a gov concentrator or not. Professor Porter is as experienced as they come in the subject matter and keeps you interested and entertained with his stories.","interesting material and the requirements for this class are moderate. not easy to study for midterm and write essays, you must draw on sources outside of class.","Great class but difficult grading. Professor Porter has the best stories about his work, especially with Reagan.","Professor Porter really cares about this class. His lectures are always enjoyable. It is a great class for anyone interested in American government. However, choose your section wisely as your TF can really affect how much you enjoy this course.","Professor Porter is a must-have while you are an undergraduate at Harvard. He is dynamic, intelligent, and has spent a great deal of time with and around Presidents. He tells amazing stories, and I also learned a lot in the class. Readings can get kind of long, but in the end, what matters is paying attention in lecture and knowing how to write a good paper. Take this class if you can!","I am blown away by the scope and excitement provided by this course, and believe that everyone at Harvard ought to take this class","Professor Porter is a very good lecturer.  He generates great enthusiasm about the content of the course.  Sections are also a great strength in this course.","Dont miss out on this class.","This class is a Harvard staple. You will have missed a wonderful opportunity if you foolishly pass on Roger Porter's American Presidency. Your concentration is an irrelevant factor to your enjoyment of this course.","Porter is a very fun professor.  His lectures are lot story time.","Take the class!! Prof. Porter is the best.  He teaches you a lot about the Presidency and about life.","LOVED this class. Professor Porter's lectures are something that shouldn't be missed in your time at Harvard, even if you just sit in one day!","A great class and great professor.  Does require a little work, but it is worth it.","Some in-depth knowledge on American government (congressional processes, interactions between the three branches) is needed beforehand as it seems most students were well versed in these topics at the beginning of the course. Still, I greatly recommend the course as Professor Porter is a fantastic lecturer and has extremely interesting inside stores on various presidential administrations (this alone made lectures well worth attending)","Absolutely should take this while at Harvard. Porter is such a great person to take a class with and the HKS teaching fellows are outstanding.","The class is great, but you will zone out a lot in lecture when Professor Porter gives his stories. He organizes the class quite clearly though, which is very helpful. Be prepared for tough essays on the midterm and final.","A course that cannot be missed if you have any interest in the subject material.  One could not ask for a better professor than Prof Porter.","This course is really fun and interesting and provides unique insight into the presidency. Porter's style is to lay out a couple of simple theories and then illustrate with a lot of anecdotes. If you don't really like that style of lecturing you should not take the class, I found it pretty interesting for the most part, as did most people I think. The papers were incredibly frustrating because of how hard it was to find information to answer their questions. Also some of the material (like how the executive office is structured) is just really boring, and most of the readings are quite boring (I wouldn't recommend buying most of the books, I didn't really end up using them).","Professor Porter is great.  His personal experience allows him to give real-world examples to help you understand the material presented in class, which makes the experience much more interesting and enjoyable.","This course, when I was engaged in lectures, did the readings, and asked questions, taught me things applicable far beyond the subject matter. That said, if you want to learn about the presidency and White House specifically, this is the course to take.","This is one of the best classes I have ever taken at Harvard. Even if you are not really the government\/politics type, this class will make you interested in these matters. I learned so much from the class, and Professor Porter is amazing. You don't want to miss the stories from his own experience in the White House. 90 minutes is a bit long, but it is definitely more manageable than other 90 minute classes I have taken.","It's a very fun class.  Lectures are interesting, and you learn a whole lot.  It gives you a much better understanding of the Presidency and its role within the American political system.","This class gives a unique personal insight into the American Presidency and how it functions.","If you have any interest in American politics, you must take this class.","Make sure you do the readings and go to lecture. Professor Porter is an awesome person and teacher and you will learn a lot from him. This is a must take class at Harvard.","This is a solid class. Porter's stories are fun, you do learn a lot about the way the presidency works and interacts with other entities. However, I wouldn't say the class was super interesting.","great class with great teaching staff","This class is very insightful and fun to take.  It makes you reconsider your notions about the presidency.","I wouldn't trade a moment of this course for anything.","If you like government, are interested in a career in politics, or are fascinated by power, this is your class. There aren't many professors at Harvard more experienced in government than Dr. Porter and he's more than willing to tell a few stores- from his time on Air Force One to his visits to Camp David. Incredible class, and I urge every Harvard student to take it if afforded the opportunity.","It can be a lot of work but it's worth it, and make sure you go to lectures because they are pretty interesting.","be sure to do the readings","I enjoyed lecture, specifically Professor Porter.","If you don't know a lot about american politics this is an interesting class to take!","This is a unique opportunity to learn from a professor who has extensive experience and happy to share his knowledge with you.  Scott Darnell is an excellent TF! Stay on top of the readings because they will be useful for the exams - and you can form a study group so you don't have to do all of it yourself.  Spend some time on the essays and discuss them with your TF before you submit them.","Its an awesome gov class!","This is definitely one of the best classes at Harvard. Take advantage of Professor Porter; he is a remarkable teacher and a great person. Just make sure to stay on top of the readings and you will do very well in the class.","This class is awesome, and gives a great background into the American Presidency for those with or without any prior knowledge. Professor Porter is extremely engaging and it is clear how much he loves teaching the class, and cares about his students. I learned a ton of cool information and would tell anyone to take this class.","Fun class to take if your interested in the executive branch","Baller.","Porter is awesome! This class teaches you about the Presidency, but a lot of what you learn is very applicable to many aspects of life and being successful at any job as well.","Having Professor Porter teach this course on the American Presidency made it perfect. The way he combines the material with his personal anecdotes is not only very interesting but also very informative","This course will, at the very least, convince you not to run for the presidency. You will also hear great annecdotes and get a much better understanding of how the federal government works (not just the executive branch)","This is the greatest class I have taken so far at Harvard. Not only is Roger Porter totally awesome, but I learned so much about the presidency, which is useful information that all Americans-not just those interested in American government-should know.","Great class and great experience at Harvard.  We had two guest lecturers, one by the ex-Sec of Treasury and one by Jeb Bush, plus Porter is amazing.  Very good if you want to take a government class at Harvard, highly recommend.","This is a good course and the stories are especially great!","This is a great class.  Doesn't really live up to the hype as the \"best class at Harvard\", but definitely worth taking.  Professor Porter is very personable and has invaluable life experiences to share.  You don't really need to do the reading, but it helps if you stay up to date on current events for discussion in section.","You should definitely take this class before graduating.  Professor Porter is amazing.","This class will provide you with a great understanding about our American political system and how our conception of the president has evolved. The reading material is enlightening, and it spans from the birth of our nation (when the Founders were devising their vision for the presidency) to the modern day, tracking the evolution of the office of the presidency. The lectures are gems, and you will be inspired to think more critically about how America operates.","Porter is a great lecturer with great stories. The class is based on his personal ideas, and your section leader can greatly effect how you feel about the class.","I'm not a gov concentrator, rarely take paper classes, but this was the perfect elective. It is challenging, not just an easy elective. but lectures are amazing, professor porter is such a great person, so intelligent and a great lecturer. i didnt miss one lecture...because i didnt weant to!! i have a feelign its hard to get a flat A, but otherwise, no problems with this class","Professor Porter's stories are priceless and Scott is a great head TF.","This is a very good class at Harvard.","If you are not excited by american government or the intricacies of its functions, DO NOT take this course. You will be bored and will probably not do very well. The material isn't particularly stimulating at all times.","Professor Porter is an awesome lecturer, so very brilliant and a real person, approachable outside the classroom.  Section is fantastic.  This course will give you the tools to interpret presidential action and will affect the way you even just read the daily paper, because you'll be thinking about the different pressures and forces affecting the president's decisions.  This course makes you a better and more aware citizen.","great class if you're interested in American history and politics, and the workings of our political system.  particularly important because of how important the President has become in recent years.","Great class.  The professor is awesome and really puts effort into the lectures and assignments.  The assignments can be a bit tricky at first, but if you put some thought into them they'll work out just fine.  Take this if it fits your schedule!","You MUST take this class before you graduate!","This class probably has the highest DHA quotient of any class at Harvard. If you want a class that you can get by doing no reading and no weekly assignments, by attending lecture only when you feel like it, and where you won't be required to have creative ideas, you can't go wrong. Lectures are likely story-time, occasionally infused with Republican ideology or pedantic moralizing undertones.","assignments require a lot of additional research and if you haven't been tracking politics you may find yourself lost lots of the time","This course was incredible--I came into Harvard a pre-med biology-something-or-other and took this course, and have resultantly done a 180-degree turnaround and am currently considering a Government or Social Studies concentration. Porter's passion is infectious, and the TFs are fantastic. I have absolutely no complaints, and I leaned so much this semester!","If you have any interest in the U.S. government or politics in general, take this class!","One of the best courses I have taken at Harvard. It would truly be a shame to graduate without taking this course. This had nothing to do with my concentration, but I took it because it got rave reviews in the Q, and I completely understand why. Professor Porter is one of the best lecturers, not to mention one of the most interesting, approachable, and kindest people I have encountered at this school. He really wants to get to know his students and took his time to give me valuable life advice. I knew embarrassingly little about the presidency and the executive branch in general, and now I am considering for the first time going into government. I can't emphasize enough that future students should absolutely take this course.","The information is so interesting, and Professor Porter is an amazing professor. He talks about theories and then supports the theories with information from his time in the White House.","Keeping up with the readings is not necessary. You should unquestionably pay attention during lecture, as many of the exam questions come from things that Porter discusses but are not in the readings. \r\nIf you are looking for a cool class wherein we investigate all Presidents and talk about the interesting tenures of leaders like Lincoln and FDR, you will NOT find it here.","Porter has great stories... the papers are easy but the exams can be difficult to get good grades on because the TF's are anal about very small details.","Absolutely worth taking just to hear about Professor Porter's experiences and stories; he knows the presidency like no one else and it is a pleasure to get to learn from someone as passionate about the material he is teaching as Porter is.","The lectures in this course are great! Professor Porter is really knowledgeable and experienced. I would also say that there is a lot of reading.","This class is really interesting but it's hard to engage with at a high level."]},"Fall '12":{"comments":["Very doable course - interesting if you want to learn a little history, theory, and dilemmas presidents face.  The lectures are really fun to listen to, but section can be a little boring.","Great class, especially if you want to hear Porter lecture. It wasn't as mentally stimulating as a subject of this complexity could be though.","Lecture is always extremely interesting.  Porter is a great story-teller.","Don't miss the chance to take this class, especially if you are an upperclassman! Prof. Porter is one of the best professors you will meet - a bona fide academic who also did some incredible things in D.C. Do the readings to get the most out of it and of course pay attention in class. It is not that much work otherwise. Enjoy!","Professor Porter is a fantastic lecturer. The course material is really interesting, but the best parts of lecture are his stories and his life lessons. The workload isn't took heavy and you will leave the course with a much better understanding of how to evaluate the performance of a president.","I believe in most fields of study there is one course you should take. If you want a good political or governmental course, this is the one. This course provides you a fascinating introspective look at the American Presidency. It is all subject to Professor Porter's own mind and viewpoints but once you take the course you won't feel it's lost time.","This is a great class by a very interesting and knowledgeable professor. The first half of the class is very well structured and Professor Porter has tons of stories to share about his 11 years in the White House. Although the second half is more disorganized, it is still interesting. The class doesn't require too much work, 1 midterm, 2 5-page papers and a final. So it's pretty fair and you get to learn a lot. TFs are also great.","Opportunity to learn from an experienced White House insider who doubles as a really nice and interesting person. Less about technical workings of the executive branch, and more theories about executive power and stories from Porter's days in and around the WH. Doing the readings can add a lot to what you get out of the class. No lecture notes or taped lectures - frustrating when you lose focus in class.","Prof. Porter is a pleasant man with a lot of interesting stories to tell, and in that sense this is a nice enough class.  However, lecture can be unfocused, more like 'storytime with Roger Porter' than anything, and it's hard to tell what material you're expected to be learning. Reading is generally not well-integrated with lecture, and the paper assignments are similarly disjointed. You can get something more substantial out of the course, but overall, this class--like so many--is what you make of it.","I loved this class. Lecture was so interesting and I looked forward to it every day","TF TF TF. Make sure you get a good one. Get Jordan he was very engaging and loved pushing back on our ideas to make us work harder!","Roger Porter is a fascinating man and you should take the course if only to hear him speak. However, be warned that the readings are useless, redundant, and boring. Be ready to tackle tedium.","Take it for the lectures, and don't worry about the readings (they're covered). Office hours are tough, so don't do it to get to know Porter. Then again if that's your aim, don't be a gov. major.","This is a great class. Prof. Porter is one of the most engaging professors you will meet â€“â€“ I never missed a single class â€“ you will likely not miss any either. That said,  the grading is very very arbitrary, the curve is something akin to grade deflation.","Great class, obviously Professor Porter's lectures don't disappoint. You learn a lot and you get to hear some amazing stories. Sections can be pretty fun and enlightening as well, although it helps to know US politics.","Easy class. If you aren't a civics kid, make sure you take Government 30 first.","This is a great class. I'm glad I got to take this senior year. Professor Porter is very entertaining (though can be a bit boring sometimes) as a lecturer. Even as someone who knew quite a bit coming into the class, I still felt like it was worth taking.","This is a great class and if you have the opportunity to take it, you have to! It is one of the best classes at Harvard.","It is a bit focused on story telling but still very interesting","This is the first gov class I have ever taken and I do not regret it. You learn a ton. Roger Porter is also a phenomenal lecturer. The course is worth taking just to hear his stories. A caring man who cares about the course and his students. The material is well-put together and well thought out. Readings are relevant and interesting.","This is absolutely one of the best classes at Harvard.  The topic of the American Presidency is interesting on its own, but it becomes truly fascinating when Professor Porter brings it to life with his firsthand experience.   He is the best professor that I have had at Harvard.","Porter is a great lecturer with fascinating stories from his time in the White House, and the course requires very little work week to week.  However, most of the theories and content in the course were pretty self-evident, and I feel like I learned less than in other government courses I've taken at Harvard.","Take this class.  Not the easiest elective, but the opportunity to hear Professor Porter's stories makes it totally worth it.  He is one of the most incredible teachers I have had at Harvard.","It was actually more work than anticipated because both the papers were research papers and the grading scale is pretty merciless. Otherwise, I learned a lot about the American Presidency in ways that I didn't expect!","Great class and Professor Porter is amazing. You can learn a lot from him and it's not an impossible course at all.","get a study group with some gov concentrators","Great lectures. Long readings","The lectures are mostly very enjoyable. More so than most classes I've taken here, I feel like I will retain and use the knowledge of this course in my life. Professor Porter is delightful. It's tricky to know how the papers will be graded, but they aren't too hard.","Professor Porter's stories alone make this class worth taking. The exams are fair and the readings are not overwhelming. I definitely recommend that you take it if you have an interest in politics.","This course provides what other courses on the American presidency may be unable to do, which is to offer a firsthand account of interacting with presidents and working in the White House. This firsthand account adds so much perspective and life to sometimes otherwise dry topics. In other words, Professor Porter's stories are definitely the main reason to take this course. Apart from them, lectures and assignments are not always the most engaging or helpful for learning. I would therefore highly recommend this course but not suggest that it is a \"must take\" one.","Although the amount of reading\/information given in this course is daunting, it's absolutely worth it. The exams were tough, but all in all it's a really rewarding experience.","This is a phenomenal class. The lectures are consistently interesting, and the material is great to learn about. And of course, Roger Porter has great stories.","A unique Harvard class taught by an unique Harvard Professor. If you get the chance definitely take it. Porter's stories alone make the class but the material itself is very interesting and you learn so much about the Presidency and leadership in any organization.","This is a fascinating class that provides a very unique insight into the White House, as provided by Professor Porter. I loved it!! Lectures were never boring.","This class is awesome! One of the best classes I have taken at Harvard","Professor Porter makes this class worth taking.","TAKE THIS CLASS!!!!!!  You will not regret it- fascinating subject material and interesting assignments.  If nothing else, take it because Professor Porter is awesome and so inightful.  The best class I've taken at Harvard.","Professor Porter is a soft-spoken, kind, and excellent professor\/lecturer.  It's a must take class. I only wish section had been a bit more useful in handling the readings and coursework.","good class","Doesn't require much time and you gain a lot of insight into the power structures and processes used by the president to accomplish what he does.","Professor Porter, like my grandfather, is a really lovely and sweet old man. However like my grandfather he goes on long tangents and espouses half-baked political theory. Yes the stories are great, but this class might be the softest social science class at Harvard.","If you have the chance, take it.","Definitely the best government class that I've taken at Harvard (slash, maybe best class overall). Professor Porter's stories of working for three administrations in the White House are incredible, and you leave the semester with a great understanding of how the Presidency works in relation to the public, media, and other branches. I felt that this course actually helped me to understand and engage with current events.","Professor Porter delivers interesting lectures, although the entire course could probably have been condensed into half a semester instead of the whole thing. Much more theoretical than I anticipated, and worth taking only if you have a limited understanding of the office of the presidency (which I did).","Everyone should take this course at some point! It's a great elective for science people and I would assume for humanities\/social sciences as well. Professor Porter's lectures are almost always fantastic and the material in the course feels very relevant to real life and will help you better understand current events. The papers are tough but interesting -- be aware that they require a lot of outside research, but you get to write about a topic that interests you so they're fun to work on. Section was also very enjoyable in this course and not just a repeat of lecture.","Take this class. Professor Porter is incredibly thoughtful and dignified, and you learn a lot just by watching his example. The lessons you learn in this class aren't just about the presidency; they're also about how to run an organization. \r\n\r\nNot too much work, lectures are great, and the reading is interesting.","Study the presidency with someone who has spent most of his life working in the White House. Porter is an entertaining and informative lecturer, making the class well worth it for anyone with more than a passing interest in government","Great class, Porter is an awesome professor who will keep you interested with the material through his ridiculous experience and stories.. Throws in some life lessons too which are awesome","I really enjoyed this class.  It was particularly fun to take it during a presidential election year but I would recommend it anytime.  Prof. Porter's lectures are great!  Lectures involve a lot of storytelling from his time in the White House (he worked in three administrations) but the stories do generally illustrate a point about how government works.  You will come away with a much better knowledge of how presidents make decisions, how the White House operates, and how powerful the presidency really is.  Readings and papers are generally not too onerous, although the grading of exams can be tough (perhaps depending on your TF).","The curve is tough but this class is really fantastic. You won't have the opportunity to get insights on presidents again, so take it!","This has been one of my favorite courses at Harvard thus far. Learning about the Office of the Presidency from Professor Porter, who has worked with many presidents and devoted a large part of his career to working in the White house, is absolutely incredible. You will mainly be learning about the office of the presidency and the powers, both formal and informal that the President holds. You will delve into how where Presidents derive their power, how they get nominated and elected, how they decide to organize their Executive office, as well as decision making strategies in the domestic, economic, and foreign policy realms. You will not only learn this information through the thorough readings, but also through Professor Porter's personal stories about his interaction with the Office of the President. Take this class before you graduate!","This class is not particularly difficult or onerous work wise. Professor Porter's stories in lecture are wildly insightful and often very entertaining.","FABULOUS CLASS! Porter is such a great lecturer and has great charisma!!!","Probably my favorite class I've taken at Harvard.  Professor Porter is a great lecturer and also really makes an effort to be accessible for the students.","Professor Porters lectures are great.","Take it. Even if you aren't a government person. Great lecturer, fascinating information. It was tough as a non-gov concentrator, out of my comfort zone, but so worth it. I broadened my understanding of a lot of things, not just presidency. Worth the not ideal grade I got, believe me. Just do it.","TAKE IT. Porter is an AMAZING professor - the best I've had at Harvard. I would take this class again if I could.","TAKE IT!","Definitely take this class if you are even slightly interested in Executive power in general. The course does obsivously revolve around the presidency, but it offers fantastic insight on decision-making strategies, the struggles with executive organization, and how to get the most out of individuals that you work with in any facet of life, not just being President. Porter's lectures are fun, entertaing, and engaging. His stories are extraordinary and his experiences are one of a kind. Do not miss the chance to take this class.","You should take this class because of Professor Porter. He is an amazing lecturer with great stories and insight into the White House. The material can get a bit repetitive and sometimes a bit dry but this is a great class to take as a gov concentrator or not.","A really interesting course. Professor Porter tells unbelievable stories -- he has worked in a number of presidents' administrations. It also gives you a really great overview of how the presidency and electoral system works. Not an easy course, though.","This class is wonderful! Regardless of whether you are a government concentrator or not, this class is incredibly informative and one of the best I have taken at Harvard thus far","One of the best classes at Harvard! A must for anyone interested in politics or those interested in learning more about the Presidency.","If you're looking for inside stories of the White House, Professor Porter is your guy. Lectures are incredibly interesting as he tells all these anecdotes about his time in the White House, and is a captivating story-teller. However, the readings are subpar, as most of them are repetitive from lecture, or quite long and boring. The papers are personalizable and the exams very fair. All-in-all an interesting class if you're interested in the Presidency.","This class is absolutely amazing! Everyone should take it. Roger Porter is the man! His teaching style is captivating and energetic. You will learn so much just from lecture. I strongly encourage everyone to take this class.","professor porter is a good lecturer, and makes the class worth your time. the paper topics are not only relevant, but interesting. if you're expecting to learn about individual presidents specifically, this is not the class to take. expect overarching leadership themes with stories mixed in.","Porter is unbelievable and lives up to his reputation. Come to class, put your phone away, and just listen.","Did not enjoy the course.  Professor Porter's stories were boring.  Lecture made it seem as if Professor Porter was teaching a 90-minute class about Professor Porter.","Grading for this course is incredibly difficult. While it is fun and engaging it is certainly not an easy Gov A. Porter uses a strict curve.","Professor Porter's lectures are filled with many interesting stories, all of which stem from his experience having worked in several White House administrations. If you are interested in the American Presidency, you should take this course.","Great to hear about government from somebody who's really been there","Definitely take it. Porter is an incredible lecturer and you actually do manage to learn something from the course that is probably going to be applicable in the future.","It's a good class overall. Professor Porter's storytelling is enjoyable for most of the time. But I have to say this class is a bit overrated. His perspectives developed while working in the White House are definitely interesting, but somewhat skewed. Also, topics\/lectures tend to repeat. But it's still a good Government class.","This class is interesting because Professor Porter is a good storyteller.  The subject matter itself is less exciting, and it never felt like we really delved into the topic beyond mere lists describing different processes and operations of the presidency.","Take this course! Professor Porter is an amazing resource, and you will learn so much just from having the opportunity to listen to him talk about his experiences working in the White House for various presidents. The workload for this course is very manageable, and you should be able to take it regardless of your background (I took it as an elective, coming from a science concentration). If you can, try to take it during a presidential election year, since that made for very lively in-class discussion.","Take this course! Professor Porter is a phenomenal teacher and lecturer. His stories about his time in the White House are great and you will not find them anywhere else. Take advantage of this opportunity. The presidency is a fascinating institution and you will learn so much more about it than you ever thought possible.","This is a fun, easy class with great stories from Professor Porter's time in the White House","While Professor Porter's personal stories that he frequently tells in lectures are interesting, sometimes its hard to decipher what parts of the lectures are worth writing down and which parts are just for entertainment. The midterm and the final were somewhat hard to study for considering how many things were brought up only a few times in class but which later were revealed to be very crucial parts of the course.","This is an awesome class. Professor Porter teaches not just about the presidency, but about life. \r\n\r\nHowever, the class gets very repetitive and section is a waste of time. \r\n\r\nOverall, this is an awesome course. Not too tough--though you'll probably get caught off guard when the assignments finally do come out.\r\n\r\nDefinitely take!","This course is amazing. Professor Porter is not only a brilliant scholar, but also a great lecturer whose talks are highly informative and engaging. He is also very easy to talk to, so take the chance to have a conversation with him. There are some weeks where it feels like there is a lot of reading, but none of it is busy work. I would recommend this course to anyone interested in American government, politics, and modern political history."]},"Fall '13":{"comments":["TAKE THIS CLASS!  Professor Porter is an amazing lecturer.  The class is engaging and interesting and something you will look forward to every Tuesday\/Thursday.  The reading assignments are interesting and manageable, too.  The class is about more than just presidential power, you learn about styles of leadership and management that can be useful in any setting or profession.  This is one of those classes that you have to take at some point during your four years at Harvard...","Enjoy the lectures and think about the big picture","I got what I came for--I gained a lot of personalized insight from Professor Porter on what it's like to work in the White House.  Lecture is interesting, section is painless, it's a fun class--not terribly difficult but make sure you really work hard on the assignments because they are only a few and they all count a lot.","Take it, work the lottery the best you can. Vote early, vote often!","Interesting course and Professor Porter is great. However, it doesn't quite live up to the hype (or maybe I just expected too much). Lectures are just story-telling so you walk away wondering what you actually learned. Guess it'll be useful if you're ever President.","You should take this class before you graduate. It's one of those classes that you wouldn't be able to get anywhere else. Professor Porter is charming, a great storyteller, and very knowledgeable. It's also not particularly demanding.","Porter is a great lecturer because he has a lot of first-hand experience from within the executive office. There is a huge amount of reading, but manage your time well because there is no incentive to do the readings as you go - you only need them for tests and maybe a few of them for the papers. The exams were fair; to do well on the IDs, you need to do the reading, but you can get by on the essays by having gone to lecture only. The 2 papers were very manageable (no more than 5 pages each).","This course was extremely interesting and lectures were engaging and full of relevant real-life examples of the concepts and theories covered in the course. Prof. Porter is amazing and very willing to engage with students at all times.","Professor Porter is extremely knowledgable and gives interesting lectures. But the course was highly focused on the bureaucracy of the government - it would have been nice to apply the concepts to more case studies. Also, the class revolved around structured models, and it seems shortsighted in some instances to categorize the Presidency so strictly (for example, that there are exactly four types of transition hazards that are narrowly defined). I also with the readings had been more integrated into the class - there was little incentive to do them in the first place as the class revolved almost exclusively around lectures.","great anecdotes. I learned a lot. Fascinating for someone who likes both history and politics. Porter is really interested in the administrative set up of the White House (as opposed to the political or legislative side of governing). Although interesting, those lectures, I felt, could at times seem a little mundane. But otherwise a great introduction to the Presidency.","Very interesting course. Pay attention during section.","Take this course for Roger Porter. His stories are incredible and keep you interested at all times.","Awesome class to take at Harvard. You will learn so much about life from Professor Porter, as well as a bunch about management and the presidency.","Prof. Porter is one of the best professors at Harvard. Don't miss out. He is so adorable and smart. Great Senior fall class, pretty manageable and the grading is pretty lax.","This course is a Harvard classic, and I highly recommend it. The subject matter includes a brief history of the presidency, his relation with other institutions in US government, decision-making, and presidential leadership. Professor Porter's lectures offer a healthy balance of course material and relevant stories from his experiences in the Ford, Reagan and Bush White Houses. Readings tend to average about 100 pages per week, and it is very beneficial to do them, though some of them are only tangentially related to the course. There are two short papers (5-7 pages) that provide a good opportunity to apply the models learned in the course to case studies of your choice, and they are graded fairly. The midterm and final are fair in content and grading, with several IDs and two essays. The greatest weakness of this course was the section component, which provided little (if anything) to what I learned in readings and lectures. That being said, they were low-stress and very comfortable. Finally, students should be aware the Porter adheres to a relatively strict curve, with allegedly only 5 percent of students earning \"A\"s, and another 20 percent earning \"A-\"s. Overall, you will learn a lot about the presidency that will correct common misconceptions about the institution and presidential power, and will come away with a positive experience. This has been one of my favorite courses at Harvard.","Great lecturer","Interesting material, Roger Porter is so interesting and engaging and full of incredible stories about his time in the White House. Take this class!","Porter is fabulous, and material is interesting.","Great class! Lectures can sometimes digress from the main point, but Porter is kind and knowledgeable, the TFs were helpful, and the readings are fantastic. A manageable and enlightening class, especially for those who prefer big-picture outlooks on government concepts","This class is great for Professor Porter's stories alone.  Otherwise, \"Presidential Power\" with Carlos Diaz-Rosillo is actually a much better class (I say this having taken both and understanding the irony because Carlos used to TF this class).  This class just didn't have very effective conversations in section and Porter didn't do a whole lot to incorporate the readings in a helpful way that would lead to preparedness for the papers and the exams.  That said, his stories just may be worth it.  Unless you really have a good reason to take this class, though, I might just audit for a few of Porter's lectures.","Lots of interesting stories. Weird to have a super conservative condescend to you about politics at Harvard, but still a good class","It's a pretty typical government class.","Really a great class. Didn't stretch me thin at all as far as the workload goes, lectures and Prof. Porter's anecdotes (which you can't get anywhere else) never disappointed, and John's section was very helpful and fun. Prof. Porter is honestly just an awesome and extremely accomplished person, and that comes through in the course. Academically, I found the material to be very interesting, but more informational and the theories\/frameworks that we covered not to be particularly enlightening, to be more descriptive, and some of the lecture topics felt just a bit repetitive at some points. Also, I feel like the way some of our claims were substantiated in lecture and the way they had to be done in the short papers (b\/c of time constraints and the formula that we knew we should follow) was not too rigorous. What I mean here is that I often had to make some claims (or heard them in lecture), supported by one or two examples, that I didn't always find to be rigorously substantiated. Overall, however, I totally recommend this course. I feel that I have many tools and frameworks to looking at the presidency, know A LOT more about all the modern presidencies (since FDR), their styles and some of the big decisions they had to make, and also about management.","His stories are amazing and lectures are overall interesting. Quite a bit of reading but he goes over them thoroughly in class.","Porter's lectures are SO worth it, truly amazing and better than any lectures I have had heard in my 3.5 years at Harvard thus far. The exams are a bit hard, the papers surprisingly easy - you'll do just fine grade-wise. Get a good TF though. Hope that Zach is still the head TF!","If you're already well-versed in American politics, this will pretty much be a blow-off class for you. Nothing you're told is revolutionary and at no point are the ideas really challenged or debated. Professor Porter's stories are cool but don't do enough to sustain the course for an entire semester. If you do anything, get into Zach Howe's section because it will ensure that you are the most prepared for all the exams and you get the best grades.","This course is a good course for government concentrators who want to hear Porter's stories. Otherwise, I would recommend shopping the course and thinking critically about whether you would like to listen to Porter tell long stories throughout the entire class and to find little struggle.","This course is very interesting in that it provides in inside look at the White House and the very best view of Presidential Power; however it can be slightly boring at times and monotonous in some of its material.","Porter, regardless if there are days you fall asleep, is worth it. Good heart, great man, fun stories. Helps if you're into US politics","Make sure you go to all lectures and pay attention closely in every one. No term IDs are given for the midterm\/final to study from so you have to have really good notes.","The American Presidency is an excellent class! Roger Porter is not only a fantastic professor who lectures brilliantly and tells captivating stories; he also structures his lectures in a very organized and logical format. Every class, he hands out a sheet of paper outlining the lecture and emphasizing the key takeaways. The course readings are interesting, relevant, and manageable. Section is always fun, and we often do interactive exercises that incorporate theory from the readings.","This class is really interesting and I definitely felt like I learned a lot throughout the term. However, I have reservations with the assessment and grading system. I often felt that I truly understood the nuances of the material but did not have a great that correlated with my knowledge of the material.","Professor Porter tells great stories!","Professor Porter is an outstanding lecturer. While his lectures are packed with information, he always manages to speak in an organized fashion, never stuttering, and always making time for the occasional anecdote. From all of his experience in Washington, Professor Porter has much experience to share, and he does so, but never in a manner that seems self-inflating. I genuinely enjoyed this class and loved professor Porter. I highly recommend taking it if you get the chance!","Professor Porter is awesome. I definitely learned a lot, especially because I took this class with very little background in politics and the presidency. Papers definitely required extra research, but you learn so much through the process of researching.","Make sure you go to class. Lecture notes are handed out during class, and you cannot find them online. Also, the exams focus on Professor Porter's lectures more than the readings.","If you already know something about American politics but not so much about the Presidents and his office itself, take that course. Prof. Porter makes it very interesting and he has fascinating insights to tell.","Pretty good, professor tends to ramble.","Professor Porter is a good lecturer, but a lot of the time he goes off on tangents and half the time doesn't finish discussing what's on the outline that he gives at the beginning of class. The class is kind of disorganized. There is literally nothing on the course website -- no outlines, no lecture videos; nothing. There are also way too many readings that are irrelevant to the course's main topics. This course was way more time consuming than it needed to be, but it wasn't particularly difficult, just frustrating.","This is a fantastic course in American politics and you will learn so much from it!","Everybody should take this class to not just have a better understanding of American politics, but to have the opportunity to learn from Dr. Porter. I am a senior, and this is by far one of the best classes that I've taken at Harvard.","I would recommend it as a class that is not going to require too much work. However, if you are taking this class to get alot out of it, it will be very disappointing.","Take this class if you enjoy learning about the executive functions of American Government","The stories from Porter are really interesting and its an awesome class.  make sure you have a good background of the Presidents. A lot of the work and comments on work required a lot of historical knowledge. Keep up with the readings so you don't get in trouble at the end, there are a lot of readings BUT they are really interesting!","Porter is such an amazing lecturer, and really just a wonderful professor.  He has so many stories from when he worked in the White House, and he somehow finds a way to tell them while being incredibly humble and modest about it all.  You really learn what life is like for the President, and on top of that you learn a lot about life in general as well.  This class didn't fulfill any requirements or count for any department for me, but it was one of the best classes I've taken at Harvard.  Do it!","Take it - one of best classes you will take at Harvard.","I would recommend this class solely for Roger Porter. He had so much background and knowledge from his personal experiences of working in the Whitehouse under different administrations that was extremely interesting to take in and listen to.","Interesting class, manageable amount of work","Porter is great.  Gives not just subject lessons but life lessons, too.","this is by far the best class that I have taken at Harvard.  Professor Porter is amazing, the class is well run, the readings are informative and relevant, it is a great all around class.","This class has fantastic lectures, great section leaders, fair assignments and exams. Professor Porter seems to have found the perfect way to teach this class. I couldn't have been happier with the way it was taught. His stories are also great!","A wise TF once told me, \"easy classes are only easy if you treat them like hard classes.\" For Gov 1540 , truer words were never spoken. Although the class seems easy at first glance, the assessments can be tough. Overall, it's a good chance to learn about the world's most studied office from an expert in the field. Take it earlier in your time at Harvard and you'll get more out of it!","A very inspiring course, mainly because of what is not directly relevant in the exam. Beware though, it is harder to obtain a good grade in this course than in many other courses.","Great class. Lectures are informative and entertaining. Assignments and readings are straightforward. Take it if you get in lottery","Porter is great and hearing his stories is great; however, this course feels more like a series of story-telling sessions than a course. It's well organized, interesting, and light enough that it's still a good class.","Take this class!! Especially if you don't really know what American politics is about. You will not regret it. The professor is amazing; always interested in actually learning about his students, full of fun stories from his experience working in the White House during lecture, and so approachable. Admittedly, the two papers will take a lot of time if you want to do well - but it's definitely achievable. Section was also very lively and rewarding, especially for someone like me who had never taken a gov course before this and was initially very scared of voicing my own opinion in class.","Professor Porter teaches you not only about the presidency, but also how to live a life. Absolutely practical in that it relates the presidency to your real life.","It's true, Professor Porter does like to infuse his lectures with stories from his time in the White House. Those stories are not only interesting, but they're also really informative about the inner workings of the West Wing. I took this class as an elective and it was one of the best classes I took at Harvardâ€”I've learned so many life lessons from Professor Porter's lectures in class.","Excellent class. Everything comes together when you study for the finals. Remember the notable anecdotes that Professor Porter tells in class.","I learned a lot from this class. Not super easy, but not extremely difficult either. The material was fun to read and the exams were fair and manageable. Excellent professor and TFs!","This class is great--Porter has interesting stories and you learn pretty important things. He does have a tendency to go on tangents in lectures, but that's not so bad.","It is important for all American citizens (and citizens of the world) to have an adequate understanding of the office and duties of the President of the United States. This course provides a comprehensive look into the job and the men who have held it.","This course will change the way you view the President and the American Government. Also, you'll hear some great stories\/ life advice from one of the best professors at Harvard.","This is a great class.  Porter is the best and between his stories about his years in the white house and his life lessons, every minute you spend in his class is well spent.  If you're looking to fill a gov requirement or even just an elective, I would highly recommend this class.","This is the best class I've taken at Harvard.  It teaches you how to be a leader through the eyes of the President.  Really useful and interesting!  Plus Porter is amazing and an incredible story teller.","Take this class! You will not regret taking this class.","Porter is an enthusiastic and fascinating lecturer. The class may occasionally feel boring, but it is definitely worth taking.","Professor Porter has many great stories, and his lectures are awesome!","I took it totally as an elective. Cool to sit in on lectures, but the curve is really harsh, so your GPA can easily take a hit.","Good course, although not as life-changing as I had originally expected. It was easy for me to lose focus in lecture and that made parts of the course hard. Form a study group to split up the readings, and if you've taken other courses on presidential power expect to be familiar with a lot of the concepts already. Prof Porter is very sweet, excited to talk to students, and overall a legend.","This is a must take class for anyone interested in American politics. It's a class you can only take at Harvard. Professor Porter has direct experience working in the White House and his anecdotes in lectures come straight from his experiences. The class was fun and engaging and I also learned a lot about the presidency.","This class can help to broaden your understanding of the government, and it is also taught by a person who was part of many of the events that are discussed - which allows for an even better understanding.","It's the class of hot TFs. It's the class with the professor who goes on an on and on. Take it if you really find the professor interesting. If you don't find him interesting, sit in the view with the TFs.","This was a great course. Prof. Porter's stories really made the class. He's very engaging and loves to get to know the students in his course. Definitely take this course. You won't regret it.","Go to all of Porter's lectures. A few are a tad dry, but the vast majority are very engaging.","I would tell students to come to every lecture! It was so worthwhile to get up in the morning to listen to Professor Porter's stories of being in the White House.","This course can be quite challenging.  You do really have to be engaged throughout the semester; don't fall behind.  However, with that said, this class has to be the most worthwhile class I have taken here at Harvard.  If you are looking for a good elective (regardless of your concentration), you absolutely need to take this class.  You will learn so much about how our government works as well as the decisions that executive leaders must make.  By doing so, you will learn valuable decision-making strategies that you can apply in your own lives, when you are put in a situation of leadership.  This class is not just about the American Presidency; its about leadership as well.  When you think of the perfect Harvard course that you absolutely must take before graduating, your conception probably looks a lot like this class.","Professor Porter is a legend! One of my favorite classes at Harvard. His personal anecdotes from his time in the White House really add to the arguments that he makes. One of those must-takes at Harvard.","Porter is a legend. I wanted to take this class since my freshman year, decided to wait until my senior fall, and it was well worth the wait! The assignments were actually fun and enjoyable!","Take it! Not much work - Porter is awesome - the class is an experience and I learned a lot. The papers were cool\/interesting and not long at all.","You should take this class because you'll never have an experience like it! As everyone says, this class is story time with Roger Porter. Sometimes his stories are on point and incredibly engaging. Other times it is confusing why he is telling that story. That being said, Professor Porter is very approachable and loves interacting with his students. Also try to get John as your TF. He is the smartest person I have ever met.","This class does a great job at dissecting the balance of power and actual power of the President while helping understand the in's and out's of the American Political System. Professor Porter is a great lecturer.","Professor Porter is a great lecturer who manages to tell entertaining stories while also delivering substantive lectures. It's important to pay attention to key terms in lecture and the readings. The historical details are less important than understanding the big-picture takeaways. Take this class if you're interested in learning how the modern presidency works!","It is not an easy A","A direct and manageable course. Professor Porter is a great lecturer.","Professor Porter is perhaps the most engaged professor I have encountered so far at Harvard.  His passion for the students is clear, and he makes an effort to involve everyone on a more personal level, even in such a big class. His firsthand accounts of the presidency make this class unique and unmissable.","Professor Porter is the best! Great lecturer, funny story teller, and overall clearly has a passion for the content. You will learn a ton you did not know about presidential power (and how he has none!). I highly recommend this course - the readings are very doable and you won't be punished if you fall a bit behind. Make sure you have them done for the tests though!","Take this class for Roger Porter's lectures, but look forward also to really fun and engaging sections. Nothing in this class is terribly difficult, but everything about it really rewarding.","This is a fantastic course taught by a very interesting professor.  Take it!","This class is great if you're interested in the presidency and interested in hearing Roger Porter's views on it, and his stories about it.  The assignments are pretty straight forward, and section isn't the best, but the material in the class is pretty interesting.  I really enjoyed it.","This is one of the more popular Gov classes at Harvard but honestly I don't know why. I did end up learning a lot about the presidency which is cool and exciting but the section kind of sucked.","Do the readings","This was a really great class; my favorite so far. Professor Porter is a great lecturer, and the essays are actually enjoyable. I tried to lottery in for a few years and didn't make it, so I'm very glad I did.  The readings are interesting, and you should do them to get the most out of the class. Honestly, it's worth taking the class just to hear all of Porter's stories.","Professor Porter makes this this an only-at-Harvard kind of class. Take it if you're interested in the executive branch.","Professor Porter is one of the best professors I have had.  He lectures well and you learn a lot.  Definitely a \"must take\" course.","Take the class for Porter.","This is an incredibly insightful and interesting course taught by a wonderful, engaging, and enthusiastic professor alongside a fantastic teaching assistant staff.  That being said, it is not an easy course - the grading is quite harsh and the exams are challenging. Don't let that deter you - this is still a really fantastic course.","This class is definitely worth taking. Roger Porter comes from a long line of Washington political statesmen that are a dying breed. He is incredibly enthusiastic about sharing his knowledge about the presidency with all of his students. Sometimes the lectures can get sidetracked by his stories about the White House, but with hour and a half lectures, he could afford some time for his tales of the White House. The readings aren't too bad, and I wouldn't say this class is too easy or too difficult, but a very reasonable amount of work. The sections sometimes feel unnecessary, but with only one hour a week, they were never unbearable. Overall, this is a great class with an incredible Kennedy School professor, and you should take it if possible."]},"Fall '14":{"comments":["The purpose of this course is to watch Roger Porter perform. Beyond that, what you will learn is rather vague or generic: \"Presidents aim to make informed decisions\" or \"It is important to have a well organized Executive branch\" -- there are no surprises in the material, and if you have a brain and are even mildly engaged with politics, you could probably figure out on your own most of what you will learn. The lectures are taped but not posted, which I think is a drawback of the course that seriously hinders the ability to review for exams. Nevertheless, this is a good course simply because Porter's excitement for the Presidency is infectious.","This is the best class I have taken thus far. It offers a rather comprehensive look into the office of the presidency in the context of other institutions and the outside world, and you also get a personal insight from Professor Porter. Porter's stories alone make it worth it to take American Presidency. And if you are lucky enough to have Jon as your TF, you will have a wonderful experience and really learn a lot from very experienced individuals.","Make sure to concentrate and enjoy the lectures. Dr. Porter rocks but sometimes I was too tired to pay attention. No need to do all the readings. Get a reading group.","If you're interested in American politics, this is a dope class. A lot of what Professor Porter lectures about is just cool stories from when he worked in the White House. The workload isn't too bad and the concepts are pretty easy to understand. The course sort of loses steam towards the end, but it was definitely an enjoyable experience altogether.","Readings and assignments aren't that difficult, and it's worth taking just to hear Porter lecture twice a week.","Amazing course! Really makes you think about the President in a different light. And Professor Porter is just great. He is a great lecturer, and he really cares about the students. I enjoyed that he visited each section once and he gave us two inspirational speeches (read them and printed it out for us). That I found was great.","A must take class from an amazing professor.","Professor Porter is worth the cost of admission.","Professor Porter has constructed a fascinating and engaging course appropriate for such a fascinating and engaging topic.  Lectures, sections, readings, exams and essays come together to give a full and interesting picture of the American Presidency.  And, as a cherry on top, Professor Porter turns each lecture into a 90 minute \"School House Rock\" episode with insightful and humorous personal stories of recent Presidential practices and actions.","Take it. It's a great class. Professor Porter is awesome.","Take this class for the stories and for the amazing lectures, but don't expect a grade above or below a B+. The readings are important for the exams and the questions can be a bit nitpicky, but the class overall is not too difficult and can be what you make it. I recommend this class for the enjoyment but not necessarily for the grade or the material learned.","This is a highly interesting course. Professor Porter gives absolutely fantastic lectures and has some incredible stories. However, the essays might be a bit challenging if this is your first government class and are not totally sure about how to write a government paper.","I'd take this class for the sole reason of being able to learn about the presidency from someone who worked in the West Wing for a number of years. Porter's stories are entertaining and really cool. There's a lot of reading-some of which doesn't seem too relevant. The essays and exams were quite difficult.","Yes, this is the story class and it's totally OK to take it just for that. It also makes you think a lot more about the President's role and abilities outside of class.","This is a great class. Professor Porter is super interesting and the course gives a really good insight into the presidency.","This is the best class you will take at Harvard. Professor Porter is phenomenal. His real-world experience working in the White House provides a truly \"Harvard\" education. Furthermore, he teaches and instills in his students a great sense of moral virtue. You can learn a lot from him whether you are a beginner or expert in the field of government.  The course is always relevant to current happenings in the White House and U.S. politics. This alongside Professor Porter's stories make for a very engaging class. Definitely take it even if you are only slightly considering it!","Porter is such a cool guy and a great lecturer. I liked the class because of him.","Easily my favorite class at Harvard. Porter is interesting because he has the stories and experiences to teach the material from a first hand experience. It's also not a difficult class. Sophomores take note, this is a great punch class because the timing of assignments is convenient and the class starts at 11:40 (hopefully that doesn't change.) Very interesting class, you'll actually want to attend lecture. Nothing bad to say about it. Take it.","great class, go to lecture","Professor Porter is absolutely wonderful, his combination of anecdote and normal lecturing makes the class profoundly interesting and insightful.","read taming the prince to understand the theory on executive power... take this class to learn what the modern presidency is like day to day","It's not incredibly hard or time-consuming and you learn a lot about the presidency that you might not have considered before. At the same time, this course turned me off from being a gov concentrator. The lectures and readings were very redundant - Professor Porter's stories during lecture were great, but other than those he often just went over what was in the readings. If you want to be able to get by essentially with just lecture, then I guess it's not a bad class. But if you want lecture to give you something on top of readings, this isn't the one. In addition, many people rave about Professor Porter's lectures but I found many of them to be extremely slow - that's partially because they're long but also partially because on every topic he goes into historical examples\/anecdotes that aren't always the most engaging.","Class is pretty good. Professor Porter can sometimes get carried away with his war stories of being with various presidencies.","This is one of my favorite courses that I've ever taken here. The lectures are incredible if you pay attention, and there were no points of frustration whatsoever. The readings were fascinating, and I definitely learned an amazing amount. Take this class, and hope you get into the lottery!","It's amazing","This course might not be as easy as you expect, especially if it is your first ever Gov class. While the workload is very small, grading can feel very arbitrary based on your individual TF's expectations, and little guidance is given as to what's expected for the essays. Lots of reading, but unfortunately they are rarely incorporated into lecture of even section (which sometimes devolved into directionless discussion). Still a very interesting course, especially given Professor Porter's first-hand experience and great anecdotes. To hear his perspective is a one-of-a-kind opportunity, but you may leave the class feeling like you went to a semester's worth of \"story time\" without actually learning anything too substantial. (Still, not a bad as an elective.)","Make sure to keep up with the readings and you will be fine for the tests.","This is a great class to take! You learn a ton from just sitting in lecture and there isn't really a lot of busywork. Professor Porter is extremely knowledgable, and it was great to hear what he had to say from his experience, even though I sometimes disagreed with his opinions. If you can, lottery for this class!","This a fantastic class and Professor Porter is fantastic.","Fantastic class, you won't regret taking it","This course is as much about decision-making as it is about American government. It certainly teaches you about how American politics works, but it does so in a way that helps you think about how leaders make decisions more generally. Really useful if you're in a leadership position in your personal life.\n\nDr. Porter has taught this course for decades, and it shows. The lectures are well-structured, well-rehearsed, and delivered quite well. However, it sometimes seems that Dr. Porter gets bored with saying things he's said many times before, and he digresses into telling stories which can be of mixed quality. On the best of days, it is information about a president that nobody else has had before, which is genuinely cool. On the worst of days, it is a description of how cool Air Force One is, how cool it is that he's been on it, and a detailed description of how many toilets it has.","Great class. You will definitely have to put in a little work, but you definitely get a lot out of the course.","This course is fantastic. Do the readings because they are great. Come to lecture because Porter tells fascinating stories. Great course.","Actually do the readings.","This class is exactly the kind of class I wanted to take at Harvard. I can't wait to take Professor Porter's Business and Government class in the future. His stories are incredible and his lectures are very interesting. Take this class if you want a fascinating introduction to the American Presidency. The assessments are fair and reasonable. I felt prepared for them. I would recommend this class to anyone (and have actually recommended it to several friends).","This course was really interesting and I learned a lot. The lectures are full of great stories that are relevant to the material. I recommend this class.","This class was great because of Professor Porter's stories and solid knowledge about the topic, but it is not as life-changing as the previous years' comments have made it to be. It's a great lecture on the American Presidency but don't expect too much from this course.","Professor Porter tells amazing stories, makes you obsessed with the presidency, and is one of the few remaining embodiments of the Paper Chase-style professor. He gets sidetracked a fair amount and doesn't always have enough material for 90 mins, but that's not something that should keep you from taking this. All the TFs with whom I've interacted are very intelligent and help you out a ton.","Will not regret taking this class.","A background on American politics is very useful. Having a background of American presidential history would be particularly helpful in writing the papers. Students who don't have this background are at a disadvantage when writing the papers and participating in section.","Porter is simply the best professor I have had here at Harvard.  He is a professor you will want to say you have taken a class from in your life.  Anyone from any concentration can take the class and do fine; government majors will likely have an upper hand in that case though.  Take advantage of going to a school with people like Roger Porter on campus.","TAKE THIS CLASS. Porter is a legend. If your not a gov. major don't worry! I'm a senior who has never taken a gov. class and I loved this course. A word to the wise though: get study materials from people in previous years because Porter tends to reuse questions and will forget that he didn't teach you something and then will test you on it.","Presidency is a very interesting class without an unnecessary amount of work. Porter's lectures and stories are something you have to attend before you leave college.","Porter is a fun lecturer and has some great stories to tell. But if you're looking to understand the executive branch in a new or deeper way, this class might not be the best for you. There is relatively little structure to the curriculum, and the readings, while interesting themselves, are never really incorporated into the lectures or section very well. The papers were not interesting, but not overly challenging. Depends on how much you like listening to stories.","Enroll in this class only if you are interested in stories of inconsequential relevance or if you want to boast to people back home that your Prof worked with a couple of President. Other than that, the course is only a superficial overview of the multiple aspects of the Presidency. Often, key ideas are repeated over and over again without new ideas.\n\nAnother problem I had with the course is that it is far from rigorous Political Science. It does not present many testable theories, and when it does the empirical treatment was confined only to atypical and unrepresentative anecdotal evidence. Too many times Prof. Porter presented his own theories as alternative to some of the reading authors', but he support those only by citing his experience in the White House. Undoubtedly his stories and experience are very interesting and important, but to advance our understanding of the Presidency more is needed. The course dealt with some of the most important ideas behind the American political system, such as the role of the executive, influence of the media, or the relationship between the three branches of the government, but trusting that Prof's Porter convictions about those are true and credible required a leap of faith that I was not willing to take.","I would advise against taking this course. The assignments are not very clear and graded harshly, the exams are difficult to prepare for because the material isn't cohesive, and the lectures are dry. The suffering and annoyances are not worth what you get out of it at the end.","You should take this one!","Professor Porter is an amazing professor with experiences you'll get to hear about that you won't find elsewhere. Be ready to focus though for an hour and a half. His lectures are somewhat unstructured and if you're not the type of person who learns well without a powerpoint, I would suggest reconsidering the course. That being said, it really is excellent. The readings are great as well.","A great course with a GREAT professor. This course is worthwhile and one of the best you will have at Harvard.","Professor Porter is one of the best lecturers I've had the pleasure to learn from, and I really enjoyed each class.","Gov 1540 is a class with a fairly low weekly workload that is probably best taken as an elective- you should not expect to take away anything tremendously profound from the course, but is worthwhile to understand the office of the Presidency better than you did before, particularly from the perspective of a political scientists. Also, attending lecture is necessary, but it is not tedious, as Professor Porter has a methodical, deliberative way of lecturing. The 2 paper topics are not difficult, but they do require a significant amount of time if you wish to do well, as they require a lot of outside research and synthesis. As for the readings, they are usually not necessary on a weekly basis, but to do well on the essay components of the exams, you should know the basic arguments of authors from the readings in order to do well.","This is an amazing course! Professor Porter is an amazing lecturer and his stories are very cool! Definitely worth taking this course!","This class was fantastic. Professor Porter is so knowledgeable and brilliant that I truly enjoyed listening the hour and a half lectures. I learned a tremendous amount, and would recommend this course over any other I have taken at Harvard thus far.","This course is great. Prof. Porter is a very entertaining lecturer and he provides a multitude of examples form his personal experience within the White House.","Do not be lead into thinking this class is the greatest class you can take at Harvard (many people think this to be true). There are a lot of experiences, yes. A lot of positive ones, yes. But also a lot of negative experiences. It is also sometimes TF-dependent, be aware.","Great class that you should take before you graduate","The American Presidency may be a lot of work, but it was an extremely rewarding experience to take the course. Professor Porter and the TFs--Jon Palmer for sure--are knowledgeable and helpful. I learned so much both about American politics and history and about management and other critical life skills that I can apply in many instances. The course may be a lot of work, but every minute is well worth it.","it's a super easy class, but don't expect to get much out of it if your'e taking it for the grade.","You will learn a great deal from this course and experience some of the best lectures this campus has to offer.  You will then be subject to some of the harshest paper and exam demands this campus has to offer (not all of them fair).  Your choice.","Its an interesting subject made far more interesting by the first-hand stories Professor Porter tells.  He's got a ton of cool stories worth taking the class to hear.","This class is amazing!! The topic is extremely interesting and it's really helpful to understand the American presidency and learn about why presidents act the way they do. Additionally, Porter is one of Harvard's most incredible professor's. He is super engaging and he makes class very fun by telling stories of his times at the White House.","This class can be redundant and it is hard to follow the outline of the lecture. Additionally, if you have ever taken a gov class before, you may find the material repetitive."]}},"mostRecentQ":{"overall":"4.30","workload":"4.30","difficulty":null,"recommendation":"4.30","enrollment":"133","response rate":"72.18","QCourseOverall":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"1","2s":"2","3s":"11","4s":"37","5s":"44"},"QDifficulty":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"5","2s":"29","3s":"100","4s":"16","5s":"1"},"QWorkload":{"number":"GOV 1540","course_id":"2234","cat_num":"4925","1s":"16","2s":"56","3s":"7","4s":"0","5s":"2"}},"success":true}