{"scores":{"Spring '13":{"course_score":{"overall":"4.17","workload":"2.00","difficulty":"3.17","recommendation":"4.17","enrollment":"17","response rate":"76.47","QCourseOverall":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"2","2s":"2","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"0","2s":"3","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"4","2s":"12","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PHIL 7","cat_num":"1583","course_id":"4039","year":"2012","term":"2","id":"ac78e49932a94b4b4ac4422d4e70a2da","first":" Russell Edward","last":"Jones","InstructorOverall":"4.25","EffectiveLecturesorPresentations":"4.33","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.17","FacilitatesDiscussionEncouragesParticipation":"4.33","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '11":{"course_score":{"overall":"3.60","workload":"2.00","difficulty":"3.15","recommendation":"3.50","enrollment":"22","response rate":"90.91","QCourseOverall":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"2","2s":"2","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"0","2s":"3","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"4","2s":"12","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PHIL 7","cat_num":"1583","course_id":"4039","year":"2011","term":"1","id":"ac78e49932a94b4b4ac4422d4e70a2da","first":"Russell Edward","last":"Jones","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"3.68","FacilitatesDiscussionEncouragesParticipation":"4.21","GivesUsefulFeedback":"4.83","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Fall '10":{"course_score":{"overall":"3.79","workload":"2.33","difficulty":"3.24","recommendation":"3.61","enrollment":"37","response rate":"89.19","QCourseOverall":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"2","2s":"2","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"0","2s":"3","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"4","2s":"12","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PHIL 7","cat_num":"1583","course_id":"4039","year":"2010","term":"1","id":"ac78e49932a94b4b4ac4422d4e70a2da","first":"Russell Edward","last":"Jones","InstructorOverall":"4.19","EffectiveLecturesorPresentations":"4.21","AccessibleOutsideClass":"4.27","GeneratesEnthusiasm":"4.12","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"3.70"}]},"Spring '09":{"course_score":{"overall":"4.00","workload":"1.76","difficulty":"2.52","recommendation":"4.14","enrollment":"24","response rate":"87.50","QCourseOverall":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"2","2s":"2","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"0","2s":"3","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"4","2s":"12","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PHIL 7","cat_num":"1583","course_id":"4039","year":"2008","term":"2","id":"e075fdb3f16b85d83aa9c140ad0d1d66","first":"Mi-kyoung Mitzi","last":"Lee","InstructorOverall":"3.95","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.11","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.11","GivesUsefulFeedback":"2.83","ReturnsAssignmentsinTimelyFashion":"3.33"}]},"Fall '07":{"course_score":{"overall":"4.25","workload":"1.86","difficulty":"2.71","recommendation":"3.86","enrollment":"11","response rate":"72.73","QCourseOverall":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"2","2s":"2","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"0","2s":"3","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"4","2s":"12","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PHIL 7","cat_num":"1583","course_id":"4039","year":"2007","term":"1","id":"092187c06715107bba0838b3781ada85","first":"Christine J","last":"Thomas","InstructorOverall":"4.57","EffectiveLecturesorPresentations":"4.43","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"4.29","FacilitatesDiscussionEncouragesParticipation":"4.17","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '09":{"comments":["This is a great class if you're interested in ancient Greek philosophy! The professor and TF are amazing, and you learn a lot!","A pleasant, no-pressure intro to philosophy.","I would tell students that this class is accessible and that the material is interesting, especially in that it illustrates how long people have debated issues that we consider to be \"modern.\"  That said, I don't know if the material is for everyone.  I think that I would recommend a course like Justice before this one because it seems more relevant to the specific issues we face.","it is useful to get a good background in philosophy","It's an interesting course, not a whole lot of work, very interesting material.","If you have even a slight interest in philosophy and have never taken a philosophy class at Harvard before, take this one.","This is a great class in which you get to deal with the essential questions of human existence. Reading the ancients is incredible because it is amazing how current their thinking seems today. If you are not interested in digging into these ideas, however, I wouldn't recommend the course. The reading is difficult enough that you won't enjoy it unless you're genuinely interested, and the lectures are not so dramatic\/humorous that you will be entertained if you are not interested in learning about the material.","A very good introduction to ancient philosophy.","Make sure you finish your response papers on time.","Doing well in this class pretty much consists of going to lecture. If you can do that, take it. (If you can't, don't.) Very little work assigned. You also might learn some interesting things.","As boring as it might be sometimes, keep on going, it comes together in the end.","Do the readings","It's a fun way to get introduced to philosophy."]},"Fall '11":{"comments":["This is a really great Ancient Philosophy class as well as an introduction to Philosophy.  Professor Jones is very easy to talk to, and he really knows this material.  This was my favorite class of the semester.  I took this class over Phil 3 because I felt that the narrower focus on only Plato and Aristotle would pay off, and it did.  Plus, this class is smaller than Phil 3, so you really get to practice writing philosophical papers and putting together arguments.  However, getting an A in this class is extremely difficult, especially to those new to philosophy.  If you've never written philosophy before, you will be terrible at it, but I've been amazed by how much I've improved over the course of this semester.  Definitely do all the readings, and don't be afraid to really think about these thousands of years old texts.","The professor is one of the most boring I've had in all my time at Harvard. You don't get an overall feel for the approach of philosophy in ancient greece, rather 2 authors. Don't expect any contextual background with the readings. It's more like studying stories individually.","Professor Jones truly knows his stuff and teaches it with enthusiasm.","If you know yourself to be someone that likes ancient philosophy, this course isn't bad in covering the major topics--that being said, it does not bring enthusiasm to the material, so if you don't like the material naturally, it won't inspire you.","Wonderful class to get into philosophy! Plato is pleasant to read, and Aristotle is quite difficult at first, but the lectures are great at explaining the key points. By the end, Aristotle is no longer intimidating! The exams are good, because you're given the essay questions before hand, so you get to study for them. It's really fun to discuss the readings!","This class requires determination. The readings are very dense, and writing the required papers takes more time and effort than typical. This was definitely my hardest class this semester.","It's important to take a course like this to get an ancient phil background (for concentrators). But it's not the most exciting or engaging course in the world. If you don't look at secondary material on the primary texts on your own, you won't get much out of lectures. The writing assignments are graded kind of hard.","Solid introduction to Greek philosophy.","This is the hardest of the introductory philosophy courses that I've taken (harder than Phil 3 and Phil 7). I'd say take this course only if you're willing to put in quite a bit of work and would appreciate being held to high standards for your writing and thinking.","Great overview of the ancients, but for someone like me more interested in political philosophy, it was just really hard to get excited about, say, primary substances.","Don't take this. I strongly regret taking it. About a third of the material (i.e. the Republic) is a total waste of your time. Professor Jones is uninteresting and adds very little to the class. There were probably five people I talked to in the class about the class, and each of them was quite disappointed with the class. Take a different intro philosophy class.","Essentially this course is an opportunity to read some very important work by Aristotle and Plato. If Plato's Republic has been on your list of \"must read\" books but you never got round to it, then you may well elect to take this course. You should come into the course with a keen interest for philosophy and have some idea of the messages that Plato taught. The lectures are fairly small and this course has little of the glamour associated with some of the larger courses at Harvard. The two weekly lectures and the section will be your main source of outside opinion but for most of the course it will just be you and the text. You will also be required to write a one page paper almost every week, which is a fantastic way for you to keep the writing hand moving and ensure that you are understanding what you read.","It's great.","If you're interested in ancient philosophy, this course is an excellent introductory treatment of Plato and Aristotle.","My favorite class of freshman fall because i'm really into ethics. Read great works like the Republic and Ethics"]},"Spring '13":{"comments":["Great intro to ancient philosophy. Interesting and important readings. Anyone with an interest in philosophy should take this class. Prof Jones and Olivia were both super cool and knowledgeable teachers. The assignments were gently paced and the exams were very fair. This was probably my favourite class of the semester.","Learning about Socrates and Aristotle is made accessible and challenging through this course","This course does exactly what it's supposed to - provides an introduction to the works and ideas of Socrates\/Plato and Aristotle. The lectures aren't spectacular and the readings can be dry if you don't have a strong interest in the subject, but it's a good foundational course to take if you have always wanted to read these guys but would never get around to it otherwise. The workload and exams were very fair and low-stress, though the grading is always pretty harsh. Olivia was a wonderful TF, by the way, and a big asset to the class.","I thought that I was going to find the material really interesting...I didn't. Make sure you're really motivated.","For anyone who thinks they might be interested in philosophy, this course will be useful in helping them determine whether or not they really like it. The class is generally laid back, with most sections- and even lectures- being centered around discussions of the readings. Professor Jones and Olivia were also both great: they expressed genuine interest in students' ideas, and offered lots of opportunities for one-on-one discussions outside of class, which was especially useful for papers and exams.","You go very deep into learning ancient philosophy. Professor Jones really knows his stuff and his office hours are delightful. He can think of very relevant thought experiments with a snap of the fingers. Olivia is a joy!","Fantastic course if you wat to study Socrates, Plato, and Aristotle, but this is a very specific course for an intro to philosophy.  Other intro classes might be more general.","Good course but grading is difficult."]}},"mostRecentQ":{"overall":"4.17","workload":"2.00","difficulty":"3.17","recommendation":"4.17","enrollment":"17","response rate":"76.47","QCourseOverall":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"2","2s":"2","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"0","2s":"3","3s":"12","4s":"4","5s":"1"},"QWorkload":{"number":"PHIL 7","course_id":"4039","cat_num":"1583","1s":"4","2s":"12","3s":"4","4s":"0","5s":"0"}},"success":true}