{"scores":{"Spring '14":{"course_score":{"overall":"4.10","workload":"2.60","difficulty":"3.40","recommendation":"4.10","enrollment":"28","response rate":"57.14","QCourseOverall":{"number":"PHIL 149z","course_id":"11078","cat_num":"54787","1s":"1","2s":"0","3s":"2","4s":"6","5s":"7"},"QDifficulty":{"number":"PHIL 149z","course_id":"11078","cat_num":"54787","1s":"0","2s":"4","3s":"3","4s":"7","5s":"2"},"QWorkload":{"number":"PHIL 149z","course_id":"11078","cat_num":"54787","1s":"1","2s":"8","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"PHIL 149z","cat_num":"54787","course_id":"11078","year":"2013","term":"2","id":"249339f6d9c871d31004e8dfa6ff16d7","first":" Edward J","last":"Hall","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.40","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"1.90"}]}},"comments":{"Spring '14":{"comments":["definitely take it if you're interested in the questions it addresses. Otherwise it will seem tedious and technical","Good class, a lot of work.","Best class of my freshman year.  Take if you love science, take if you love philosophy.","I think this class might have taught me, in a 'learning how to think way', more than any other I've yet taken. Not perfect, but *really* good--I highly recommend. Also, Ned [Edward Hall] is a gem and you should take anything he teaches ever.","This class is essentially exactly as promised. A fair bit of work, but a surprisingly deep survey of all the greatest hits in terms of issues in mainstream philosophy of science. Some of the greatest hits are really irritating to read and frustrating to think about, but KNOWLEDGE. Ned is a phenomenal teacher and very accessible, so take advantage of that and go to office hours! Doug is a phenomenal TF and very chill, so take advantage of that and go to his office hours if he's TFing again! Also, for those without much background in philosophy: if the class dynamic is like ours was, there will be a few people who think of themselves as *philosophy students* and do the majority of the talking. Don't be intimidated - sometimes they say stupid things too, just in sentence structures that sound convincing. Assert yourself. That is probably true of every philosophy class, actually. But because nobody has really ever done phil of sci before, nobody has much background, so it should be even more democratic.","This class introduces you to philosophy of science's most interesting questions. You'll be challenged tremendously, but the material is incredibly interesting and engaging.","Ned Hall is terrific. The teaching is excellent. The topics are well-covered. It's an introduction to a great way of thinking, which can sometimes get tedious.","Go expecting to learn things about this field. Don't go expecting to develop your ability to argue philosophically.","Amazing course, you will find something you like.","This class is amazing.  It does change the way you look at science.  Ned is amazing.  He is very intelligent, is an engaging lecturer, and really cares about his students.  This has been one of my favorite courses I have taken at Harvard.  Definitely consider taking this class."]}},"mostRecentQ":{"overall":"4.10","workload":"2.60","difficulty":"3.40","recommendation":"4.10","enrollment":"28","response rate":"57.14","QCourseOverall":{"number":"PHIL 149z","course_id":"11078","cat_num":"54787","1s":"1","2s":"0","3s":"2","4s":"6","5s":"7"},"QDifficulty":{"number":"PHIL 149z","course_id":"11078","cat_num":"54787","1s":"0","2s":"4","3s":"3","4s":"7","5s":"2"},"QWorkload":{"number":"PHIL 149z","course_id":"11078","cat_num":"54787","1s":"1","2s":"8","3s":"5","4s":"1","5s":"1"}},"success":true}