{"scores":{"Spring '14":{"course_score":{"overall":"3.40","workload":"2.60","difficulty":"3.30","recommendation":"3.10","enrollment":"14","response rate":"71.43","QCourseOverall":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2013","term":"2","id":"165edb8d123232254f2eb19b107308ff","first":" Rachelle","last":"Gaudet","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"3.30","FacilitatesDiscussionEncouragesParticipation":"3.40","GivesUsefulFeedback":"1.00","ReturnsAssignmentsinTimelyFashion":"1.00"},{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2013","term":"2","id":"fdb4a66a12b052321a6c121d74fe5f0d","first":" Andres","last":"Leschziner","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"1.00","ReturnsAssignmentsinTimelyFashion":"1.00"}]},"Spring '13":{"course_score":{"overall":"4.42","workload":"2.83","difficulty":"3.50","recommendation":"4.00","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2012","term":"2","id":"165edb8d123232254f2eb19b107308ff","first":" Rachelle","last":"Gaudet","InstructorOverall":"4.42","EffectiveLecturesorPresentations":"4.58","AccessibleOutsideClass":"4.88","GeneratesEnthusiasm":"4.75","FacilitatesDiscussionEncouragesParticipation":"4.62","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"},{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2012","term":"2","id":"acee33d732f90c2c771e6cebf51a8159","first":" Victoria","last":"D'Souza","InstructorOverall":"3.33","EffectiveLecturesorPresentations":"3.00","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.25","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"},{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2012","term":"2","id":"fdb4a66a12b052321a6c121d74fe5f0d","first":" Andres","last":"Leschziner","InstructorOverall":"4.83","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.82","GeneratesEnthusiasm":"4.83","FacilitatesDiscussionEncouragesParticipation":"4.75","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '12":{"course_score":{"overall":"3.82","workload":"3.00","difficulty":"3.76","recommendation":"3.41","enrollment":"18","response rate":"94.44","QCourseOverall":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2011","term":"2","id":"599e157c0ee8df97017146e4e2fa19fe","first":"Sarah B","last":"Miller","InstructorOverall":"4.56","EffectiveLecturesorPresentations":"4.56","AccessibleOutsideClass":"4.62","GeneratesEnthusiasm":"4.69","FacilitatesDiscussionEncouragesParticipation":"4.57","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"4.67"},{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2011","term":"2","id":"acee33d732f90c2c771e6cebf51a8159","first":"Victoria","last":"D'Souza","InstructorOverall":"3.06","EffectiveLecturesorPresentations":"2.94","AccessibleOutsideClass":"3.64","GeneratesEnthusiasm":"2.93","FacilitatesDiscussionEncouragesParticipation":"3.64","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":"4.00"},{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2011","term":"2","id":"fdb4a66a12b052321a6c121d74fe5f0d","first":"Andres","last":"Leschziner","InstructorOverall":"4.41","EffectiveLecturesorPresentations":"4.53","AccessibleOutsideClass":"4.43","GeneratesEnthusiasm":"4.47","FacilitatesDiscussionEncouragesParticipation":"4.17","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '11":{"course_score":{"overall":"3.12","workload":"3.00","difficulty":"3.88","recommendation":"2.88","enrollment":"17","response rate":"94.12","QCourseOverall":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"7","4s":"0","5s":"0"}}},"Spring '10":{"course_score":{"overall":"3.24","workload":"2.71","difficulty":"3.86","recommendation":"3.19","enrollment":"25","response rate":"84.00","QCourseOverall":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2009","term":"2","id":"165edb8d123232254f2eb19b107308ff","first":"Rachelle","last":"Gaudet","InstructorOverall":"3.52","EffectiveLecturesorPresentations":"3.43","AccessibleOutsideClass":"4.05","GeneratesEnthusiasm":"3.33","FacilitatesDiscussionEncouragesParticipation":"3.70","GivesUsefulFeedback":"3.86","ReturnsAssignmentsinTimelyFashion":"4.38"}]},"Spring '09":{"course_score":{"overall":"3.05","workload":"2.77","difficulty":"3.77","recommendation":"2.91","enrollment":"25","response rate":"88.00","QCourseOverall":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2008","term":"2","id":"165edb8d123232254f2eb19b107308ff","first":"Rachelle","last":"Gaudet","InstructorOverall":"3.41","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"4.05","GeneratesEnthusiasm":"3.18","FacilitatesDiscussionEncouragesParticipation":"3.38","GivesUsefulFeedback":"2.25","ReturnsAssignmentsinTimelyFashion":"2.60"}]},"Spring '08":{"course_score":{"overall":"2.62","workload":"2.06","difficulty":"3.81","recommendation":"2.69","enrollment":"27","response rate":"62.96","QCourseOverall":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2007","term":"2","id":"0027acd06806f486e0fc0ec4c1373b76","first":"Guido","last":"Guidotti","InstructorOverall":"3.12","EffectiveLecturesorPresentations":"2.94","AccessibleOutsideClass":"3.33","GeneratesEnthusiasm":"3.06","FacilitatesDiscussionEncouragesParticipation":"3.08","GivesUsefulFeedback":"3.67","ReturnsAssignmentsinTimelyFashion":"4.33"}]},"Spring '07":{"course_score":{"overall":"2.70","workload":"2.30","difficulty":"4.30","recommendation":"2.40","enrollment":"22","response rate":"45.45","QCourseOverall":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"7","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MCB 56","cat_num":"5424","course_id":"3531","year":"2006","term":"2","id":"0027acd06806f486e0fc0ec4c1373b76","first":"Guido","last":"Guidotti","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"3.62","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"3.33","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]}},"comments":{"Spring '08":{"comments":["You do not need to understand the material. All you need is to be able to do all the homework problems and all the old exam questions. The Prof does not make up new questions- all midterms and finals recycle old questions","Be glad this class is disappearing forever. Not because the Prof. is bad (he's a great guy), but because it's 9am and there are other ways to learn biochem.","This course was quite frustrating.","only take it if you need ot for med school or a requirement","take it only if you need to, it's not particularly fun","The course is poorly organized, but the material is interesting, and provides a new statistical and mathematical perspective on biological phenomenon. The course also allows you to integrate what one has learned in chemistry, physics and calculus to more deeply understand biological phenomenon.","Just don't do it. Just don't. I wish I hadn't. Someone publish this, please.","You need to put in the time to do well.  There is a lot of material to understand."]},"Spring '09":{"comments":["I think this is a good class for people who really want to learn the material in the class.  It's important to have a strong background and know you have aptitude for the subject before taking it.","If you are interested in quantitative descriptions of biological phenomena, this will be a good class for you!","This class does not provide a good introduction to biochemistry.  The teaching is poor, and it is not worth the effort.","If you are a biology major interested in learning a more physical way of viewing biology, this is a good course. It would not be rigorous enough for physics or chemistry majors.","The difficulty varies widely--some weeks it's very easy, other weeks it's very hard.  Just stay on top of the work, and you'll be fine.  It's actually very interesting, you get to learn so much more about things you've heard about before.","The lectures were good and I felt like I learned a lot but unfortunately I felt like the material that was present on the exams and actually tested had very little to do with what we were taught. Exams were extremely poorly designed and the whole course was quite disorganized.","There are a lot of materials, so be careful studying at the end of the year.","I didn't really enjoy the material and it wasn't really what I was expecting.  I would advise students that it involves more mathematics than they are expecting and encourage them to shop alternative.s","-biological aspects very well covered and insightful\r\n-thermodynamic concepts are not treated too intuitively (not the class to take for a super rigorous understanding of statistical mechanics)\r\n-often derivations of math are not too insightful\r\n-for more rigor, may want to consider classes in the chem dept","It's a good class in principle.  I think in future years it will be improved so that it will be a much better class.","If you are a biology major then I would recommend this course as it is interesting.","The class is well-taught and not extremely difficult, but it is a lot of material, so be prepared to put in time if you want to stay on top of everything.","Only take this class if you're really interested in thermodynamics and math and don't mind doing a lot of textbook reading and practice problems beyond problem sets.","Only take this class if you really are interested in the derivation of formulas used in thermodynamics and kinetics.  Otherwise, it might seem boring and only plugging numbers into equations.","The material is interesting, but the concepts are difficult to command."]},"Spring '10":{"comments":["This class provides an understanding of the basis of many biochemical principles. It teaches in a very straightforward way (go to lecture, learn concepts and how to use equations, and use them on problem sets and exams), which was refreshing for me in contrast to MCB 52.","This is a good bridge between key concepts in chemistry and how they relate to biology.","Great class, especially if you are more of a mathy scientist.","Take the class, you'll be challenged and it's rewarding!!!!","Take it if you like more quantitative aspects of biology, but be prepared to stay on top of the material. And you shouldnt skip lectures","Going to lecture is important even though the readings are generally very good.","take this course only if you're interested in the material.","It fulfills a requirement but is not the most put-together class.","Extremely difficult course that met MWF 9am with pop questions and problem sets due every Friday morning.  Take with caution.","Don't take it unless you HAVE to for med school requirement","I thought the material in MCB56 was very interesting, and it definitely made me think about specializing in biochemistry\/biophysics for graduate school!  It was well-taught, and very organized.","It's a good class--material is very interesting, but be ready to put work into it. You can't fall behind or else things get ugly","As a senior, I had trouble paying attention to the lectures because they were at 9:00 in the morning.","You should be prepared to work on the psets and do a good bit of math and calculus.","This class is only for those definitely interested in a research and biochemistry specific career. Application to other fields in biology is difficult. Medical students, try and find some other option to meet the BioChem requirement."]},"Spring '11":{"comments":["very hard.","Don't take this class unless you absolutely have to.  It has all the drawbacks of a large pre-med with very few of the benefits.","not too heavy on the math -- concepts are interesting","This course is very good for students who like chemistry.  It teaches many important concepts that apply to many facets of scientific understanding.","I took this class instead of PS1, and I am sure I learned much more than PS1, but it definitely ruined my GPA.","It is a fair, well-run lecture-based class in which you receive much more personal attention than typical pre-med classes, and is also much much less stressful.","This class is interesting, but challenging by the end. Rachelle is great and she really cares about her students.","I would recommend this course only if you have a passion for the information. It is very complicated.","Like structural biology and biochemistry, otherwise you'll never muster the interest to give a damn."]},"Spring '12":{"comments":["The material is very interesting and the teaching is quite lucid.  I think its important for people going into grad school in biology or biochemistry to have an understanding of the physical basis for some quite intuitive concepts you may accept.  The material is definitely accessible.","This class can be a lot of work, but it's a decent overview that could be far worse.  It's useful stuff to know, after all.","it's a very well-structured course that covers a lot of ground in protein biochemistry, and the teaching staff have clearly put a lot of thought into making the lectures and exercises. i think they have improved it significantly. take it for the p-chem requirement or biochem! the lab component is relatively painless and more useful than the one for MCB 52. pymol is a useful tool to learn. also, make a study group! we had a good time.","This class is an awesome treatment of protein structure, delving into the physical and quantitative aspects that most other classes (MCB 52\/54, Chem 27) abstract away. You'll go from seeing proteins as blobs\/spinach, to looking at them and being able to play with the structural elements intuitively. This class is about problem solving, intuitions and physics, not memorization. The professors teach from their own interests and experience.","Biochem is a difficult topic, but it couldn't have been taught any better. The instructors are so devoted to teaching. Just be prepared to work hard on psets and exams.","Tough and tedious, but you will learn a lot.","This course was not good. It is unfortunate because the material is actually interesting, but the structure of this course and the way it is taught only made me lose interest in the subject and dread the hours spent studying for this class. Class lectures present very easy concepts or biological examples that are of no help when it comes to exams or psets. This means that you will be on your own to learn anything that matters. Exams are a pain, because if you don't think exactly the way the exam is written, the grades will be bad. Lab portion was burdensome, and taught very little except how to do some techniques. Teaching was okay, but they really need to think about the course from the student perspective while designing the course to avoid basic problems like giving pset questions that, instead of extending your thinking, evolve into frustrating exercises based on the lack of the necessary information or background. Take this course only if you have to, and do not come in to it expecting a pleasant experience.","Great, but it is pretty hard.","If you need to take PChem and are interested in Biology, you should take this class because of the material, which is interesting. Otherwise, the class is pretty mediocrely taught and is organized like an intro class (lecture. section, lab, midterms). Lectures are so-so.","This class covers a lot of material pretty fast, so it definitely takes time and effort to keep up. Based on the problem sets and tests I saw, I think this year's class was an improvement over previous years, but some of the problem sets were still confusing and required a lot of collaboration to finish. The lectures were mostly very clear, though the mathematical derivations could have been clearer. A non-powerpoint format for those lectures would probably have worked better. The lab component was pretty painless, except for the final report that we had to write. The professors and TFs were all accessible, helpful and responsive.","Easy way to get your physical chemistry requirement for CPB out of the way.","Only take this class if you are required to, unless you find the material very interesting.","Take, but not as a senior. Too much work for a senior spring class","It's science! Hooray science! Biology, chemistry, physics - this course has it all. The lab component is actually fun, worthwhile, and relevant, with the potential to yield useful novel results. The subject matter is difficult, as is the workload, but you will cover a lot of ground. That said, the course is geared heavily toward biology concentrators, so if you're more into physics or chemistry, consider Chem 130 instead. But overall, it feels like a natural extension of MCB 52\/54 + orgo, so if you're a junior or senior MCB\/CPB concentrator, then I would recommend it (otherwise don't even think about it). Also, having prior lab experience helps a lot."]},"Spring '13":{"comments":["MCB 56 is a wonderful class. The professors are interesting, the material is well presented, and even the lab is well thought out and actually applicable to what I am doing in my own lab. The course staff have done a wonderful job overall putting together this course -- if you have any interest at all in structural biology or even if you just want to learn more about the biochemical background of life, you should take this class!","This class is really worth it, even if it might be hard at times. You learn a lot about EM, NMR, and crystallography as well as the thermodynamics behind protein binding and folding - all fundamental things to know as a biologist of any kind. The teaching staff is also great, and really helpful.","Well taught and very interesting course, but it's a HUGE amount of work. DO NOT TAKE THIS COURSE WHILE WRITING A THESIS. Otherwise, definitely do it.","The professors are very chill and approachable, get to know them!","This course is a great why to get introduced to biochemistry and biophysics.  The teaching staff are all very knowledgeable and make lectures very fun and informative. The lab portion is also a lot of fun as it teaches you a lot of practical biochemistry skills.","Try not to take this course as a senior. Although you will learn a lot, this class is quite challenging and time-consuming (weekly labs, problem sets). The way the class is run is very similar to MCB 52\/54. The grading is harsh, so it can get stressful.","This is a great class, and a very interesting look at biochemistry. I would definitely take this class. The lab component is not that big of a deal!","Take this course only if Andres is teaching it and they stop researching TAP for lab. The material is great in my opinion, just poorly delivered.","MoCB56 provides a more quantitative side of biochemistry and requires consistent input of work (alongside consistent attendance in class due to frequent pop-quizzes). The teaching staff is great.","You really do learn biochemistry!"]},"Spring '14":{"comments":["Compared to the alternatives for my concentration requirement, this was the less painful choice, but definitely not painless. The lectures sometimes felt like they were going through unnecessary information and sometimes were coming straight from the textbook. Additionally, the \"trick\" questions they ask on psets and tests are frustrating and unnecessary, especially since when with such a small teaching staff they don't catch some ambiguities and\/or alternative interpretations of the questions. While some of the content was definitely interesting and had important practical implications, some of the class also focused on very trivial things. The class often also felt disjointed, jumping from one topic to another with little to no transition. Though I think I did learn some interesting concepts from the class, overall I do not think the class was very helpful for me.","MCB56 was a good intro course to thermo with an emphasis on proteins\/applications to biology. Overall, I learned quite a bit of useful information about how to think about protein structures and reactions in biology. If this counts for your concentration credit, this class is probably less painful than other thermo alternatives. The lab component isn't too bad compared to other labs, as it's only 2.5 hours per week. There are pop questions given in class, so you should consider that if you plan to be absent a lot.","Hard, but a great course. Small setting makes it much better than larger biology classes. Learn a lot and put a lot of what you've learned in other classes together.","The material is generally interesting and this is a good introduction to structural biology (though there is a lot of kinetics as well). There is a lot of busy work though--there are attendance mechanisms via take home quizzes, for which you need to be in class both to receive and at the next session to return. Especially if you are interviewing for med school or busy traveling for intercollegiate events, you miss a lot of these, which is a bummer; the lack of lecture videos makes this even worse. Lab is also tedious, as the actual experiments performed are very low content, despite the requirement for a ~20 page lab report at the end of the course; the section component of lab is useful though. Exams this year were much longer than in past years, preventing many (including me) from finishing the final and cutting it close on the midterms. Definitely not an easy class, but not the hardest I've taken by any means. Would recommend this over other CPB requirements for physical biology if you're not a huge math person.","I highly recommend this class for biologists who like a quantitative view of biology and for physicists who are interested in biological problems.  Although not absolutely necessary, it really helps to have familiarity with molecular biology, organic chemistry, and probability (the intuition about these subjects is most important â€“ e.g. quickly inferring from organic chemistry knowledge what changes might occur if a tyrosine were replaced with a serine).  The class focuses primarily on conceptual understanding as opposed to memorization.  With the exception of the first midterm (where you need to memorize the amino acidsâ€™ structures to infer their properties and their functional implications), exams allow a double-sided note sheet.  Problem set and exam questions are only occasionally â€œplug-and-chugâ€\u009d and more often test synthesis of different concepts.  Importantly for a problem-based class, the course staff are interested in your learning and not in â€œgotchaâ€\u009d questions â€“ if you appropriately justify an alternate interpretation of a question, they will happily accept your answer. (This is not to say that the questions wonâ€™t be tricky!)","I was hoping this course would feel more like an upper level course in terms of the structure, but it ended up being just like an intro course in many ways (2 midterms, final, lab\/section component). Definitely fulfill the pre-requisites, especially the MCB ones. I did not and I fell behind as a result, as a fluency in biochemistry and molecular biology is very much expected. This is a good overview of physical biochemistry, especially on the empirical side, but somebody with a math\/physics background may be dissatisfied with the lack of rigor in some of the explanations.","Prepared to do a lot of work. Like a LOT of work. Lab report felt like a second thesis. Exams are very difficult, so it's difficult to tell how well you did and you will be surprised by how you do.","A difficult course on a difficult subject. However, the material is well taught and if you keep up with the assignments and study in advance for the exams, you will do well. The readings are not necessary, as the lectures are fairly comprehensive of the material."]}},"mostRecentQ":{"overall":"3.40","workload":"2.60","difficulty":"3.30","recommendation":"3.10","enrollment":"14","response rate":"71.43","QCourseOverall":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"1","4s":"4","5s":"2"},"QDifficulty":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"0","3s":"4","4s":"5","5s":"0"},"QWorkload":{"number":"MCB 56","course_id":"3531","cat_num":"5424","1s":"1","2s":"2","3s":"7","4s":"0","5s":"0"}},"success":true}