{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"2.20","difficulty":"3.00","recommendation":"3.80","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"0","3s":"1","4s":"3","5s":"2"},"QDifficulty":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"1","3s":"4","4s":"1","5s":"0"},"QWorkload":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"1","2s":"3","3s":"2","4s":"0","5s":"0"}}},"Fall '13":{"course_score":{"overall":"4.20","workload":"1.50","difficulty":"2.50","recommendation":"4.70","enrollment":"6","response rate":"100.00","QCourseOverall":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"0","3s":"1","4s":"3","5s":"2"},"QDifficulty":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"1","3s":"4","4s":"1","5s":"0"},"QWorkload":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"1","2s":"3","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PORTUG 30","cat_num":"5024","course_id":"4447","year":"2013","term":"1","id":"b59195749224ca9830d6ff9b5a29e43d","first":" Clemence M","last":"Jouet-Pastre","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.00","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.00","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"3.00"}]},"Spring '13":{"course_score":{"overall":"4.30","workload":"1.90","difficulty":"2.30","recommendation":"4.30","enrollment":"13","response rate":"84.62","QCourseOverall":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"0","3s":"1","4s":"3","5s":"2"},"QDifficulty":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"1","3s":"4","4s":"1","5s":"0"},"QWorkload":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"1","2s":"3","3s":"2","4s":"0","5s":"0"}}},"Fall '12":{"course_score":{"overall":"4.58","workload":"2.00","difficulty":"2.50","recommendation":"4.75","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"0","3s":"1","4s":"3","5s":"2"},"QDifficulty":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"1","3s":"4","4s":"1","5s":"0"},"QWorkload":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"1","2s":"3","3s":"2","4s":"0","5s":"0"}}}},"comments":{"Fall '12":{"comments":["There is not too much work and your Portuguese will improve if you put in the effort. Bocskay is awesome and you should get to know him well.","This class was great!! It really helped improve my Portuguese by A LOT, and it pushes you to speak more in the classroom. The course also gives you a better feel for Brazilian culture, which is great, especially if you ever intend on going to Brazil.","Take it!!!!!! i loved this class :) So chill, but so cool! Mr. Steven is really cool and sings all the time! So fun :)","This class is a terrific learning opportunity that not only helped me improve my knowledge of the portuguese language, and strengthened my confidence in speaking, reading and writing the language, but also served as a great introduction to Brazilian culture.","This is a really fun and great way to continue your Portuguese. The readings are substantive compared to earlier levels, but they're easy and generally really interesting and you don't even realize when you've read an entire coursepack. There's no busywork and you never really feel like what you're doing isn't beneficial. One of those classes where, if you do the work and do it well, you get a LOT out of it. And Heloisa is such an animated, creative and fun instructor!","Great introduction to Brazilian culture and history. Fun class!","This is a great class. You learn Brazilian History in addition to key grammar points. The workload isn't bad, and the teachers in the department are generally pretty awesome.","I absolutely recommend this class. Class discussion was lively and stimulating and my Portuguese speaking abilities improved tremendously even within just the first month of being in this class. The readings are interesting and the workload is very manageable."]},"Spring '13":{"comments":["This is a great course to improve your reading skills.","That it is a fun and engaging way to learn about Brazil!","Great class. Take it. You will improve your portuguese and become more immersed in the brazilian culture. Stephen Bocksay is a great professor.","You will have to do a lot of reading, but if you want to continue Portuguese through context (versus through simple grammar and vocabulary review), this is a fun and interesting class.","The class is good, but the material isn't that interesting. It's a long way from the enthusiasm and fun of intro Portuguese, but it's pretty good nonetheless.","Great class if the other students are chill"]},"Fall '13":{"comments":["Definitely take it if you can get Stephen Bocksay as your professor.","This class was a great way to improve language skills while still really learning something important about Brazilian history. Really came away as though I had taken a history class--in the best way possible--and still feel much more comfortable about Portuguese than I had before. I had not taken Portuguese C, and hadn't taken Ad in a year, so I was worried it would be difficult, but it was at a very good balance between challenging and very enjoyable and laid-back. Great course.","This class is wonderful. And if you have Stephen as your TF, you're in for a treat. Be sure to do the reading as section is based off of the readings. If you don't, you won't really have any other opportunity to practice speaking. You'll definitely improve.","This class is very interesting and you will get a lot out of it but make sure that you feel pretty comfortable with speaking and with Portuguese grammar because it isn't really reviewed much... you're just expected to know it.","Be prepared to read a lot and have opinions about the readings. The more you put in, the more you get out."]},"Spring '14":{"comments":["I've heard better things about Portuguese 40 from friends who have taken both.","This course is amazing! It gives you the opportunity to solidify portuguese knowledge by learning about Brazilian culture, identity and politics. Readings give you a lot of insight as to what Brazil's national identity is like and the project at the end of the semester is a great opportunity to delve into an issue about Brazil that you want to learn more about. I feel that this course improved my Portuguese grammar as well."]}},"mostRecentQ":{"overall":"4.20","workload":"2.20","difficulty":"3.00","recommendation":"3.80","enrollment":"7","response rate":"85.71","QCourseOverall":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"0","3s":"1","4s":"3","5s":"2"},"QDifficulty":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"0","2s":"1","3s":"4","4s":"1","5s":"0"},"QWorkload":{"number":"PORTUG 30","course_id":"4447","cat_num":"5024","1s":"1","2s":"3","3s":"2","4s":"0","5s":"0"}},"success":true}