{"scores":{"Fall '13":{"course_score":{"overall":"4.00","workload":"2.20","difficulty":"2.80","recommendation":"4.00","enrollment":"44","response rate":"90.91","QCourseOverall":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"0","3s":"11","4s":"16","5s":"13"},"QDifficulty":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"9","3s":"29","4s":"2","5s":"0"},"QWorkload":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"5","2s":"22","3s":"13","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 70","cat_num":"4249","course_id":"5175","year":"2013","term":"1","id":"7ee315cd84690f3848f0513bb2565bb9","first":" Laura A.","last":"Frahm","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.20","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '12":{"course_score":{"overall":"3.67","workload":"1.78","difficulty":"2.61","recommendation":"3.76","enrollment":"47","response rate":"97.87","QCourseOverall":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"0","3s":"11","4s":"16","5s":"13"},"QDifficulty":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"9","3s":"29","4s":"2","5s":"0"},"QWorkload":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"5","2s":"22","3s":"13","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 70","cat_num":"4249","course_id":"5175","year":"2012","term":"1","id":"7ee315cd84690f3848f0513bb2565bb9","first":"Laura A.","last":"Frahm","InstructorOverall":"3.67","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"4.03","GeneratesEnthusiasm":"3.91","FacilitatesDiscussionEncouragesParticipation":"3.65","GivesUsefulFeedback":"3.94","ReturnsAssignmentsinTimelyFashion":"3.67"}]},"Fall '11":{"course_score":{"overall":"4.21","workload":"2.03","difficulty":"2.57","recommendation":"4.30","enrollment":"41","response rate":"95.12","QCourseOverall":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"0","3s":"11","4s":"16","5s":"13"},"QDifficulty":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"9","3s":"29","4s":"2","5s":"0"},"QWorkload":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"5","2s":"22","3s":"13","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 70","cat_num":"4249","course_id":"5175","year":"2011","term":"1","id":"4c5d829ed3e7ef5a2ff4d73d7aece084","first":"Rebecca Anne","last":"Sheehan","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"3.68","AccessibleOutsideClass":"3.70","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.86"}]},"Fall '10":{"course_score":{"overall":"3.55","workload":"1.66","difficulty":"2.55","recommendation":"3.79","enrollment":"58","response rate":"96.55","QCourseOverall":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"0","3s":"11","4s":"16","5s":"13"},"QDifficulty":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"9","3s":"29","4s":"2","5s":"0"},"QWorkload":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"5","2s":"22","3s":"13","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 70","cat_num":"4249","course_id":"5175","year":"2010","term":"1","id":"4c5d829ed3e7ef5a2ff4d73d7aece084","first":"Rebecca Anne","last":"Sheehan","InstructorOverall":"3.41","EffectiveLecturesorPresentations":"3.43","AccessibleOutsideClass":"3.72","GeneratesEnthusiasm":"3.64","FacilitatesDiscussionEncouragesParticipation":"3.64","GivesUsefulFeedback":"3.44","ReturnsAssignmentsinTimelyFashion":"3.33"}]},"Fall '09":{"course_score":{"overall":"3.53","workload":"1.69","difficulty":"2.64","recommendation":"3.58","enrollment":"38","response rate":"97.37","QCourseOverall":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"0","3s":"11","4s":"16","5s":"13"},"QDifficulty":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"9","3s":"29","4s":"2","5s":"0"},"QWorkload":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"5","2s":"22","3s":"13","4s":"0","5s":"0"}},"instructor_scores":[{"number":"VES 70","cat_num":"4249","course_id":"5175","year":"2009","term":"1","id":"afcab0b47c477447ba01a06e5127d544","first":"Ted","last":"Barron","InstructorOverall":"3.44","EffectiveLecturesorPresentations":"3.22","AccessibleOutsideClass":"3.63","GeneratesEnthusiasm":"3.36","FacilitatesDiscussionEncouragesParticipation":"3.61","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.10"}]}},"comments":{"Fall '09":{"comments":["If you're interested in film, this is a very enjoyable introductory class that covers a lot of film techniques and movements without becoming overwhelming.  I definitely have a much greater appreciation for the art of filmmaking now.","take it with ted!","I took this class because I thought it would be easy and I could learn new things about making movies. It was easy, but boring, and I didn't really learn that much about movies. A good choice for a Lit B for the art-illiterate like me.","This class is actually fun.  The films that you watch are interesting, and the readings are not hard for the most part.  Some of the articles that you read are challenging, but the professor and TF explain them well.","If you are interested in becoming a film-maker, or if you are extremely interested in movies, I would recommend you take this course.  If you don't know much about movies and are just looking for an easy, fun elective, I warn you that this course is somewhat dryer and more difficult than you might expect a course about movies to be.","It's a nice way to fulfill a Lit-B core.  The movies are mostly enjoyable and you learn to appreciate films on another level.","Be prepared to invest a lot of work without reaping the rewards you deserve.","The information learned in this course is useful grounding for studies in film theory, but the lectures were poorly organized and didn't seem to provide much insight beyond the textbook.","Great class for anyone interested in an introductory scope of the dimensions of film making.  You'll never watch a film the same way again.  Very accessible professor and tf.","Good course for beginners in the subject of film, but not as great for those with some experience in the field. Did not fulfill all my expectations considering how much I already loved and had studied the subject matter when I entered.","A great introduction to film theory.","I regret sleeping through it. The course material is interesting though, the professor pretty good, and it changes the way that you might evaluate film.","In the past this course has been taught to a general audience. This year, it was targeted towards people who had a strong enthusiasm for film themselves in an academic way. The professor did not seem to generate additional enthusiasm for the subject matter, and his lectures were surprisingly not audio-visual for audio-visual material.","Lectures dry.","It's a good class to get a very general background to film. Between the classes, lectures, section, and screening, it does end up taking a lot of time, but I think it's worth it, especially if you want to take a more advanced film class.","Prior knowledge of film is not necessary for this course. It is not necessary to do all of the reading for this course, but doing the reading is extremely beneficial in that the texts give you a better sense of the technical terms of shot analysis and how to apply them.","The class is boring.","Take another film class taught by someone else. You DO NOT need to take this course first.","If you already know the basics of film, there isn't not much reason to take the course.","A nice change of pace from the other academic classes I was taking, but not incredibly riveting.","Barron is not a great lecturer, although I understand that he is not who usually teaches this course.","Watch the movies since you will get a lot out of them."]},"Fall '10":{"comments":["Not the best class I ever took.","A pretty good class.  Professor Sheehan made the course a little easy, but if you're new to film studies that makes it especially accessible to you.","I loved learning about how and why films create the effects they do and why we respond to them in certain ways. If you want to watch and discuss and write about cool movies, this class is for you.","If you want a strong background in classic films and film theory, this class provides that.","Great list of movies. Some of the reading is a little dense, but still manageable. If you like film and film theory, or would like to know more, this is where you start.","This class was a lot of fun, even if occasionally time-consuming. Lectures are enjoyable, with lots of movie clips and discussion, sections are low-key and helpful, and screenings are interesting. The textbook was fine, but some of the readings were pointless, and papers took up way more time that I would've liked. But overall, I'm really glad I took this class. College is the perfect time to take a film class at any rate!","I think the course achieved its ideal role this year - a fair, manageable, and exciting introduction to film. While lectures could be difficult to follow, the films chosen were often engaging and evocative of the principles being studied. The textbook was very helpful (and well-written), and critical commentary was presented a digestible pace. Assignments were, for the most part, what you would expect of an introductory course, and were fairly graded.","Lecture is a bit boring but interesting if you're in the mood, and  pretty necessary in order to do the assignments if you don't know much about cinematography, editing, etc. Do the readings if you have time, not because you need to but because they do make the course more interesting (I didn't and regret it).","You will have a whole new appreciation for film and the language to speak about it and analyze it intelligently.","Good introduction to film theory, introduces you to many of the major filmmakers and theorists. Is sometimes super-dry.","Its hard to keep up with all the films, but its a great way to learn a lot quickly.","Take it pass\/fail.  It is interesting and fun to learn about film, but the grading is a disaster.","This class is a fun way to be introduced to the world of film- you learn how to analyze film including the different terms used and also gain a better appreciation for everything that goes into directing a film. The reading is reasonable and the assignments weren't too hard.","The class is like a mechanics workshop. You learn how the parts work, but it does not teach an appreciation for the finished product--i.e. you will spend a lot of time learning the tools to deconstruct a film, like sound, perspective, terminology, etc. In other words, when VES decided to name the class The Art of Film, they mean \"art\" in terms of craft and not a created object of higher meaning.","It's interesting if you like watching films and being able to talk about them, and not that much work. Sometimes can get quite abstract and hard to follow.","Please go to lecture! I really wish I attended more often because the information is super interesting and important if you hope to go into film!","It is an enjoyable course, but frankly I didn't feel I left it with a clear understanding of, well, the art of film in any complete way -- or even in a foundational way. The course gives good tastes of how the art of film is constructed, but it didn't always feel systematic. Then again-- my record of attending lectures was less than stellar.","I liked the section and the films we saw. Lectures were okay, and a bit early. Other than that, it's an easy class and kinda fun.","This class has a relatively moderate workload and engages you in a way of thinking about filmmaking and cinematic thinking that you likely have not considered before.  It's an excellent entry into a more sophisticated outlook on the manner in which films are both composed and perceived.","The material is extremely interesting. The films and readings are really beneficial. However, the class deeply needs a restructuring. Sections are pretty much useless, and lectures are not very helpful.","Logical. easy to follow. coherent lectures. easily accessible films. completely reasonable assignments. Only 3 hours of class time a week. Learned a lot of necessary things about films if you want to go into the field. watched a lot of good classics, that you might not otherwise watch on your own. gives great movie recommendations.   BUT be sure to ask your section leader\/professor for an example of a good film analysis before you're asked to write one so yo don't think you did a good job and then get screwed...","This course was great, a wonderful introduction to film. However, be prepared for a lot of analysis.","This class is fun","It's hard.","I found this course very interesting and if you enjoy film it should not be overlooked.","This class is, unfortunately, very poorly taught. Don't expect to get much out of it.","The course provides a good understanding of cinema and important films historically","Will learn a lot but the class is hard. Assignments are hard and it is something you most likely will never have been exposed to before. Film concepts are often hard to grasp. Success in other analytic subjects not correlated directly with success in VES 70.","This is a class you get out of it what you put in. There is no reason not to get a good grade in this class.","a truly enjoyable course for those who want to learn more about film and film theory","Do it, and if you're having trouble adapting to writing for a new discipline (cinematic studies) make sure to engage with your TF - you will pick it up quickly. Take this class, you will learn a lot, have a lot of fun, and not work too hard.","This is a good class to serve as an introduction to film theory and history.  It is heavily section-driven and requires average time and effort, but can get repetitive and boring at times."]},"Fall '11":{"comments":["This is such a great class. I came in not knowing anything about film, and have loved learning the basics of film and the progression of film and all it components throughout the years. If you are looking for an interesting class with a pretty light work load, Take This!! Learned a lot with out having to stress too much.","Loved it!!!! The films screened were fantastic this year and the challenge of reading a little bit of film theory each week was actually quite enjoyable (don't worry the reading load is quite manageable...you can skim some of the longer readings and they let you know which ones are really important). Don't take it just to see movies though...take it to understand how cinema can be an \"art.\" If you take it just to take it you may roll your eyes at the discussions in section, the readings or the course in general. I also really like Prof. Sheehan...she's really accessible. She may seem shaky at times in lecture BUT she does know what she's doing so give her that. If Kyle TFs the class again you're lucky because he's brilliant, really chill and helpful (three qualities I rarely see coexisting in grad student TFs).","Fun and light class to take! If you are actually interested in film theory, it does get you started on how to read films critically.","If you have not yet taken a film course at Harvard, be aware that this course is not necessarily an accurate representation of the field.  This course is intended as an introduction to the method and reason of formal film analysis, and that its tightly structured form is kept with the intent of providing exactly that, and little more.  The assignments do not easily encourage exploration beyond the requirements; that being said, any student who is willing to do more will, with a little initiative on his or her part, be able to do so.  The course material and section discussions themselves are extremely interesting and engaging, however!","Very interesting material.  Film studies gives you a fantastic technical\/ cultural background in film, and the screenings are very informative (though sometimes the films dragged).","Take this course! It's amazing! The class screenings are fantastic and lectures consist of a lot of clips to back up the theory being covered. Possibly the class I've enjoyed the most at Harvard.","It's excellent. Take it!","The course is interesting, but not everyone's cup of tea. If you're a bit on the artsy side, and don't mind a bit of overanalysis, the course is a good one.","This course gives you an entirely new perspective on all kinds of films and helps develop a better appreciation of the details of filmmaking. The material covered is interesting and would be engaging for anyone even they were not interested in pursuing film as a concentration.","This class was phenomenal and was one of the best classes I have taken over my 3.5 years at the college.","This class is so much fun.  The lectures are sometimes a bit slow, but Professor Sheehan excels at making them participatory.  The movies are fun.  The assignments are fun.  There isn't too much work over all but you still learn a lot.  This course has changed the way I watch TV and movies in general.  It has made the practice of viewing visual media a much richer and more fulfilling experience.","This course should change forever the way you watch films. To be sure, it shall bring you out of the ignorance of absentminded spectatorship into an articulate self-conscious spectatorship that can actually appreciate films aesthetically rather than merely voyeuristically.","You get to learn about so many different aspects and decisions that go into filmmaking. It really helps you have an appreciation for film. Professor Shehan is a still a little nervous during lectures but she is obviously very knowledgeable about film and I found lecture enjoyable especially with all the film clips. Be prepared to watch films every week and spend a little more time outside of lecture each week for this class.","Make sure you differentiate between an interest in film theory and film production.","This class is a great intro to the cinema of film and learning how to discuss and write about film. It's also a nice, fun, easy elective. My one complaint is that it almost seemed a little too easy at times--section discussions were a little dumbed down, and expectations for papers and tests didn't seem very high. It's the kind of class where you can get as much as you want out of it. You can breeze through it and enjoy yourself, or you can really engage with the material, learn a lot, and challenge yourself to really think critically. Either way it's awesome!","Want to be an artsy intellectual film buff? And have fun with it? Take VES70.","This class is fun, without stress, and it is what you put into it. No matter what you are going to learn and watch great movies.","A good course to take when deciding whether film studies is an interest for you.  I would suggest looking at the syllabus to see if they seem like films you would see on your own.","VES 70 was a good introduction to film history and theory. I feel like I was exposed to diverse range of films and acquired a greater appreciation for the choices that underlie their form and style. The workload was very manageable.","I took this class as an elective, and I absolutely loved it. I recommend it to anyone interested in learning more about film - because of your future plans, because of general interest, or otherwise. While you won't become an expert in film theory by the end of the course, it provides you a firm grounding in both film techniques and history.\r\n\r\nAs a caveat, I will say that having a good TF is probably important. I did not necessarily love the lectures themselves (although they were decently interesting), but I did enjoy the class discussions. If the section leader does not force you (via blog posts\/writing requirements\/discussions) to engage critically with the reading material, then the class will be a waste."]},"Fall '12":{"comments":["Really interesting class that makes you think about film in new ways--the reading got dense and theoretical (polite way of saying boring) at times, but Bordwell's Art of Film was consistently interesting and accessible. The assignments were interesting and made it easy to pursue your own interests. I definitely recommend this class if you have any interest in film.","Interesting, but the lectures do not not necessarily connect with the assignments","Definitely take it.","You get out of it what you put into this course, so do all the readings (especially the textbook) and you will learn a lot about film.","Professor Frahm is amazing. And so is Katie. Though lectures can be a little boring, the class is still awesome and so fulfilling no matter what you're concentrating in.","This class can be interesting at times and frustrating at others. In the end, I did enjoy it but I wonder if there aren't better film classes out there for those just looking for an elective to take.","Really great class. With the encouragement of creative assignments, its a lot of fun. There is no one course to cover the entire scope of film, and like any art form, the outlooks on it are highly subjective. The idea is to get you exposed enough to have your own opinions and thoughts about it. The work is very very manageable and the TFs are great.","This is a good, fun class. Since the lecture material is never tested and Prof. Frahm's voice is soothing and sweet, sometimes its hard not to zone out a bit. But the screening are good and the workload is light. Two essays, weekly \"video blogs\", and a group project.","The course is really great, but it tries a little \"too hard.\" For example, my friend's TF once sent out an e-mail, during class, saying \"to the 12 of you who aren't here, I know who you are...not too sound omniscient.\" That started off the semester in a pretty unusual way and led to a 10-AM sign in sheet (FOR A FILM CLASSS!!!). Most people would want to be there anyways...so that was weird.","If you are considering taking this class, then I strongly recommend doing so. It is a fun, informative, engaging, and creative class. The workload can be a little deceptive at times because there is the film screening and blogs that tend to take up some time in addition to the papers (need to rewatch films when doing so) but for most weeks you just need to get the highlights of the reading and pay attention as much as you can and you will get so much out of the course.","Great intro to film class!","Though Professor Frahm is a bit shy and quiet in lecture and some of the films you'll watch are bizarre, this course is ultimately a peek behind the film curtain. The history and mechanics are fascinating, Bordwell and Thompson is one of the lighter books you'll be required to read, and the assignments, though time-consuming, are actually quit enjoyable.","This film will teach you a TON about the history of film, how movies are made, and how to look at cinema critically. Sections are great (especially if Katie is your TF), but lectures can be quite dry and unengaging. The course is quite manageable, and the creative assignments can be a lot of fun. One recommendation: DON'T go into this course because you're interested in watching a few of the movies on the syllabus (e.g. Citizen Kane, North by Northwest, etc.). Instead, go into this course if you're really interested in learning about how to appreciate film and how to talk about cinema in an educated way. The Section component of this course was definitely a 5 for me, but I would give the course somewhere around a 4.3 overall. I really liked a lot about VES 70, but it could have have been a lot more challenging, and the lectures could have been much more engaging (it's a class about MOVIES for goodness' sake!). Shop it, see what you think.","If you have a true love\/interest for film, this class is most definitely for you.","This class has potential to get even better. We were the guinea pig class, as the first with a new professor (Laura Frahm), and a new project (the final multimedia project). I'm sure this will only get better with time.","The lectures are interesting, and it will help you to be more culturally literate about films and how to interpret them better. Work is minimal. There might be two or three projects that demand some sizable effort, but other than that I wouldn't worry about workload. And the weekly screenings are usually a good excuse to relax and watch a movie.","Loads of fun, if you're genuinely interested in film. The assignments are enjoyable and colourful. The course staff takes great interest in individual students' work... Detailed feedback on assignments. However, the lectures and non-textbook readings are not always connected to the subject matter.","I didn't learn much from this course.","Sections are great, but lectures aren't--hard to follow the flow of the course. It's focused more on film history than on actual analysis, which means that there is minimal guidance on the assignments.","I'm in love with everything about this course. Professor Frahm, a brilliant new transfer to Harvard, has revamped this course to make it into something extraordinary. Her lectures are thoughtful and to the point, displaying wide networks of mutual influences and several origins. She's super accessible outside the class, and is closely involved with each student (and their writing) although this is technically a lecture course. This is definitely not your average introductory level film studies course with an ambitious mission of both teaching you how to write about film, and exposing you to several aspects of world cinema (not just mainstream Hollywood). The assignments are likewise ambitious and sometimes too demanding, but you learn so much from completing these assignments, that they're definitely worth it. Katie is a phenomenal and extremely helpful TF with a terrifyingly awesome sense of humor, and she makes this course shine like a diamond with additional extra-credit screenings.","This was the class I was most excited for and the class that most let me down.  First off, there is no predictability to the class.  You receive very little feedback (only on the first essay) so it's difficult to improve in between the first and final essay.  So it's hard to know if you're doing something right or wrong for the majority of the semester.  Secondly, the class is not unified.  Lecture, section, and readings could be parts of three different classes.  They never seemed to satisfactorily combine into one coherent experience.  Also, with the exception of three films, they really aren't that interesting.  So, the class felt very disjointed.  This might be because this was the Professor's first semester, but she needs to reorganize her class before I can recommend it to anyone.  In short, don't take this unless you're concentrating in VES or you've heard the Professor has made major changes - which I think is totally possible because she seems relatively open and understanding.  I do hope this feedback helps her!","It's a great introduction to film history\/theory. No prior knowledge is required and the section discussions are great. You can just tell how much everyone involved in the course loves film, and it's a little contagious.","Wonderful course, terrific introduction to film theory and analysis, inspires an appreciation for film across genres\/decades.","Despite Professor Fraham being very nice and clearly knowledgable in film, the lectures were very boring and even unnecessary. Reading through the book once would have provided more insight into film than attending all of the lectures. Katie was the best however â€“ perhaps even worth taking the class to have had a TF like her.","This class introduces you to the major film movements, which is really interesting.  The film screenings are fun and an easy way to see major examples of the styles you are studying in class.  The papers aren't explained well, which makes them difficult, but the class content and readings are fun and interesting.","Good films but not very engaging.","The Teaching Fellows are fantabulous! Katie Kohn is the single most encouraging TF I have ever encountered.  She instilled in me confidence in my work and my opinions, even when I was surrounded by movie buffs (which I am not).  I think that the downside here is the lecture component.  They sometimes drag, and are not as pleasant as the screenings or the sections.","If you have ever wanted to gain knowledge about the context for the movies that you see everyday, this course is hugely beneficial. You will learn how movies are made and why certain directors make certain choices, but you'll also learn about the long tradition of auteurs that informed these decisions and inspired them. You'll also get to watch some great and very interesting films along the way.","This course is not overly dificult, and I would lable the reading as optional. The only warning I would give it there are only three assignments, all of which are a bit vague. If you can't write an extremely academic paper about film, you may not want to take a course that bases so much of your grade on said papers.","Professor Frahm was pretty soft spoken and could have fleshed out her specific points for lectures better. She tended to get carried away explaining her outlines for each lecture and glazed over many points without giving great examples. Most of the film screenings were intriguing and classic, but a few were pretty weird and archaic for my tastes. I think this course needs to integrate more films from the 90s and 2000s and realize that contemporary classics could still show interesting cinematic techniques. The assignments were mainly essays (no exams, one vocab quiz), though their instructions were sometimes confusing. There was also a multimedia project that was due 2 days after Thanksgiving break and I feel we could've benefitted from being forced to do earlier planning back in October (maybe even have them due before the break).  Katie Kohn was a fun TF and was very encouraging in section when you tried stretching connections between concepts or film techniques, though we usually discussed more of the readings and less of the screenings and our reactions to them. SUMMARY: This was an easy, fairly interesting but not terribly exciting or perfectly organized course that might be better enjoyed by serious VES buffs (I'm a psych major). Perhaps it would have been better taught\/organized by a different head lecturer. Professor Frahm was very sweet, though!","This class is great fun and the group of students is one of the most diverse (in terms of interest, grade. etc.) I've seen in a class of this size. Prof. Frahm's lectures are so-so, but section is incredible. Some of the readings were more difficult to get through (Andre Bazin), but do read them because section discussion will clarify your understanding if you come prepared. Do note that the screenings often ended late (7-9 was to short a period for many of the film programs), but the films and shorts beforehand are incredible so just plan accordingly and try to be patient during the screening even if it runs 30-45 mins past 9. The assignments were fair and the course is well structured to prepare students for the assignments (workshop on iMovie before the iMovie assignment). Prof. Frahm and the TFs make themselves very available and approachable. Great intro to film studies. Will leave you wanting more. \r\n\r\nThe weekly blogposts seemed kind of annoying at times. This is partly because I probably took them too seriously, but I got a lot out of them, so even though it was time consuming, it helped me develop skills to analyze film."]},"Fall '13":{"comments":["Great class. Very interesting films and assignments. There is more work than one would expect, but it is mostly pretty easy and manageable.","This is a great introductory course for anyone interested in film.","This class is great for students looking to concentrate in films studies or are interested in studying the historical movements of film. The screenings on Tuesday nights are great, and after taking this class you will watch films differently: you will appreciate things like mise-en-scene and camera movements.","Frahm is superb. Her lectures are structured really well and encourage discussion. Sadly, many don't discuss. Section with Serge was one of the best I've had. Mind blown is the only way I can describe it. He's very encouraging which contributes to a productive section. The assignments take some time and the weekly post is annoying sometimes. The films are classics that most have not seen. This shouldn't scare anyone away, though; they're all fantastic! The film screenings demand some time, but you're watching a classic on the big screen. Overall, a solid introduction to film history and theory.","This course touches upon interesting topics in cinema. You can choose your own topics for assignments and projects, so it is convenient for you to develop your thoughts on what you are most interested in.","Definitely make sure you're interested in the material!","It will change your perspective on how you look at film, that's for sure. Most of the films you watch are interesting. Some of the readings may be unnecessary and sometimes lecture may draw on a bit, but when it comes down to it, this class is definitely worth taking. The assignments are very well-thought out and force you to think intellectually about film. Professor Frahm is very accessible and motivated to make sure you do well. Also, if Jungmin is still a section leader, she goes above and beyond to assist you in anything you want to accomplish in this course.","Professor Frahm is the best! She is so helpful and makes you understand why you love the films that you love. This course has changed the way that I watch film.","Definitely take this class!! The best class I have taken at Harvard. I recommend it to everyone -- whether or not you have previously been interested in or worked in film.","If you already know film production and film history, check the syllabus for the parts you don't know and try to look those up online or in the film library in Sever. This is an intro course and you should probably fill in some of your gaps on your own and then take a higher level film class that says VES 70 is a prerequisite but just wants to make sure you have a basis. But if you decide to take it, the professor and section leaders are really nice and there was a fun group of people in the class.","The thing about this class is that the course itself has all the potential to make for a very interesting class, but the teaching staff (at least the semester I took it in) don't actualize that. Professor Frahm is obviously knowledgeable, but she's not very engaging as a lecturer. She's great to talk to outside of class, but she can't command the attention of a class of 50. The section leaders this semester don't help her out, either. Section felt like another class of its own, except if it were actually a class, it would not be at Harvard. At times, it was completely disjointed from the lecture and would tackle new philosophical ventures beyond the realm of film. Unfortunately, it wasn't connected to the lecture topics sufficiently. The film selection was all right. I didn't appreciate the earlier films as much as I did the more contemporary ones, and they were not discussed enough in section, where I felt it would have been good to talk about them. The readings were more optional than anything, and I got away with not reading half of them. You will be asked to make visual essays for this class (basically montages of different movies) but you'll have to look for the movie clips yourself (which means you have to either rip DVDs or else have to download the clips illegally) so if you're not up to that kind of creative thinking, this class isn't for you. The class does allow a lot of flexibility though so you do get a lot of freedom with regards to the films you choose to write about. All in all, I would love to recommend this class but I think it needs to iron things out first.","If you have any interest in cinema, this is an interesting and relevant way to fulfill your Aesthetic Understanding requirement.","Fun and relaxing class to take for AIU.","The professor and the TFs were super nice. I was able to learn a lot about film history and the cinematic techniques. No background knowledge is necessary. I recommend this course because it gives you a new perspective about films and about life in general.","This class is outstanding. Professor Frahm is fabulous and try to get Jungmin Lee as your section leader! I wish I could take this class again. The film selection is fascinating and rich and the reading is super interesting. The lectures are really informing and interesting, the section is inviting and engaging, and the films shown on Tuesday night are more fun than work. Professor Frahm is a wonderful person, in the classroom and out, and you should really get to know her. Take this class if you can! It's by far been my favorite class at Harvard.","I surprisingly learned a lot about film in this class. I didn't enjoy it as much while I was enrolled, but reflecting back it was beneficial. The assignments aren't the most useful.","The class is really interesting. I was new to film, and I definitely learned a lot about cinematic history and I learned a new critical approach. Professor Frahm is really smart and sweet and an interesting lecturer, and Serge is a great TF.\r\n\r\nThe class is kind of disorganized and sometimes feels a little bit like a joke. The assignments are really annoying--they usually have multimedia components that require iMovie or Final Cut Pro. I didn't know how to use them and they're really frustrating. Things take forever to import and export and it crashed my computer and ate up a lot of room on my hard drive. This might sound like a trivial complaint but it really colored my experience of the course because I got so stressed and frustrated with every assignment and they all took much longer than anticipated. The lectures\/section never really touch on the readings, so they kind of feel like a waste of time, and sometimes the lectures didn't even delve too deeply into the films we screened. \r\n\r\nOverall I would recommend this class because you do learn a lot of interesting things and you really learn how to watch film in a different way, but be prepared to be a little bored and frustrated at times.","This is a great class for an introduction to the history of film.  Not only did we learn about film techniques and styles, we also learned to use those techniques to evaluate cinematic movements.","Lectures can be tedious, section can be very vague. The material itself is interesting but its presentation and cultural connection is sometimes lacking","This class is great.  If you need an AIU class then take this.  I didn't take it for that reason but I definitely know that a lot of people did that.  The material is great and if you are interested in film, you will learn a lot about history and theory.  This is definitely an intro class but I thought it was so interesting and even though it seems like there is a lot of work (screenings, blog posts, projects), it doesnt take that long and they give you a lot of time and help","It will expand your understanding and appreciation of film.","Great class, but strong focus on history of film.","It's a great way to fulfill your AIU requirement. As long as you go to screenings, participate in discussions, and do the short weekly assignments you'll gain more than you expect from this course. I did not do many of the readings, but it definitely helped to skim or look them over when writing blog responses. Also, that helped when writing the longer essays. The films we watched were pretty cool, and discussing them was even more fun just to hear people's perspectives. I would not consider this course a big burden on anyone's workload, but give yourself some time for longer assignments during the semester.","Professor Frahm isn't a great lecturer, but the material covered is super interesting. The workload is really inconsistent. Some weeks, I spent very little time doing work for this class, but the projects took up huge amounts of time.","This is a great course, definitely consider taking if at all interested in film. Professor Frahm is very passionate about film and is just a sweetheart--get to know her outside of class.","Professor Frahm is so kind and knowledgable. Lectures are thorough and interesting. Lots of assignments, but they are fun to do. Movies are good, too. Definitely worth taking if you need an A&I and want to learn about film. Useful for life!","I loved this class. If you have any interest in film you will come away from it knowing much more than you went in with, and you'll watch some great films to boot. The class can be a bit time consuming--there are two lectures a week and one section, and a 2.5 hour screening at night once a week, but the projects and papers are interesting and the professor\/TFs are genuinely passionate about what they're teaching. I recommend it.","VES 70 lectures are boring. Section was pointless. The assignments were hard but useful."]}},"mostRecentQ":{"overall":"4.00","workload":"2.20","difficulty":"2.80","recommendation":"4.00","enrollment":"44","response rate":"90.91","QCourseOverall":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"0","3s":"11","4s":"16","5s":"13"},"QDifficulty":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"0","2s":"9","3s":"29","4s":"2","5s":"0"},"QWorkload":{"number":"VES 70","course_id":"5175","cat_num":"4249","1s":"5","2s":"22","3s":"13","4s":"0","5s":"0"}},"success":true}