{"scores":{"Spring '12":{"course_score":{"overall":"4.56","workload":"2.81","difficulty":"3.31","recommendation":"4.69","enrollment":"17","response rate":"94.12","QCourseOverall":{"number":"GERMAN 147","course_id":"2105","cat_num":"6994","1s":"0","2s":"0","3s":"0","4s":"7","5s":"9"},"QDifficulty":{"number":"GERMAN 147","course_id":"2105","cat_num":"6994","1s":"0","2s":"1","3s":"9","4s":"6","5s":"0"},"QWorkload":{"number":"GERMAN 147","course_id":"2105","cat_num":"6994","1s":"1","2s":"4","3s":"8","4s":"3","5s":"0"}},"instructor_scores":[{"number":"GERMAN 147","cat_num":"6994","course_id":"2105","year":"2011","term":"2","id":"dd5da5e35720279c6f118465599d4e59","first":"Peter J.","last":"Burgard","InstructorOverall":"4.56","EffectiveLecturesorPresentations":"4.44","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '08":{"course_score":{"overall":"4.37","workload":"2.89","difficulty":"3.47","recommendation":"4.53","enrollment":"28","response rate":"67.86","QCourseOverall":{"number":"GERMAN 147","course_id":"2105","cat_num":"6994","1s":"0","2s":"0","3s":"0","4s":"7","5s":"9"},"QDifficulty":{"number":"GERMAN 147","course_id":"2105","cat_num":"6994","1s":"0","2s":"1","3s":"9","4s":"6","5s":"0"},"QWorkload":{"number":"GERMAN 147","course_id":"2105","cat_num":"6994","1s":"1","2s":"4","3s":"8","4s":"3","5s":"0"}},"instructor_scores":[{"number":"GERMAN 147","cat_num":"6994","course_id":"2105","year":"2007","term":"2","id":"dd5da5e35720279c6f118465599d4e59","first":"Peter J.","last":"Burgard","InstructorOverall":"4.53","EffectiveLecturesorPresentations":"4.63","AccessibleOutsideClass":"4.29","GeneratesEnthusiasm":"4.68","FacilitatesDiscussionEncouragesParticipation":"4.63","GivesUsefulFeedback":"3.86","ReturnsAssignmentsinTimelyFashion":"4.20"}]}},"comments":{"Spring '12":{"comments":["Are you strong enough?","You get a chance to read some incredible books under the guidance of a terrific scholar and teacher.","A great introduction to Nietzsche's thought and an entirely new way of analyzing texts.  The reading list is comprehensive and demanding.  The assignments are meaningful and fair, and the staff are engaged and helpful.  I was almost never bored in class, which is rarely true in a two-hour seminar.  \r\n\r\nA great class where you get to think about all of the deep questions you were hoping for from your liberal arts education (how to live your life, what is truth, what is language, etc.).","Instead for being reading Nietzsche alone (him sermonizing with epithet and spit as you sit dumb unable to process it all), it is very useful to read him among friends so that Nietzsche is not quite so imposing - discovering that your ignorance is shared among other smart people will make you happy.","Great class!","A necessary approach to a widely misunderstood thinker and foundational for anyone interested in postmodern philosophy.  The class moves through nearly the entire corpus of Nietzsche, which is the only way it can be done.  Burgard is dynamic, engaging, and erudite in his analyses of Nietzsche.  A well-structured class that moves quickly, necessarily so, but never forfeits its rigor and attention in approaching Nietzsche's multifarious writing style.","Very good class.","Beware, analytic philosophers, but rejoice, those of the continent. Burgard is shameless in his advocacy for Nietzsche's textual flourishes and games, sometimes a bit too shameless, mind you. Sometimes, you may even feel yourself aching for \"ideas\" and \"concepts\" to latch onto. But isn't that precisely the point? This class is like no other: Burgard is a professor to be experienced, no matter what his detractors say. He rambles and gets lost in particulars, but just like Nietzsche, his rambling easily trumps the \"main points\" of anyone else. You will consider this an especially fantastic class if you like to hear words like \"system theory\" and \"negatively performative text\" thrown about with abandon, along with continual metacritical musings on the process of lecturing. Plus, and this is a big plus, you'll come out of it having read the majority of Nietzsche's writings, even if you fall a bit behind or skip over a few (which is, let's admit, inevitable). He's perhaps the most important thinker ever, and he's often the most fun reading you'll ever have on syllabus. So take it: it'll make you far more likely to get in a fistfight with someone who sings the body analytic.","Though Nietzsche himself and class presentations are at times a quagmire of apparent meaninglessness, the pearls one is able to scoop up in the process do make it worthwhile.","The specificity of this course makes it a very unique experience. Nowhere else would I have had the opportunity to read and discuss the entire Nietzsche corpus chronologically. This was a fantastic experience. Professor Burgard is a great lecturer as well.","I would strongly urge anyone to take advantage of the opportunity to study one of the most important authors of our time in such a comprehensive way. Professor Burgard is excellent.","Don't fall behind in the reading.","I loved this course, and I can honestly say it was the most thought provoking course I took while at Harvard. Nietzsche and Burgard together inspired me to think very differently about the world and my own place within it."]}},"mostRecentQ":{"overall":"4.56","workload":"2.81","difficulty":"3.31","recommendation":"4.69","enrollment":"17","response rate":"94.12","QCourseOverall":{"number":"GERMAN 147","course_id":"2105","cat_num":"6994","1s":"0","2s":"0","3s":"0","4s":"7","5s":"9"},"QDifficulty":{"number":"GERMAN 147","course_id":"2105","cat_num":"6994","1s":"0","2s":"1","3s":"9","4s":"6","5s":"0"},"QWorkload":{"number":"GERMAN 147","course_id":"2105","cat_num":"6994","1s":"1","2s":"4","3s":"8","4s":"3","5s":"0"}},"success":true}