{"scores":{"Spring '14":{"course_score":{"overall":"4.80","workload":"2.10","difficulty":"3.20","recommendation":"4.50","enrollment":"22","response rate":"68.18","QCourseOverall":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"0","3s":"1","4s":"1","5s":"13"},"QDifficulty":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"3","3s":"7","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"3","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1420","cat_num":"6233","course_id":"2737","year":"2013","term":"2","id":"42c61e3756f6f9a5ae10c521d60bc7ab","first":" Katherine","last":"Zink","InstructorOverall":"4.90","EffectiveLecturesorPresentations":"4.70","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.90","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '12":{"course_score":{"overall":"4.67","workload":"3.25","difficulty":"4.12","recommendation":"4.62","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"0","3s":"1","4s":"1","5s":"13"},"QDifficulty":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"3","3s":"7","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"3","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1420","cat_num":"6233","course_id":"2737","year":"2011","term":"2","id":"a4b14a95bbabc1b8e554c7fb68185bea","first":"Tanya","last":"Smith","InstructorOverall":"4.38","EffectiveLecturesorPresentations":"4.75","AccessibleOutsideClass":"4.57","GeneratesEnthusiasm":"4.75","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '11":{"course_score":{"overall":"4.20","workload":"2.70","difficulty":"4.40","recommendation":"3.90","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"0","3s":"1","4s":"1","5s":"13"},"QDifficulty":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"3","3s":"7","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"3","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1420","cat_num":"6233","course_id":"2737","year":"2010","term":"2","id":"a4b14a95bbabc1b8e554c7fb68185bea","first":"Tanya","last":"Smith","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.40","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.43","ReturnsAssignmentsinTimelyFashion":"4.83"}]},"Spring '10":{"course_score":{"overall":"4.24","workload":"2.80","difficulty":"4.12","recommendation":"4.40","enrollment":"26","response rate":"96.15","QCourseOverall":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"0","3s":"1","4s":"1","5s":"13"},"QDifficulty":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"3","3s":"7","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"3","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1420","cat_num":"6233","course_id":"2737","year":"2009","term":"2","id":"a4b14a95bbabc1b8e554c7fb68185bea","first":"Tanya","last":"Smith","InstructorOverall":"4.44","EffectiveLecturesorPresentations":"4.32","AccessibleOutsideClass":"4.72","GeneratesEnthusiasm":"4.48","FacilitatesDiscussionEncouragesParticipation":"4.36","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Spring '09":{"course_score":{"overall":"4.67","workload":"2.22","difficulty":"3.67","recommendation":"4.56","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"0","3s":"1","4s":"1","5s":"13"},"QDifficulty":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"3","3s":"7","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"3","2s":"7","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HEB 1420","cat_num":"6233","course_id":"2737","year":"2008","term":"2","id":"a4b14a95bbabc1b8e554c7fb68185bea","first":"Tanya","last":"Smith","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.44","AccessibleOutsideClass":"4.44","GeneratesEnthusiasm":"4.56","FacilitatesDiscussionEncouragesParticipation":"4.75","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"5.00"},{"number":"HEB 1420","cat_num":"6233","course_id":"2737","year":"2008","term":"2","id":"e601975271ed3c7237ec7c934fdf7882","first":"Daniel E.","last":"Lieberman","InstructorOverall":"4.78","EffectiveLecturesorPresentations":"4.89","AccessibleOutsideClass":"4.56","GeneratesEnthusiasm":"4.89","FacilitatesDiscussionEncouragesParticipation":"4.75","GivesUsefulFeedback":"4.75","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Spring '09":{"comments":["Even if you didn't enjoy LS2 all that much, this course is definitely worth a look. I found the subject material in LS2 to be interesting, but found that the huge lecture format didn't really help to spark my interest further. This class was one of my favorite classes I have taken at Harvard.","Great teaching and interesting subject matter!","you have to keep up to do well","The course material is extremely interesting and taught very enthusiastically!","Seriously, if you are premed for real, take this class.  It is hands down the best science class, and the best class altogether that I have taken in the 8 semesters I have been at Harvard.  If you don't love this class, medicine isn't for you.","Great preparation for med school!"]},"Spring '10":{"comments":["Incredible to understand the anatomy of the body and it is done in a relaxed and helpful atmosphere which makes it very enjoyable.","it's an awesome class.  It's a lot of memorizing but for students interested in medicine, it's definitely a very nice introduction to gross anatomy.","This course is really interesting, a great opportunity to learn about something really familiar to us (ourselves), and definitely worth shopping.  It is definitely difficult, but worth the work.","this class is a hidden jewel - great professor, great material, and especially helpful if you are going to medical school.  so glad i took this class! sadly, this practical class also made me realize how un-useful most of my other harvard classes are to help my actual career.","This is the toughest elective I ever took, and while the information is fascinating, the professor grades extremely harshly. She's kind, but even though I poured more time into this class than all my other classes put together, I feel like I was punished despite promises to the contrary, and the grading definitely pitted people against each other in a way that was more unfair than in any other premed class I had ever taken. I would tell future students to take other classes if they're doing premed requirements, and even if you like anatomy stay away unless you've gotten into med school already so you can take this pass\/fail.","It's such a great class, and if you are premed, I would definitely say you should take it. Just be ready to put in a lot of time!","- Great for med school. Not that I'm applying, so I guess great if you're not going to med school as well, so long as you are interested and willing to put in the effort.","Take this class for sure if you are pre-med, and if you are interested in the human body!  Run away from this class if you hate memorizing and if you are looking for an easy time.","Extremely interesting material, really fun presentation. A LOT of work\/ memorization. But if you put the work in, it's pretty rewarding.","the prosections are awesome","I think that you have to have an appreciation for the complexity of the human body before you think about taking this course. It is not an easy one by any means but if you are interested in learning about how the body moves and works then it is for you.","Be prepared to spend MANY hours every week memorizing lots of information.  Also, time spent does NOT by any means translate to success on lab quizzes and assessments.","The human body is such a marvel to behold! Everything fits togetherin such an intricate manner. This is extremely practical f you ever desire a career in medicine or anything in the exercise sciences. In addition, we go over a lot of our evolutionary past. What a delightful romp through the annals of human history! You learn a lot of great things in this class, and Dr. Smith makes it quite fun.","great addition to LS2. anatomy can be very complex and this course was right at my ability level as i learned a ton but never felt overwhelmed.","challenging but good course for people interested in pursuing a career in medicine. if you don't like this course, don't go to med school.","It is very difficult, but definitely one of the best science classes I have taken at Harvard!","This is definitely a great class if you're interested in physiology or want to go to medical school. For me, I enjoyed this a lot more than looking at cells and stuff. It was a lot of material but the class is well taught.","This class is enjoyable and it takes a lot of time to study the material because the breadth of material we learn is so extensive--make sure that you have the time to study!"]},"Spring '11":{"comments":["-The teacher does not make the course worth it, as her lectures are honestly rather boring, and the pace is so fast and overwheleming that you wont absorb the material in lecture. The professor also presents herself as unhelpful and unsupportive in your learning process, both in office hours and in the way the tests are constructed to essentially try to make you get answers wrong. Only if you're willing to learn everything independently without much support or guidance, then take this course.","Tanya Smith is a great professor. The material is captivating and the evolutionary portion helps put it all into perspective.","This class is very interesting but be prepared to learn a lot. The shear amount of information is sometimes overwhelming so make sure to always stay on top of your work.","This is an amazing class and an amazing opportunity for all Pre-Med Students and students interested in the human body. You engage with the human body from all different perspectives, from the cadavers you see and touch at the Med School, from lectures, from labs, and from learning about being human from developmental and evolutionary perspectives. This class, unlike something you would receive in Med-School is a course that will allow you to get an overview of so many aspects of the body. It is definitely worth the time and the effort (which will admittedly be a lot) that you put into it.","It is a lot of work, but you learn a lot and the teaching staff is great!","Be sure you go into this class knowing it is a lot of work and fairly difficult.  The amount of information covered in the class is huge and you have to keep up with it.","The teacher really love this subject and it goes a long way. She really wants the students to care about the material. It is pretty difficult.","its a great, small, premed class taught with care","There is a LOT of memorization. It is a hard class. Best to take it after LS 2 but not absolutely necessary. Put the work in on a regular basis--get flashcards!"]},"Spring '12":{"comments":["This class is VERY DIFFICULT and a lot of work, but incredibly enjoyable and interesting and engaging. You will struggle but you'll learn it--although it may totally eat your life all spring. If you were taking it P\/F, I'd recommend it with enthusiasm. If you're taking it for a grade, make sure the rest of your classes are fairly light. But it's a rare and wonderful class with the unique opportunity to actually go to the medical school and view prosections (an incredible experience!), plus it has a developmental approach, which you are unlikely to find in a med school anatomy class.","This is a wonderful class and you will learn a lot! Study as often as possible and use as many resources as you can. The material cannot be learned in short amounts of time.","Take it! This class is great and don't listen to the people that say it is too hard. This class is tough but worth every effort.  The subject material and course heads make this so interesting that you will not notice the extra time and find the studying fun.","This course is worth it!!! It is a lot of work, but extremely rewarding. Looking back, I would definitely choose to take it again.","This class should be mandatory for all premed students! Yes, it is a difficult class. However, I learned an incredible amount about the body and I feel that what I learned in this class has, of all the classes that I have take here, prepared me well for medical school.","dedicate all of your free time to the course!"]},"Spring '14":{"comments":["Take this class! If you like anatomy and a willing to put in the time to learn the material, you will get so much out of it. Professor Zink is wonderful and made lecture fun to be at. The exams cover a lot of information, but everything on there is fair- she never tries to trick you.","Not very much work- no psets, short lab that ended early often. Material is straightforward and sometimes repetitive between the three modules. Professor is absolutely amazing. Prosections great.","Take this class! It's amazing.","Lots of rote memorization, but worth it for the prosections and getting to know the professor, who genuinely cares.","TAKE THIS CLASS! Dr. Zink is absolutely amazing, and the class is extremely interesting. It is an anatomy class, so there is a lot of information to learn, but the organization of the class makes it easy and fun to do! Keep up with the work and you will do well!","Katie is superb, and this couse really manages to be interesting despite the significant amount of memorization. LS2 isn't required at all, but it does complement HEB 1420 quite nicely. I really don't like when courses are repetitive, but I took both and didn't feel like there was too much repetition at all.","You will have to memorize a lot of material, so it is better to learn the stuff as you go. Dr. Zink is a good lecturer despite the material sometimes being boring. There is little work on a day-to-day basis (will have to cram for tests if you don't study as you go, and the final paper requires research but is easy enough). I did not go to the prosections but I heard they were worthwhile. You have six 1.5-hour labs, which are painless (just filling out a worksheet and getting to look at the bones and muscles on models). Good class as prep for med school or if you want to know more about the human body. Take it pass fail if you are worried about the memorization. Class covers tiny bits of development, basics of human evolution, and all the muscles, bones, nervous system, etc.","AMAZING CLASS - don't cram though","A must for premeds who want a better hold on gross anatomy before med school. No psets, but expect an extra day or two than normal to study for all the material for the tests. The final isn't cumalative -- its more like a third midterm, which helps workload wise. I enjoyed learning the material but that's because I'm a premed who enjoys that type of thing. Anyone who wants to go to med school shouldn't shy away from an anatomy course just because they've heard it's a little bit more work. It wasn't even that bad.   Professor Zink is an enjoyable lecturer and wants to help you learn the material. Tests won't trick you.","BEST CLASS AT HARVARD HANNDS DOWN. if you have any interest in anatomy take it!!","Take this course! Especially if you've already taken LS2, this course is a natural addition and so much fun! The prosections at the Med School are awesome (but optional). Definitely take advantage of them! They are so helpful.","Professor Zink is amazing, the prosections were SUPER cool, and your mastery of anatomy going out of the course is very good. Definitely required a fair amount of work, but absolutely worth it for any premed or pre-health sciences. Recommend 5\/5."]}},"mostRecentQ":{"overall":"4.80","workload":"2.10","difficulty":"3.20","recommendation":"4.50","enrollment":"22","response rate":"68.18","QCourseOverall":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"0","3s":"1","4s":"1","5s":"13"},"QDifficulty":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"0","2s":"3","3s":"7","4s":"4","5s":"1"},"QWorkload":{"number":"HEB 1420","course_id":"2737","cat_num":"6233","1s":"3","2s":"7","3s":"5","4s":"0","5s":"0"}},"success":true}