{"scores":{"Spring '14":{"course_score":{"overall":"3.40","workload":"2.00","difficulty":"2.70","recommendation":"3.50","enrollment":"71","response rate":"60.56","QCourseOverall":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"2","2s":"6","3s":"17","4s":"9","5s":"8"},"QDifficulty":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"3","2s":"11","3s":"25","4s":"4","5s":"0"},"QWorkload":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"4","2s":"35","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"US-WORLD 29","cat_num":"3243","course_id":"2076","year":"2013","term":"2","id":"ecd72a7f49c813bf4b03b75faa0687df","first":" Alex","last":"Krieger","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.50","AccessibleOutsideClass":"2.50","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"3.20","GivesUsefulFeedback":"2.50","ReturnsAssignmentsinTimelyFashion":"3.30"}]},"Spring '13":{"course_score":{"overall":"3.81","workload":"2.00","difficulty":"2.63","recommendation":"3.89","enrollment":"60","response rate":"90.00","QCourseOverall":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"2","2s":"6","3s":"17","4s":"9","5s":"8"},"QDifficulty":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"3","2s":"11","3s":"25","4s":"4","5s":"0"},"QWorkload":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"4","2s":"35","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"US-WORLD 29","cat_num":"3243","course_id":"2076","year":"2012","term":"2","id":"ecd72a7f49c813bf4b03b75faa0687df","first":" Alex","last":"Krieger","InstructorOverall":"3.68","EffectiveLecturesorPresentations":"3.57","AccessibleOutsideClass":"3.28","GeneratesEnthusiasm":"3.83","FacilitatesDiscussionEncouragesParticipation":"3.67","GivesUsefulFeedback":"3.62","ReturnsAssignmentsinTimelyFashion":"2.89"}]},"Spring '12":{"course_score":{"overall":"3.54","workload":"1.94","difficulty":"2.54","recommendation":"3.62","enrollment":"61","response rate":"81.97","QCourseOverall":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"2","2s":"6","3s":"17","4s":"9","5s":"8"},"QDifficulty":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"3","2s":"11","3s":"25","4s":"4","5s":"0"},"QWorkload":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"4","2s":"35","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"US-WORLD 29","cat_num":"3243","course_id":"2076","year":"2011","term":"2","id":"ecd72a7f49c813bf4b03b75faa0687df","first":"Alex","last":"Krieger","InstructorOverall":"3.27","EffectiveLecturesorPresentations":"3.27","AccessibleOutsideClass":"2.81","GeneratesEnthusiasm":"3.59","FacilitatesDiscussionEncouragesParticipation":"2.44","GivesUsefulFeedback":"2.75","ReturnsAssignmentsinTimelyFashion":"2.50"}]},"Fall '10":{"course_score":{"overall":"3.84","workload":"1.91","difficulty":"2.70","recommendation":"4.02","enrollment":"50","response rate":"86.00","QCourseOverall":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"2","2s":"6","3s":"17","4s":"9","5s":"8"},"QDifficulty":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"3","2s":"11","3s":"25","4s":"4","5s":"0"},"QWorkload":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"4","2s":"35","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"US-WORLD 29","cat_num":"3243","course_id":"2076","year":"2010","term":"1","id":"ecd72a7f49c813bf4b03b75faa0687df","first":"Alex","last":"Krieger","InstructorOverall":"3.95","EffectiveLecturesorPresentations":"3.93","AccessibleOutsideClass":"3.61","GeneratesEnthusiasm":"4.14","FacilitatesDiscussionEncouragesParticipation":"3.48","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"3.33"}]}},"comments":{"Fall '10":{"comments":["I absolutely loved this course, but I was also interested in the topic from the start. I would recommend that you actually have an interest in urban planning if you are enrolling. If not it might become a hassle to go through the readings and do the assignments.","The subject matter is truly fascinating and is something that every American, at the least, should be conscious of. The readings and paper are fun and interesting, the sketchbook assignments can be frustrating, but in general, this course is worth the hassle!","Probably one of the most unique undergraduate courses at Harvard for people with an interest in cities and design. Great overview of the American urban ideal from Jefferson, through the industrial revolution, to the decay of the post WWII city, and international futures. Kreiger is great and funny, and the powerpoint lectures are awesome. Not too much readings, and you do not have to do them all, but if you do, they are worthwhile.","This class is great for students interested in architecture or urban planning.","The lectures are horrible. Professor Krieger does not know this material (or, really, anything given his thoughts on \"Dickensonian\" England and \"Broadacres City\") terribly well. The sketchbook assignments are a huge pain and the exams are not very interesting. You can find a better America-in-the-World.","I found this course to be enjoyable through and through--the material itself was really interesting, the paper was open-ended and allowed you to focus on something you found intriguing, the sketchbooks were a welcome break from normal academic assignments, and I treated the reading as though it was for pleasure instead of for school.","I've never enjoyed a core class as much as this one, which entirely revolutionized the way I think about cities. The readings were interesting (with the exception of a very few dry\/excessively long ones), and I was actually motivated to complete most of them. Sketchbook assignments should be scheduled ahead of time, since they can be time-consuming, but they are great reasons to escape the Harvard bubble and explore a bit. (Sometimes the assignment turned into a day excursion into Boston with friends.)","Easy and painless way to satisfy a gen ed.","Awesome class. If you like architecture, urban design, urban planning, or Chicago, take this class.","This course is really good for someone who has never taken a class and city planning and wants to learn something new.  The class is great for the historical content it delivers and making city planning relevant to everyday life and culture.  Sometimes the readings are monotonous and seem superfluous, and some of the assignments are not difficult in themselves but hard to get a grasp on in terms of what the TFs want.  ItÂ´s an interesting class, but probably not the most straightforward for someone who is looking for an easy Gen Ed.","course is great, entertaining lectures, though getting a good section is really important.","There is a lot to be taken from this course if the student takes it seriously... it's a surprise that it's not more popular","Great course that goes over social, aesthetic, and environmental components of city-building in America.","- TFs can make or break this class as the professor is interested almost exclusively in lecturing.","This was, without a doubt, the worst class I have taken in 4 years at Harvard. It was extremely disorganized, there was no connection between themes of the class and the various (and many) assignments. Also, given the amount of work they expect you to complete, it all seems just random work with no point. It has BOTH a final paper and a final exam, which is totally unacceptable. The lectures were boring, repetitive, and the slides looked like a 5-year old put a bunch of pictures through powerpoint. The professor was elitist and this was reflected in his approach to the class. Absolutely do not take this class unless you want to be frustrated for an entire semester.","Sketch book assignments are really fun.","TAKE THIS CLASS. Krieger is a great lecturer and the readings are fantastic. The drawing component is actually quite interesting once you've done it and allows you to enjoy the city more.","This class counts for Lit B. For underclassmen it will count for US in the World. This class has cool readings.","Far too much work for a Gen Ed course. Not worth the time.","GREAT class. One of my favorites I have taken at Harvard. Really nice because this year for some reason it was really under-enrolled so the class size was pretty small. I learned so much and found all of the lectures to be very interesting. Would definitely recommend to anyone interested in cities.","I would recommend it. It's really interested, though I wished the material were presented in a more organized fashion.","The class is okay. Just okay. I did not jump for joy, and was not that inspired. This is about as close to urban planning 101 as you can get at Harvard College, and frankly this does not do justice to the field.","This class is great. The books you read are great. You learn A LOT about why the American landscape looks the way it does. It also gives you a good idea of what urban planning entails (but in no way is this a course about urban planning...). The sections are painless, but boring (especially since no one does the readings given that response papers were not assigned). The sketchbook assignments (where you are assigned places to go and draw out and write about) were awesome! I learned so much about Boston, and I'm from around here. It's also not that hard of a class, so if you're looking for an interesting elective, definitely take this class.","Parts are a bit confusing, but that's mostly a part of how different and original the course material is in comparison to your other courses.","I thought this course was a lot of fun. I generally found all the work to be interesting, and I really felt like I walked out of lecture and section each day having learned something concrete. I enjoyed writing the final paper and exploring more about a place I had spent so much time in. I also thought there was a very strong sense of keeping the big picture in mind in the sense that each lecture was connected to the others, and I felt like there was a very deliberate course that the lectures took."]},"Spring '13":{"comments":["Very interesting course on the history of urban design in America. Professor Krieger is always fascinating to listen to. The sketch assignments are fun and give you a new perspective on parts of Boston. Don't worry if you can't draw, I can't, and I was fine.","Make sure you get a good section leader!","If you don't like urban planning a lot, don't take this class. If you do like urban planning a lot, take a different class.","This class is incredible and I encourage you to do the reading for it even though many apparently scratched by without doing so.  The sketch assignments are a lot of fun even if drawing is outside of your comfort zone because they force you to go out and see the city in which we live!! More importantly, the way you see urban development will drastically change.","It provided a good survey of a lot of issues around cities and suburbs, and this was really interesting. If you have never taken a course in design or landscape, it is ideal as an introduction. It forces you to visit sites and work on sketching and synthesizing information in a way different from we are used to in most liberal arts classes.","This class was more about the history of cities than I thought it would be. It does not cover modern day cities or the future implications of cities. The professor went off of tangents a lot during lecture which made the lectures seem a bit unorganized and diluted.","The subject is interesting and this class does make you look at your surroundings much more critically. It was an enjoyable experience. Make sure that you are awake and alert in lectures--they go in circles sometimes.","Interesting subject matter, you really get to examine the many decisions that are made in planning urban areas that we usually don't know about. These decisions can play a large role in defining how we live our lives in our surrounding spaces. \r\nThe actual teaching of the subject matter, however, is a little bit disorganized and could be improved. Lecture videos and slides (though they were recorded) were not provided to undergrads taking the course. This was problematic since Prof. Krieger is not a very clear lecturer sometimes.\r\n\r\nThere is a lot of reading to do every week (I personally could not keep up and gave up on it after two weeks). Sketch assignments are cool to do, though they can be frustrating at times if you are not an experience drawer. You don't need to be amazing, but having some experience (which I didn't) or a friend who draws who can offer advice (which I did) is helpful.","Lectures were a bit confusing, but the topic is pretty interesting and has really gotten me thinking about urban development.","I thought this was a good way to fulfill the US-World gen ed. Lectures could be organized better but the content is interesting and the only assignments throughout the semester are sketchbook assignments, drawing different parts of Boston. Section is mandatory but pretty manageable. The only drawback with the class is that it has both a final paper and final exam.","Take this class if you are able to engage yourself in academics. If you rely on the lecturer to bring a subject alive for you, avoid this class like the devil. This course is fascinating, but it involves a lot of self-teaching, and can easily slide into being incredibly boring.","The course covers quite a bit of material over the semester. Prof. Krieger does a great job of presenting the material and providing examples during lecture. Overall, one lecture flows well into another and the course is well organized, especially considering the breadth it covers. The sketch assignments are not bad at all and there is only one midterm, a term paper, and a final - not bad at all.","I think this is a great class that may go unnoticed because of people taking Ec 10 for their USW requirement. If you dont want to do problem sets and are interested in what has shaped this country this is a great class to take.","Unique class with not too big a time commitment and interesting discussions in section. Assignments aren't too bad either apart from the longer essay at the end.","Great class--especially great GenEd","A lot of fun, but you have to like drawing.","Great class that covers the history of the American city.  If you genuinely interested in the evolution and philosophy of the American city, you will love this class. Great readings as well.","This class was great at thinking about urban issues.  The sketching assignments don't require any artistic skill.  They are just meant to make one more aware of how the urban form is.  They allow you to think in a different way about urban issues.","This is an excellent way to fulfill the USW requirement and the class assignments involve going out and exploring Boston. The final paper is very stimulating because you get to write about your home town\/city.","Be interested in the topic.  It's a great into to what goes on at the design school, but not necessarily a course on actual design.","Until the architecture track truly gets up and running and stops being so exclusive, this class is one of the only non-super advanced architecture\/ urban planning undergraduates can take. I know a lot of people took this class because it's the only one you can take, and, therefore, the class gets a little complacent. The midterm is harder than the final and the paper is pretty easy, and actually a lot of fun to write. The sketching assignments, in my opinion, are a bit of an exercise in futility as you put a lot of time and work into them but get very little back. This course definitely could be improved, but there are a lot of really interesting aspects already present in the material and powerpoints. It's a good class, not a great one.","It's a great way to fulfill the US-World gen ed, but only if you're already interested in urbanism\/architecture. If you've considered taking courses at the GSD before, then go for it, but objectively this is not the easiest way to fulfill it.","This is a great course if you want to better understand American development in a historical context and in relation to other trends across the globe. It is not too demanding and it is so relative and informative. You won't regret anything you learn in this course because it will be visually evident in your everyday life. You will look at cities and suburbs and where you desire to live differently and you will understand these ideas more critically. Take it if you are interested in any of this or if you are interested in sustainability and thinking critically about land use, problems, and future solutions. Lectures are entertaining with great visuals, sections and assignments are great.","The lectures are at times hard to follow but if you go along with the handout it makes it a lot easier","Professor Krieger is a really amazing and funny guy, in a cute grandfather kind of way. The topics and examples are really interesting and you leave the class having approached a wide range of issues plaguing the American city, and understanding historical underpinnings. I really enjoyed all the assignments, which were mostly drawing; even if you weren't a great artist, it forced you to get creative with representing interesting features of a space. The readings were interesting; some were a bit long and boring but not many. Lisa was a great TF and made participating in section very easy and fun. Definitely one of the more interesting classes I've taken at Harvard.","Fascinating reading materials and exciting assignments that will bring you into the heart of Boston with a sketchbook in hand. The lectures can be a bit dry, but the concepts are very cool and relevant to those who are interested in urban design. I liked the emphasis on personal interpretation in our assignments.","If you are interested in cities, infrastructure, urban planning, or anything about the way we choose as a society to live, this is the course for you. I found this course incredibly thought provoking and as I walk down the streets of Boston, Cambridge, my hometown, or any other civic landscape, I view everything I see in a new light. The course material is relevant to every citizen in today's global society, Professor Krieger gives excellent lectures, the questions raised are very stimulating to think about, and it is serves as the embodiment of what a Gen-Ed course should be. I found the course highly rewarding and I recommend it with enthusiasm.","This could be an interesting option for those looking to fulfill a Gen Ed. For upperclassmen looking for an elective on urban history or urban design, there are probably other courses (in the sociology, history, or VES departments) that would be a better fit and would over a bit more depth.","It was interesting but I didn't jump from joy. I guess I might have expected a bit more applied experience but it was a typical do your readings\/go to lectures format. The sketchbook assignments made this course somewhat different but I think we weren't provided that much guidance on what we were expected to do (and no feedback on the result either). \r\nOverall, the material is easy but a bit repetitive. An easy way to fulfill your USW requirement, but if you have another course that you're more interested in that also fulfills this requirement, that might be a better option.","This course is fantastic. Professor Krieger may be disorienting at times but the course materials, ideas, and visual sources teach you how to think about the relationship between physical habitat and ideas in human history. The course offers a fresh perspective and tool to think about the world. Some people may find it boring. But if you're interested in the topic, you should take it."]},"Spring '14":{"comments":["No prereqs necessary, which is nice. A solid US and the World, I do feel much more knowledgable on a very important topic, both how we got here and solutions. Interesting material.","Be careful before taking this class.  It's a cool subject manner and Professor Krieger is great but there is a lot of busy work, and the biweekly sketches take a ton of time.  If you are an athlete, especially, it is really hard to find the three hours needed to go to Boston and sketch.  If you aren't artistic, beware!  The sketches take time and you still don't do well on them.  The grading is kind of harsh, too.  But it is interesting and lectures are generally pretty cool.","Really interesting class! I liked the material much more than the actual class itself but it makes you think about cities and urban\/suburban environments in a totally new way.  Definitely worth taking as an intro to urban planning and development.","It's a lot of interesting material and will make you reconsider how cities develop. Krieger is a good, well-organized lecturer. However, the sketch assignments were time-consuming without really teaching me anything. The readings, while interesting, did not actually come up in class that much.","YOU NEED TO KNOW HOW TO DRAW. THEY'RE A BIG PART OF YOUR GRADE, AND IF YOU CAN'T DRAW YOU'RE AT A BIG DISADVANTAGE. Don't believe them when they tell you otherwise.","Great gened; decent amount of work.  The lectures aren't great but the material is really awesome!","Shop around for classes on this subject--there a number of ways to get this material, and it comes down to questions on style.","This is a fantastic Gen-Ed. The lectures are really interesting, the course pace is nice and quick and doesn't get bogged down in the more boring details. The sketch assignments get you out into Boston and are a fun creative assignment. I highly recommend taking this course, it's been one of my favorites.","This is a good course, but it involves a lot of smaller assignments, a final as well as a final paper.  The requirements were not made clear in terms of what the expectations were for understanding content, and while one learns a lot from lecture I wish that they had been recorded and that there was more clarity as far as the conceptual content is concerned.","This course fails to engage with the interesting and challenging topics around urban planning. In many ways it falls short, just providing a brief introduction to something and then going very far back in history. Professor Krieger is dry and frustrating, frequently making gaffes by saying, \"We try to make housing for poor people that normal people would like,\" or by saying, \"people like us\" when referring to Caucasians. It was frustrating and shocking to hear him say things like that. There are so many interesting aspects to urban planning, and I want to be an urban planner myself, and I felt very disappointed with this class. The subject material is incredibly fascinating, but Professor Krieger made it very dull.","On the one hand, I think this course has great potential and great promise, as American urbanism is a really important and interesting subject to be conversant in. However, this course completely failed to live up to my expectations, and for two reasons. First, while the selection of topics for this course were generally pretty good, I felt like the lectures, sections, readings, and assignments were completely disconnected from each other, and I was often wondering to myself how and why some of these assignments were even relevant. Secondly, the sketchbook assignments were literally the worst. Honestly, they have no educational value, as I don't think I happened upon any particularly thought-provoking insights from them. Also, they take up so much time, and honestly feel like such a waste of time because there really is no point to them. Be prepared for the drawing component of the class if you want to take it.","This is a great course, and I think it's a great example of what a good Gen Ed should be like: it really changes the way you view your surroundings. It's a bit higher on the workload than you may want from a Gen Ed, though.","Don't think that this class is easy. Take another meaningful USW course that will require the same amount of work but will teach you something good","This class is a lot of work for a gen ed.  You'll learn a good bit about cities, but be ready to read and be ready to draw.","i personally really enjoyed this class. it's a history class, an architecture class, and a government\/policy class. there is so much to learn about how our cities are planned and it's so interesting to go from the history of cities to how that has affected the architectural style of our cities and what policies have shaped them. it's definitely a well rounded gen ed course that i would encourage everyone to take. professor krieger is one of the top people to lecture in this topic, and he does it with so much passion and charisma, it's always a pleasure to go to class to hear him speak. he definitely wants to reach out to us and get us to see the city and where we live not only as a place to live but he also wants to show us that we can also make a difference. this is honestly a great class - i only wish that i took it earlier (not as a thesising senior) so i could've devoted more time to the readings (the selection is really great).","I enjoyed this class. Each lecture is about a different city. The final paper is own your home town which was enjoyable. You have four sketch assignments but they are really easy but take a lot of time. Overall, painless way to fulfill a USW gen ed.","The class gives you a pretty good overview of the major trends and influences in the development of American cities, and it definitely got me to think about cities in a different way. Lectures can be a little disorganized and hard to follow and the sketch assignments take a little longer than you would expect, but overall a pretty good class.","I took this class because I was interested in learning more about how cities are designed, and I definitely did learn about this and the evolution of the American landscape and architecture, which I am glad to know more about. The class sometimes seemed a little scattershot, though, and the assignments were not very enjoyable.","This class is good if you want to really engage with some of the broader issues concerning American urbanization. I would caution though that if you are a person who wants lectures to be chronologically laid out, and if you are a stickler for course organization, this class may not be for you.","Do not take this class! Unless you need a gen-ed credit and there is no other option, I'd recommend looking elsewhere. I took this class as an elective because I was interested in the subject, but the shallow material coverage, general apathy from the teaching staff, collective month of sketch assignments, and lack of any discussion of the readings in class made this the biggest disappointment of the year.","There are easier USW classes out there. I would only recommend taking this class if you are actually interested in design","This is a fairly interesting class; if you like to draw or are interested in architecture\/urban planning, definitely take it. There's generally a good amount of reading and weekly assignments, so the class requires more work than expected.","If you are looking to fulfill the USW gen ed and don't want to just do the standard reading and writing assignments, consider this class. The sketchbook assignments do not require you to have any drawing ability whatsoever, and they give you an excuse to explore downtown Boston.","Not a very unified course. Compelling at first, its disparate materials end up being a hindrance to learning anything substantial.","This class is not about architecture or different design styles or movements, but rather helps you think about what Americans want from their cities and living environments. The lectures are interesting and the sketch assignments are truly doable (no matter your artistic skill level). This course leaves you feeling that you understand more about the big picture of American urbanism and able to think more critically about space.","If you are interested in urban design or planning, this is likely a great course for you! If not, you might be better off picking a more generic gen-ed."]}},"mostRecentQ":{"overall":"3.40","workload":"2.00","difficulty":"2.70","recommendation":"3.50","enrollment":"71","response rate":"60.56","QCourseOverall":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"2","2s":"6","3s":"17","4s":"9","5s":"8"},"QDifficulty":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"3","2s":"11","3s":"25","4s":"4","5s":"0"},"QWorkload":{"number":"US-WORLD 29","course_id":"2076","cat_num":"3243","1s":"4","2s":"35","3s":"4","4s":"0","5s":"0"}},"success":true}