{"scores":{"Spring '14":{"course_score":{"overall":"4.10","workload":"2.50","difficulty":"3.00","recommendation":"4.10","enrollment":"24","response rate":"70.83","QCourseOverall":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"0","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"3","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"9","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 150","cat_num":"8997","course_id":"1337","year":"2013","term":"2","id":"6533e5de560d9ed75c09872d892481f6","first":" Yue","last":"Lu","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '13":{"course_score":{"overall":"3.76","workload":"2.76","difficulty":"3.48","recommendation":"3.67","enrollment":"22","response rate":"95.45","QCourseOverall":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"0","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"3","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"9","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 150","cat_num":"8997","course_id":"1337","year":"2012","term":"2","id":"6533e5de560d9ed75c09872d892481f6","first":" Yue","last":"Lu","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.38","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.21","GivesUsefulFeedback":"4.11","ReturnsAssignmentsinTimelyFashion":"4.15"}]},"Spring '12":{"course_score":{"overall":"4.47","workload":"2.71","difficulty":"3.65","recommendation":"4.25","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"0","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"3","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"9","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 150","cat_num":"8997","course_id":"1337","year":"2011","term":"2","id":"6533e5de560d9ed75c09872d892481f6","first":"Yue","last":"Lu","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.82","AccessibleOutsideClass":"4.56","GeneratesEnthusiasm":"4.53","FacilitatesDiscussionEncouragesParticipation":"4.43","GivesUsefulFeedback":"4.57","ReturnsAssignmentsinTimelyFashion":"4.70"}]},"Spring '11":{"course_score":{"overall":"4.20","workload":"3.10","difficulty":"3.70","recommendation":"3.89","enrollment":"11","response rate":"90.91","QCourseOverall":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"0","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"3","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"9","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 150","cat_num":"8997","course_id":"1337","year":"2010","term":"2","id":"6533e5de560d9ed75c09872d892481f6","first":"Yue","last":"Lu","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.60","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"4.67"}]},"Spring '10":{"course_score":{"overall":"1.57","workload":"3.14","difficulty":"4.43","recommendation":"1.43","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"0","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"3","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"9","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 150","cat_num":"8997","course_id":"1337","year":"2009","term":"2","id":"11ff9f2db8ecf4298c8407084cdac4af","first":"Navin","last":"Khaneja","InstructorOverall":"1.43","EffectiveLecturesorPresentations":"1.00","AccessibleOutsideClass":"2.60","GeneratesEnthusiasm":"1.14","FacilitatesDiscussionEncouragesParticipation":"1.00","GivesUsefulFeedback":"2.00","ReturnsAssignmentsinTimelyFashion":"2.00"}]},"Spring '09":{"course_score":{"overall":"2.75","workload":"2.42","difficulty":"4.00","recommendation":"2.67","enrollment":"13","response rate":"92.31","QCourseOverall":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"0","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"3","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"9","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 150","cat_num":"8997","course_id":"1337","year":"2008","term":"2","id":"11ff9f2db8ecf4298c8407084cdac4af","first":"Navin","last":"Khaneja","InstructorOverall":"2.83","EffectiveLecturesorPresentations":"2.67","AccessibleOutsideClass":"3.82","GeneratesEnthusiasm":"2.83","FacilitatesDiscussionEncouragesParticipation":"2.78","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"2.80"}]},"Spring '08":{"course_score":{"overall":"3.20","workload":"3.00","difficulty":"3.70","recommendation":"3.20","enrollment":"17","response rate":"64.71","QCourseOverall":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"0","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"3","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"9","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 150","cat_num":"8997","course_id":"1337","year":"2007","term":"2","id":"11ff9f2db8ecf4298c8407084cdac4af","first":"Navin","last":"Khaneja","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.60","AccessibleOutsideClass":"4.11","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"3.43","GivesUsefulFeedback":"1.00","ReturnsAssignmentsinTimelyFashion":"1.25"}]},"Spring '07":{"course_score":{"overall":"3.50","workload":"3.50","difficulty":"4.00","recommendation":"4.00","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"0","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"3","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"9","3s":"5","4s":"1","5s":"0"}},"instructor_scores":[{"number":"ENG-SCI 150","cat_num":"8997","course_id":"1337","year":"2006","term":"2","id":"c523c55ecf3decd905dffa256d8b4405","first":"Mai","last":"Vu","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.50","FacilitatesDiscussionEncouragesParticipation":"2.00","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '08":{"comments":["The class is good to take to refresh your probability background.  However, not everything that there is to know about probability can be covered, so you should do some extra reading if you want to learn more.","For somebody who wants a nice introduction to probability, this is probably a good course.","Good introduction to probability in engineering.","You are likely to be confused.","there is a reason why so few people enroll in this course, it is pretty bad. take other stats if you can, most people who are here only take it because they have to. not taught well, goes really fast, and has hard psets"]},"Spring '09":{"comments":["Look at the other recommended text books for the beginning of the course as they offer a much clearer presentation of the material","The course does present some interesting theoretical math, but there is little in regards to its application.","Pay attention from day 1!!","The class is fine for a concentration requirement, but I wouldn't recommend it as an elective.","Life is probability.  Take this course, and get a life.","The simple effectiveness of this course at teaching concepts was a breath of fresh air amidst a myriad of engineering courses which try to do too much at the cost of students' depth of understanding."]},"Spring '10":{"comments":["Don't take this class unless it is a concentration requirement. The lectures are super boring.","Expect to do a lot of independent learning","Try to petition out of it. I don't know if they will let you but perhaps if enough people try then the department might see that this course offers no additional value to electrical engineering students. The students would at least learn something by taking a well taught probability or stats class.","Only take this course in its current format if you absolutely have to.  The teaching is nonexistent and the assignments are more challenging than they have a right to be.  Get a tutor if you can.","The course needs to be revamped and reorganized from the bottom up. There was no class final review and we started our final 25 minutes late... pretty much summed up the class as a whole in the end.","If this class is not required then don't take this class."]},"Spring '11":{"comments":["very well taught, Professor Lu builds in a lot of review, so its easy to stay on top of the class as long as you are using the lecture notes and augmenting that with the textbook","The professor was excellent. The course was very well structured. We had quick reviews at the beginning of each lecture which were very helpful. Th topics are very interested. All in all, it was my best class this semester.","This is an enjoyable course, but assignments are challenging so get together with the other students in the class to do the problem sets.","This class has some really interesting and applicable material. Also, Professor Lu is great, although lecture can be a little dry at times."]},"Spring '12":{"comments":["Professor Lu is great. He's a really good lecturer and explains new concepts in ways that just makes everything really clear. You should definitely go to his office hours, because his one on one tutorials are even better. The class is very laid back, homeworks are difficult but manageable, and the material is really interesting if you like probability and math.","Lue was a fantastic teacher and the material was exciting and interesting. Fantastic option for probabilistic mathematics requirement, even if you aren't an engineering student. Very well taught.","You should only take this course if you need to.  It is very interesting and Professor Lu is great, but there are plenty of other classes that teach you probability in a much lower stress environment.  The class has two midterms and a final, plus weekly problem sets.  All manageable if you go to office hours and find a good study group.  The material does get pretty dry at some points.","Take. This. Class.  It class is very good for developing your intuition and you'll think about things around you in the world in a probabilistic manner.  It will help you model scenarios for future classes and think more logically.","This class is straightforward and teaches you what you need to know. A lot of the topics are really interesting, and the Matlab assignments are educational without being too difficult. The course was also not unnecessarily difficult.","Go to office hours and approach Professor Lu for help, he is very accessible and helpful.","This is a great class. You will finally understand probability theory.","Excellent intro to engineering probability","This is a great alternative to stat 110 with a great professor.","This is a good course with a great professor.  It starts off very easy and then gets much more difficult very quickly.  As long as you keep up with the readings, it's not too much material to handle.  To be clear, this is only a probability course and does not cover statistical topics like regressions, etc.","Professor Lu is an excellent instructor. He present the material in an understandable way and gives a lot of relevant examples."]},"Spring '13":{"comments":["Yue is wonderful. I loved the class! I liked the applications we saw. And the class was great because you're rewarded for the work you put in if you're consistent.","This was a good class, that did what it was supposed to: provided a first introduction to probability and gave a few engineering applications.","This is a difficult stat and probability class, but professor Lu is a great and effective teacher. The p-sets are very difficult and office hours are extremely helpful. Both midterms were hard but the final was very fair. Overall, a tough class but you learn a lot of probability theory throughout it.","The professor knows what he is doing, and is always willing to help.","A great course for covering probability, though perhaps a bit lacking on the side of statistical analysis of data.","Manageable but not a blow off course.","Course has challenging material but workload is manageable. Be sure to take advantage of Prof.'s office hours, lectures, book chapters, etc and the course will be smooth","This course was challenging, and required a lot of time and effort to really understand the material. As a result, I learned a lot, but again, it was a tough course. Probability is not as intuitive as I'd expected going in, and took a lot of time to really start to grasp. Prof. Lu was extremely helpful in office hours, and demystified a lot of topics for me.","Yue is a really good professor. His lectures are very clear and well organized, and he integrates many cool and interesting examples into his presentations. He is also available for office hours and immensely helpful if you meet with him one-on-one. If you have to fulfill a statistics requirement I would recommend this class. It will be more challenging than the some of the other statistics classes but you will also learn a lot more.","If it's a requirement, take it."]},"Spring '14":{"comments":["I enjoyed this course very much, and would recommend this class to anyone looking to complete their statistics or probabilty req for ES. The class is enjoyable, and the problems are not too difficult, and the time this class takes is probably around 2-4 hours outside of class per week. Also, the exams are usually not as hard as the homework problems, which is nice because it makes the class less stressful.","As a concentration requirement, this class was great.  Professor Lu knows the material extremely well and explains it in an easy, comprehensible way.  Definitely take this course if you're interested in probability & statistics.","Definitely the best was to fulfill the stat requirement for engineering. Not too challenging but interesting","this class is good for seniors to put off until senior year, but be aware that the material from right around engineering thesis time is the material emphasized on the final.","It is a great probability class. You learn a lot without it being too painful. The assignments are very fair.","It is a required course for most engineering majors, so if you're taking this class you probably have no real choice.  It was one of my more moderate classes; not the best, but not the worst, either.  That being said, I would recommend you form pset groups because some pset problems are not easily solved with only the lectures and textbook as references.  Also, go to lecture, because the online lecture notes are not as helpful as one would hope.","easier than stat 110, but you don't get quite the same level of problem solving skills","Great assignments, great lectures, interesting tests, I can't praise this course enough. I learned a lot and the course was painless.","Very easy class, but I wish Stat 110 was an option to take for the electrical engineering requirement, as I feel I would have learned more.","Material is dull (if straightforward) and not relevant to engineering. We discussed very few engineering applications during this class.","The lectures are very well structured and the material is presented in a way that it is easy to learn. As long as you go to lecture and go to section or office hours when you find a topic confusing, this class is very straight forward and easy to do well in."]}},"mostRecentQ":{"overall":"4.10","workload":"2.50","difficulty":"3.00","recommendation":"4.10","enrollment":"24","response rate":"70.83","QCourseOverall":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"0","3s":"5","4s":"4","5s":"7"},"QDifficulty":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"3","3s":"9","4s":"3","5s":"0"},"QWorkload":{"number":"ENG-SCI 150","course_id":"1337","cat_num":"8997","1s":"0","2s":"9","3s":"5","4s":"1","5s":"0"}},"success":true}