{"scores":{"Fall '11":{"course_score":{"overall":"4.35","workload":"2.04","difficulty":"3.09","recommendation":"4.43","enrollment":"24","response rate":"100.00","QCourseOverall":{"number":"HAA 174s","course_id":"2581","cat_num":"9158","1s":"0","2s":"0","3s":"3","4s":"9","5s":"11"},"QDifficulty":{"number":"HAA 174s","course_id":"2581","cat_num":"9158","1s":"0","2s":"2","3s":"17","4s":"2","5s":"1"},"QWorkload":{"number":"HAA 174s","course_id":"2581","cat_num":"9158","1s":"4","2s":"14","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HAA 174s","cat_num":"9158","course_id":"2581","year":"2011","term":"1","id":"6554df6d5af17648b84e59cbbd390ffb","first":"Ewa","last":"Lajer-Burcharth","InstructorOverall":"4.61","EffectiveLecturesorPresentations":"4.57","AccessibleOutsideClass":"4.48","GeneratesEnthusiasm":"4.74","FacilitatesDiscussionEncouragesParticipation":"4.14","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Fall '07":{"course_score":{"overall":"4.68","workload":"1.84","difficulty":"2.63","recommendation":"4.75","enrollment":"40","response rate":"57.50","QCourseOverall":{"number":"HAA 174s","course_id":"2581","cat_num":"9158","1s":"0","2s":"0","3s":"3","4s":"9","5s":"11"},"QDifficulty":{"number":"HAA 174s","course_id":"2581","cat_num":"9158","1s":"0","2s":"2","3s":"17","4s":"2","5s":"1"},"QWorkload":{"number":"HAA 174s","course_id":"2581","cat_num":"9158","1s":"4","2s":"14","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"HAA 174s","cat_num":"9158","course_id":"2581","year":"2007","term":"1","id":"6554df6d5af17648b84e59cbbd390ffb","first":"Ewa","last":"Lajer-Burcharth","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.85","AccessibleOutsideClass":"4.23","GeneratesEnthusiasm":"4.55","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"4.67"}]}},"comments":{"Fall '07":{"comments":["This is an enjoyable class with well structured lectures.","it's interesting, the professor is enjoyable, and the papers were not a lot of work.  but there were 215 images to memorize for the final (i thought that was a lot).","Get excited.","Professor Lajer-Burcharth will change the way you think about art.","Do the readings--they're short and pretty easy to read, and really helpful.","It is a great opportunity to increase one's understanding of art","That it is pleasant, and you will learn something.","Excellent class; great survey of French art.","The topics are not as arcane and confined as it might seem based on the title and description of the class--in fact the broad relevance of subject matter is one of the strenghts of the class.","Good class, great teaching, interesting lectures.  Material is a little esoteric, and I'd probably recommend HAA70 before this one.","very very interestng subject matter.  excellent professor.  very well prepared lectures."]},"Fall '11":{"comments":["You will look forward to these lectures each week. You can tell people you study 18th century French porn. And by the end of the semester, you will have something insightful to say about any work of art that depicts a human body. The readings are super-dense and theoretical, but the TF (Aaron) is phenomenal and will encourage you to disagree with the stuffy authors. The more opinions you bring to section, the more enjoyable it will be. Overall: this class is challenging but beyond worth it.","The course material is very interesting and Professor Lajer-Burcharth is a great lecturer.","Great professor who taught everything in an interesting and concise manner, and I felt like I actually learned a lot about things that were important. You learn a lot about art that people actually know about! Also it was the perfect workload with good placement for the essays- not right around exam time.","The paintings are fascinating and Ewa Lajer-Burcharth is a genius.","Take it!  Professor Burcharth and the TF (Aaron) are both incredible.","This class is an excellent exploration of French bodies placed in a brilliant historical and artistic framework.  Professor Lajer-Burchart truly sparkles as a professor and is truly a one of a kind teacher.  The art is interesting, as a non-concentrator it was a perfect fun class that was also a serious class in its own right. Lots of slides to memorize, but it comes with the territory.  Be prepared to see lots of nude bodies (which I enjoyed). Also, don't blow off this class.  You get as much out of it as you put in.  Speak to Professor Lajer-Burchart EARLY and use the resources of the TF.  It was really helpful.  If the second paper is the same, be very careful with it and make sure you meet with the TF (many had trouble with it). Also, form a study group at the beginning of the semester and share notes, etc.","Just make sure Aaron's not your TF.","Great lectures.","This is a superb survey of French art (and a bit of visual culture) in the 18th and 19th centuries. Professor LB's command of and enthusiasm for the subject do much to make the lectures fascinating.","Aaron Wiles is an excellent T.F. - he gives very helpful feedback on papers. I also thought the reading material was well chosen.","This is by far one of the best classes I've taken.  The lectures are all extremely interesting, and I learned quite a bit not only about French art, but also French culture and history.  Make sure to do all the readings in preparation for section, especially since they'll really help you with writing assignments and also the exams.","This class will give you a new lens through which to think about early modern art history.","This course is really interesting and covers a great time period.  But it is hard.  It's a small class so there is no where to hide if you don't do the readings, and the TF was extremely thorough in section.  Plus the readings are difficult if you aren't used to HAA. Very high expectations of the students so be prepared for that.  Also, final exam required memorization of 200+ slides with exact name of artist (and they are french so accent marks) and exact date.","cheat sheet: art was really boring until the 1800s.","This class is very interesting and gives you a deeper understanding of French art in general. A few of the lectures seem not to make total sense, but they are engaging for the most part, and I'm very glad that I read the articles we were assigned; I have a generally more sophisticated grasp of art history after this class."]}},"mostRecentQ":{"overall":"4.35","workload":"2.04","difficulty":"3.09","recommendation":"4.43","enrollment":"24","response rate":"100.00","QCourseOverall":{"number":"HAA 174s","course_id":"2581","cat_num":"9158","1s":"0","2s":"0","3s":"3","4s":"9","5s":"11"},"QDifficulty":{"number":"HAA 174s","course_id":"2581","cat_num":"9158","1s":"0","2s":"2","3s":"17","4s":"2","5s":"1"},"QWorkload":{"number":"HAA 174s","course_id":"2581","cat_num":"9158","1s":"4","2s":"14","3s":"5","4s":"0","5s":"0"}},"success":true}