{"scores":{"Spring '14":{"course_score":{"overall":"3.80","workload":"1.60","difficulty":"2.50","recommendation":"4.00","enrollment":"60","response rate":"70.00","QCourseOverall":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"1","2s":"2","3s":"12","4s":"17","5s":"10"},"QDifficulty":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"3","2s":"18","3s":"20","4s":"1","5s":"0"},"QWorkload":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"21","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SCI-PHYUNV 19","cat_num":"5923","course_id":"2020","year":"2013","term":"2","id":"2cde53a8e3c14d87d4215e9d8851fce5","first":" Robert P.","last":"Kirshner","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '12":{"course_score":{"overall":"3.60","workload":"1.77","difficulty":"2.65","recommendation":"3.64","enrollment":"104","response rate":"94.23","QCourseOverall":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"1","2s":"2","3s":"12","4s":"17","5s":"10"},"QDifficulty":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"3","2s":"18","3s":"20","4s":"1","5s":"0"},"QWorkload":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"21","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SCI-PHYUNV 19","cat_num":"5923","course_id":"2020","year":"2011","term":"2","id":"2cde53a8e3c14d87d4215e9d8851fce5","first":"Robert P.","last":"Kirshner","InstructorOverall":"3.94","EffectiveLecturesorPresentations":"4.02","AccessibleOutsideClass":"3.88","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.18","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.14"}]},"Spring '11":{"course_score":{"overall":"3.99","workload":"1.61","difficulty":"2.53","recommendation":"4.10","enrollment":"114","response rate":"92.11","QCourseOverall":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"1","2s":"2","3s":"12","4s":"17","5s":"10"},"QDifficulty":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"3","2s":"18","3s":"20","4s":"1","5s":"0"},"QWorkload":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"21","2s":"16","3s":"5","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SCI-PHYUNV 19","cat_num":"5923","course_id":"2020","year":"2010","term":"2","id":"2cde53a8e3c14d87d4215e9d8851fce5","first":"Robert P.","last":"Kirshner","InstructorOverall":"4.24","EffectiveLecturesorPresentations":"4.22","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.55","FacilitatesDiscussionEncouragesParticipation":"4.23","GivesUsefulFeedback":"4.12","ReturnsAssignmentsinTimelyFashion":"4.21"}]}},"comments":{"Spring '11":{"comments":["Fun class if you like science. Bob is a fantastic lecturer","The class is a challenge, but very interesting. It exposed me to topics that are valuable and that I would have never otherwise gotten in my Harvard career. If you keep up with the work and use the TFs it should not be a problem. And Kirshner's really entertaining.","Kirshner is great! Material is interesting.  You can get away with completely slacking in this class, but the material is interesting if you actually pay attention. I like that Kirshner tried to make every lecture interesting by having some sort of demonstration.","Professor Kirchner's incredible humor and enthusiasm for the class was unmatched by any professor I have encounter at Harvard. His lectures made high level astrophysics accessible to anyone and he incorporated bits of relevant current events and economics that made this class all the more interesting and applicable to the world in general. I LOVED this class!!","A painless and enjoyable way to fulfill a core. The physics is very basic, perfect for laypeople, and yet one learns a great deal about the way our universe works. The professor is hilarious and the demonstrations are fun. The TF explains all the groundwork. And yes, the universe is expanding.","Make sure to really pay attention to the factual aspects of the class and from readings.","It's a good way to satisfy your Science A core. The problem sets are easy each week. The exams are also not that hard. Painless.","I loved this class. Really interesting material that I had absolutely no previous knowledge of. Professor Kirshner is ridiculous and great, the class has a very fun, relaxed vibe. For the most part the class was very easy, but it was still really rewarding. This was probably my favorite class of the semester, although it has nothing to do with my concentration or previous interests.","Very interesting material and an engaged professor.","Fun! You learn a lot without having to worry about grades. Just remember to take the course seriously despite its easiness.","If you have any doubts, JUST SHOP THIS CLASS!  I walked into the classroom on accident during shopping week and loved it!  So glad I took this, it's an amazing class.","It's easy, but that can lead to not studying and then bad test grades. so remember to keep up on the work","If you get Paul, this course is made a lot more understandable.","This class was extremely interesting. The professor is funny, engaging, and a real leader in his field which makes it that much cooler he teaches a core class.  The TFs were all great as well.  The work is easy, and actually teaches you.","The midterm and final for this class are rather difficult, especially since the homework is graded based on completion. Kirshner does a lot of demos in class, some of which are cool. The material is presented in a rather confusing way. Stay on top of the material and study!","Interesting course that makes astrophysics seem very accessible.","The course was incredibly interesting - the lectures were engaging and the material was great.","Learn a ton about life in general, changed my general perspective on what things around us are.","Interesting material, not mathematically rigorous","This is an awesome class.  It is quite easy and super interesting.  Make sure to attend lectures, since they are fun.","The class overall is interesting and is not too much of a workload, but make sure you understand the readings and pay attention.  But anyone who loves science should do great.","This course is fun and interesting to take.  If you have ever had an interest in the cosmos, then this class will help to fuel your interest.","This course theoretically covers interesting material.  But, because they treat you like you have never seen a calculator before, you don't get a lot from it.  That being said, it's quite easy and brings up some cool ideas in a very easy to understand way.","If you need to fulfill an SPU gen-ed, definitely consider taking this course. As long as you keep up with the material (you don't even have to do 100% of the readings, just try to focus in lecture and review the conepts at some point) you'll be fine","This was an ideal Gen Ed.  It didn't require too much time, but I learned SO much about something that I never would have thought to study and that I ended up finding incredibly interesting.  Professor Kirshner is one of my favorites; he is brilliant and incredibly enthusiastic about teaching, and also kind of corny in the most endearing of ways.  TAKE THIS CLASS even if you never thought astrophysics was something you would do.","You learn some pretty amazing stuff.","More about telescopes than you might expect. Don't leave the p-sets for the last minute because you might find out you need a textbook you don't have with you. Lecture slides don't necessarily contain all the required information. Keeping notes will help create the cheat-sheets for the exams.","prepare well for exams","If you have a good background with physics then you would enjoy this, but if you are hoping to enjoy a fun simple general education science of the physical universe course, then this is not what I would recommend.","This course is interesting, and the lectures are lively and entertaining, but the information is not presented as effectively as it could be.  It is sometimes hard to glean the main points from the lectures and readings, and it is also hard to establish continuity between things learned early in the course and the bigger\/whole universe ideas.  It is a very easy way to fulfill an SPU gen-ed if you're not a math\/science person.  But you should really only take it if you're interested in astronomy and it doesn't freak you out to think about an infinitely expanding universe, the death of the Sun, and the end of the universe.","This is a nice, pretty painless SPU gen-ed with really fun demonstrations, your classic mad-scientist type of professor (who's also actually pretty famous and sometimes quite funny), and kind of time-consuming but not difficult problem sets that were graded on completion, not accuracy.  I think it's probably a good way to get the SPU requirement out of the way, but it was a little frustrating as a science person, because the class was run under the assumption that no one who would take it is.","The material is very interesting, at times complex but assignments are easy","A tolerable core... pretty easy. Weekly homework assignments are sort of tedious, but you don't have to go to lectures. Could be worse.","This class is fantastic! Take it! I can't think of a better way to fulfill SPU. Prof Kirshner is hilarious and a great lecturer - I loved going to lectures each week. The TFs go out of their way to provide support\/resources for problem sets, midterm, final, etc. Observing sessions are really fun - you go to the roof of the Sci Center and use Harvard's telescopes, which is a cool experience. And most importantly, the subject matter is intriguing, and it is certainly worth understanding how the universe works before graduating college.","It is a relatively painless and informative way to fulfill a Gen Ed. I actually learned some interesting stuff in this course. Make sure you study stuff beyond formulas for the tests as the more difficult questions actually ask you to give specific, factual answers that don't just rely on doing math with formulas, especially for the first midterm.","very exciting course with a great lecturer. Material is very engaging.","This class can be harder than many give it credit to be.","Don't listen to all these people saying it's the easiest class ever. It isn't, especially if you are not at all a science person. That said, it's a very manageable class if you put the necessary time in, and the subject matter is fascinating. Probably one of the best ways to fulfill this GenEd requirement.","This was my absolute favorite class of the term.  Professor Kirshner is absolutely incredible, and his demonstrations made for some of my favorite classes of the term.  His sense of humor and easy familiarity with the subject matter make astrophysics seem much less daunting than I had previously thought.  If you are not a science person and need to fulfill you SPU Gen Ed, then THIS IS THE CLASS for you.","It's a sold core\/gen ed. Lectures are kind of useless, though. Section is much more enjoyable and informative.","take it if you're even remotely interested in astronomy and\/or astrophysics.","its an easy science core but im a bit concerned that my grade is going to be uncurved and not as good as i would want. if you put in full effort, no reason you shouldnt get an a or a-. it is helpfult o go to lecture an kirshner is a really interesting. i woudl hoep for better lecture notes that highlighted the info we should know.","Keep up with the material and you'll be fine.","This class is ideal for students in the social sciences or humanities looking to take an interesting astronomy course without having to worry about rigorous problem sets.","keep up with the concepts.","Take it, if you need the gen ed requirement, it is awesome!","Easy, fun class!","I took 15a before, but I still took this course for its astronomy component. The physics part is very easy for me, so I get to enjoy the \"real substance\" of the course. And I have to say, it is mind-blowing to know more about the greater world beyond where we live in, and to understand better the extreme phenomenon in our universe. The observing sessions, though required, are a refreshing break from studying. I would have felt really regretful if I had graduated from Harvard not using the telescope at all. Now thanks to this course I would constantly browse through wikipedia about astronomical concepts I am interested in. That being said, the homework is a little bit \"eccentric\" sometimes and asks you about trivial, non-important questions","Kirshner messes around a lot, but if you get a good TF (you probably will) then you'll learn what you need to know.  Kirshner is funny and overall the course is really interesting and easy.","This class is fun but difficult","Professor Kirshner pretends that this will be a very simple course. The readings are not enjoyable and the lectures are not very informative. The professor also has a huge ego, which becomes annoying. Section was easily the best part of the course. If you like astronomy, take this course. If you not, there are definitely better science cores.","Easy and incredibly interesting.  A definite must-take for a non science person who needs to do their SPU.","my roommate recommended this course to me because it \"changed her life.\" i thought a lot of what we did was very cool, but it was a lot more math than i expected. the parts that weren't math were great. while i recognize that, as professor kirshner said, math is the language of science, i found a lot of it difficult.","This class in AMAZING.  The homework is only graded based on participation, the tests are fairly easy, even if you are not a science person, Bob Kirshner is a fantastic lecturer and this is the best class ever.","Kirshner is like Bill Nye - he's really entertaining, and this course teaches worthwhile stuff while not being ridiculously demanding like a lot of cores\/gen-eds can be.","Since the course is not curved and you just need above a 90 percent for some kind of A, make sure you take care of every small item that counts for a small part of your grade. Don't miss any psets, go to the telescope sessions as early in the semester as possible and study for the quizzinos. These small grades add up.","If you're not a very strong mathematician or scientist, be cautious. However, the material we learned was really interesting and was presented in an equally fun and interesting way. I'd say it is completely worth the hard work...most things are!","If you are looking for a class with really serious lectures and with a really serious, earnest professor, this class is not for you! If, however, you are looking for a class that conveys a LOT of information without taking itself too seriously, and which includes some fun demonstrations and a healthy dose of humor from the professor, you'd probably really enjoy this class. The section component and the problem set assignments allow you to gauge if you're on track and are learning what you should. I learned a great deal from this course, so I'm definitely not saying it's a joke of a course, I'm just saying it's probably more chill than your typical Science A.","you learn about a really interesting topic at a level that is appropriate for non-science concentrators. Do it if you are remotely interested in the subject and need to fulfill the GE requirement","This class has a lot of interesting concepts, and you will be surprised at how much knowledge about the universe and physics you will have learned by the end of the course. However, make sure to keep up with the lectures and psets and go to sections. They are key to keeping up with the course materials, which will dramatically pick up after the midterm.","This is the perfect course to take to fulfill the SPU requirement or as an elective. It's incredibly interesting, but really easy and fun too.","There comes a time in the life of every Harvard man (or, I suppose, woman), in which he (or she) learns that he (or she) will have to take a science A course. This will fill said student with dread. But lo! Look what light through yonder window breaks! It is the Science of the Physical Universe 19, and it is your savior. Yes, science friends may scoff, pointing out that the problem sets require such complex skills as \"scientific notation\" and \"plugging and chugging.\" But you won't care! Unlike those science friends, you've actually***REDACTED***hand. So begone, ye advocates of the \"Einstein Revolution,\" with your having-to-do-complex-math. Fie, those who would tempt the Life Science Monster. If there's one thing Harvard's about, it's knowing how to go with your gut. Or taking one, as the case may be."]},"Spring '12":{"comments":["Don't be fooled by the exponent lessons... this course will actually involve math (that is probably relatively easy if you pay attention, but will you?) TFs vary a LOT. Switch at the beginning if you get a bad one. Kirshner is bizarre, in a good way.","it's easy but not as easy as one would think - the psets take time and if you're not used to science psets it can be hard","This is a great SPU Gen Ed. You learn a lot about the Universe from one of the leading researchers in the field, who is also a great teacher. You'll leave the course with the ability to have a dinner conversation about General Relativity and atomic physics.","You can't just use the math, you actually need to learn things about stars","The midterms and final were harder than I expected. I'd recommend trying to get the general concepts down before making your cheat sheet to study for it. But as an SPU I'd definitely recommend this, especially because Kirshner is so hilarious and great as a lecturer.","This is a very easy class and a painless way to get a Gen Ed requirement out of the way. It also does give a new appreciation for astronomy, the night sky, and how weird our universe really is.","Absolutely fascinating material - especially for those who've always been curious about the world outside of this world.  Gives perspectives on things.  Go to all sections.  Can't recommend the same for lectures.","I would definitely recommend this course as a general education course for SPU since the professor is so engaging, funny, and knowledgeable. Do not underestimate the midterm because it is more difficult than expected. Use the TFs as resources!","Decent SPU. Minimal math, engaging and entertaining lectures, great section.","It's not THAT easy. It's important to keep up with the homework and just put in your best effort in attending lectures and doing the readings in order to do well.","Not too difficult, very interesting material.","Professor Kirshner is a very entertaining lecturer, and the fact that he had a hand in discovering a lot of the material he discusses makes this class worth taking.","This course is not as easy as I'd anticipated! The readings are enjoyable, but actually take quite a bit of time.  I think they were well worth it, and I learned a lot in this class, but it certainly was not what I had anticipated in terms of difficulty.","Kirshner is hilarious. You will probably learn something taking this course but nothing is more incredible than watching Kirshner flying a rocket car into the next classroom and then doing the whole \"wheel rolling out\/crutches\" scene. Do not think you can do no work and get an A. You can do little work and do well but you should do the homework and should at least watch the lectures online.","It's a very interesting course and Professor Kirshner is a very engaging lecturer, but it's not as easy as you might expect it to be!","I never thought I would enjoy a physics or science class for that matter but that was certainly not the case with SPU 19! The lectures are engaging, witty, and well presented which made this course very enjoyable!","a very enjoyable introduction to astronomy","Lectures are not too interesting, but the material itself is really fascinating! Definitely go to section; you learn a lot there.","If you don't know physics it's not as easy as they say it will be.","learn about everything in the universe in an easy way - very interesting","This is a very easy Gen Ed. It won't take up much of your time, the tests aren't challenging, and the course material is very interesting. Go to lecture and pay attention and you won't even need to study for exams. The lectures are interesting too; Professor Kirshner is very funny in his own way.","Fun, exciting course. Lectures are never boring. Do the reading though, all of it.","This class teaches you a lot of interesting things about the universe, without going into too many details you don't care about.","This class is a fantastic introduction to everything you ever wanted to know about the universe.  The material is really interesting and the homework isn't too bad.  Professor Kirshner is an entertaining lecturer and he always does a crazy and awesome experiment\/demonstration at the end of class--for example, like driving a fire extinguisher propelled go cart across the front of the room.  If you ever wanted to know more about the universe, this is a fantastic way to satisfy that curiosity.  I took it without any prior experience in astronomy\/astrophysics and found it to actually be pretty easy.  If you do take it, though, go to lecture.  He posts the lecture notes online but you won't get nearly as much out of them than if you go to lecture.  You'll also miss the awesome demonstrations in class, which are well worth attending by themselves.  This is a fantastic way to fulfill the SPU GenEd.","Fairly easy gen ed, really interesting subject material at times. Kirshner is a hilarious lecturer.","So long as you keep up with the work and do all the assignments, SPU-19 is a great way to learn about the universe from a really interesting and engaging professor while also not breaking your back with the courseload. Take it!","This is a good SPU to take if you're looking for a pretty straight-forward, entertaining class. The workload is not bad at all, Kirshner's lectures are always fun (with GREAT demonstrations!)","It's a good class where you learn a lot of cool things. That said, I felt like it was a bit too much work for an elective. Take it if you need an interesting course to fulfill the SPU requirement, but don't take it \"for fun\" unless you're really on top of your work and can devote a  moderate amount of time to this course (i.e. don't think of it as an easy elective or easy 5th course, because it's not).","Excellent course if you're looking for a relatively painless GenEd.  You don't really have to pay attention in the lectures to do well, but I would recommend listening because they are VERY INTERESTING!!!","Although the subject is interesting, I would not recommend this class unless you can really dedicate time to it. This is not a nice, fun, easy astronomy class. Professor Kirshner is great, but the readings, psets, lectures, and sections become overwhelming. The homeworks do not prepare you for the exams, and all of the reading is too much to do for this class. But take it if you're interested, just make sure you're willing to do the work. Lectures are crucial. You get so much more out of going to lecture than watching the videotaped lectures. Sections are also very helpful and good. He says he doesn't curve, and that is 100% true. This class is not curved!","This is a great way to fulfill your SPU gened. The assignments aren't bad, but make sure to study concepts for the midterm\/final. Overall, a great class!","Be diligent about your course work. Be sure to keep up with the lectures and the material.","Make sure to review lecture slides assiduously.","Lecture is horrible. Section is somewhat helpful. Pretty easy, but definitely not a guaranteed A.","It's definitely a good SPU class to fill the requirement, but it seems deceptively easy--it does require a good amount of time if you want to do above average. That said, you do learn a lot of conceptually interesting stuff and I can't really complain.","Great professor and staff. All very nice and passionate about topic. Not a very time consuming or difficult course, but definitely VERy interesting material. I'm super glad I took this course and will certainly further explore this topic in my free time.","Class is not necessarily an easy A. You need to really like astronomy or be able to pick it up quickly to do well. Kirshner is a great lecturer though, and really fun.","This class is very fun and interesting.","It's a painless way to fulfill your SPU Gen Ed requirement.  It's interesting and you'll understand how we know what we know about the universe by the end of the course.","This is a fun way to fulfill the SPU requirement, and you can learn a lot if you actually go to lectures.","Donâ€™t take this. Everyone wants an easy class to balance a tough schedule but unless you know this stuff already donâ€™t take SPU19 (the question of whether you should take a class where you know everything is a separate argument -  I would urge you not do it). If you are genuinely interested in learning about the subjects in this course, donâ€™t take the class â€“ it will only confuse you more and leave you frustrated. There is no incentive to learn some really fascinating stuff and you are just given a random jumble of information. If you care about learning the content then just read the Wikipedia pages on all of this stuff and donâ€™t put yourself through the struggle of battling with this dreadful attempt at teaching. If you ignore my advice and decide to take this, the only you will redeem the experience is by talking to the TFs who are great â€“ go to their office hours. Otherwise, this class is completely pointless. The worst I have ever taken, anywhere, in my life.","If you are looking for an easy and interesting gen ed, don't take this class!!! There are more than twice as many psets as other SPUs, the psets are pretty difficult, there's a ton of reading, lectures are obtuse.. I could go on. Professor Kirshner is nice but crazy, full of himself (did you know that he advised last year's nobel prize winners??!) and hard to follow. Not to mention he tells the same jokes and phrases over and over (\"yes, they replied with one voice!\"). I learned a couple cool things over the course of the semester, but it wasn't worth it.","I enjoyed learning basic elements of astronomy, but the course was not as easy as I was told.  There is a lot of material to digest, and I didn't get very much of it from lecture or section.","Ideal SPU for humanities-oriented students. You actually learn interesting things about the physical universe and aren't asked to do difficult math. It gives you a very good idea--as far as I can tell--of the trajectory cosmology has taken and where it is headed. Go to all the lectures: Kirshner is not worth missing. You can get a lot out the class if you just pay attention and not blow it off as just another Gen Ed requirement.","Very interesting material from a great professor.  More memorization and less math than SPU's typically are, however.","Probably the best SPU out there, though I think the whole science gen-ed thing is a bit silly.","I recommend this class to humanities concentrators looking for a good science gen ed. The class made me miss complex physics and chemistry, but it was a good course to use to get a requirement out of the way. It's not all that demanding in terms of the workload, the readings are interesting, and Professor Kirshner made me laugh out loud at least once every lecture. The class wasn't as intellectually engaging as some other classes are, but it was still very enjoyable.","Good gen ed.  Professor gets scatterbrained near the end of the course.  The TF's were fantastic and the best source of information for the class.","It's pretty hard for a Core, as a social sciences student who has taken AP Physics I thought I wouldn't have to work that hard, but I actually did.","This was an amazing course and professor Kirshner is an amazing and very entertaining lecturer. Every class we had fun demonstrations. The course is an easy step into astronomy and the homework doesn't take too much time. The best are the two observing sessions with the telescope.","This is a very nice way to take care of the SPU requirement, with no labs, fun lectures and challenging but fair exams.","Good science GenEd or elective, especially for those familiar with physics and are interested in astrophysics.","This course requires much more work to succeed in than it sounds like it will. Though it's not uninteresting, it is also not the easy Gen Ed it seems like it might be. You'll need to either watch or attend lectures to do well-- the books won't really help you.","I really liked this class. The TFs are great, and Prof. Kirshner is really cool and funny (and a little crazy, but in a good way). The course load is quite light, but never think of this class as a \"joke\" class. You will regret it. If you are interested in astrophysics and are willing to put in some good effort, you will find this class enjoyable.","Take this class.  Professor Kirshner will literally change the way you see the universe."]},"Spring '14":{"comments":["Take this class only if you need the GenEd. It is bearable, at best. Psets are annoying and usually not related to lecture. If you do attempt the reading, its terse and yet again unrelated to lecture. Demonstrations in lecture are cool, but usually are left unexplained and then later show up on tests.","This class is a really easy and enjoyable way to fulfill the SPU requirement.  Kirshner makes the course fun, especially with his demos at the end of every lecture.  Attendance at lecture is suggested but not required (all lectures are filmed), and they tell you beforehand if you'll have a pop quiz in the lecture (and thus need to attend).  If you have Sarah as your TF, then this will be a great experience.  She was an absolutely terrific TF.  The psets could be completed the night before if need be, and you get two drops which is great.  For the midterm and final, you get one sheet of paper to write notes down on.  There is no excuse to do poorly on the exams.  They're easy, focus on the main ideas of the course, and you get notes!  Also, you don't need to do the readings.  They're pretty fun but not essential to doing well.  I learned a lot about space and it was painless.","There are easier SPUs to take.","Of all the SPU courses, I would definitely recommend this one. It's the most interesting material I could find and not too difficult while still learning a lot. The course isn't the best organized, but the material is very interesting and fun for the sake of knowing.","Professor Kirshner is an incredibly engaging lecturer who truly cares about his students. The class is not very difficult; Professor Kirshner is great at communicating complex topics in an accessible manner. If Sarah Wellons is a TF next time, make sure that you are in her sectionâ€”she is amazing.","Wonderful SPU.  I could not recommend a better gen ed.  Prof Kirshner is great, his demo's are on-point, lectures are engaging, and it is relatively easy to stay caught up with the material.  The teaching staff were so helpful and did a great job explaining concepts that were difficult at first.","This is really a great, painless SPU for the less science-inclined.  If you do the work it's easy, and if you don't do the work you can learn all of science in the 24 hours before the final and you'll be okay.","If you're looking for a gen-ed science course with excellent readings, minimal group work (problem sets! much better), and engaging lectures, consider this course. Not too much work, and the work you have to do is interesting and fun.","This is an enjoyable and relatively pain-free solution to the SPU problem. That said, don't expect a comprehensive introduction to Astrophysics.  Kirshner is enjoyable and entertaining, but his lectures often stray from the point.","This class is really fun and relaxing. You will learn a lot. The professor's own research is super interesting, and the whole class will lead up to how he got there.\r\n\r\nTo do well in the class I would definitely recommend looking at the practice exams. Don't worry about the books, they are not tested on the exam.","the course was okay. professor kirshner digresses a bit too much, never seems to get to the point. some of the physical concepts are breezed through, without much elaboration. BUT was it a relatively painless gen-ed knockout? i guess... in the end, fernando, my tf, saved it for me.","This is the perfect SPU! Lectures are entertaining and informative. Professor Kirshner is brilliant and does a lot of funny, memorable demos. I feel like I learned a lot, and I never had to be stressed about my grade. As long as you do the psets and prepare a good cheat sheet for the exams (yes, you always get a cheat sheet), you should be fine.","This is an easy course, and I think I would have gotten more out of if we covered all the of material of the work plan, but nonetheless I got something out of it and fulfilled a General Education requirement at the same time.","Not too much work, and Kirshner is hilarious and a great lecturer","Given the lack of labs, this is a harmless way to fulfill the SPU requirement. It does however, at times, feel a bit like high school AP physics. While the work load is low, just one problem set a week, one short presentation, midterm and a final, there may be more inspiring ways to fulfill the requirement, if you have the time.","This is an outstanding SPU. Not very difficult, but incredibly engaging. Fascinating material (especially if you're interested in space), hilarious\/great professor, and the homework is not bad either.","Don't take it if you really like math, but it's a great class that gives a broad introduction in an intelligible way.","This class is a low-stress SPU and the lectures are pretty funny, although they do digress sometimes. I enjoyed it!","This is a great course to explore your interests, or at least fulfill the Gen Ed requirement. Professor Kirshner is witty and tries to liven up each lecture...definitely come to class to see the demonstrations, which are mostly entertaining!","Kirshner is a hilarious guy. He goes on tangents for about a quarter of the class, but I still came away with a lot of knowledge. I found this class fascinating and not difficult at all. Highly recommend!","Take this class!! It's a gem of a SPU - not hard and really fun.","This course is an amazing introduction to astronomy for students with limited science backgrounds. Professor Kirshner is an amazing lecturer and opened my mind to the astronomical realities in the solar system and beyond. Amazing.","This class has some interesting topics near the end, but tends to hog time one boring things like Newton's laws (if you've taken physics before)."]}},"mostRecentQ":{"overall":"3.80","workload":"1.60","difficulty":"2.50","recommendation":"4.00","enrollment":"60","response rate":"70.00","QCourseOverall":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"1","2s":"2","3s":"12","4s":"17","5s":"10"},"QDifficulty":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"3","2s":"18","3s":"20","4s":"1","5s":"0"},"QWorkload":{"number":"SCI-PHYUNV 19","course_id":"2020","cat_num":"5923","1s":"21","2s":"16","3s":"5","4s":"0","5s":"0"}},"success":true}