{"scores":{"Fall '13":{"course_score":{"overall":"4.00","workload":"1.40","difficulty":"2.20","recommendation":"4.30","enrollment":"112","response rate":"94.64","QCourseOverall":{"number":"CULTR&BLF 47","course_id":"1960","cat_num":"8691","1s":"1","2s":"5","3s":"19","4s":"47","5s":"34"},"QDifficulty":{"number":"CULTR&BLF 47","course_id":"1960","cat_num":"8691","1s":"19","2s":"47","3s":"36","4s":"2","5s":"0"},"QWorkload":{"number":"CULTR&BLF 47","course_id":"1960","cat_num":"8691","1s":"65","2s":"37","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CULTR&BLF 47","cat_num":"8691","course_id":"1960","year":"2013","term":"1","id":"0e4b62e32bb1a3424230b69b8db1c1c5","first":" Janet","last":"Browne","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Fall '11":{"course_score":{"overall":"3.81","workload":"1.63","difficulty":"2.41","recommendation":"4.00","enrollment":"65","response rate":"96.92","QCourseOverall":{"number":"CULTR&BLF 47","course_id":"1960","cat_num":"8691","1s":"1","2s":"5","3s":"19","4s":"47","5s":"34"},"QDifficulty":{"number":"CULTR&BLF 47","course_id":"1960","cat_num":"8691","1s":"19","2s":"47","3s":"36","4s":"2","5s":"0"},"QWorkload":{"number":"CULTR&BLF 47","course_id":"1960","cat_num":"8691","1s":"65","2s":"37","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"CULTR&BLF 47","cat_num":"8691","course_id":"1960","year":"2011","term":"1","id":"0e4b62e32bb1a3424230b69b8db1c1c5","first":"Janet","last":"Browne","InstructorOverall":"4.19","EffectiveLecturesorPresentations":"4.27","AccessibleOutsideClass":"3.84","GeneratesEnthusiasm":"4.33","FacilitatesDiscussionEncouragesParticipation":"4.04","GivesUsefulFeedback":"3.67","ReturnsAssignmentsinTimelyFashion":"4.08"},{"number":"CULTR&BLF 47","cat_num":"8691","course_id":"1960","year":"2011","term":"1","id":"9e0e33af098e1d402203d84a782c1f1c","first":"Alistair William","last":"Sponsel","InstructorOverall":"3.77","EffectiveLecturesorPresentations":"3.85","AccessibleOutsideClass":"3.84","GeneratesEnthusiasm":"3.85","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.64","ReturnsAssignmentsinTimelyFashion":"3.82"}]}},"comments":{"Fall '11":{"comments":["The course is rather flakey, with last-minute changes coming from the head TF, no response paper grading (or acknowledgment), and boring lectures. However, it can be an enjoyable, easy, and educational experience if you make it one yourself. Plan on making the final \"project\" a final essay because the project is highly discouraged. Get Philip as your TF and you will be happy, guaranteed.","This is a fun and engaging course. The lectures are interesting, section discussions are enjoyable, and the workload is very manageable.","enables a broader understanding of the role Darwin's theory plays in each one's life","The class was okay. You really should read all the readings and attend all the lectures in order to feel like you are gaining something from the course, although doing either isn't necessary to do well in the class. The response papers are unnecessary and aggravating. The course does, however, try really hard to engage you with a lot of material outside of class (movie showings, actual primary source displays, etc.)","A really fun class, with a lot of interesting material. Also a pretty easy class.","Make sure you keep on top of your work or it may catch up with you!","It was a very interesting class with great lectures.","Painless and interesting culture and belief. If you are at all a science person take this course there really isn't a better culture and belief option for you.","Excellent teaching fellow staff reads your short essays enthusiastically. One of the few classes where you feel like it's really worth it to research and write well.","I would tell them that this course is pretty awesome and that they will learn a lot more about Darwin than they ever imagined and that they may leave the class looking at Darwinism and its perception today in a new way.","It''s not a bad way to fulfill the GenEd. The final paper was 20 pages long, and a real slog at the end.","This course does not take my time out of your week, but the focus is really on the history, so if you want a course that you find relevant information about today as well, this is not it.","This class is quite stress-free so long as you put in effort on the two mini projects and the final project. Keeping up with the reading helps, but it isn't exactly necessary.","Engaging assignments and interesting lectures.","A very fun and quirky class about evolution. Lectures are awesome, section is great, and the grading is very fair. It will definitely be one of your favorite classes.","This course is a great opportunity to learn about Charles Darwin and his revolution from an expert in the field. The students who take this course also tend to be great, section discussions are top notch and at a higher intellectual level than most.","Awesome!","The final paper was way too long and the course didn't provide enough preparation for it.","Pretty good class overall, grading seems to be pretty easy.","I loved this class! The best gened I have taken so far! You learn so much about why we think the way we do about culture, science and religion. I always attended lecture and really looked forward to section each week (a first for me as a science concentrator in a humanities class). If you are willing to do the readings, they are really fascinating and you will get a lot out of them. Both Professors are really nice and approachable. Try to get Philip as your TF if he is still teaching it...again a great section was part of why I loved this class.","The work is manageable, so stay up on it. Doing the readings really enhances lecture and if you engage with the materials you will get a lot out of it. I LOVED the class. HEB majors, definitely take this as a gen-ed.","Go to lectures because they are worthwhile.","Interesting. Good job showing how science can be viewed in a historical way.","This is a course you take for fulfilling culture and belief requirement in the most engaging and fun ways! It does not take too much of your time or your energy. It is the type of course you are looking forward to. Also there are videos, so in case you can't make it to a few lectures, there's the back up plan.","The final project requires a lot more work than most general education courses do. I probably would not have taken this course had I not had to.","Although the emphasis is placed much more heavily on the historical importance of Darwin's theory than rigorous scientific examination, it's a class I would recommend to anyone interested in science, due to the comprehensive exploration of the process by which a scientific breakthrough is reached and the results that it has on the world at large.","If you are even vaguely interested in evolution or Darwin you need to take this class!","Take this if you like thinking historically. The professors are great and clearly care a lot about the subject. Honestly I took this as an easy senior elective but I wish I had understood how seriously they would take your ability to write historically.","Take this course unless you hate writing. The course will be pretty easy until the final project, which requires a 20 page research paper or a movie project that takes quite a lot of time.","I would like to tell future students that this is a great class if they are interested in demystifying the theory of Evolution. There are a lot of misconceptions out there about evolutionary concepts and the class not only clears them up, but it makes you able to speak knowledgeably about the subject as well.","I'd recommend this class- it was interesting and was not very much work at all. The professors are friendly and excited by the material they are teaching, which is nice. There is a lot of reading assigned, but it is not necessary to read all of it thoroughly, lightening the work load considerably.","If you want a very manageable gen ed course, this is not a bad option. The material loked a lot more interesting to me than other culture and belief courses and the workload wasn't bad at all.","This class is a decent gen ed option because the assignments during the semester are very low-key. However, I had a few issues with this class. First of all, the weekly response papers were irritating because they weren't graded, so there was no impetus to put any effort into them. They were more of a nuisance really. I found section to be kind of useless because we weren't really discussing anything that required clarification or that could be taken to a higher level of understanding. The material in this class is very straight-forward, so I always found discussion to be boring. The most annoying thing about this class is the final paper. Yes, you can do a project instead, but, if you choose to do a paper, you have to write a 15- page paper. Personally, I think 15 pages for a gen ed class is ridiculous. I'm a sophomore and this was the longest paper I've had to write for a class, including papers in classes I've taken for my philosophy secondary. Aside from all of those negatives, the class does cover some pretty interesting topics.","This is an interesting class with engaging lectures and a fairly light workload.","This class is very laid-back, but still interesting. The reading list is very manageable, so you may as well keep up with the readings - it makes the rest of the class much more worthwhile. The grading scheme may change, but be prepared to put a lot of effort into the final paper, which was worth 50% of our grade this year.","Enjoyed the material, however the midterm and final project were quite extensive.","If your main interest is science, CB 47 is a great way to fulfill a history requirement. I don't usually like history, but this class won me over.","It's easy and the subject matter is interesting for a C&B course.  The class is about a lot more than just Darwin (there's only a few lectures on him), and you'll learn so much more about the science\/religion debate than you could ever find in a textbook.  It's also cool to take a class on Darwin with Janet Browne, who basically knows more about him than anyone in the world.","This is the best gen ed class at Harvard. It was incredibly interesting and was just the right amount of work. It gives you a deep appreciation of Darwin and evolution.","This class is a gem. If you put in even a little bit of effort, you'll do well. Professors really care about the subject."]},"Fall '13":{"comments":["Very easy and no work but pretty boring and limited subject material.","This course exemplifies the best and worst aspects of the System in General Education. Prof. Browne (former curator of Darwin's papers, a leading historian of evolutionary theory, and, moreover, the present chair of Hist of Sci) and the excellent teaching staff provide an accessible and thoughtful introduction to the topic. Because the class demands so little investment from its students, however, it often dramatically oversimplifies the material. The ironic result is that the non-historian may find himself bored with the class's historical element and come away with the vaguest notions of the complex phenomena under discussion, whereas the historian will likely be frustrated by the lack of rigor in an otherwise fascinating course. I recommend CB 47 only to students with a strong interest in history who are prepared to watch the stuporous members of the Harvard hockey team browse the ESPN homepage during lecture and listen to classmates wonder aloud why positive eugenics was such a controversial policy during section.","The material is very interesting and the work load extremely low. It is the perfect culture & belief course to take as a supplement to one's schedule. I cannot recommend it enough.","take this class! light workload","the readings aren't too bad (but keep up as best you can or else you'll fall behind, and one of them will show up on the exam!) and Janet Browne literally wrote the book on Darwin.  Straightforward midterm and final, no papers, definitely a great gen ed or elective!","It is only a midterm and a final (which I found easy). Also, Professor Browne is an expert on Darwin and is a very engaging professor. The content itself is fascinating (although, as an HEB major, I already have an interest in ripple effect of Darwin).","This is a great class that requires very minimal work--so take it! It is very insightful to see just how Darwinian theory has affected history and society today. If you're interested in the science vs. faith debate, take it. It was also very interesting for me since I concentrate in HEB.","It is so fun to learn about the background of one of the most unlikely controversies of the modern age.","This course is extremely straightforward, and if the subject matter sounds interesting then you should take it.","This was a surprisingly great course. The readings were well-selected and worth the relatively small amount of time per week required to read them. (It's nice to have time to actually fully participate in a gen ed and still have time for other courses.) The material was great, too: scientific empiricism is a social phenomenon -- who knew?","Great class, enthusiastic professor, light workload, interesting content","It's much more historical than I expected; less science and more history.  Good gen ed, and an interesting course in general, but I still have trouble figuring out why it's so important to study the history of science, which I hoped this class would help me understand.","Very painless way to fulfill Culture and Belief, but also a very interesting course. It will greatly expand your knowledge of evolutionary theory and the people and ideas involved with it. Also a good intro to the History of Science concentration. Professor Browne really cares about students learning but also not having too much work, especially freshmen.","Enjoy the material and embrace the simplicity of this class. Skim the readings...it isn't necessary to spend hours on this course.","Professor Browne is an incredibly enthusiastic, engaging, and funny lecturer. Her presentations are well organized and very easy to follow. The readings are of very reasonable length (and you can get by in section even just by skimming them). Reading and discussing Darwin has never been this easy or fun.","This class is intellectually stimulating yet does not have an overwhelming workload. The reading is applicable and interesting, and Professor Browne genuinely cares about what she is teaching. Her enthusiasm, and that of my section leader, made me excited about the course too!","This class is taught very well and is extremely interesting as well.","This is a wonderful course taught by an incredible professor. The section component of this course is weak, and thus in order to succeed in this class one needs to be self motivated.","very easy but also very interesting, a good class that takes up like no time in your life","This class is a wonderful option for fulfilling your culture and belief requirement.","This class is a great gen ed because it is not too time-intensive and also is very eye-opening. I came away having learned a lot without having put too much time into the class.","You learn the historical relationships between science and religion, and gain a deep appreciation for the history of science, you learn to think about science critically, fantastic course for biologists and students who have never taken a course in this field, not much work","Do the readings. V few assignments so readings can understandably pile up. But the ID's for the exams require quite a sophisticated and deep understanding. Adequate answers can reasonably be studied for last minute but 100% correct answers require a bit more dedication. It's a GenEd, so decide for yourself where your priorities are.","Good, fairly easy course that fills one of the general education requirements.","If you are at all interested in Darwinism or the intersection of science and society, this is a super easy and painless way to fulfill your C&B requirement. The readings and lectures are interesting, section is well-run, and the topics explored are really quite interesting.","Go to Lecture","Lots of reading. You can get by with doing little work.","Take this class if you are a science person looking for a good gen ed thats not too far away from your comfort zone","This class is fantastic! The lectures are engaging, professor is enthusiastic and fun, workload is low enough that you can really enjoy the readings. I've always studied science but never learned much about the history of science, really makes you look at science a whole new way. Plus the debate between science and religion is incredibly pertinent and interesting. Perfect way to satisfy the CB gen ed. Take this class!!","This class requires little outside work from you. You practically don't have to do any of the readings, but you should because you'll get a lot more out of the class. This course will give you a good understanding of Darwin and the people\/politicians\/scientists who came before him and after him. It will complexify the modern debate of religion v. science.","If you are interested in this course, you are likely to do well. The lectures are brilliant and offer you great perspectives on the history of evolutionary thought and the theory's implications. Don't be fooled by the name, there is a lot more to this course than studying the life and works of Darwin. You will have the opportunity to read and discuss the works of several other influential thinkers.","This is a really interesting course that I would definitely recommend.  The TFs are helpful, the readings are straight-forward and not too time consuming, and Professor Browne is a great teacher.  It has a strong focus on finding connections between different events, so be prepared for an emphasis on context.  Also, you won't reach Darwin himself in the first few weeks and modern controversy isn't until the end.  However, these didn't detract from the class.  I can't recommend this course enough (even if you're not a science or history person)!","This is a very fair Gen Ed, and does not require that much work. It is quite interesting and gives you a view of History of Science which can be very helpful when taken in conjunction with other Science courses. Janet Browne is a fantastic professor and is always available. The section component is only one hour and does not require that much work either.","This course is a very good option for fulfilling the Culture and Belief requirement, especially if you're interested in history of science. The weekly workload is not heavy at all and the readings are generally useful to understanding the course material. If the course is still doing the museum visits, those were really cool and a nice chance to explore the resources that Harvard has.","The most interesting Cult&Blf gen ed! The professor is absolutely fantastic and the lectures are incredibly interesting!","The only grades come from a midterm and a final, and their formats need real work. There are no presentations, projects, or papers, and the sections are so big that it is difficult to feel like you're contributing. There is no real way to feel like you're being objectively evaluated in the class.","Janet Browne is awesome and the course load is very light so it is a good class to take if you have a heavy semester.","This is an interesting class and the reading material assigned every week will benefit you immensely if you take it seriously.","This class is an easy gen-ed that does not require significant effort. The topic is extremely interesting and Browne is a very knowledgeable person. Definitely take this class if you need a good culture and belief gen-ed.","It is a great course. You really learn to appreciate the resources Harvard has, and learn about the history of the school in context of the role it plays in the acceptance of evolutionary theory.","This is a fun, interesting class that doesn't take too much work.","It's a great history class! And it's very interesting to learn about Darwin.","It's always worth going to class because it's interesting but you don't miss much for not going. It's a win win situation","This is an interesting gen-ed course that isn't too much work. The readings aren't too bad and the teaching staff is helpful.","That the material being taught is very interesting and a course where you will definitely learn something knew. And that Professor Browne is outstanding!","If you are interested broadly in the history of science or Charles Darwin or the idea of evolution, this course is informative and VERY manageable. That said, be honest with yourself. Only take this course if you are the kind of person who will take a course seriously when many around you don't and when there are very few assignments to hold yourself accountable for the material.","It's an awesome class, and really gets into the meat of how the world has been changed or revolutionized by Darwin's theory of natural selection.","Unclear how they grade the class, but little work and very painless","This was really fun! Prof Browne tries to keep the work load to a minimum which is great.  The readings aren't even really mandatory but you'll want to do most of them because they're so engaging.","Really lovely course. It requires very minimal work, but you will get a lot more out of the course if you spend time actually delving into its thematic material. Lectures were always relaxed, but engaging. Great class as an intro to the field of History of Science, and so many interesting topics, like Creationism and Eugenics in the US.","This class is a relatively low-stress and interesting exploration of the reactions to Darwin's theory, and is great for anyone interested in the topic.","It is a great class with a curriculum that flows really well chronologically. Professor Browne is the best and does a great job providing a non biased account of the evolution of a very controversial and relevant topic that everyone should know!!","Didn't have to read a single page...studied one night before midterm and did just fine.","It's  great if you enjoy learning about Darwin and his ideas","Fantastic class and you can never go past a class with Janet Browne.","Easy class, but interesting.  Make sure you do the readings for the midterm and final, although if you fall behind a little bit it's not a big deal.  Midterm is sneaky tough- it's easily manageable if you studied, but don't underestimate it and think you can get by without doing the readings.","Great course!","Take this class if you want a relatively low workload general education class, or if you're really interested in the history of Darwin's theory.","easiest course at harvard. no work just midterm and final which are both very straight forward. interesting material and perfect gened","Fun class to learn about evolution and taught in a very fun manner.","Immerse yourself in this class! It will provide you with a lot of knowledge that you should just know for life. I would HIGHLY recommend that you do all the readings!","Pretty easy and interesting. It seems like you need to know the material and be very thorough on exams though.","Although the coursework is very minimal, you will be sufficiently challenged to view society in a different lens and ask interesting questions","Great class for a GenEd. Very little work.","Take this class! Professor Browne is the leading expert in the world on the history of Darwin. Lecture is fun, engaging, and informative. Pay attention though because topics discussed in lecture will come back in full force on the midterm \/ final. The TFs are good too and know a lot about the history of science. If you've ever wanted to learn more about Darwin, creationism, or the conflict between science and religion, you've come to the right place. Readings are manageable and helpful. You'll learn a lot."]}},"mostRecentQ":{"overall":"4.00","workload":"1.40","difficulty":"2.20","recommendation":"4.30","enrollment":"112","response rate":"94.64","QCourseOverall":{"number":"CULTR&BLF 47","course_id":"1960","cat_num":"8691","1s":"1","2s":"5","3s":"19","4s":"47","5s":"34"},"QDifficulty":{"number":"CULTR&BLF 47","course_id":"1960","cat_num":"8691","1s":"19","2s":"47","3s":"36","4s":"2","5s":"0"},"QWorkload":{"number":"CULTR&BLF 47","course_id":"1960","cat_num":"8691","1s":"65","2s":"37","3s":"3","4s":"0","5s":"0"}},"success":true}