{"scores":{"Spring '13":{"course_score":{"overall":"3.90","workload":"1.73","difficulty":"2.24","recommendation":"4.12","enrollment":"80","response rate":"86.25","QCourseOverall":{"number":"SOC-WORLD 33","course_id":"2047","cat_num":"9691","1s":"0","2s":"7","3s":"12","4s":"29","5s":"19"},"QDifficulty":{"number":"SOC-WORLD 33","course_id":"2047","cat_num":"9691","1s":"11","2s":"30","3s":"23","4s":"2","5s":"0"},"QWorkload":{"number":"SOC-WORLD 33","course_id":"2047","cat_num":"9691","1s":"28","2s":"28","3s":"10","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 33","cat_num":"9691","course_id":"2047","year":"2012","term":"2","id":"77ffed0ff6ba63862f7a3bd6b3205e91","first":" Theodore C","last":"Bestor","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.06","AccessibleOutsideClass":"3.91","GeneratesEnthusiasm":"4.39","FacilitatesDiscussionEncouragesParticipation":"4.14","GivesUsefulFeedback":"4.31","ReturnsAssignmentsinTimelyFashion":"4.36"}]}},"comments":{"Spring '13":{"comments":["For anyone interested in Tokyo, Japan, Japanese, or Japanese culture and history, this course is an amazing one. It gives you background on Edo (Tokyo pre-1868) and Tokyo, the cultural transformation of the city, and the globalization of the area. It provides information on many aspects of Japanese life inside and outside of Tokyo, and it is a wonderful opportunity to learn about an amazing place.","Beware of the disorganization that will take place in the first month, not even week.","Take this class. Bestor is the man, Non is the man, Tokyo is a fun city.","A good Gen Ed. Fun lectures. Fair assignments.","Great course!  The assignments were completely manageable and had much freedom for exploration within your topic.  I also loved section and had a great TF, the other TFs seemed just as great as well.  The books were very interesting and you were able to select which ones you wanted to read which was great.  I also loved the films and additional reading material.  Very manageable class, but only take if you are truly interested in Tokyo.  But with a city so fascinating, who isn't?","The class is very diffuse, but it is a good general introduction to Tokyo.","This class was really disorganized - a required book got added to the syllabus after the class had started and every assignment was pushed back from the original due date.  It was also very disjointed in that the lectures were completely unrelated to the readings and both were completely unrelated to the final paper.  While I initially thought this was really cool and academic, I soon realized that it lacked much reinforcement of material or focus of subject matter.  If you want to learn about Tokyo for the sake of learning in a relatively low-pressure setting, this is a good class for you.  If you care about organization or classroom logistics or are only somewhat interested in Tokyo, I would recommend a different class.","The section leaders do not understand this is a gen ed. There is no reason to give C's for decent work in a gen ed.","Get to know the staff!","i really recommend this class to anyone who is interested in Japan! Professor Bestor really knows a lot about Tokyo and Japan and is just generally a really cool professor. the class can seem a bit disorganized at times but overall its really enjoyable, not too difficult at all, and taught by someone who is dedicated to the material","Take this class if you are interested at all in Japan. I didn't know nearly as much about Japan as most of my peers in the class and all I really knew about Japan was sushi, anime and samurai. But as long as you have some interest -- and are open minded and love learning about new cultures, this class is for you!","This class is a fantastic way to look at the history of Japan from the Meiji Restoration to present day, through the lens of focus on Tokyo as the centrality of progression through time. If you have any interest at all in Japan, Japanese culture or language, or even just sushi, this is the class to take a look at. Professor Bestor runs a great course, and is so great to listen to in lectures. He really knows his stuff, is hilarious, and truly cares about each and every student in the course.","If you genuinely have an interest in Japan and its history, definitely take this course for a gen-ed. There is minimal work. But if you're just trying to complete a gen-ed, I would not recommend this course, since we focus a lot more on the history of Japan, as opposed to its modernity.","This is a great way to fulfill your SW requirement.  It's a really chill class - this year we only had three paper assignments and there is no weekly assigned reading.  You only have to read four books throughout the course and you can choose which you want to read.  As this was the first time this class was offered, it was a bit disorganized, so there may be more assignments in future years.  Section is a little strange because most people in the class know a lot about Tokyo so discussions often revolve around prior knowledge of the culture.","Interesting and easy, but the course itself is quite scattered; if interested in Tokyo, there are probably better options.","Even though the course is entitled \"Tokyo,\" I think I learned as much about Japan in general as I did about Tokyo itself.  That is just one example of how, in my opinion, the course was a little disorganized.  It was hard to find anything on the course website and as a whole, the lectures did not seem to develop a clear direction.  That said, the course did teach a lot of interesting odds and ends about Tokyo and Japan through a wide range of disciplinary perspectives like architecture, film, literature, anthropology, sociology, and visual arts.  We also had some highly enthusiastic TFs who were always alerting us about extra opportunities to experience Japanese culture like screenings of Japanese films, Japanese art displays in the Boston area.  Since the course had no tests (the final was dropped, though the course syllabus still has it listed, I believe), the disorganization was not such a bad thing, and I could focus on the information and extra activities that most interested me, reflect on those interests in my response papers and final project, and not feel pressured to remember every random detail thrown at me, which would have been an absolute nightmare if there was an exam.  In fact, knowing what I know now, I would think twice about taking this course if it has an exam listed next time it is offered.","Be sure to take the readings seriously. The books are dry and long, and you are required to use them in papers. We had the final exam canceled on us, but in the future, the course will probably require both the final exam and final paper\/project, so be forewarned about those.","This class is very little work over the semester, and you have a lot of freedom in choosing what to read, what to write your response paper about, and what to do a final project on. There was no exam, which was really nice, since you could (or could not) go to class and not worry about memorizing everything.","There is very little work, but it was very unorganized.  It was also confusing at the beginning trying to figure out how to pick the books you were supposed to read.","Fascinating Introduction to Japan.","Take advantage of the TF and Professor office hours! Make sure that you pick books that you find interesting and have fun with the final project! The professor and teaching staff really try to make sure that you can explore a topic that interests you in a way that interests you so you can have a blast with it.","Interesting enough curriculum with some of the lowest expectations I've ever seen at Harvard. I couldn't imagine an easier way to kill a gen ed requirement.","Take this course! Stress-free but you learn so much at the same time. Excellent GenEd course!","Seriously a really easy class - very little workload, lectures were interesting. Highly recommended","4\/5. This course was really fun and you learn a ton about Tokyo and Japan in general throughout the semester, but it was very poorly-organized. Just as an example, we were actually supposed to have a final exam, but our professor didn't register in time, so our final grade was just based on participation, two short papers, and a final project. Still, if you're interested in learning more about Tokyo and Japan from a variety of different perspectives, take this class! Although it may be disorganized, Professor Bestor knows EVERYTHING about Japan, and you'll have a fun time if you choose to take this Gen-ed","Painless way to fulfill Societies of the World","One of the best Gen Ed classes I've taken at Harvard. The workload is manageable, the material is compelling, and you'll actually have fun writing your papers!","The quality of a given lecture, reading, section, or film screening varies wildly over the course of the class. It's interesting stuff, but sometimes it can get bogged down in anthropological terminology that's not really interesting or useful to someone just taking the class as a gen-ed.","I didn't feel like a learned a ton from lectures, but the books were interesting and sections were fun.","I have mixed feelings about this course. While the workload was light, I felt that this meant the course lacked direction. The course's lectures felt superfluous: they were broad historical overviews rather than detailed analyses. The course's readings were good, but all we had to do was pick 4 books of 8 to read. This made for a light workload, but didn't really teach me that much. In the end, this course piqued my interest, but didn't really satisfy it.","This is a great class that helps to inform us about a vibrant and interesting society and people.","This course is awesome - the readings are super intersting, Ted Bestor is the man and gives clear, engaging, and hilarious lectures.  The TFs are great - Non was my TF and I learned so much about how to write a credible anthropology assignment thanks to him.  He also made section experience stress-free and intellectually-stimulating.  The professor puts a lot of effort into this course - you would be foolish to pass it up.","You should be genuinely interested in Tokyo. If not, the course will just end up feeling like a huge waste of time. \r\nBestor is a good lecturer and a really interesting person to talk to. Required readings are pretty good.\r\nOn the whole, the course was just really badly organized and therefore extremely frustrating.","This class is not demanding yet very rewarding! The reading materials are surely interesting and informative. Take this class if you're interested in Japan","You should really pay attention in this class. It may seem haphazard or disorganized but you really learn alot about Japan and the certain things that make it how it is. It was a great class and I honestly wish it was longer so I could learn more.","wonderfully engaging class! really enjoyed being immersed in the culture of japan and engaging with it in different ways. professor bestor often recounted his own experiences conducting research in japan and told some great stories. my tf, non, was also very entertaining and took after professor bestor in being tongue-in-cheek in his presentations. he also helped us put together a 4 d puzzle at the beginning of the semester and brought us japanese candy and coffee and tea every week. with that said, all of the teaching staff was very knowledgeable, and i learned a lot about japan this semester. this class really piqued my interest in exploring the country more in the future. great gen ed!","If you enjoy learning about Japan, its a great Gen Ed.","You get what you put into this class. Yes, you can get by with barely reading the assigned books, coming to class, writing the midterm paper, and final paper (our year didn't have a final), but you'll get more out of it if you spend time on the course website exploring the articles and resources offered. At its minimum, it's a fun course with an enthusiastic teacher (bestor). Yrmv if you don't put in any effort into the class.","Really relaxed Gen-Ed with only 2 response papers and a final project (on whatever you wanted as long as it was loosely related to Japan). Sections were extremely interesting and a whole lot of fun. The lack of any midterms and final exams really allowed me to focus on the readings as purely something out of leisure and in doing so, I was that much more able to learn volumes on the history of Tokyo. Definitely Take it!"]}},"mostRecentQ":{"overall":"3.90","workload":"1.73","difficulty":"2.24","recommendation":"4.12","enrollment":"80","response rate":"86.25","QCourseOverall":{"number":"SOC-WORLD 33","course_id":"2047","cat_num":"9691","1s":"0","2s":"7","3s":"12","4s":"29","5s":"19"},"QDifficulty":{"number":"SOC-WORLD 33","course_id":"2047","cat_num":"9691","1s":"11","2s":"30","3s":"23","4s":"2","5s":"0"},"QWorkload":{"number":"SOC-WORLD 33","course_id":"2047","cat_num":"9691","1s":"28","2s":"28","3s":"10","4s":"0","5s":"0"}},"success":true}