{"scores":{"Fall '14":{"course_score":{"overall":"3.80","workload":"2.80","difficulty":null,"recommendation":"4.00","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"0","2s":"1","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"3","2s":"7","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"2","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"LING 106","cat_num":"6115","course_id":"2785","year":"2014","term":"1","id":"9640a897d547cab1de1ce8035cc8e532","first":" Gennaro","last":"Chierchia","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '14":{"course_score":{"overall":"3.50","workload":"1.60","difficulty":"2.40","recommendation":"3.50","enrollment":"19","response rate":"89.47","QCourseOverall":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"0","2s":"1","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"3","2s":"7","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"2","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"LING 106","cat_num":"6115","course_id":"2785","year":"2013","term":"2","id":"72481e25bfe7557bb9cb5d8af90b28e3","first":" Andreea Cristina","last":"Nicolae","InstructorOverall":"3.80","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"3.50","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '13":{"course_score":{"overall":"2.75","workload":"1.75","difficulty":"3.00","recommendation":"3.00","enrollment":"5","response rate":"80.00","QCourseOverall":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"0","2s":"1","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"3","2s":"7","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"2","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"LING 106","cat_num":"6115","course_id":"2785","year":"2012","term":"2","id":"f3df1358086dbdce7fa3b0241318665d","first":" Ulrich","last":"Sauerland","InstructorOverall":"2.33","EffectiveLecturesorPresentations":"2.25","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"2.50","FacilitatesDiscussionEncouragesParticipation":"2.00","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]},"Spring '12":{"course_score":{"overall":"3.56","workload":"1.67","difficulty":"3.11","recommendation":"3.67","enrollment":"11","response rate":"81.82","QCourseOverall":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"0","2s":"1","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"3","2s":"7","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"2","2s":"2","3s":"0","4s":"0","5s":"0"}},"instructor_scores":[{"number":"LING 106","cat_num":"6115","course_id":"2785","year":"2011","term":"2","id":"9640a897d547cab1de1ce8035cc8e532","first":"Gennaro","last":"Chierchia","InstructorOverall":"3.89","EffectiveLecturesorPresentations":"3.89","AccessibleOutsideClass":"4.43","GeneratesEnthusiasm":"4.33","FacilitatesDiscussionEncouragesParticipation":"3.75","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.50"}]}},"comments":{"Spring '12":{"comments":["Semantics was a really good class.  Gennaro is a good lecturer and generally explains stuff clearly.  It's really helpful to talk through the problem sets in office hours\/section, so make sure that whoever TFs the class next year is good at breaking down concepts\/explaining the complex notation.  I would not have gotten NEARLY as much out of this class without the fantastic TF, Andreea.","This course does introduce a different way to look at sentences and their meanings, but it is not the best taught course. I feel like the lectures could be less ambiguous. Also, because this course extensively uses set theory, it may be more mathematical than some of you may want it to be.","Has potential to be a good course, but in need of some restructuring.","This was an excellent class. I would strongly recommend it for both linguistics concentrators and others who are simply interested in learning about the meaning of words and sentences. It did involve quite a bit of set theory, but both the professor and TF are excellent and teaching the basics, so no background knowledge in this field is necessary. The lectures were always engaging, the reading was interesting, and section was always extremely helpful for understanding complex ideas.","The philosophical concepts aren't particularly well-integrated with semantic notation and set theory (which the assignments deal with), so the class feels somewhat disorganized. Prof. Chierchia and Andreea are excellent, but things need tweaking for this to be a strong Ling course. Shop it to see if you like it. You'll get more out of the course if you enjoy thinking abstractly about language and if you have some knowledge of syntax or formal logic."]},"Spring '13":{"comments":["It's hard to say what this class is like with another professor, and ours was just here for this year. As it was, section was awesome, the problem sets were pretty good, and lectures were a struggle. I found the material interesting, though, and I ultimately felt the course was worthwhile.","My year the course was taught by a visiting professor who was not a great lecturer, making the course not worthwhile. It might be different when taught by Prof. Chierchia but I'm not sure."]},"Spring '14":{"comments":["This class really picks up in the last three weeks... Prepare yourselves for more rigorous homeworks then.","If you've already found that you like semantics, you'll love this class. Otherwise, you may get bored. You'll learn a lot and come to think about the meaning of language in a very different way, but the approach to different concepts doesn't really change from week to week and things get very repetitive. The class isn't very difficult and requires little in terms of work, but it's also not terribly exciting. Wouldn't recommend to those outside the concentration.","I actually quite enjoyed this class. Lectures were pretty good as Andreea stresses participation and weekly homework assignments were reasonable and fair, although sometimes involving topics that we may have very barely if never covered in class (which will drive you insane). In other words, the coursework was definitely manageable despite having a few assignments with questions that may take you more than two hours to finish. As for the topics covered, I thought it gave me a very extensive view of semantics and I truly feel that I learned a lot by the end of the semester. The final take-home exam really shows you how much you learned.","This is a relatively easy, fun class. Just make sure you pay attention in class and get your homework done.","A good introduction to semantics. Relatively painless. There are weekly homework assignments, no midterm and a take home final. Show up, pay attention in lecture, and you'll do fine","This class was really easy this year- the p-sets literally took 30 mins most weeks. A good senior spring class in that respect!","It was a very interesting course that made the mystery behind semantics make a lot more sense for me. Without enough attention to this, even harder problems in semantics can start to make sense. It also gives a gateway into more complex semantics pretty smoothly. I liked that we were able to talk about bigger issues like Negative Polarity Items and Quantifier Scope even with the very basic knowledge that we had.","A nicely taught, easy class. A requirement for linguistics. Fun\/hot professor.","The material in this class is very interesting, but the teaching was really subpar.  Class was usually sort of confusing and awkward, and the homework assignments often went beyond topics covered in the class, which was quite annoying.  The workload is pretty light, so if you're looking for a class where you don't have to put a lot of effort, this may be a good fit.  If you're looking to just try out a linguistics class, this could be a good option, but I feel like some of the other intro courses in the department may have been better.","The material is interesting and useful, but class is boring and the teaching is frustrating.","You learn really cool stuff (if you're into linguistics\/semantics). I'm a ling concentrator and this course was really useful! Some of the psets were a bit frustratingly difficult, though, but hey, you'll get that with any pset class."]},"Fall '14":{"comments":["Not a great first linguistics course to take. The material is super interesting, but it's pretty disorganized and the teaching is variable. If you're already interested in linguistics, though, it's cool.","If you really enjoy open-ended, theoretical lectures that do not lead anywhere but just pose existential questions and you enjoy working with syntactical structures and semantical denotations, then this will be a very interesting class for you. The lectures will be unrelated to the homework and you will not cover everything on the handouts in detail, so either you need to self-study a lot or just have an intuitive sense of what is going on beforehand. Great for linguistics concentrators, not so great for everyone else."]}},"mostRecentQ":{"overall":"3.80","workload":"2.80","difficulty":null,"recommendation":"4.00","enrollment":"7","response rate":"71.43","QCourseOverall":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"0","2s":"1","3s":"1","4s":"1","5s":"2"},"QDifficulty":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"3","2s":"7","3s":"5","4s":"2","5s":"0"},"QWorkload":{"number":"LING 106","course_id":"2785","cat_num":"6115","1s":"2","2s":"2","3s":"0","4s":"0","5s":"0"}},"success":true}