{"scores":{"Spring '13":{"course_score":{"overall":"4.12","workload":"3.50","difficulty":"4.11","recommendation":"3.89","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"1","3s":"2","4s":"6","5s":"3"},"QDifficulty":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"0","3s":"3","4s":"4","5s":"5"},"QWorkload":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"1","3s":"6","4s":"3","5s":"2"}},"instructor_scores":[{"number":"MCB 131","cat_num":"9868","course_id":"3543","year":"2012","term":"2","id":"6392d6c02a61e0c3c73bea7e394da14c","first":" Haim","last":"Sompolinsky","InstructorOverall":"4.22","EffectiveLecturesorPresentations":"4.33","AccessibleOutsideClass":"3.87","GeneratesEnthusiasm":"4.56","FacilitatesDiscussionEncouragesParticipation":"3.83","GivesUsefulFeedback":"3.71","ReturnsAssignmentsinTimelyFashion":"3.57"}]},"Spring '10":{"course_score":{"overall":"3.92","workload":"3.50","difficulty":"4.17","recommendation":"3.67","enrollment":"15","response rate":"80.00","QCourseOverall":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"1","3s":"2","4s":"6","5s":"3"},"QDifficulty":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"0","3s":"3","4s":"4","5s":"5"},"QWorkload":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"1","3s":"6","4s":"3","5s":"2"}},"instructor_scores":[{"number":"MCB 131","cat_num":"9868","course_id":"3543","year":"2009","term":"2","id":"6392d6c02a61e0c3c73bea7e394da14c","first":"Haim","last":"Sompolinsky","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.09","AccessibleOutsideClass":"4.44","GeneratesEnthusiasm":"4.36","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.75"}]},"Fall '06":{"course_score":{"overall":"3.73","workload":"3.67","difficulty":"3.93","recommendation":"3.56","enrollment":"23","response rate":"73.91","QCourseOverall":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"1","3s":"2","4s":"6","5s":"3"},"QDifficulty":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"0","3s":"3","4s":"4","5s":"5"},"QWorkload":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"1","3s":"6","4s":"3","5s":"2"}},"instructor_scores":[{"number":"MCB 131","cat_num":"9868","course_id":"3543","year":"2006","term":"1","id":"6392d6c02a61e0c3c73bea7e394da14c","first":"Haim","last":"Sompolinsky","InstructorOverall":"4.25","EffectiveLecturesorPresentations":"3.94","AccessibleOutsideClass":"4.71","GeneratesEnthusiasm":"4.56","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"3.75","ReturnsAssignmentsinTimelyFashion":"3.75"}]}},"comments":{"Spring '10":{"comments":["Take it if you have the background. This is not a course that will baby you if you happen not to know some background that you are supposed to know.","Well, Haim is leaving, so I'm not sure what to tell the potential student of the future professor for this course.  Just be careful and make sure you know what you're getting yourself into.  For me, Math 21a\/b and Stat 110 felt like  moderately to grossly insufficient preparation.  Get a sense of the expectations set by the new professor.","The instructors give coherent and extensive introduction to theoretical neurosciences.","It's an applied math course.  It's interesting, but it helps if you have a physics background, because it's REALLY not a very neuro-bio centered course.","It gives a fresh and rigorous perspective that is hard to find in any other neuroscience class, but the math is very difficult.","Be warned: Professor Sompolinsky has an abrasive lecturing style. This course is not appropriate for most MCB undergraduates. This course is better suited as an advanced undergrad or grad math or physics course. Students should be familiar with linear algebra, multivariable calculus, differential equations and MATLAB before entering this course. This class is heavily audited by grad students post docs and professors. The minority of individuals in attendance are undergraduates.","The course is really hard for biology-majored student. It is more suitable for people coming from physics and mathematics background to apply their skills in computational neuroscience."]},"Spring '13":{"comments":["This is a math course that, sporadically, looks at applications. If you want to know what modelling is, absolutely take it.","The course is a great introduction to computational neuro, and is one of the best mathematical biology courses available here on campus. Especially since this is offered only once every 3 years, you don't want to miss out on this! However, be sure that you have the background for the course; it's much more geared towards the mathematical sides of things than the bio. Having a great deal of experience with computation and general mathematical maturity will go a long way in this course.","The course is truly a great course, but an extremely difficult one. Lack of course materials and delays in grading and posting of solutions by course staff makes it difficult to catch up when one lags behind. That sad, Haim is an amazing professor who truly cares about students.","MCB 131 is usually taught every three years, so if you have the opportunity to take it, do consider it. Even if it means adding to your schedule or replacing it with another class, it is well worth your time, because the material covered is applicable to various fields, including neuroscience, biology, computer science, applied mathematics, statistics, economics, etc. This course is similar to CS 181 but with less coding, so if the material in that course is interesting to you, but you do not have the computer science background, you should take this course.","It's really interesting but really hard. It felt like Physics 16 without the collaborative atmosphere because there are few undergrads.","This material is mind-blowing:  it gives us an idea (at least a vague one) how the sensory system, memory, and decision making process work at the mathematical level. Take this course ONLY IF you have a very strong background in advanced math and physics. make sure you are comfortable with fourier transform, advanced linear algebra, differential equation, and taylor expansion. I do quite well in advanced math and physics classes here but this class is still quite challenging for me.  The fact that it is in the MCB department is misleading: this is not a bio course and a bio background does not help at all. That being said, this class is only offered every three years -- cherish the chance. Haim is the boss in the field -- it is an harvard only experience! Note that this covers similar material with CS 181\/ 281 but much more rigorous and math heavy.","Definitely take this course if you have sufficient math background and you are interested in existing models in neurobiology. Background in biology is not needed, as it is used only to illustrate the concepts. Haim is a very good lecturer, he presents the concepts from physical point of view and makes connection to physics. Homeworks are just right.","The problem sets may be onerous at times, but they truly reveal what parts of the lectures you understand and which parts you just think you understand. This class is definitely worth the time and effort which it demands.","Unique and very challenging course. Does not attempt to make itself accessible to neuroscientists, but is rewarding if you can put in the time to keep up, even if you can't follow every step of the derivations.","This course extremely hard for students without advanced math knowledge, but rewarding if you're prepared to spend a lot of time on it. It is exclusively theoretical, with little applicability non-theoretic neuroscience research."]}},"mostRecentQ":{"overall":"4.12","workload":"3.50","difficulty":"4.11","recommendation":"3.89","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"1","3s":"2","4s":"6","5s":"3"},"QDifficulty":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"0","3s":"3","4s":"4","5s":"5"},"QWorkload":{"number":"MCB 131","course_id":"3543","cat_num":"9868","1s":"0","2s":"1","3s":"6","4s":"3","5s":"2"}},"success":true}