{"scores":{"Fall '14":{"course_score":{"overall":"3.10","workload":"9.99","difficulty":null,"recommendation":"3.40","enrollment":"31","response rate":"67.74","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}},"instructor_scores":[{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2014","term":"1","id":"4559191edbcdc6c228d034b10baabcc7","first":" Jun","last":"Liu","InstructorOverall":"2.70","EffectiveLecturesorPresentations":"2.70","AccessibleOutsideClass":"3.30","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"3.40","GivesUsefulFeedback":"2.80","ReturnsAssignmentsinTimelyFashion":"3.40"}]},"Fall '13":{"course_score":{"overall":"3.50","workload":"4.00","difficulty":"4.20","recommendation":"3.50","enrollment":"27","response rate":"88.89","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}},"instructor_scores":[{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2013","term":"1","id":"4559191edbcdc6c228d034b10baabcc7","first":" Jun","last":"Liu","InstructorOverall":"3.40","EffectiveLecturesorPresentations":"3.20","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Fall '12":{"course_score":{"overall":"4.23","workload":"4.21","difficulty":"4.31","recommendation":"4.26","enrollment":"45","response rate":"86.67","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}}},"Fall '11":{"course_score":{"overall":"3.72","workload":"3.80","difficulty":"3.88","recommendation":"4.00","enrollment":"27","response rate":"92.59","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}},"instructor_scores":[{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2011","term":"1","id":"4559191edbcdc6c228d034b10baabcc7","first":"Jun","last":"Liu","InstructorOverall":"3.44","EffectiveLecturesorPresentations":"3.40","AccessibleOutsideClass":"3.57","GeneratesEnthusiasm":"3.96","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.25","ReturnsAssignmentsinTimelyFashion":"3.73"}]},"Fall '10":{"course_score":{"overall":"3.94","workload":"3.44","difficulty":"3.78","recommendation":"4.39","enrollment":"21","response rate":"85.71","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}},"instructor_scores":[{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2010","term":"1","id":"4559191edbcdc6c228d034b10baabcc7","first":"Jun","last":"Liu","InstructorOverall":"3.78","EffectiveLecturesorPresentations":"3.56","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"4.28","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Fall '09":{"course_score":{"overall":"3.50","workload":"3.25","difficulty":"3.94","recommendation":"3.62","enrollment":"21","response rate":"76.19","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}},"instructor_scores":[{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2009","term":"1","id":"4559191edbcdc6c228d034b10baabcc7","first":"Jun","last":"Liu","InstructorOverall":"3.31","EffectiveLecturesorPresentations":"3.29","AccessibleOutsideClass":"3.25","GeneratesEnthusiasm":"3.71","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"3.43","ReturnsAssignmentsinTimelyFashion":"3.60"},{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2009","term":"1","id":"eb4afb2e8ccd873f1187bb462dc2125e","first":"Donald B.","last":"Rubin","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.73","AccessibleOutsideClass":"3.22","GeneratesEnthusiasm":"4.13","FacilitatesDiscussionEncouragesParticipation":"3.67","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"3.40"}]},"Fall '08":{"course_score":{"overall":"3.33","workload":"3.90","difficulty":"4.20","recommendation":"3.35","enrollment":"27","response rate":"77.78","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}},"instructor_scores":[{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2008","term":"1","id":"8af03553fd64efb700b2ff1923e401ec","first":"Samuel","last":"Kou","InstructorOverall":"3.85","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"3.41","GivesUsefulFeedback":"3.71","ReturnsAssignmentsinTimelyFashion":"4.00"},{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2008","term":"1","id":"eb4afb2e8ccd873f1187bb462dc2125e","first":"Donald B.","last":"Rubin","InstructorOverall":"3.37","EffectiveLecturesorPresentations":"3.32","AccessibleOutsideClass":"3.46","GeneratesEnthusiasm":"4.16","FacilitatesDiscussionEncouragesParticipation":"3.82","GivesUsefulFeedback":"3.50","ReturnsAssignmentsinTimelyFashion":"3.86"}]},"Fall '07":{"course_score":{"overall":"2.67","workload":"4.22","difficulty":"4.22","recommendation":"2.67","enrollment":"21","response rate":"47.62","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}},"instructor_scores":[{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2007","term":"1","id":"4559191edbcdc6c228d034b10baabcc7","first":"Jun","last":"Liu","InstructorOverall":"2.50","EffectiveLecturesorPresentations":"2.50","AccessibleOutsideClass":"2.40","GeneratesEnthusiasm":"3.00","FacilitatesDiscussionEncouragesParticipation":"3.67","GivesUsefulFeedback":"2.75","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '06":{"course_score":{"overall":"3.53","workload":"3.59","difficulty":"3.88","recommendation":"3.82","enrollment":"35","response rate":"48.57","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}},"instructor_scores":[{"number":"STAT 220","cat_num":"6270","course_id":"4847","year":"2006","term":"1","id":"4559191edbcdc6c228d034b10baabcc7","first":"Jun","last":"Liu","InstructorOverall":"3.65","EffectiveLecturesorPresentations":"3.71","AccessibleOutsideClass":"3.15","GeneratesEnthusiasm":"3.71","FacilitatesDiscussionEncouragesParticipation":"3.47","GivesUsefulFeedback":"2.50","ReturnsAssignmentsinTimelyFashion":"3.58"}]}},"comments":{"Fall '07":{"comments":["Stay away from this class","learn interesting and very practical material but problem sets are terrible and lecture often doesn't match up with textbook or problem sets, so ability to learn on your own and some patience are necessary","Although I love these topics, I would not advise anyone to take this course with this professor.  Anyone who needs these tools should learn them on their own, or through a different course.","any scientist wishing to analyse data on his own should know about the Bayesian school of thought - it actually goes into the core of the problem at hand and tries to model the actual problem, instead of borrowing recipies from the frequentist school.","The material is interesting and you will learn a lot, but you will have to learn independently.  The professor doesn't care about teaching or the students in the class.  He is disorganized and at time unprepared.  Lectures are often very unclear.","avoid like the plague.  The instructor was disorganized, demeaning, and altogether disappointing as a professor at Harvard.  Having come from another country to attend the graduate school of this prestigious institution, I expected world class instruction.  I ended up teaching myself out of the book and other books.  A waste of time."]},"Fall '08":{"comments":["Tough course - but very practical for any statistics major","The lectures are a bit of a waste of time, particularly when Don Rubin is leading. Chris Paciorek's course, in the Department of Biostatistics, would be better for students looking for more guidance, and less of a \"sink or swim\" teaching style.","I would not recommend this unless it was for a student in the stats department or a student outside the stats department who needs bayesian methods specifically. If it was a student outside the stats department, I would probably encourage them to take the bayesian class in the gov department, which is a bit gentler in its introduction. This class is like being thrown in the deep end and takes too much time away from your research.","It is a great opportunity to learn about Bayesian Statistics and, in this particular case, from a great combination of professors. The themes of the lectures of Professor Rubin seem to be somewhat random, but always of Statistical relevance. Professor Kou's teaching technique is very clear and more helpful in terms of understanding the course material.","A very interesting course and should be taken by any statistician to get a great insight into Bayesian statistics. In saying that this course can be a pain. The lectures are great but often unrelated to the homeworks. The homeworks are long and the sections don't really help you very much. Its a real pain and you will hate yourself the whole time for choosing this course but when its all over you will be glad you did it.","Learned almost nothing but worked really hard."]},"Fall '09":{"comments":["Check in early and often about your final project, and take advantage of time you can get with your professors outside of class; their experience is amazingly valuable.","Explore other Bayesian classes too","I was a bit concerned given the last few years reviews that both instructors would be poor lectures, but was pleasently surprised to find out that they were not.","Interesting material, but you need to stay motivated to really get a deep understanding","Always ask which chapter of the textbook corresponds to the current lecture material, and read that part. Lectures alone will be very hard to understand.","You will end up doing most of the learning on your own outside of class\/"]},"Fall '10":{"comments":["This class gives an overview of Bayesian statistics and introduction to current research areas where Bayesian statistics play an important role. Incredibly useful for research in the Harvard Stats department, in particular.","If you take this course and do all the work, you will learn a lot. Lectures were not very helpful to me and most of the learning I got from the book. If you have the self-discipline to work through the textbook for this course, you probably don't need to actually enroll.","Be well-prepared","A Stat 211 level of knowledge goes a long way in making lectures clearer.","With Jun Liu as professor, you get a very good introduction to Monte Carlo methods and Bayesian techniques","Absolutely fascinating perspective from which to view statistics - should be required."]},"Fall '11":{"comments":["As a Stat concentrator \/ senior undergrad, I learned a ton from this course, and will forever consider it an integral part of my statistical education.  However, I would recommend that undergraduates take it Pass\/Fail if possible, because it is poorly taught (pray that Alex D'amour TFs again, he is the only redeeming part of how the course is taught), unpredictable (midterm given this year out of the blue for no apparent reason), fatal problems when the subject matter is as advanced as in this course.  \r\n\r\ntl;dr poor teaching overshadows great material","This is a class with difficult material and confusing lectures, so I learned much of the material either through section or independently by reading the textbook and wikipedia.  It is also very time-consuming, with long problem sets that involve tedious algebra and\/or lots of coding.  The material is interesting and very useful, but be sure you know what you are getting into.","Stat 220 covers some very cool material. Anyone interested in Bayesian statistics realizes that this course covers a lot of this material. However, the lectures were very disorganized which made things difficult. The description of the course said that simulation would be emphasized. However, much of lectures and too much of the homework was working things out analytically. I wish it had been even more emphasis on simulation.\r\n\r\nThe class was ultimately saved by the book, which is a very well written statistics book, and the TF who was very helpful in teaching the material and helping with the homework.\r\n\r\nI was also very upset that a midterm was added. It was not on the original syllabus and was not officially added  until after shopping period ended.","You learn how to use Bayesian statistics and the use actually then generates a lot of theoretical intuition.  There is a lot of independent learning going on so definitely read BDA and perhaps even some of the supplementary articles that Prof Liu suggests.","great class! be prepared for lots of work. i warned you!","Very useful course for anyone who wants to perform statistical inference and modeling beyond just taking an existing algorithm.","Watch out who is teaching it. \r\nCertainly shop it and see for yourself.","Useful class.","Fortunately, the Harvard statistics department is one of the best places in the world to learn about Bayesian Data Analysis---which is a tremendously interesting subject. Unfortunately, Jun is not the best instructor. If he is taking the class, make sure to read and re-read the book, look at outside notes, and work through problems on your own. The course itself is a useful excuse to learn the material.","Interesting, but a lot of work."]},"Fall '12":{"comments":["You will add a new set of Bayesian tools to your statistical analysis toolbox.  And Professor Gelman will entertain you every lecture.","20+hrs on psets every week","Please be prepared to take this course. If you are not familiar with R, please spend at least 2 weeks in the summer on sophisticated R programming. And you should take some graduate level probability or inference course before taking it.","This course is insanely difficult, but if you have the time to devote to working through each pset it will be wort the effort.","Regardless of the instructor (who was good), the material studied in this course is very important for anyone whose work involves statistics, even remotely.","You'll learn Bayesian methods that are totally mind-opening and not taught elsewhere.  You'll be able to code in R like a pro by the end of the course.  It takes a ton of effort, but the bang is definitely worth the buck--just be sure to clear your schedule.","This course (taught by Andrew Gelman) was one of my most amazing Harvard experiences. Our class got the chance to read from the bible of Bayesian data analysis and learn from the author himself. The textbook is incredibly good, and Gelman is a wonderfully entertaining lecturer.","Be prepared to work hard! And you'll learn a lot.","Each 90-minute lecture was approx. 35 minutes of learning and 55 minutes of rambling and discussing.  You have to learn everything on your own or with the help of the TFs.  Lecture often degenerated into useless discussions about tangential topics between the professor and a handful of overeager students sitting in the front row.  The course material is useful to statisticians but if the course is run like it was this semester, it isn't worth it at all.","This class--at least when taught by Gelman--is fantastic.  Easily the best class I've had at Harvard so far.  You'll learn a hell of a lot about Bayesian inference and you'll get real practical skills in building models and--most importantly!--checking them.","I hope Andrew Gelman is teaching it!","You should beg someone in power to beg Andrew Gelman to come back and teach this class again.","It is a really difficult course.","My understanding is that this class is very different when Gelman is not teaching it. But I highly recommend taking anything he is teaching if he's ever back at Harvard. It was very useful getting to hear him talk about statistics and seeing how he thinks about things. It was one of my favorite classes I've taken.","Stat220 is a really great class if you want to work with data, particularly from a Bayesian perspective.  The course is a fairly significant time commitment, but you learn a ton from doing the psets.  The TFs this semester (the Alexs) were incredibly helpful and knowledgeable about the subject, and Professor Gelman is really perhaps the best resource available for all things Bayesian.  Don't expect to learn the material just by going to lecture though.  Lectures mainly consist of stories that can enhance your understanding if you've already read through the chapters but can sometimes detract from it if you haven't.  Overall it's a wonderful class that I would certainly recommend to any students with a substantial stats background looking for a good data analysis course!","The course is extremely informative, but be aware that the weekly homework assignments are exceptionally time consuming.","This class is very difficult. Gelman taught the entire book. Don't expect any solutions."]},"Fall '13":{"comments":["You need to be prepared to do a huge amount of work.","A challenging class with difficult but interesting material.","no","Be prepared to work really hard! I really enjoyed this class--every problem set was a challenge, but I learnt a lot.","The course is poorly organized which makes already challenging material more challenging. The instructor is passionate, but  his lectures tend to be highly theoretical and so do not help with completing homework or exams. Also, be aware that the course starts out quite easy and becomes progressively more and more difficult and time consuming as the semester goes on.","difficult, painful but useful","prepare to spend a lot of time to study on your own","Make sure you have plenty of time to do the homework assignments. Carefully read the responses given when the prof last taught this course, as not much has changed.","Take a different Bayesian analysis class if at all possible, such as in the Public Health school.  The lectures are nigh impossible to learn from and do not build any sort of overarching understanding of Bayesian statistics.  You would do better to work through the book on your own.","This course is a lot of work!  You will have to learn most of the material from the book."]},"Fall '14":{"comments":["Giri (the TF) makes this class great. Take it to understand Bayesian methods.","If you know Bayesian statistics already and want to dig deeply into the underlying rational, this course is the one to go. Otherwise, pause a little bit, finish the book before taking this course.","It's a good course if you're good at teaching yourself from a book. If you come to lecture knowing what's going on, Jun can give some cool insights and often discusses philosophical implications or subtle points related to the topics. Having said that, course organization is a little shaky, and you won't learn much if you just show up to lecture without spending some time with the book or other outside sources.","definitely necessary for advanced statics. but be aware of the course load","Make sure you know a lot of statistics before taking this course as it is not an taught at an introductory level.","Be prepared for a lot of stuffs.","This course covers a wide range of material that any serious statistics student should know; it is a good in-depth overview of this material. However, students will find that they will largely have to teach themselves the material; often, they'll have to depend on resources outside of the lectures and textbook, because the textbook can be very difficult to read.","This class is A LOT of work, including a lot of self-learning. Definitely recommend taking the undergraduate version (120) beforehand if you have no knowledge of Bayesian statistics.","Look: the course topics are fascinating. You need it to be a data scientist, and Bayesian analysis is now the standard rather than the fringe.\n\nBut be warned: this class is AWFUL. When one student asked for a schedule of future topics, the lecturer explicitly said the he would be changing things around until the last minute, so could not provide any outline of topics to be covered. That's how disorganized the class was. Lectures were incoherent (the first half the time was spent discussing utterly unrelated topics while he tried to figure out what he was supposed to lecture about) and unrelated to the problem sets. It was difficult, not because the material is inherently difficult, but because we would be asked to solve problems and discuss topics that we would learn 6 weeks later. Later problem sets were in turn trivial because they used topics we had learned 8 weeks ago.\n\nOh, and the general G1 consensus is that the textbook, BDA, sucks. It's poorly written, fraught with typos, and about as disorganized as the course. If you actually want to learn some Bayesian analysis, pick up Hogg.\n\nThe only (minor) saving grace of the course with Giri, who made grading much less stressful than it could have been and whose sections\/notes were quite good (though often completely illegible).","Bad lecture. Jun's lecture notes are just terrible. Wait until Gelman teaches it."]}},"mostRecentQ":{"overall":"3.10","workload":"9.99","difficulty":null,"recommendation":"3.40","enrollment":"31","response rate":"67.74","QCourseOverall":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"1","2s":"3","3s":"9","4s":"7","5s":"0"},"QDifficulty":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"0","3s":"5","4s":"9","5s":"10"},"QWorkload":{"number":"STAT 220","course_id":"4847","cat_num":"6270","1s":"0","2s":"3","3s":"5","4s":"0","5s":"8"}},"success":true}