{"scores":{"Fall '14":{"course_score":{"overall":"3.40","workload":"2.40","difficulty":null,"recommendation":"3.90","enrollment":"75","response rate":"86.67","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1900","cat_num":"4016","course_id":"4293","year":"2014","term":"1","id":"c9dd0c4d5eb1ad776e18b793690ef577","first":" Patrick","last":"Mair","InstructorOverall":"3.70","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Spring '14":{"course_score":{"overall":"3.40","workload":"1.70","difficulty":"3.00","recommendation":"3.30","enrollment":"51","response rate":"66.67","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1900","cat_num":"4016","course_id":"4293","year":"2013","term":"2","id":"01256661bd44f6545a699425f29f381f","first":" Max","last":"Krasnow","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.30"}]},"Fall '13":{"course_score":{"overall":"3.30","workload":"1.50","difficulty":"2.80","recommendation":"3.40","enrollment":"54","response rate":"94.44","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1900","cat_num":"4016","course_id":"4293","year":"2013","term":"1","id":"c9dd0c4d5eb1ad776e18b793690ef577","first":" Patrick","last":"Mair","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.60","AccessibleOutsideClass":"3.60","GeneratesEnthusiasm":"3.60","FacilitatesDiscussionEncouragesParticipation":"3.40","GivesUsefulFeedback":"3.40","ReturnsAssignmentsinTimelyFashion":"3.80"}]},"Spring '13":{"course_score":{"overall":"4.12","workload":"1.52","difficulty":"2.16","recommendation":"4.30","enrollment":"52","response rate":"96.15","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1900","cat_num":"4016","course_id":"4293","year":"2012","term":"2","id":"4329f67a5da894e75a7d364c2dec5d1f","first":" Nicholas Peter","last":"Aramovich","InstructorOverall":"4.38","EffectiveLecturesorPresentations":"4.48","AccessibleOutsideClass":"4.41","GeneratesEnthusiasm":"4.36","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.05","ReturnsAssignmentsinTimelyFashion":"4.30"}]},"Spring '12":{"course_score":{"overall":"4.40","workload":"1.57","difficulty":"2.20","recommendation":"4.46","enrollment":"107","response rate":"91.59","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1900","cat_num":"4016","course_id":"4293","year":"2011","term":"2","id":"47715861cd999e1ec1e0af43c83c9894","first":"Matthew K.","last":"Nock","InstructorOverall":"4.62","EffectiveLecturesorPresentations":"4.71","AccessibleOutsideClass":"4.39","GeneratesEnthusiasm":"4.67","FacilitatesDiscussionEncouragesParticipation":"4.53","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.58"}]},"Spring '11":{"course_score":{"overall":"4.50","workload":"1.46","difficulty":"2.24","recommendation":"4.58","enrollment":"61","response rate":"85.25","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1900","cat_num":"4016","course_id":"4293","year":"2010","term":"2","id":"47715861cd999e1ec1e0af43c83c9894","first":"Matthew K.","last":"Nock","InstructorOverall":"4.86","EffectiveLecturesorPresentations":"4.92","AccessibleOutsideClass":"4.48","GeneratesEnthusiasm":"4.71","FacilitatesDiscussionEncouragesParticipation":"4.46","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Spring '09":{"course_score":{"overall":"2.25","workload":"2.02","difficulty":"3.43","recommendation":"2.50","enrollment":"59","response rate":"83.05","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1900","cat_num":"4016","course_id":"4293","year":"2008","term":"2","id":"ac2f707e355b94ad61f59d49e175b913","first":"Yaoda","last":"Xu","InstructorOverall":"2.50","EffectiveLecturesorPresentations":"2.35","AccessibleOutsideClass":"3.55","GeneratesEnthusiasm":"2.33","FacilitatesDiscussionEncouragesParticipation":"2.50","GivesUsefulFeedback":"2.40","ReturnsAssignmentsinTimelyFashion":"2.81"}]},"Fall '07":{"course_score":{"overall":"3.05","workload":"1.49","difficulty":"2.40","recommendation":"3.65","enrollment":"91","response rate":"61.54","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1900","cat_num":"4016","course_id":"4293","year":"2007","term":"1","id":"525c70f58333c8ad02d7192fca3a0683","first":"David","last":"DeSteno","InstructorOverall":"2.98","EffectiveLecturesorPresentations":"2.91","AccessibleOutsideClass":"3.47","GeneratesEnthusiasm":"2.87","FacilitatesDiscussionEncouragesParticipation":"3.27","GivesUsefulFeedback":"3.18","ReturnsAssignmentsinTimelyFashion":"4.27"}]},"Fall '06":{"course_score":{"overall":"3.08","workload":"1.50","difficulty":"2.23","recommendation":"3.35","enrollment":"99","response rate":"55.56","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1900","cat_num":"4016","course_id":"4293","year":"2006","term":"1","id":"525c70f58333c8ad02d7192fca3a0683","first":"David","last":"DeSteno","InstructorOverall":"3.33","EffectiveLecturesorPresentations":"3.12","AccessibleOutsideClass":"3.07","GeneratesEnthusiasm":"3.14","FacilitatesDiscussionEncouragesParticipation":"3.69","GivesUsefulFeedback":"3.38","ReturnsAssignmentsinTimelyFashion":"3.89"}]}},"comments":{"Fall '07":{"comments":["Great way to learn stats and cover your requirement for psychology.","This course is required for the concentration\/secondary field.  Otherwise, i would not recommend it.","Very easy class that does not entail very much work.","I would recommend this for anyone who wants to learn statistics, whether for a requirement or for their own enrichment or other career-related purposes. I thought it was a very nice intro class.","Good class to have under your belt!","The material is excellent and really gives you an understanding of psychology statistics. But the class is monotonous and is, therefore, very hard to pay attention to.","Not a very difficult way to get a stat requirement out of the way","It's a good way to learn statistics, especially for psychology concentrators.","If you want an easy stat class, this is fine. Other than that, it's kind of a snooze.","It is a good and practical introduction to statistics.  It is not too challenging, so if you are a math person, don't take it.  If you aren't a math person, don't worry, it isn't stressful and you can do just fine on all the exams.","Statistics is necessary to many fields.","It's a bit complicated but necessary if you want to major in psych","Learning statistics is not fun; this class at least makes it painless.","The class was manageable and fair.  The professor and TFs seemed to want students to do well.","Psychology concentrators need to take this class and it helps a lot with critical reading and comprehending more about psych journals.","You have to be diligent about going the extra mile if you want any of tis to stick. If yo study hard you'll be fine. It's pretty straight forward and if you need help - ask for it - and you won't do badly.","If you end up having to take it, it's not that bad.","Little to no background is necessary.","take only if you're a psych major and want a really easy boring semester","no point in going to lecture or section- just read the lecture notes, textbook, and section materials online","I would take this course for credit, but don't take it as an elective unless you really enjoy statistical studies","Do yor homework and you will be fine.","It's necessary for psych majors and really painless, even fun sometimes.","I found Psych 1900 easy but informative.  It helped me better understand the validity of experimental results when asked to read psychology papers for other classes.  I now know the difference between One-way ANOVA and Chi tests and how to differentiate the significance of findings.","it's required. it's easy.  just take it.","Read the text book and do the problem sets and you'll be set.","you have to take it anyway and this one is SO EASY","It's a requirement, and it's kind of boring. But it's useful to understand statistics in order to have a grasp on how psychology experiments are measured.","Perhaps if there was a different professor?","It is a simple way to get through requirements.","critical to psychology research papers in the future","Lecture and section attendance totally unnecessary.","section is more useful than lecture"]},"Spring '09":{"comments":["Go to the office hours!! They're very helpful.","if the same teaching staff are instructing the course, beware that things move very quickly and they often assume you know things (when you shouldn't or can't possible!) and therefore it gets frustrating and confusing especially as the material gets more complicated","I put in a lot of effort to this course and saw very little return.  I would not recommend it.","lectures are useless, just read the textbook.  it's much more clear","The exams are ridiculous, stupid, and far harder than they should be relative to the class material.  And they don't test anything practical relating to statistics.","If you need to fulfill the requirement, you don't really have a choice.","Take stat 101 to fulfill the psych requirement.  This is the worst class I have taken not only at Harvard, but in my life.  It is not only boring and not interesting, but lectures are not helpful.  Be prepared to teach yourself statistics using a textbook and if you are the type of person who needs to have math explained to understand it don't take this class.  The professor just reads the slides and is difficult to understand.  There are no practice tests available so it is difficult to prepare for tests.  Stay away.","They should take psych stats IN the stats dept rather than the psych dept. it's a class that no psych prof wants to teach, so it's better to take it in the dept with a prof who specializes in it.","It's an interesting class, but I would only recommend it to those who need to take it for a requirement.","This class is very difficult, and you need to stay on top of your work. Lecture material is repetitive and most of it you can read in the textbook. Coursework is reasonable. The professor and TF are always available for extra help!","I would only take this class if you need to for Psych concentration or if you don't want to take any of the other stat courses.","The lectures and content are not particularly interesting but the class overall is doable.","i liked how it was targeted towards psychology and everything will be applicable","DO NOT TAKE THIS CLASS\r\nTake anything else if you can","You either like it, tolerate it, or hate it.","While this class fulfills a requirement for psychology, I can't be sure it's the best way to do it.","Focus more heavily on the problem sets, as they are the most applicable to psychology work and will teach you the most overall."]},"Spring '11":{"comments":["Definitely take this course instead of Stats 101 if Professor Nock is teaching it.  He walks through all of the concept very carefully so that you understand how to do them.  Since he cuts out all of the \"fat\" that is not relevant to psych, the time commitment is quite low, and you're never doing busywork.  You also learn SPSS in this course, which is more widely used in psych research than other programs.","If you have to take stats for psychology, definitely take this course! It makes statistics interesting, practical and applicable to the real world, or at least in psychology. It was much more understandable than how my stats teacher in high school taught stats and this was by far more interesting. Professor Nock is awesome, as is Kathy. Hope you get Kathy as your TF. she's really sweet, fun and a great TF. Professor Nock tries to make jokes in class to make class more interesting. It's nice. He makes statistics as interesting as you can for stats which is saying a lot!","keep up with the work on your own. theres no problem sets or required work so make sure you dont fall behind. but its a great intro class, great professor, and all around not bad for a required class.","It is a great introductory class focused on psychological studies.","Even though this class seems like it will be boring, it is not at all! Professor Nock and the TFs are funny and  present the material in terms that students will understand and want to learn!","The best statistics class you'll ever take at Harvard. No problem sets, no final exams, yet you come away still learning a lot. Where do they do that at Harvard? Exactly...it's a rare combination.","great way to fulfill the requirement - so much better than Stat 104!  The professor is amazing and really corny funny and the TFs are really great.  A painfree way to learn statistics!","Great class- the professor, the TFs, and the textbook make the material very understandable. Any intimidation one might feel about Statistics is easily and quickly mitigated in this class. With Professor Nock, this must be one of the top intro Stats classes, if not the best. While pretty much necessary for Psych concentrators, this would also be a fantastic way to fulfill the math Gen Ed requirement for anyone else. Highly recommended","This is the BEST class I have taken in Harvard. No friggin joke.","Prof Nock is AMAZING!!!!!!!!! He makes stats interesting and I actually enjoyed going to his lectures.  He is clear and succinct in his explanations and his slides are extremely organized and helpful. He does his best to insert comical comments to keep the energy in the room as high as possible. Don't freak out about this class.  Just keep up and review the material at regular intervals and you'll be fine.  The teaching staff is on your side and they're not out to trick anybody.","Professor Knock was awesome! If you have to take stat, you definitely want to take it with him!","Professor Nock is the bomb","You have to keep yourself motivated in some way. \r\nThe subject material doesn't engage everyone.","It is very little work, and teaches you something, which is nice.","SO MUCH BETTER THAN APREVIOUS YEARS (at least from what I could tell by reading previous Q-scores). Professor Nock is able to teach the concepts SO well and SO clearly that you actually end up enjoying statistics! The tests are not very hard as long as you have a good grasp of the concepts by paying attention in lecture, which isn't hard to do anyways. Definitely recommend--I never thought I would enjoy a math-related course at Harvard!","Take this class if Professor Nock is teaching it.","Prof Nock is an amazing lecturer. I was scared about taking stat but he made it really easy to follow and I loved it from the first lecture on! The exams were completely fair.","Possibly the most enjoyable class you could take for the stats requirement","It's a funny, thorough math course that focuses mainly on concepts rather than repetitive application.","If you are looking at this course, you probably have to take it for psych concentration\/secondary but don't worry, professor nock made the process really painless.","make sure Nock is teaching","Professor Nock makes this class amazing!  You can tell from the material that this could be a really, really boring class which I was worried about.  But lectures were always entertaining and to the point, and I feel like I learned a lot.","If you need to take a stats course...TAKE THIS ONE!!!!! The work load is awesome, Nock is fantastic, and the information you learn is super applicable and interesting.","Professor Knock is a very clear lecturer, and makes everything very clear. His exams are very fair and straightforward, so if you go to lectures and do a little review you will do well.","This course is the perfect class to take if you are looking for a basic, easy introduction to statistics. Professor Knock is a great, humorous, and engaging lecturer. The teaching staff is very welcoming and available to help students. Workload is not heavy at all and easy! Definitely recommend it.","Professor Nock rules-great lectures, he doesn't try to trick you on exams, and the material is very straight forward-if you're going to take Psych 1900, take it with him.","Really great, funny, interesting professor! He's really clear about the material. Reading the book helps a lot so I recommend you keep up with that. No psets! But there are recommended problems that you should do anyway.","Take this class! Prof. Nock was really engaging and funny, and Prof. Nock really made sure we understood the material.","This class is a lot less painful than psych concentrators think.","Good material taught by great people","Statistics for students who don't like math very much...and as a result, one of the most fun math classes that I've been in. But I think you need to push yourself to learn more about statistics if you're serious about it.","Professor Nock is AMAZING. Class was easy.","This is an incredible course. If you need to take stats for psych, take this one! You wont regret it. There is very little work, which allows you to focus on what you need to work with rather than redundant problems. Also, Alex is an AMAZING TF. If you can be in his section, do it!","I thought this was a great class and Professor Nock is awesome!","great class! nock (and kathy) were awesome and made a class i had been terrified to take interesting and very managable.","Professor Nock is so awesome and funny--he loves creating stats problems with examples from the media and things that are entertaining for students. I loved Nock, he was so much fun. He managed to make statistics interesting and not at all the painful ordeal I expected. I came into this class expecting to hate it, but it was actually one of my favorite psych courses. I learned so much and am now able to peruse the once incomprehensible results section of psych papers. :)","This course is a great introduction to statistics and the material you cover is especially helpful for stats concentrators.","Professor Nock is insightful, encouraging, funny, and very approachable.  I appreciated the time he took to clarify concepts for students just starting out in statistics (like myself), and his teaching staff did a great job teaching us how to apply these concepts using SPSS (I loved Kathy!).  This course becomes extremely useful for those going into either psychology or other sciences, where you will see a ton of experimental data and will be able to understand results VERY well.  This class was a wonderful pleasure to take, with little stress and much insight about the quantitative side of the world!","This class is great! It is highly based on self-motivation, but Professor Nock is awesome and you definitely get a good overview of statistics by the end.","This is an INCREDIBLE class! Professor Nock is an awesome professor who makes lectures very dynamic and generates interest in the subject material. As someone who generally stays away from math courses, this class made me rethink this. I truly enjoyed learning statistics and plan on taking more classes in the future!"]},"Spring '12":{"comments":["This is a super straightforward class. Not hard at all, just study the material and you should be totally fine. There are no surprises on exams and the workload is very light.","Great class","prof. nock is an outstanding teacher for this course.  he really made it come alive with humor, clarity, and clear transmission of ideas.","If Professor Nock is teaching this class you need to take it!! I would highly recommend it to anyone who is not a fan of math or p-sets and who likes to learn cool new programs on the computer or just wants to be able to understand statistical reports better.","It was super easy, and if you are looking for a class to take that doesn't take any sort of effort at all, then take this course.  However, if you want to learn something and challenge yourself, take something else.","This class made statistics generally painless for someone who despises any sort of math. Professor Nock makes the lectures really fun and relevant, and makes the best, corniest jokes. Kathy is the chillest, nicest, and best TF. Also, make sure you don't fall behind in the class! Everything comes together with each chapter.","Do not take this course if you are really a beginner. Look in to real stats courses (where I'm assuming they stay on topic and know what they're doing.) DO NOT BE FOOLED BY HIGH Q SCORES. Nock is funny and charming, yes, but he is a terrible math teacher.","This is an amazing class that everyone should definitely take if you want a comprehensive understanding of stats in relation to psychology. Plus, where can you find a better stats professor? Nowhere.","This class is a very well taught and extremely fair class, that being said, don't let the fair pace and easier tests make you over-confident about your grade.","This was a GREAT course. I was concerned about taking statistics before, but Matt Nock and his teaching staff made it manageable, clear, and even enjoyable! Also, Kathy was an incredible TF!","If you need statistics credit, or even if you just want to take a math elective, take this class. Professor Nock is an amazing professor who explains the material in a manner that allows even math-shy students like myself to understand. Furthermore, TF Kathy Gerlach is attentive and thorough in helping students with anything they need help with in the class. Math made me extremely nervous before this class, but this course was structured in such a way that I didn't get too overwhelmed by the material.","I'd recommend it if you need to take a Stats course as this is a pretty painless way to fulfill that requirement (compared to what I've heard about Stat 101, or 104, etc.).  If you don't need to take it, don't take it as I see it being pretty useless.","Nock is AMAZING. His lectures are SO clear, and he is SO willing to help. This class is so, so easy, and it's all because of him. I do admit, though, that the material was sometimes so easy (and the exams so easy as well) that I often decided just to read the slides\/do practice problems on my own, skipping class altogether. If Nock is teaching this class, take it if you have a Stats requirement! And really, it's a wonderful way to fulfill the E&M gen ed. From what I gather, this course is easier (and better taught) than Stat 104, 101, etc.","If you are looking to take an introductory statistics course, take this one! It is well-taught and very reasonable.","This is a great class. Even if it wasn't a required class for many people, I would recommend it with enthusiasm. The teaching staff is great.","Professor Nock is really funny. This is probably the most laid back Stats course at Harvard. A great intro. for the humanities types.","This is a great stats class to take, especially for people interested in psychology.  Professor Nock is a very easy going professor, he and the teaching fellows are very accessible outside of class, and they really want to make sure that you understand the information.","It is one of the most useful courses you can take if you are interested in going into any type of science.","Do the homework and keep up with the material! At first it's very easy to get the material without doing work and then it catches up with you. Otherwise painless class.","This is not a hard class to get a good grade in, but it's also not a hard class to get a bad grade in.  Basically, as long as you come to lecture and read the book\/workbook when something is a little confusing you can get a good grade.  However, if you totally blow it off, your grade will reflect that.","This is a really great class! Professor Nock is super funny and the class is enjoyable. It's also not a lot of work, and pretty easy. Psych concentrators - Statistics are not scary!","That it is a great class and teaches interesting material.","best stat class ever! if you understand the material, you'll get an A. very little work outside of class","Professor Nock is great! Lectures are clear and prepare you well for exams.","Great way to learn basic statistics. Connection to use in science\/psych based studies is great and relevant for science concentrators.  Professor Nock is clear, enthusiastic and entertaining in explaining concepts.","I really like easy classes, but this class was stupidly easy.","Great if you're damn sure you're going to be a psychologist. Anything else, perhaps investigate a more broad Stats class.","Just make sure to keep up with what we are learning and you will be totally fine. Also, don't stress about the final essay. Just do the exact requirements for it and you will be totally fine.","Nock is amazing and really helps you to understand the reasoning behind statistical measures.  Logical and straightforward course material.","I LOVED this class. I learned so much about statistics having had absolutely no stat background. Lectures and section were very laid back. The exams were all fair.","Statistics is not an inherently interesting topic, but Matthew Nock does an excellent job teaching it in an engaging way. This course converged well with a lot of things I learned in other psychology course as well and allowed me to understand psychological research papers much more readily.","Professor Nock is a great lecturer and the statistical concepts are explained very clearly. Learning SPSS in section is useful and fun. Depending on your level of comfort with statistics, you might find the pace of the course to be somewhat slow.","Professor Nock is an amazing lecturer (and incredibly funny!) and even though the course got harder by the last month, I enjoyed the class a lot.  Highly recommended for anyone who needs to take a statistics course or wants to understand how the statistics in psychological research is collected and analyzed.","This is a moderately easy class and is very introductory. It is also very interesting and provides good basic information to build on in the future with more difficult and intricate statistic courses.","If you're looking for an easy math, a stat course, or a psych concentration, this course is for you. It gave me a basic overview of statistics and good grasp on SPSS without being too much busy work. Professor Nock is amazing - take the class with him. He's sharp, hilarious, and enthusiastic about the material.","This was a great class. Professor Nock is a fabulous teacher. He keeps it interesting and straight to the point. Anyone interested in research can benefit from the understanding of statistics this class provides.","Psych 1900 is the undiscovered intro stat course gem (And you don't need to be a psych person to like it or have it be useful!) This course is easy, interesting, and doable because it is taught well. He is not a teacher who gives needless assignments to fill the time, or keeps talking to fill the hour. instead, Prof. Nock is entertaining and teaches in the best way to help you learn the material. It didn't have p-sets which was great, so you just did as many review problems as you needed to before exams and quizzes. Learning SPSS was helpful. Definitely take this class over the other Intro Stats!","You can learn very similar material to Stats 104, but much more easier and with a science emphasis. Recommend this course to other stats intro classes.","This is a great introductory statistics course. I took AP Stat in high school (which was much harder than this class) and was able to get A's on all the tests without much additional studying. Professor Nock is really funny and really nice. This is a painless way to satisfy any stat requirement.","if you want to take an easy stat course, TAKE THIS ONE! you don't even need tog o to class! all the quizzes\/exams are from the slides, and the slides are perfect for explaining anything you don't know. The class was super easy, and the exams were very straightforward; there were no tricks; they really want you to do well in this class. Easy A class","TAKE THIS CLASS. One of the best (if not THE best) classes I have taken at Harvard. Professor Nock is engaging and funny, a wonderful lecturer and truly cares that you are learning the material. His exams are straightforward--if you studied and did the problems, there is no reason not to receive an A\/A- on them. Learning SPSS in lab was also helpful. This was the best class of my semester, and I know that the material learned will be applicable outside the classroom as well. Even if you are not a Psychology concentrator, I highly recommend this course as an alternative to the more well-known Stats 100 sequence courses.","If you want\/need to learn statistics, this is a good course for it.","My freshman year, I had a negative experience with statistics. Coming into this class, I was sure that this class was going to be a nightmare; however, Professor Nock structured the class in such a way that makes statistics VERY understandable and intuitive. In addition, he makes lectures that are pretty engaging. Bottom line: it's a great course!","I am not a mathy person and never have been, but I really enjoyed this class. Nock and the TFs do an amazing job of explaining and demonstrating concepts.","Take this class! It is a great addition to a 5-class semester.","Painless and fun way to learn statistics. Def. better than stat 104","Great class. Go to lecture or you will miss out!","This class is a great way to get an introduction to statistics in a straightforward way. I loved it.","Best... class... ever.","not so difficult in the beginning but picks up pace after the first half, make sure to be on top of readings before lectures or else you won't understand whats going on","Definitely take this class with Professor Nock if you have to take statistics as a requirement. Actually enjoyable instead of a pain.","Prof. Nock is AMAZING. You will walk out of this class loving stats and psychology. One of the most useful classes I've taken at Harvard by far.","The material is interesting, but Professor Nock was a bad teacher. At times, he confused the material more than he clarified it. Several times I found myself looking back at his powerpoints, and learning more by teaching myself than I did paying attention and taking notes in class.","If you're going to take a statistics class at Harvard, take this one! Even if you aren't a psych concentrator, this course gives a great introduction to statistics and teaches you the basics necessary to understand the tests that normally come up in research papers. Professor Nock is awesome and makes lectures really entertaining. The lab\/section component is great and actually teaches you something that will be of use in the future. With no p-sets and no final, this class is low on the workload while still teaching you a whole lot.","It made stats less intimidating!","This is a great introductory statistics class! No problem sets, but do practice problems as necessary, and you will do great!","It's a great and easy way to fulfill the psych stat requirement! Nock is a great and funny professor too!","great class. prof. nock is really good about making sure everyone is understanding the material. if you keep up with what's going on in the class, you'll easily make an A. try to make sure you understand everything though the day you learn it, that way studying for the midterm is just review.","Great class to fulfill your maths requirement - optional (no) problem sets and will learn the same material as other Stats classes","This is a great intro stat course. Professor Noch is great, and he explains concepts very well and very simply. Definitely take this course. Most people in this class are psych concentrators, but I took it to fulfill a premed stat requirement, and the psych approach is pretty interesting. Noch stays very basic so don't worry if you've never taken stat before.","With Prof. Nock, absolutely the most enjoyable class of the semester! If you are looking at knocking off the GenEd and aren't into math, this is your class. If you are thinking about psychology, this is your class again - it actually becomes helpful for reading psych papers within 2 weeks of the beginning of the class. Tremendously helpful! \r\nOn top of that, Nock is supremely funny! He is one of those professors you wish taught more classes so you can interact with them more. Statistics should not be that amusing, but he makes it hilarious.","This class is great; professor Nock is awesome and makes statistics fun and understandable.","Professor Nock really makes statistics both painless and applicable. Definitely take this class!","This is a great class and not very difficult, but you definitely have to keep up! The exams and quizzes are not too hard, but you'd be much better off not having to cram the night before. Other than that, great class and Professor Nock is amazing!! Definitely recommend going to lecture.","Great class for the psychology concentration. The professor is great! He is funny and engaging. The exams and quizzes are not bad.","This class is an interesting and easy way to fulfill the EMR gen-ed while still learning a lot about psychology and statistics in general. You'll feel much better equipped to read research journals after taking this class!","This class might be the easiest class you'll take at Harvard partially because it's just not very complex or vast but also because its taught so well. You also learn how to use SPSS which is pretty useful."]},"Spring '13":{"comments":["It's a fine stats class but it might be more worthwhile to take stat 104 because that course seems to have much better support, and you have a much wider network of peers to study with.","If you are taking this class it is probably because you need to. It is painless and at times pretty interesting. Also SPSS is so great to know and you will definitely see how statists is relevant.","It is a very easy statistics class. Especially if you have taken stats in high school. The SPSS sections were very helpful.","This class is extremely straightforward in a great way! Teaches you what you need to know in order to run statistical tests for psychological research and the exams test you on exactly what is taught in lecture.","This class was such a wonderful way to take statistics. Lectures were very straightforward and the lecture slides contained all information necessary so I didn't feel pressure to take super extensive notes. There weren't any problem sets and I found that all I needed to do for tests and quizzes was review slides and do some of the suggested practice problems. The teaching staff was great, especially Prof Aramovich. I would highly recommend this class.","Not really an option for most people but if you want to be able to do basic statistics, this is a perfect way to do it!","This was a great class. I don't know if Professor Aramovich is teaching again but if he is, he did an amazing job. He had a way of explaining the information and providing examples that was super clear and very helpful. I always knew that if something was confusing that he would take the time to make sure I understood the information. One of the best math teachers I have ever had. I really enjoyed the material as well. Also, the class was not very difficult as it was taught this year. The quizzes and tests were very fair and not too difficult to study for. Lab section was helpful without being overly demanding and the final project was easy but also a helpful review of what was learned in lab.","- The class is designed to make you learn. It has no big final exam and to me that was great. The professor is really nice and really wants to make the class as fun and as easy as possible.","Easy, fun course! A lot of small quizzes and exams which are a bit tedious, however. Overall though, definitely a course that I would recommend to fulfill a psychology concentration requirement.","For anyone in the sciences, this is a great opportunity to learn important statistical techniques. The professor is really great and presents the material well. The work load is light but the return on your time investment is high. The course has already helped me design thesis experiments. I think it's a far better course than other introductory statistical classes.","This is such a SANE class. They don't make you do busy work - everything is on the lecture slides and the tests and assignments are incredibly straightforward. They don't make it harder than it needs to be and it's a great, easy way to understand statistics for psychology. If you took stat in highschool you can easily take it as a fifth class - or, if you want to do harder stuff - take Stat104 or something - but this is a great way to tackle the requirement without getting life sucked out of you.","This course is an excellent course to take for any one interested in going into the psychology field and do not be intimidated about learning about statistics that will be so essential in any research field one goes in. Professor Aramovich is very clear in his presentation of concepts and learning SPSS in section will definitely be a pragmatic skill to have for a future in research which is easily learned in this class.","It is very basic statistics.","I loved this course! Professor A. and TF Nancy are amazing! Statistics may seem daunting to some, but it was a really smooth experience. It focuses on statistics relevant to psychology so you'll end up reading and understanding research articles a lot more (the methods and results section, specifically). I was also working in a lab at the same time and the course definitely helped me understand our results and work better. Take it in the spring, you won't regret it!","This is an easy and interesting way to learn stats!","This is a great way to learn stats. Dr. A is a very good professor and the TFs are really helpful. It is an interesting and not tough class.","Very easy class if you pay attention and do the problem sets when you think you may be struggling. The professor is a boss and teaches things very well. Always open to questions and nothing is a stupid question. Made me feel as though I could actually learn the subject.","Take this over Stat 104. There are no problem sets, and the class is really easy.","It's a pretty easy class, but it's very memorization-driven. I would have much preferred a class that emphasized understanding statistics and was a little harder, than a class that about regurgitating formulas for a quiz or test. However, for someone that math isn't really something you like and you need to fulfill the department's stat requirement, it's a good class. You don't feel like you learn too much, but that's ok because you don't need to put too much time into it anyway. Also, the textbook is kind of hilarious.","This class is very easy, with minimum work required. The professor is awesome, and teaches the material well. If you need to take stats for psych, definitely take psych 1900.","Everyone should take this class. Professor Aramovich is a fantastic lecturer who really cares about his students. The textbook is great and super straight forward. If you put in the effort, you will get a good grade (:","It's fun, it's easy, it's useful. Take it.","It is an engaging course that teaches relevant material. Dr. Aramovich is an incredibly engaging lecturer who makes the material fun and easy to understand.","This is a great and manageable class for students who want an introduction to statistics.  The material is thoroughly explained, which makes the quizzes and tests pretty straight forward.  Great class that's pretty easy!","It's probably the easiest statistics course there is but it's still difficult for people incompetent at math.","I found this course super easy. I wish I would have chosen a more challenging course. This was a prereq to another course I planned on taking, but I changed the track of my concentration, so this became unnecessary. I still have to take Stat 110 anyway. If I would've known it would be this easy\/boring, I wouldn't have taken it. It is a nice GPA buffer, which the majority of use wouldn't mind having at all.","Don't bother taking it unless you are actively pursuing psychology."]},"Spring '14":{"comments":["A very useful class. It's not particularly hard. The lectures are clear and concise, and you actually can learn a lot.","Professor is great. Very responsive, open, and helpful. If you have to take stats, this is the class to take.","It was Professor Krasnow's first time teaching this class. You can tell he wasn't yet comfortable teaching this subject. The course material (exams, section) still need to be improved before I would recommend taking this class.","This class made statistics so clear and understandable.  I'd thought I wouldn't enjoy statistics but actually loved this class.  It was not a lot of work at all and the assessments were really fair in both testing what we actually knew\/how we could apply it and in not trying to trick us out or anything.  The final project was also cool because it wasn't a lot of work but we actually got to apply everything we'd learned to real world data and actually find results.  I thought this class was pretty easy and it's easy to do well.  Reading the textbook\/doing the practice problems also made everything so clear and I feel like I have a really solid understanding of statistics now.  Definitely take this class!","This is a pretty difficult intro stats class, but Professor Krasnow is great and really cares about his students. He adjusts the grading to make sure that everyone is learning and succeeding. You do learn so much in this class and Professor Krasnow is a great lecturer.","It is not difficult if you do the suggested problems in the textbook. Also, the textbook is really helpful if you do not understand lecture.","People may say this class is easy even if you don't like math, but it still requires math. Nothing more than basic algebra, but the mathematical\/statical procedures and concepts have to be studied to do well (if you don't have prior knowledge of statistics). Best way to do well is DO READING, then go to lecture. Learned real-world applications, and SPSS software is very handy. Great course, got what I wanted out of itâ€”learning stats...","Be prepared to be able to not just know the material, but know how to implement it very quickly.","Great stat class. You learn many of the things you will need to know if you pursue research and Krasnow's teaching style is very effective.","Definitely use the textbook and not so much the lecture because getting lost in lecture is very easy with the quick pace of examples. Concepts are hard to pick up in lecture and reinforced through practice with the textbook!","this is a very easy stat class and does not take too much time but has disorganized, often confusing sections","This class is very manageable. I would highly recommend keeping up with the reading (I know, ugh) because the textbook explains the concepts really well. DEFINITELY DO THE PRACTICE PROBLEMS HE SUGGESTS. The homework is not mandatory, but you will fall behind if you don't make an effort to try out the practice problems. The midterms are very fair, only an hour long and multiple choice. I really like the professor too! The TFs are stellar, definitely try to get Pemberton.","Just make sure you stay on top of the reading and you'll be fine -- conceptually not a terribly hard course at all, and the tests test the material that's taught, so just review and study and you'll be fine.","This class is more or less painless. If you put in the work, you will not be disappointed, but it's hard to rationalize putting in the work when there are so many other classes you're taking and Stats is usually supposed to be your chill course. But do the work, keep up with what's going on in class, (go to lecture AND pay attention)","This class is ok, but lecture can be very slow. The material itself is interesting, but lectures are just not engaging. Section was much better than lecture; it was actually useful and engaging.","It certainly is an interesting way to apply statistics to an area that you're interested in. Using the class survey made our number seem very real, and it gave me a greater sense of enthusiasm for the material in lecture, in lab, and on the final project.","There is no structure, so you have to depend on yourself. If you don't like to read the chapters, read the chapter summaries and the practice example at the end of the chapter before lecture and DEFINITELY before exam (it will be better than reading or looking at the slides-no other way to learn how to do the problems). Go to lecture and do the practice problems. Then make it to office hours no matter what. This semester, their office hours were limited.. so prepare over the weekend!","The material itself is not particularly difficult, but you may find yourself struggling because this class is EXTREMELY DRY.","It seems like a very easy course due to the light work load but unless you are naturally great at statistics or have the time and energy to teach yourself from the textbook on your own time, you will be very thrown by this course.  I spend the first half of this course thinking that it was easy and things were going fine, as did the rest of my classmates, but then came midterm 2, where the class average was a D.  Go into this course with your eyes open and don't expect much from the professor.","It's not difficult material but you have to teach yourself most of it."]},"Fall '14":{"comments":["Its good to learn R","This class is easy but boring. Prof. Mair is not good at lecturing, and the readings are too dense to help. I learned statistics using khan academy.","This class is very much an APPLIED statistics class. If you're looking to understand statistics, this is not the class for you. If you are going to have to use statistical tests in the future and need to know how to use R, this is a good choice. Also, completely unrelated to Psychology.","Good if you're looking for a very basic overview of statistics, although no one really knew what was going on in lecture usually.  The tests and quizzes were always multiple choice and pretty easy if you know the lecture slides, even if you don't really know what they mean.  No homework\/psets, and final project was easy if you attended section.  Don't expect to really know statistics after taking this class though.","very little work, can be confusing at times. go to section","This is a great intro to stats, in a low-stress setting. Take it with Professor Mair, he's great!","I didn't have much statistics knowledge before taking this course, so it did a very good job as an Intro course. The course also moved at a good pace; it wasn't too slow or too fast.","A pretty easy way to take a statistics class! Gets you some experience with R coding and the basic concepts of stats.","Patrick is really good, and this course will teach you a lot about how to evaluate and produce basic statistical analysis. Make sure you understand the material from the first couple weeks, as it lays the foundation for the whole course.","Terrible. If you actually want to learn Statistics do not take this course. Patrick literally just spits out definitions to you. Do not take this course.","This class was a breeze. Took it with a very difficult chem class which helped balance my schedule, but if you have three other reasonable classes this would be a very easy fifth if you have any statistical background at all. Lecture is pretty unnecessary as long as you review the slides","If you have never taken statistics before, you may be a little overwhelmed at first, but it moves slowly and you will be a pro by the end. Professor Mair is very funny, reasonable and intelligent. He asks very little in terms of work, but you come away with a great understanding.","If you're considering taking a stats class (especially for psych concentrators), take this class!!! I am so happy that I chose to take it with Professor Mair instead of during the spring time. The tests are non-cumulative, the quizzes are super easy, and the material begins from the basic. Professor Mair said on the first day of class that all that you need to do is pay attention and stay focused for one hour during lecturer and that's it. You don't have psets or the need to go over slides later (unless you're studying for exams).","This is a great class. You learn useful skills in R and it's not a lot of work.","the content for me personally was difficult to follow","This course is a great course that truly puts less emphasis on outside work, and more on inside class understanding and shows great ways to apply the material to real-life examples more so than other stat courses.","This class has very little work, but to be successful you need to do what is asked of you which includes readings and going over the lectures a little bit on your own","The course is very theoretical and not application based.  The teacher is amazing and really enthusiastic about having students understand the material.  The hardest part of the course is learning to code in R, but the sections make it very easy to learn this.","Very cool class and not too much maintenance. Fairly straightforward requirement.","It's a great introduction to the subject, the workload is minimal, and I feel like you do learn a lot, especially in sections.","Make sure review lectures.","Absurdly easy. Does teach you the fundamentals of statistics, but you could also get away without learning anything. The exams are I guess pretty well designed to test actual understanding - they require little to no memorization.","This is a course you have to take as a psych concentrator.  Lectures aren't especially compelling or novel, but the lab component is definitely worthwhile.  RStudio is really helpful and cool, and it's a good thing to have on a resume.","Very straightforward and easy if you just pay attention and follow along. I really liked learning R - it would really come in handy, and it's kind of rewarding to be able to code (though at a relatively simple level) something when I'm not in CS or anything like that.","Take it if you're looking for an easy class...as someone who is interested in statistical theory, I was frustrated by the fact that we learned about the purposes of different statistical tests, but didn't learn how they actually work.","This is the required department basic methods course for psychology. The class is very straightforward and requires almost no outside work. Lectures are easy to follow, and Professor Mair really tries to add energy and flavor to them. The assessments in this course are very fair, and as long as you read the lecture slides, you should be fine. The best part of the course, by far, is lab section where you learn R and how to apply it to the concepts learned in lecture. This is a great course if you want a painless introduction to statistics.","The class is easy in terms of workload but you learn nothing and it's extremely confusing. Not that easy to do well on the exams since you learn literally nothing. Patrick's lectures are very unclear and it's difficult to take notes","This class was easily and relatively painless but frustrating at times from not understanding material - not because it was complex but could be presented in a confusing manner with little additional material or notes to back it up. Perfectly fine way to satisfy PSY stat requirement. Interesting to learn R code.","This is a relatively easy class, but it's definitely good to take because you learn some very important statistical tools and some coding.","Section (learning R) is what makes this class so valuable.","This course is really great. It is not difficult but gives you a good understanding of statistical concepts and R which is really useful for the sciences and makes you look really good to employers.","If you are concentrating in Psychology, take it! It's a good intro to Stat (and may be more appropriate for Psych concentrators than, say Stat 104), and learning R was really interesting and not stressful at all.","Show up to class, review the slides before the exams and quizzes, and you will be totally fine. If you need to take statistics for some requirement or another, TAKE THIS CLASS","This class is very manageable.","Patrick has designed the course in a way that you will learn the basics of statistics without feeling overwhelmed. He is a wonderful teacher, especially for those that may have some anxiety about the subject.","No work, great teaching, fun and applicable!","PSY1900 is a gem of a class. You learn so much conceptually without having to engage with too much math. This is perfect for a student who wants to gain knowledge about data analysis without spending their entire semester dedicated to the matter. It was a wonderful class led by dedicated professors.","This class is a gem. There is very little work aside from studying for the three quizzes and three exams which are so easy if you study the lecture slides. In addition, section really teaches you how to use R, and the final project is not hard at all."]}},"mostRecentQ":{"overall":"3.40","workload":"2.40","difficulty":null,"recommendation":"3.90","enrollment":"75","response rate":"86.67","QCourseOverall":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"3","2s":"6","3s":"23","4s":"24","5s":"8"},"QDifficulty":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"2","2s":"9","3s":"12","4s":"9","5s":"2"},"QWorkload":{"number":"PSY 1900","course_id":"4293","cat_num":"4016","1s":"37","2s":"16","3s":"2","4s":"0","5s":"0"}},"success":true}