{"scores":{"Fall '14":{"course_score":{"overall":"3.90","workload":"2.60","difficulty":null,"recommendation":"3.90","enrollment":"53","response rate":"67.92","QCourseOverall":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"0","2s":"1","3s":"10","4s":"17","5s":"8"},"QDifficulty":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"0","2s":"4","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"16","2s":"13","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 34","cat_num":"6357","course_id":"2048","year":"2014","term":"1","id":"c197af23215b1e2c00da3a19634ab1a5","first":" Orlando","last":"Patterson","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.40","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"2.90"}]},"Fall '12":{"course_score":{"overall":"4.33","workload":"1.85","difficulty":"2.69","recommendation":"4.31","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"0","2s":"1","3s":"10","4s":"17","5s":"8"},"QDifficulty":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"0","2s":"4","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"16","2s":"13","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 34","cat_num":"6357","course_id":"2048","year":"2012","term":"1","id":"c197af23215b1e2c00da3a19634ab1a5","first":"Orlando","last":"Patterson","InstructorOverall":"4.23","EffectiveLecturesorPresentations":"4.46","AccessibleOutsideClass":"3.75","GeneratesEnthusiasm":"4.15","FacilitatesDiscussionEncouragesParticipation":"3.67","GivesUsefulFeedback":"3.80","ReturnsAssignmentsinTimelyFashion":"3.80"}]},"Fall '10":{"course_score":{"overall":"3.75","workload":"1.80","difficulty":"2.95","recommendation":"3.68","enrollment":"23","response rate":"86.96","QCourseOverall":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"0","2s":"1","3s":"10","4s":"17","5s":"8"},"QDifficulty":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"0","2s":"4","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"16","2s":"13","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 34","cat_num":"6357","course_id":"2048","year":"2010","term":"1","id":"c197af23215b1e2c00da3a19634ab1a5","first":"Orlando","last":"Patterson","InstructorOverall":"3.65","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"3.47","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.75","GivesUsefulFeedback":"2.50","ReturnsAssignmentsinTimelyFashion":"2.25"}]}},"comments":{"Fall '10":{"comments":["The material is interesting, but presented poorly. It is also challenging to have a final paper and exam.","I think it a highly effective survey course that begins with the history of the Caribbean region which provides the underpinnings for country case studies analyzing different paths of economic, political, and social development before exploring regional cultural parallels.","It is important that one learns about the Caribbean. It is a very important region. However, this class is best taken if one has no understanding at all of Caribbean history and is willing to then further study about LIFE there - not just what developed countries hope that you understand.","This class is really interesting, and accessible to all people.  Professor Patterson is awesome.  It is not the easiest A, as gen eds go, but it is worth it.","If you are not very interested in the Caribbean you won't enjoy the class, but if you are from the Caribbean or are a descendant of Caribbean peoples then you won't enjoy it either. The class starts off as a history class and that is very interesting, but it takes a strong sociological turn. If you want a class that just discusses the history and culture of the Caribbean, this is not the right class for you.","A lot of work, but definitely worth it; readings very interesting","It is a lot of work, more than it seems. I can't say it was an extremely rewarding class, but you will be exposed to different ideas and realities about a region that is truly unique in its sociopolitical and economic diversity. The second half of the course loses a bit of steam.","Take a close look at the syllabus before enrolling."]},"Fall '12":{"comments":["If you are not interested in the Caribbean or its history, you will not enjoy this course.","I found the class to be not particularly challenging because it was so interesting.  I wanted to come to class.","This class was amazing. Really interesting material. Professor Patterson is a really cool fellow and he keeps things interesting with videos and guest lectures. Although there are no assignments other than two short essays, a final paper, and final exam, it was a lot of writing -- more than most would want from a gened unless you're interested in the Caribbean. I wouldn't bother reading any of the reading materials assigned though unless you're interested in a particular topic; it's all really long and dense.","The class is very interesting and fun.  Orlando and Ethan do a good job at explaining different topics.  After the class is over you will have learned a whole lot about the Caribbean.","The course is actually good, and the workload is very chill throughout the semester as the readings are not really necessary for lecture, or section for the most part. Everything piles up in the end though because of the final research paper and the final exam, so having done the readings beforehand may help save some time. Overall its very informative, and also pretty fun; especially (but not only) if you are Caribbean","It is not necessary to do the readings as Prof. Patterson provides a comprehensive overview of the material in his in depth lectures. However, the readings are extremely interesting, especially the ones about religion and music. Take this take this take this class!","Very interesting subject matter, but you get what you put into it.","This course is great if you have any interest in the Caribbean or even if you are just looking to fulfill a Societies of the World requirement. Professor Patterson has unlimited knowledge in the field and Ethan is great in section."]},"Fall '14":{"comments":["This is a very engaging, interesting class that presents some essential survey knowledge about the Caribbean. You definitely get out of it what you put in - you could scrape by with minimal work, but you'll find yourself fascinated by the questions.","This class has interesting subject matter and is not difficult at all.","Great, easy way to fulfill the SW Gen-Ed! I didn't do the readings and did fine, I did go to lecture bc I loved Professor Patterson but if you don't want to go, the lectures are recorded. Ethan is the best TF so try to go with him, and don't be afraid to ask questions in class!","This course is very easy until the last two weeks. Readings are not necessary to do well on the midterm paper, and the research paper can be very focused and independent of class work. The final exam is cumulative, however, so this tends to stack up at the end.","Prepare for the final essay, and block out a lot of time for the final.  They catch up quick and hit you hard if you're not prepared.","Definitely worth taking.","This is a great SW class. If you are looking for an easy class that does not require that much work, take this class! Orlando is funny and gives great lectures that are easy to understand. The only problem with this class is that it is very back loaded, with a final paper and final exam worth 60% of your grade. Other than the last two weeks of the semester though the class has essentially no work (readings are not necessary if you pay attention to lectures) and section is solely discussion based. The paper can be anything you want about the Caribbean, so if you pick a topic you like, it is not that bad. The final is not overly difficult and they don't try to trick you with unnecessarily hard questions.","If you're interested in the material, I would recommend the course.  It's neat to take a class from a Professor as renowned as Patterson.  Sections are a little too read-off-the-Powerpoint in style, but the information is organized.","This class is kind of a gem throughout the year, and you're learning about cool information that is relevant to where many students come from. However, come finals, you will have a final paper AND a final exam, which really sharply contradicted its gem status throughout the year. Overall, very enjoyable and low stress.","Take this class if you're genuinely interested in the region. If not, it's tough to stay engaged.","This course is not as much of a gem as it seems. The final paper is much more demanding than you expect, and the final is a bit more stressful. It is cool that lectures are taped and whatnot, but I cannot stress enough that this course is not really a gem. That being said, it was a great course to learn a ton about the history of the caribbean.","I really enjoyed this class. If the Caribbean interests you or if you want to use it as a case study for understanding why certain societies are the way they are, I think this is the perfect class.","Hope your TF is Ethan; if not, he puts his section slides online. The paper deadline also comes up quicker than you think.","It was a really good class and the information I learned really backed my prior knowledge of the course. The readings aren't extremely important but they are really interesting! Definitely recommend if you have family or there is a strong caribbean presence next to you.","If you're looking for an easy way to satisfy Soc-World, take this class. Lectures are taped, sections recap lecture material, you can get by without really doing the readings, and the only assignments are a midterm, 10 page final paper, and final exam. If you're interested in the material, even better!","This course is great! Orlando Patterson is an amazing and interesting teacher who knows almost everything about the Caribbean. The readings are simple and the homework is super chill. If you need an easy Societies of the World GenEd, then take this one!","Professor Patterson is amazing. He has a rich history behind him and a lot of knowledge to share with students. This is one of the only classes on Caribbean studies at the college to the best of my knowledge. If you are from the Caribbean or just interested in the area it is a fun, easy and interesting introduction to many of the issues and culture surrounding the region. Section slightly useful, lectures also recorded. Overall a great course and as someone of Caribbean descent interested in economics and development was one of my favorite courses here. I am grateful I was able to find it.","Make sure you think about these things as a sociology course","Lectures are easy to grasp. Readings aren't truly necessary. Workload is minimal. Take this class if you want to learn something new and want to have fun doing it.","I LOVED this class! I learned so much about my heritage and other Caribbean countries! Definitely take this. Professor Paterson is amazing and adorable in class. I recommend it a million times over.","This class is as hard as you make it.  I was really interested in some topics and not interested in others and I did the readings accordingly.  Final paper and final exam is annoying, but considering the only other requirement is a 1 hour midterm, it's hard to complain.  As someone from the Caribbean, I didn't necessarily agree with everything Patterson said, but all in all the course was a good survey of the history and culture of the region.","This is a great course. Patterson is a very fun and awesome professor. Make sure to focus on what interests you and the essay will be easy."]}},"mostRecentQ":{"overall":"3.90","workload":"2.60","difficulty":null,"recommendation":"3.90","enrollment":"53","response rate":"67.92","QCourseOverall":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"0","2s":"1","3s":"10","4s":"17","5s":"8"},"QDifficulty":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"0","2s":"4","3s":"9","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 34","course_id":"2048","cat_num":"6357","1s":"16","2s":"13","3s":"1","4s":"0","5s":"0"}},"success":true}