{"scores":{"Spring '14":{"course_score":{"overall":"3.70","workload":"2.80","difficulty":"3.50","recommendation":"3.80","enrollment":"39","response rate":"71.79","QCourseOverall":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"3","3s":"7","4s":"11","5s":"6"},"QDifficulty":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"1","2s":"2","3s":"10","4s":"10","5s":"4"},"QWorkload":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"9","3s":"15","4s":"3","5s":"0"}},"instructor_scores":[{"number":"APMTH 107","cat_num":"6411","course_id":"1120","year":"2013","term":"2","id":"06680d30ef16fcc4e07d9c80c4a008f3","first":" Leslie G.","last":"Valiant","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.70","AccessibleOutsideClass":"3.20","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"3.20","GivesUsefulFeedback":"3.10","ReturnsAssignmentsinTimelyFashion":"3.60"}]},"Spring '13":{"course_score":{"overall":"3.54","workload":"2.88","difficulty":"3.42","recommendation":"3.75","enrollment":"30","response rate":"80.00","QCourseOverall":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"3","3s":"7","4s":"11","5s":"6"},"QDifficulty":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"1","2s":"2","3s":"10","4s":"10","5s":"4"},"QWorkload":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"9","3s":"15","4s":"3","5s":"0"}},"instructor_scores":[{"number":"APMTH 107","cat_num":"6411","course_id":"1120","year":"2012","term":"2","id":"4fa43ab50f2118d37acd5ad683235639","first":" Ozlem","last":"Ergun","InstructorOverall":"3.71","EffectiveLecturesorPresentations":"3.42","AccessibleOutsideClass":"4.39","GeneratesEnthusiasm":"3.79","FacilitatesDiscussionEncouragesParticipation":"3.71","GivesUsefulFeedback":"3.43","ReturnsAssignmentsinTimelyFashion":"3.89"}]},"Spring '12":{"course_score":{"overall":"3.48","workload":"3.17","difficulty":"3.74","recommendation":"3.70","enrollment":"29","response rate":"79.31","QCourseOverall":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"3","3s":"7","4s":"11","5s":"6"},"QDifficulty":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"1","2s":"2","3s":"10","4s":"10","5s":"4"},"QWorkload":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"9","3s":"15","4s":"3","5s":"0"}},"instructor_scores":[{"number":"APMTH 107","cat_num":"6411","course_id":"1120","year":"2011","term":"2","id":"06680d30ef16fcc4e07d9c80c4a008f3","first":"Leslie G.","last":"Valiant","InstructorOverall":"3.32","EffectiveLecturesorPresentations":"3.36","AccessibleOutsideClass":"2.36","GeneratesEnthusiasm":"2.82","FacilitatesDiscussionEncouragesParticipation":"2.93","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '11":{"course_score":{"overall":"3.48","workload":"2.90","difficulty":"3.69","recommendation":"3.74","enrollment":"37","response rate":"86.49","QCourseOverall":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"3","3s":"7","4s":"11","5s":"6"},"QDifficulty":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"1","2s":"2","3s":"10","4s":"10","5s":"4"},"QWorkload":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"9","3s":"15","4s":"3","5s":"0"}},"instructor_scores":[{"number":"APMTH 107","cat_num":"6411","course_id":"1120","year":"2010","term":"2","id":"06680d30ef16fcc4e07d9c80c4a008f3","first":"Leslie G.","last":"Valiant","InstructorOverall":"3.72","EffectiveLecturesorPresentations":"3.72","AccessibleOutsideClass":"3.04","GeneratesEnthusiasm":"3.25","FacilitatesDiscussionEncouragesParticipation":"3.52","GivesUsefulFeedback":"3.14","ReturnsAssignmentsinTimelyFashion":"2.86"}]},"Spring '10":{"course_score":{"overall":"4.12","workload":"3.00","difficulty":"3.31","recommendation":"4.25","enrollment":"20","response rate":"80.00","QCourseOverall":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"3","3s":"7","4s":"11","5s":"6"},"QDifficulty":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"1","2s":"2","3s":"10","4s":"10","5s":"4"},"QWorkload":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"9","3s":"15","4s":"3","5s":"0"}},"instructor_scores":[{"number":"APMTH 107","cat_num":"6411","course_id":"1120","year":"2009","term":"2","id":"06680d30ef16fcc4e07d9c80c4a008f3","first":"Leslie G.","last":"Valiant","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.25","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.62","FacilitatesDiscussionEncouragesParticipation":"3.83","GivesUsefulFeedback":"3.75","ReturnsAssignmentsinTimelyFashion":"4.25"}]},"Spring '09":{"course_score":{"overall":"3.60","workload":"3.10","difficulty":"3.83","recommendation":"3.60","enrollment":"35","response rate":"88.57","QCourseOverall":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"3","3s":"7","4s":"11","5s":"6"},"QDifficulty":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"1","2s":"2","3s":"10","4s":"10","5s":"4"},"QWorkload":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"9","3s":"15","4s":"3","5s":"0"}},"instructor_scores":[{"number":"APMTH 107","cat_num":"6411","course_id":"1120","year":"2008","term":"2","id":"06680d30ef16fcc4e07d9c80c4a008f3","first":"Leslie G.","last":"Valiant","InstructorOverall":"3.23","EffectiveLecturesorPresentations":"3.17","AccessibleOutsideClass":"3.21","GeneratesEnthusiasm":"2.80","FacilitatesDiscussionEncouragesParticipation":"3.22","GivesUsefulFeedback":"3.62","ReturnsAssignmentsinTimelyFashion":"3.67"}]},"Spring '08":{"course_score":{"overall":"4.25","workload":"3.08","difficulty":"3.33","recommendation":"4.33","enrollment":"16","response rate":"75.00","QCourseOverall":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"3","3s":"7","4s":"11","5s":"6"},"QDifficulty":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"1","2s":"2","3s":"10","4s":"10","5s":"4"},"QWorkload":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"9","3s":"15","4s":"3","5s":"0"}},"instructor_scores":[{"number":"APMTH 107","cat_num":"6411","course_id":"1120","year":"2007","term":"2","id":"06680d30ef16fcc4e07d9c80c4a008f3","first":"Leslie G.","last":"Valiant","InstructorOverall":"4.17","EffectiveLecturesorPresentations":"4.25","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.17","FacilitatesDiscussionEncouragesParticipation":"4.36","GivesUsefulFeedback":"4.33","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '07":{"course_score":{"overall":"3.58","workload":"2.95","difficulty":"3.63","recommendation":"3.74","enrollment":"32","response rate":"59.38","QCourseOverall":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"3","3s":"7","4s":"11","5s":"6"},"QDifficulty":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"1","2s":"2","3s":"10","4s":"10","5s":"4"},"QWorkload":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"9","3s":"15","4s":"3","5s":"0"}},"instructor_scores":[{"number":"APMTH 107","cat_num":"6411","course_id":"1120","year":"2006","term":"2","id":"06680d30ef16fcc4e07d9c80c4a008f3","first":"Leslie G.","last":"Valiant","InstructorOverall":"3.47","EffectiveLecturesorPresentations":"3.47","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"3.16","FacilitatesDiscussionEncouragesParticipation":"3.38","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.33"}]}},"comments":{"Spring '08":{"comments":["Interesting material, could be improved by having better sections and better study materials","Professor Valiant is an eminence in the field who provides an original, interdisciplinary perspective on graph theory. This course is a must for any student interested in the mathematics or computer science. My best mathematical experience at Harvard as yet.","It's a great class with interesting material, the problem sets are challenging but not too time consuming, Professor Valiant is very sweet and enthusiastic. It's a good class to take if you have a requirement to fulfill.","a good stepping stone to enter theoretical computer science","The course is an excellent opportunity to improve proof-writing skills and work with other students.","Probably one of my favorite concentration classes thus far!"]},"Spring '10":{"comments":["It is overly important for computer scientists. However, many other fields are overlapping with the course material (graph theory, combinatorics)","So much better than CS124","Pretty awesome and painless class. Do your assignments diligently and you will not have a problem with the midterms.","The material was interesting but the class was lackluster; it seemed like the professor just did not care.","If you're looking to meet the CS theory requirement, this course is a very painless alternative to CS 124. After suffering through Math 23 and CS 121, I was relieved to find a math course I actually liked.","It's very interesting, the professor is boring, the problem sets get hard.","This class is very interesting and very relevant to computer science.  It is pretty time consuming though, and you are being curved against smart kids.","The class is very difficult.","You MUST take a course with Les Valiant!","This is a very fun class, but it will only be fun if you like the challenge of solving tough math problems.","It's pretty interesting, not too difficult if you put in the time, and it has no final."]},"Spring '11":{"comments":["If you like combinatorics\/ graph theory anyway and have a good intuition for the logic behind these, then the class will be pretty breezy, but you'll probably still see quite a bit of new material. On the other hand, if these things are fairly challenging for you on a fundamental level, this class will probably be quite challenging. That said, it's pretty accessible to anyone.","You should do practice problems if you want to do well in this course. You should be mathematically mature to a certain degree.","This is probably the best applied math course I've taken.  The workload is not too demanding and the material is fascinating.  Valiant is a genius, and it was great to take a course with him.","you will learn a fair amount but it is very boring.","Leslie Valiant was the 2010 Turing Award recipient. Valiant is a pretty good teacher, but he does everything on good old black board at 10am without slides, so either plan on going to lecture or have some really good friends who take neat notes. Lectures are interesting, but don't necessarily match up with the weekly pset, which take forever. They walk you through everything in section though. Midterms are pretty tough, usually averaging around 40 out of 70. Best math class I've taken at Harvard.","The material is interesting and the problem sets are surprisingly entertaining. It's nice to have the midterm and the non-cumulative final.","The course material is very interesting\/useful but the course is very challenging so I'd be careful encouraging students to take it.","This class is great. The professor is amazing. The problems are fun.","The class is hard because of the exams. Problem sets don't take long, and they are not difficult to do. Section is very helpful for the problem sets. But don't expect the TFs to be good at explaining the material. They are good at helping with the problem sets though.","It's a pretty painless course, but you have to go to all the lectures because there are no lecture notes!","Section tells you how to do your problem sets. For this reason, it's not much work, but everyone does well. Hence, even though exams are only by one third total, that is where the variance occurs, which means exams are what determines your grade ultimately anyways.","Graph theory and combinatorics are just so interesting and powerful tools in many subjects.  Valiant does a nice job of clarifying the important concepts.  This is definitely a class where you cannot get what you need just by reading the book because lectures beat the book by far.  Sections are also great at developing problem solving skills and making you really think through the problems.","Meh...some interesting stuff, but the only place to learn is lecture and there is no supplemental material.","It's a good class, but the second half is definitely weaker than the first half. It's definitely worth taking for CS concentrators -- the concepts are exceptionally relevant to CS. But otherwise you might want to consider pass\/fail or auditing instead.","The problems are usually pretty interesting.","I personally really like discrete math and combinatorics, so this was a cool class to take. Especially if you have had Stat 110 (probability and combinatorics) or a prior class in CS or AM106, that is helpful. I would not recommend it as a first course in proof-based or even discrete math, but there aren't that many options or choices at Harvard--but mostly because the class was really poorly taught this year. Prof. Valiant is absolutely brilliant (he won the TURING this year), but doesn't have as much oversight over his class. Section was awful, but hopefully future TFs can improve this component of the course.","This class is a good alternative to cs124. However, I had many problems with the teaching. Professor Valiant isn't the best lecturer and the TF's are undergrads who are consumed with their own work."]},"Spring '12":{"comments":["Interesting psets, not too much work.  A good second math course.","problem sets are tough, but they are generally the same length each week and you know what to expect. lectures are useful and there are no lecture notes posted.","I really enjoyed the class.","Professor Valiant can make the material very, very boring. It was very hard to get through an entire class without losing focus a few times.","A great deal of material in this class is covered better by other classes, including Stat 110 and especially CS124. If you are not a CS concentrator (or just want to learn about graph theory) this can be an interesting math class to take.","This class has doable problem sets, especially if you start early and ask questions at office hours (which were really helpful). The two non-cumulative midterms were really tough, mostly because they are long and only expect you to answer about half of the questions. There is no final which is nice. Valiant lectures clearly, but he is not always the most interesting of lecturers. Generally the material is pretty interesting.","Great class. Prof. Valiant is a Turing award winner and a genius. Lecturing style is not flashy but extremely clear (i.e. don't expect to be excited by the lecturing, but given that you're interested in the material itself, the lectures are very effective). It could work as a first proof-based course, though having some theoretical math experience  definitely makes it easier. \r\nFor CS concentrators considering taking this in order to \"avoid CS124\", I've taken both and yes, this class is probably better. But there's also very little overlap between the two classes, so I'd highly recommend taking both or you'll miss out on really important stuff. This is not a good class to take if you don't genuinely think graph theory is really cool.","It's an interesting and relatively painless course. The workload is very fair, and a lot of the material is fun.","This is a hard class. The material is hard to grasp, and the exams are a trial by fire: the problems are easy once you get them, but they are like puzzles, so it can be hard to get them in time. The material is totally fascinating and it's worth taking.","I think this course does present a good alternative to CS124. Quite honestly, a lot of people will say that chickening out of 124 is awful, etc. etc. However, I think that is a notion that does not have the most merit. 124 is difficult, but I am not sure that the extra time you are forced to put into that course results in your learning that much more material. If you are interested in learning about some key algorithms that might have applications in your comp sci life, you can learn them in a much less painful environment on your own. This course is good to teach you about graphs and how graphs are used to solve interesting problems. The combinatorics part is a good overview of things you might have learned in stat 110.","I would recommend this over CS 124. Go to every class and section. Section will go over problems that are similar to the homeworks.","The lectures might feel long, but I learned a great deal about the topic from an established professor!","AM 107 isn't a terrifically enjoyable class, but it's an honor to take a class with a Turing Award winner. The material is useful, and the class is a decent alternative to CS 124, though 124 is certainly more applicable to a CS concentrator. I don't regret taking this class, but the material was very difficult to understand and lectures weren't hugely helpful.","The class is very hard but the topics are very interesting. As long as you keep up with the course during the semester the work should be manageable and the course completely doable. Office hours and section are key.","Don't except the professor or tf to explain anything","The material is pretty interesting, but the problem sets can be challenging."]},"Spring '13":{"comments":["I thought this was a great alternative to 124. The material is still very challenging, so don't expect an easy class. The material is still very applicable to CS though, and I found the topics really interesting. If you want to seriously pursue engineering\/CS after college, I would say you should take 124 or 124 and AM 107.","The course followed the text very closely. Lectures were generally not engaging, but the staff was nice enough.","I LOVED IT!! the material is really fun. the textbook is really useful too, so I'd recommend getting it. the midterms are hard though.","It's a nice first exposure to math for more applied students!","Its really hard and graph theory is really uninteresting. Combinatorics is a little better. Needs to be taught better.","Definitely a better alternative to CS124. Significantly less work and easier","A good way to learn about graph theory and combinatorics\/fulfill your CS theory requirements. Fair problem sets, hard exams, but that is pretty standard.","A solid introduction to graph theory and combinatorics.  Professor Ergun sometimes got lost in lecture and rambled a bit.  But presumably Prof Valiant will be back next year and the course will be different.  The material is good for this interested in the subject.  And the class is not terribly difficult for those who have had some explore to graph theory \/ combo.","This course has its pros and cons (what are the odds!). On the one hand, the material is really interesting. In addition, if you are concentrating in something like CS, this material is very relevant. But on the other hand, the coursework is extremely challenging and the grading is really harsh.","Really interesting material, fun problem sets, though a tad bit abstract.","I really enjoyed this course, especially the graph theory portion (though I hear many of my peers preferred combinatorics).  I took it as a sophomore in CS who took Math 23 as a freshman (ugggh) but has yet to take CS121 or Stat110.  This course reminded me why I really enjoy math, which 23 had made me forget.  Some prior experience with proofs is helpful, but you don't have to be a master.  The class provides a lot of resources to help you out if you need it and there's a good chance you'll either have friends in the class or make some.  People with a really wide range of skill levels take this class - from CS sophomores trying to avoid 124 to applied math concentrators to people who are good at math who take this as an easy senior spring course.  This course generally works for everyone.","This was a decent class. The first part (graph theory) was fairly difficult. It seemed like there was no particular way to think about the problems; you just sort of try things until it works, which was frustrating. The second half (cominatorics) was much better, however.","This is a fine Applied Math class.  The fact that the grading is primarily assignments is great, since you can focus on these weekly problems rather than just focusing on an exam or two.  However, the material is not all that interesting and the problems often get unnecessarily complicated.  Not too difficult, but this class won't be thrilling.","I really enjoyed AM107 and felt that I gained a lot from the course. I learned some specific mathematical strategies and facts, but (more importantly) became a better mathematical thinker."]},"Spring '14":{"comments":["If you like going in depth in a mathematical subject, don't take this course. If you prefer a highlight reel of interesting subjects, this is an excellent course. In general, I would strongly recommend it among the options required for the applied math major, but I probably wouldn't recommend it if you're majoring in anything else.","Pretty moderate difficulty, but very little work required. Especially if you're a senior and want some time in your schedule, take this course over cs124.","Professor Valiant is a titan in CS! Although he is not usually the most exciting lecturer, the course covers many important topics in combinatorics and graph theory that every computer science major should be exposed to. The class is also skewed towards assignments so students can be less stressed out by exams.","It's hard if you don't have a strong math background. And I mean strong - like most of my classmates were math olympiads participants\/winners and had a knack for this sort of thinking. That said, it's not impossible to do and because it doesn't have any prereqs, if it fits in your schedule and you need the course this year, might as well take it. The book is pretty clear but the psets are harder than the problems in the book and you'll need to do a lot of practice problems. Lectures\/professor's handwriting are hard to follow; he's brilliant but that comes with its burdens.","If you've taken math 23 or above, this shouldn't be too hard.","This class is great!  The material is very interesting, and the problem sets are enjoyable and help with understanding the material.","This is a great class, lots of fun, and not too challenging. It's not too much work, psets usually have 4-6 problems which can be done in 1 night. However, they're often of the logic problem solving variety, so having a partner or group to work with will make this course a lot more manageable and fun. \r\nIf you've done contest math before, this class should be pretty easy for you. Some familiarity with proof techniques is useful. \r\nThis course should NOT be considered a substitute for CS124. I have no clue why CS concentration allows that. I took them both (taking both does not have much overlap) and this class is only tangentially related to CS; it definitely did not prepare me to be a good programmer like 124 did. If you're a CS concentrator, you should DEFINITELY take CS124 as a core class; AM107 is a fun side class but isn't really CS at all.","Such a great class! Honestly, doing these problem sets (especially the ones on graph theory) was so rewarding! With that said, it is a fairly difficult course, especially if you're not the best when it comes to combinatorics. But if you go to section \/ office hours and work with others on the psets, Applied Math 107 is a very rewarding experience! The lack of a final is also great!","This class is pretty interesting, but the first half of the course (graph theory) depends on you finding the trick to make the proof work. It's not hard, but it's annoying and tests are hit or miss.","This is a difficult and fast paced course. I don't know how helpful lectures are for completing the problem sets which account for most of the grade and can typically be completed during office hours the night before they're due.","Don't underestimate the amount of time spent on psets. Do go to office hours and you can get high marks on all the psets. Lectures are helpful on graph theory, the book helps a lot with combinatorics. In lectures, Valiant can be hard to follow but he often literally lays out how to answer questions on the psets, so it can be worth following.","The material is interesting, just hope for good TFs.","This is a really excellent class with an excellent professor. Expectations are clear, the support is there and the exams\/psets are challenging but rewarding. Exactly the way a math class should be.","Its hard","The lecture is a little dry, but the content is fascinating if you let yourself become invested in it.  I love the mind puzzles feel of this course and would recommend it to anyone who wants to embrace a fresh branch of mathematics very different from the traditional diffeq\/linearalg path.","This class truly focus on problem solving and helps you gain good intuitions about relevant problems. Prof. Valiant may be hard to follow at times but he has a brilliant mind and if appropriate effort is put in to the course one could learn a ton. I've taken both CS124 and Stat110 and still find this course interesting and challenging."]}},"mostRecentQ":{"overall":"3.70","workload":"2.80","difficulty":"3.50","recommendation":"3.80","enrollment":"39","response rate":"71.79","QCourseOverall":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"3","3s":"7","4s":"11","5s":"6"},"QDifficulty":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"1","2s":"2","3s":"10","4s":"10","5s":"4"},"QWorkload":{"number":"APMTH 107","course_id":"1120","cat_num":"6411","1s":"0","2s":"9","3s":"15","4s":"3","5s":"0"}},"success":true}