{"scores":{"Spring '14":{"course_score":{"overall":"3.80","workload":"1.60","difficulty":"2.60","recommendation":"3.80","enrollment":"100","response rate":"91.00","QCourseOverall":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"2","2s":"7","3s":"22","4s":"37","5s":"21"},"QDifficulty":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"8","2s":"31","3s":"42","4s":"8","5s":"1"},"QWorkload":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"38","2s":"46","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 2","cat_num":"0645","course_id":"3613","year":"2013","term":"2","id":"30f9167877f4c99514b61d9ed34158e3","first":" Osnat","last":"Netzer","InstructorOverall":"3.90","EffectiveLecturesorPresentations":"4.00","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Fall '12":{"course_score":{"overall":"3.51","workload":"1.99","difficulty":"2.83","recommendation":"3.75","enrollment":"151","response rate":"97.35","QCourseOverall":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"2","2s":"7","3s":"22","4s":"37","5s":"21"},"QDifficulty":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"8","2s":"31","3s":"42","4s":"8","5s":"1"},"QWorkload":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"38","2s":"46","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 2","cat_num":"0645","course_id":"3613","year":"2012","term":"1","id":"9a90e353e0d5a97f9d1c4f72fccddcb3","first":"Olaf Leon","last":"Post","InstructorOverall":"3.53","EffectiveLecturesorPresentations":"3.39","AccessibleOutsideClass":"3.76","GeneratesEnthusiasm":"3.92","FacilitatesDiscussionEncouragesParticipation":"3.60","GivesUsefulFeedback":"3.72","ReturnsAssignmentsinTimelyFashion":"3.83"}]},"Fall '11":{"course_score":{"overall":"4.67","workload":"1.73","difficulty":"2.34","recommendation":"4.79","enrollment":"108","response rate":"94.44","QCourseOverall":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"2","2s":"7","3s":"22","4s":"37","5s":"21"},"QDifficulty":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"8","2s":"31","3s":"42","4s":"8","5s":"1"},"QWorkload":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"38","2s":"46","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 2","cat_num":"0645","course_id":"3613","year":"2011","term":"1","id":"840c64a93f9dbd6d06256140e384edd3","first":"Richard","last":"Beaudoin","InstructorOverall":"4.84","EffectiveLecturesorPresentations":"4.87","AccessibleOutsideClass":"4.66","GeneratesEnthusiasm":"4.92","FacilitatesDiscussionEncouragesParticipation":"4.49","GivesUsefulFeedback":"4.57","ReturnsAssignmentsinTimelyFashion":"4.74"}]},"Fall '10":{"course_score":{"overall":"4.81","workload":"1.56","difficulty":"2.12","recommendation":"4.88","enrollment":"60","response rate":"98.33","QCourseOverall":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"2","2s":"7","3s":"22","4s":"37","5s":"21"},"QDifficulty":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"8","2s":"31","3s":"42","4s":"8","5s":"1"},"QWorkload":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"38","2s":"46","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 2","cat_num":"0645","course_id":"3613","year":"2010","term":"1","id":"840c64a93f9dbd6d06256140e384edd3","first":"Richard","last":"Beaudoin","InstructorOverall":"4.95","EffectiveLecturesorPresentations":"4.97","AccessibleOutsideClass":"4.91","GeneratesEnthusiasm":"4.98","FacilitatesDiscussionEncouragesParticipation":"4.68","GivesUsefulFeedback":"4.85","ReturnsAssignmentsinTimelyFashion":"4.85"}]},"Fall '09":{"course_score":{"overall":"4.82","workload":"1.84","difficulty":"2.46","recommendation":"4.79","enrollment":"59","response rate":"96.61","QCourseOverall":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"2","2s":"7","3s":"22","4s":"37","5s":"21"},"QDifficulty":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"8","2s":"31","3s":"42","4s":"8","5s":"1"},"QWorkload":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"38","2s":"46","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 2","cat_num":"0645","course_id":"3613","year":"2009","term":"1","id":"840c64a93f9dbd6d06256140e384edd3","first":"Richard","last":"Beaudoin","InstructorOverall":"4.95","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"4.81","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"4.57","GivesUsefulFeedback":"4.51","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Fall '08":{"course_score":{"overall":"4.32","workload":"2.36","difficulty":"3.00","recommendation":"4.20","enrollment":"39","response rate":"69.23","QCourseOverall":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"2","2s":"7","3s":"22","4s":"37","5s":"21"},"QDifficulty":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"8","2s":"31","3s":"42","4s":"8","5s":"1"},"QWorkload":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"38","2s":"46","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 2","cat_num":"0645","course_id":"3613","year":"2008","term":"1","id":"0b82469020f0bf7c9c8afb372d7e7d80","first":"Peter Andrew","last":"Gilbert","InstructorOverall":"4.04","EffectiveLecturesorPresentations":"3.78","AccessibleOutsideClass":"3.17","GeneratesEnthusiasm":"4.62","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"3.33","ReturnsAssignmentsinTimelyFashion":"3.33"}]},"Fall '07":{"course_score":{"overall":"3.59","workload":"1.79","difficulty":"3.05","recommendation":"3.85","enrollment":"55","response rate":"76.36","QCourseOverall":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"2","2s":"7","3s":"22","4s":"37","5s":"21"},"QDifficulty":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"8","2s":"31","3s":"42","4s":"8","5s":"1"},"QWorkload":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"38","2s":"46","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 2","cat_num":"0645","course_id":"3613","year":"2007","term":"1","id":"99269694db73fd48f99643989840ef2d","first":"Nicholas Paul","last":"Vines","InstructorOverall":"3.69","EffectiveLecturesorPresentations":"3.46","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.71","FacilitatesDiscussionEncouragesParticipation":"3.79","GivesUsefulFeedback":"3.40","ReturnsAssignmentsinTimelyFashion":"3.50"}]},"Fall '06":{"course_score":{"overall":"3.97","workload":"1.85","difficulty":"2.90","recommendation":"4.21","enrollment":"66","response rate":"68.18","QCourseOverall":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"2","2s":"7","3s":"22","4s":"37","5s":"21"},"QDifficulty":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"8","2s":"31","3s":"42","4s":"8","5s":"1"},"QWorkload":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"38","2s":"46","3s":"6","4s":"0","5s":"0"}},"instructor_scores":[{"number":"MUSIC 2","cat_num":"0645","course_id":"3613","year":"2006","term":"1","id":"0a3b45c1232f046360eaceac726328c6","first":"Joshua","last":"Fineberg","InstructorOverall":"3.53","EffectiveLecturesorPresentations":"3.39","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"3.95","FacilitatesDiscussionEncouragesParticipation":"4.04","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.33"}]}},"comments":{"Fall '07":{"comments":["This is great for someone who enjoys music and is curious about how to think more \"musically\" about their own performances.  It is not particularly hard for people who have background in music, and is a good way to satisfy the lit B core, but lectures can be boring... and if you know too much about music theory you might be bored in section too.","This is an excellent way to fulfill your Lit B core requirement, and would even be worth taking just as an elective.","Go over your intervals on your own!","I really enjoyed this class; it was a fun and not-too-stressful addition to my schedule","This class provides a good grounding in ear training and other skills that will contribute to good musicianship. I'd recommend it.","There's a decent amount of work concerning the various rules and terminologies of tonal music.","It's hard work, but incredibly fun and interesting.","A great Lit and Arts B core if you want to really learn technical aspects of music.  However, reservations if you have no experience at all with music theory.","take it if you have an interest in learning musical theory","It's a fun way to fulfill a core requirement if you have any interest or experience in music.","Shop this course, but only take it if you like both the professor and the TF. You need to be able to learn from both of them, or else you will have a wretched experience.","The professor is not fantastic, a lot depends on your TF.","It's fun, it's relatively easy (especially if you have a good ear and pay attention), and the homework doesn't even feel like homework.  Thus, it's everything Music 51 isn't.  Plus, above all, it counts for the core, so it's a good way to fulfill a requirement without feeling like you're wasting your time.","Great class!  (That was helpful, no?)","It's an awesome deviation from standard academic classes.  It teaches you a lot about a subject not touched in any other setting at Harvard.","this was my favorite class that ive taken at harvard (and this is my senior year). i thought the material was excellent, the teaching staff was great, and it was overall a very enjoyable experience.","Do it if you are interested in the theory surrounding tonal music and some historical commentary. Don't take it if you just enjoy music and are looking for a way to become a better, more skilled musician.","Don't take the course unless you have lots of extra time on your hands.","Chance to explore music interest whether it be theory for composition or theory for playing music","Unless you know absolutely nothing about music theory or you want an easy core class, go somewhere else to learn the aspects of music theory that you are interested in.","\"in previous years this has been a blow-off, arts-and-crafts class; this semester it definitely was not.  hopefully after they read the Q responses they'll make the final project a lot shorter.  all of the learning is done in section and the material is relatively fun to learn - if you're interested in music theory but haven't learned it yet, this is the course for you.\"","If you are interested in music, but not as a concentration, a great way to fulfill Literature and Arts 2 Requirement.","This isn't the most exciting class generally, but you come away from it with a good understanding of music theory, so take it if you are really interesting. Consider other theory classes here though too.","Dont take it unless you have a lot of experience with music","Good course for experienced musicians\/performers who never before took the time to learn all the supporting details of music theory.","Do not take this course unless the professor and\/or the material has been changed.","Try for Mike's section regardless of experience level."]},"Fall '08":{"comments":["The class was energetic.  The course was also surprisingly time consuming and challenging at times.","Be prepared to work hard. But it's an interesting course if you really need some basic music theory in the future.","This course is difficult if you have no background in theory or composition. It involves a lot of composition and ear training.","If a student is interested in the subject matter and has patience to really explore the composition and analysis assignments, it would be a valuable experience.","I would recommend this class.  It was more work than I thought it would be, but I learned A LOT about music and music theory.  It's a great opportunity to try your hand at some composing and hone some basic ear-training skills.","It does have quite of work involved, but it is a class that's worth it. The class itself is engaging, and it challenges to dance around the edges of the box.","The class was very interesting and also pretty entertaining.","This serves as a good introduction to the course. For those who have a background, you may find this course boring.","This is a good course to take if you really want to learn about music. It is a bad course to take if you are just looking to fulfill a Core requirement unless you have some prior knowledge of music theory or extensive experience as a musician.","If you want to learn how to compose music, take this class! It is a gradual introduction into composition that you can make as complex as you want it to be.","It is a real good class to take.","It is an interesting, easy core class.","This class takes time because of the nature of the assignments, but it's really fun.","This is the best way to fill your Lit and Arts B on campus. It's a very easy course, and is very rewarding as a musician."]},"Fall '09":{"comments":["It's not the easiest class but the challenges it provides are actually fun and applicable beyond the course material.  The faculty associated with the class are great - helpful, enthusiastic, etc.","This class is an empowering, painless introduction to music theory.  It gives you a deeper appreciation of how music \"works\" (without making it less enjoyable or moving), and the short, manageable assignments let you think creatively and give you a handful of mini-compositions you can be proud of.","This course is fun, easy, and will give you a solid background in the basics of music theory.","yes its a core but its a fast paced class.... dont get behind!","You can take this class with more or less any background in music, but it's definitely helpful to have some familiarity with notation. The class is a lot of fun and you will learn a lot about tonal music!","This was the best course that I have taken so far at Harvard.  The teaching staff was excellent and very approachable and the workload was fair.","Great class:  well taught, very easy, and an interesting subject.","If you like music and you like fun, take this class.","Know how to play the piano!","This is one of the best classes that I have taken at Harvard. Take it!","This class is great--I met so many great people through the sections too, and you actually get to create a song--a once-in-a-blue-moon opportunity. If you're a singer who wants to know more about theory, you'll love this course.","If Prof. Beaudoin is teaching it, TAKE IT!","Take it.","a good class; will be very easy for someone with musical background; someone with music theory background (AP or otherwise) should consider taking a more advanced music theory class","This is the perfect introduction to Music Theory for people who have little to no musical ability or knowledge, as well as those who are musical but lack theory, and is a perfect stepping stone to higher theoretical classes.","You should take this course if you are interested in composition or if you are eager to  learn about music and what it is behind. If you don't play an instrument it is ok, you can always start learning how to play the piano while you take this class and the TFs and professors will help you without doubt. This class is very exciting and it gives you a great introduction to music theory.","The class is essentially some nit picky rules on notation.  You won't really learn anything that will help you grow as a musician or a composer and the grading tends to be all or nothing, but it is fairly easy","One of the best classes I've taken and that's not because I found it pretty easy. It's a must take if you're interested in learning more about music theory and a great way to fulfill a Gen Ed requirement. Professor Beaudoin is also a great lecturer and a really cool person to get to know. It was one hell of a class.","Take this class! Professor Beaudoin is extremely entertaining.  His ability to explain music and make tonal theory accessible is astounding.","This is a wonderful way to fulfill Lit-B!","Do not take this as a fifth class or with a thesis to write.","This class is absolutely amazing.  It will change the way you listen to and play music, and you'll even get a chance to write your own music!  Professor Beaudoin's lectures are spellbinding, and the TFs form an extremely musical and capable team that make all music and theory come alive.  I think everyone should take it.","great, interesting, fun course that will teach you how to create your own beautiful tonal music","Be prepared to enjoy this class.","Such a fulfilling course!","Take it! I learned a ton, while having fun. If you have no background in music, I would try and learn some basics so that you are on a similar level to other people in the class.","This course is a great way to wet your feet with music theory.  The professor is fantastic, the teaching staff was always accommodating and willing to help.","This is definitely a fun course, with lots of opportunity for creativity amd actually, gasp, having fun doing assignments. It may disappoint students who are expecting a bit more in depth look at music, in which case a more intense class may be more to their liking, but this one, especially for a theory virgin like me, was more than interesting enough to take and I fully recommend it.","This course is not too difficult, but Professor Beaudoin still does an amazing job teaching everything in this class.","The best course I have EVER taken. Lectures will knock you off your feet.","Great course. Very entertaining professor and fun problem sets that let you write your own music.","I would tell students that have any sort of musical background to take the course.  It has greatly deepened my understanding of music, and it was one of the most fun classes I've ever taken.","Awesome course, very relaxed and fun, but you learn what you're meant to learn.  Great starting point for anyone interested in music with anywhere from none to a little background.  Most people concentrate in other fields so there's not a lot of pressure from that end.  Prof is awesome, as was my TF","cool way to learn music theory, music composition and supplement outside or extracurricular musical involvement (singing, performance, listening). if you want to work your mind in a new way, take this class. the professor is awesome, and you always leave passionate and energized by the material!","Professor Beaudoin is fabulous! He is thorough and engaging and expects a high standard of competency from all of his students, no matter their level upon starting. That said, do not be discouraged from taking this class, even if you can't read music. The amazing TFs will help you get up to speed with more advanced students. You cannot leave this class without having at least the basics of Tonal Music Composition.","This course will definitely teach you the basics of tonal music, including a bit of composition. Very good course.","It was so much fun! Best course I've taken outside of my concentration in my four years.","Some familiarity with music is good. Going in without any experience in music will make it hard to get the value of this course.","A terrific foundational music class to take for anyone who is interested.","Professor Beaudoin is incredible, the class is extremely well organized and interesting. Some of the homeworks take longer than expected due to the nature of the work but are generally well worth it.","Extraordinary class! A lot of work but it was really worth it.","This class is amazing.","I am not sure what I can say that would be useful as a recommendation - this course was just so good.  It is without doubt one of the best courses I have taken during my time here.","Such an interesting class!  The lectures were always epic, and they always left you gaping in awe of how awesome music is and how baller Prof. Beaudoin is.  TAKE IT.","This class is a fantastic introduction to tonal music. After taking this class, you will be able to understand the basic methods composers utilize to convey different ideas through music. Also, you will be able to compose fairly satisfying music after you take this course.","Incredibly fun, great way to get better understanding of how tonal music works and effectrs people"]},"Fall '10":{"comments":["If you are interested in gaining an understanding of some of the most fundamental underlying concepts in music, take this course. Professor Beaudoin possesses a rare command of and enthusiasm for his subject, and his energy is infectious. The assignments are unconventional and fascinating, and after the course, you will be capable of doing things, musically, that you never would have been able to do prior to the course.","This course is both good and bad. The material is very interesting and useful, but it often vacillates quite heavily between easy material and very difficult material. I won't look at music the same way again after this course, which is cool. My most important piece of advice for people considering this course is either know how to play the piano or be willing to work very very hard on your composition projects. Because Music 51 doesn't fulfill the core\/GEN.ED, many students who SHOULD be in that course end up taking Music 2 to meet that requirement and therefore are far too experienced for an introductory course. Playing the piano is a very 'Harvard' thing and so many students could play. This allowed them to easily compose music because they can play both voices at once and therefore can quickly test if their composition sounds good \/ if they made mistakes. If you don't have this background, be prepared to work hard on those projects to make up for this.","This class was a ton of fun and I learned a ton! Take it!","A painless and easy way to fulfill aesthetic and interpretive understanding while really enjoying a class. A must-take class for anyone interested in music.","The lectures are great!  Funny, interesting, and educational.","If you don't like writing or reading, this is a great and painless way to fulfill the Aesthetic and Interpretive Understanding requirement. Make sure to always go to lecture and pay attention in section.","Fantastic way to complete a Core\/GenEd. Professor Beaudoin is fantastic. You just want to sit down and listen to him talk for hours. Go to his office hours!","Professor Beaudoin is the best professor I've had at Harvard.  A true Renaissance man, he often employs analogies between music and biology, computer science, etymology, and other unrelated fields to enhance and elucidate his explanations of concepts.  I would take any class that he might offer in the future...he was that superb.  \r\nIn terms of the class itself, there are five homework assignments, two compositions and two exams.  They're all straightforward, totally doable, graded fairly, and, in retrospect, really fun.  After having taken this class, I'm now familiar with the objects and concepts of beat, rhythm, meter, staffs, time-signatures, pitches, chords, major and minor scales, triads, inversions, authentic\/plagal\/half\/deceptive cadences, pivot chords, modulation, arpeggiation, syncopation, Sonatas, and many, many others that I can't produce off the top of my head right now.  You'll never be able to listen to or look at music in quite the same way again (in a good way), and you'll be able to dissect mildly complex pieces of music with ease by the course's end.  You'll also be pleasantly surprised, maybe even delighted, when you look back and see how far you've come.  No music background is necessary at all.  Overall I'd say it was quite painless, I learned a ton and fulfilled a requirement, and even made some cool friends through this class.  It felt more like an extra-curricular than an actual class.","This is such an incredible class, especially for musicians and former musicians who are rusty on their theory. You'll never have this much fun with any other class. Take it, especially if you're interested in basic music composition. It's also just a great course for anyone who wants a slightly better understanding of the music they hear everyday.","If you love music but have never taken a theory class, this is the perfect course to take.","It's a wonderful course even if you think you know about music.  There is always more to discover and working your imagination to create your own pieces is so valuable.","THIS WAS THE BEST CLASS I'VE TAKEN AT HARVARD! Professor Beaudoin is amazing, funny, passionate, and he cares about how his students do in the class. Best way to fulfill the AIU gen-ed. Whether you have 10 years of music experience or no experience, you'll learn a ton and be composing by the end of the class. Not too much work, very manageable and enjoyable.","Lectures are interesting and concise, you know exactly what you will be tested on, and the professor is awesome","This is a good class, especially if you've always wanted to learn music theory or composition. Prof. Beaudoin is an engaging lecturer","Absolutely take this class.  It's so amazing!  Definitely my favorite class so far at Harvard.  And I'm saying that despite the fact that my section (which is 2\/3 of the class time) was horrible.  The class was good enough overall to make up for that!  And lots of people have great sections.","For those with many years of experience in music (I can't speak for other groups), this is a relatively easy Gen Ed course and a worthwhile one at that.  Though the first few weeks are spent re-learning how to read music, the course does quickly dive into more interesting aspects of composition.","Great class to take as a Gen Ed. I would say that a little bit of music background will make it easier for you.  Interesting and fun.","A great, solid class. Educational but light to take -- I found it enjoyable. Professor Beaudoin is a well-spoken, cheerful, and polite professor who gives fair exams, delightful assignments, and makes learning about music fun, no matter what level of musical background you have.","If Professor Beaudoin is coordinating this course, you will no doubt come out with a new understanding and enthusiasm for hearing music theory at work in all kinds of music.","Why would you fulfill your Core or Gen Ed with anything other than this course? Don't take a class where you listen to music and talk about how it makes you feels. Take this class, where you learn why it makes you feel the way it does. This is a truly beautiful class.","With this class, you get out what you put in.  You have the potential to learn quite a bit.","This class is amazing.  The professor is incredibly enthusiastic about the material and you learn so much about music.  It's a great feeling to perform your compositions and realize by the end of the semester that you have created an actual piece of music.","If you want to learn music theory, take this class. The material is great and Prof. Beaudoin is amazing.","Professor Beaudoin is the best professor I have ever had here. He knows exactly how to explain music in a way that connects with students and makes understanding music both easy and enjoyable. The course doesn't have much work, yet you learn so much. You will leave the course with a new appreciation for music as well as faith in Harvard professors. Unlike many professors here, Professor Beaudoin and his staff dedicate their time to actually teaching. Helping students learn is their number one priority, rather than research or something else. In addition, every time I leave Professor Beaudoin's office hours, I feel so much more confident in my abilities as a student of Music 2 as well as a musical theorist in general. If you are interested in music at all, take this course! I cannot emphasize how much this course rocks!","if you've a good amount of music background but would like to take the class (perhaps for a core\/gen-ed), go to office hours -- Professor Beaudoin and your TF will know a lot and can definitely satiate your curiosities.","My favorite class so far at Harvard. Professor Beaudoin was incredibly engaging and the sectioning system ensures that you learn at an appropriate pace.","Professor Beaudoin is Amazing!","Awesome course...not only was it a great was to fulfill A&I gen ed, it was the one class I actually wanted to go to.","Take this class if you want to gain the ability to compose simple tone music and you're starting from nothing.  If you have a lot of music experience, you should probably take a more advanced course.  This class sort of assumes you can play the piano, but you can probably just use software to hear your composition if you can't.\r\nThis class is an absolute pleasure - the lectures are engaging, and the projects are a joy.\r\nAll important course material is presented in lecture; the textbook isn't very helpful.  You should finish a draft of your composition early so you can go over it with your TF and the professor.  Exams are intentionally straightforward.","It's amazing. Period.","This class is GREAT! Even if you have absolutely no experience you can take this class (I didn't even know how to read music)","This class is very good for people who want a basic introduction to music theory without having to do boatloads of work.","Excellent class.  Highly recommended to everyone, regardless of music background","It's that rare breed of class that is both easy and fascinating. Much more material is taught than is actually tested, so you still learn a lot without having to stress about it.","Music 2 = AWESOMENESS","Although it is definitely a class you can take without any music background, I would recommend being familiar with piano.","Take this class. Very cool. So much fun.\r\n\r\nIt's not that much work, and the first few weeks are very easy if you have any musical background. The later homework assignments and compositions take a bit more time but it's really fun to write your own music.","If you're into music, you probably know everything in this course.  You can take it if you really want to take a course that you spend no time on, but you won't really get anything out of it, other than a fulfilled GenEd.  If you AREN'T into music, it should be a great introduction for you.","Great class- best class to do the art and interpretive understanding requirement. Beaudoin is phenomenal and i looked forward to some of the lectures. They really teach you music, even if you have no idea how it works. Good job!","This is a really fun and painless way to complete the Lit and Arts B core. Professor Beaudoin is an amazing lecturer! The assignments are all short, but I found myself spending large amounts of time on them just because they were fun and I wanted to make them perfect!","Great class! The professor is amazing, and the only points you'll miss are from stupid mistakes.\r\n\r\nAlso, they tend to lottery the class and give preference to people who need the course to satisfy a gen ed\/ core requirement. DO NOT take a Lit B or Aesthetic and Interpretive Understanding course before this class. If you do, you won't get lotteried in!","This class is amazing. Professor Beaudoin is incredible. Take this class."]},"Fall '11":{"comments":["This is a great course if you want to learn the basics of tonality.  If you play any musical instrument, this might help you understand the music you play.","I enrolled in this course initially because I thought it would be a simple, painless gened.  And while it was certainly painless, it was also one of my favorite classes that I've ever taken at Harvard.  The material is really engaging, and that coupled with Professor Beaudoin's insane enthusiasm and the absolutely brilliant section leaders truly makes this course one of the best the College offers.  The assignments are more than painless, they are incredibly enjoyable.   With all the craziness that is college life, it was really great to be able to sit back, relax, and enjoy the compositional process for a few hours each week.  If you can, definitely take this.","This class is unbelievably AMAZING!!!!  I've hated almost every class I've taken here, but this course was virtually flawless.  The teaching was incredible, the material was fascinating, the class was impeccably planned\/organized\/run, the assignments were straightforward (and FUN!), the grading was fair and consistent, and everything else was just perfect.  This has been BY FAR my favorite class at Harvard, and I wasn't even interested in music before.  Do NOT miss your opportunity to take this class... it will recover your faith in Harvard education!!!  Seriously.  It was perfect.","Having a background in piano is extremely helpful for the class. The course staff is amazing, and although the course is easy, it can be challenging if you want it to be.","This is a really fun class, and it will help you gain an even greater appreciation for music than you likely had before if you're shopping it. Lectures are AMAZING - professor beaudoin is truly a fantastic teacher. He is smart, engaging, and hilarious, and I learned quite a lot (and gained confidence in my composition skills) while having a really enjoyable time. Best Harvard lectures I've ever attended.","Incredible class. You learn a lot, it is taught brilliantly, and you definitely take a lot away from it.","A great survey of basic music theory for both people who play\/love music but don't know theory, or those who are complete beginners. Extremely enthusiastic prof, great material, wonderful assignments.","This class is excellent for people of all musical levels.  What's more, Professor Beaudoin is a BAMF.  I would have audited this course just to sit in lecture and try to soak up his wit.","best class ever.","A well-taught, well-run course.  Professor Beaudoin is simultaneously hilarious and brilliant.  Composing is no quick task, and I sometimes found myself at the piano for hours. Creativity, while encouraged, is only a small part of the grading rubric.","unbelievable class. professor is unbelievable - get to know him!","Though I had very high expectations for this class and lotteried twice for it, having heard very good reviews, I was ultimately extremely disappointed. It is not for everyone, because those with more knowledge are probably bored and those with less very confused and left behind, especially in terms of the composition projects. The class really should be re-thought with regard to what its goals are, what it wants its students to come away knowing, how they can best learn that, and whether it can really be taken by anyone, because the class has so much potential but does not carry through for all students, and it does not market itself as a composition class though that is what it is. Exam credit is all or nothing, and assignments do not always seem sufficient for understanding the material for the compositions. However, Professor Beaudoin is extremely engaging, committed, and knowledgeable, makes a point of learning every student's name, and is incredibly approachable, so if you are interested and willing to take the time make a point of meeting with him because he is a really incredible, intelligent faculty member. The live performances are also really great. Your expectations or understanding of the class may not be what they at first appear to be so do your research.","Professor Beaudoin witty humor is alone reason enough to take this class. If this is your first music theory and comp class, you see how far you will have come in your final composition project. I was more proud of my final composition project than anything else I accomplished this semester because in the end I created something that sounded beautiful despite starting off in the beginning of the semester with no musical background or talent.","If you truly have no musical experience, you will be put at a disadvantage","Super fun class where you learn a ton if you don't know the first thing about composing or theories behind music in general","Professor Beaudoin is a really awesome guy and a very engaging lecturer. The course really gave me a lot of practical skills in music theory that are now so ingrained in my head that they have become second-nature to me. This is a testament to how well this course is taught and structured. I honestly enjoyed being in this class and had a lot of fun writing my own compositions. Do yourself a favor and take this class before you graduate if you have any interest at all in music!","prof beaudin is a fantastic lecturer and you will look forward to weekly lectures. if you are taking this class because you think composing will take less time than writing papers, you are mistaken... I spent way longer on the compositions than I do on papers, but it's SO worth it! if you're not a music concentrator, you will probably not take another course at harvard like this one. even after this course, you will listen to music differently. also, if you think the course only deals with tonality in classical music, you will be pleasantly surprised that prof beaudin and section leaders do a really good job relating tonality to various kinds of music.","Take this course!  Or if you can't lottery in, try to take this course now so that you'll have a better shot next year.","Great senior year class: workload is manageable and the assignment are enjoyable. It will make you appreciate music once you understand the fundamentals! It's so worth it to come away with skills that you can continuing using even after the class ends. For example, I intend to keep composing in the future. It does move a little quickly, so keep up in section and use office hours.","An interesting and laid-back class that is well organized - a great way to fulfill the GenEd requirement.","Give time to the composition projects","It's a fun, relatively stress free class with a hilarious instructor (if you get Prof. Beaudoin) and all components of the class (section, lecture and the assignments) are fun and each of obvious relevance and benefit to the course.","If you have any interest in music whatsoever, regardless of whether or not you are a performing classical musician or a casual listener to popular music, this class is amazing. It can be difficult to get into, but if you have the chance it is well worth it. Professor Beaudoin is a fantastic teacher, one of the best I've ever had, and the material is taught in an easy to follow fashion. Furthermore, when the class is broken into sections, you are placed with students at similar skill levels, so don't worry if you know nothing about music.","If you have music background, you DO NOT WANT TO PASS THIS CLASS UP as an excellent, fun, chill Gen Ed. Professor Beaudoin is excellent in lecture and one of the most amazing professors that I have gotten to know outside of class. My TF Bert (who teaches those of us with a good amount of music background) is also a chill, fantastic and very helpful TF. I have opted to go to his office hours just to chat, instead of going to the (somewhat useless) one for the class that I really should go to (just to make a personal connection with the teaching staff). Since there's a vacuum in Music 1b for an excellent lecturer, I would say this is THE CHOICE Gen-Ed music course, so get your composing on!","Definitely one of the best courses I've taken at Harvard. I took it without any musical background, and though there are people who know quite a bit of music theory beforehand in the class, the exams are very fair and the material is covered at even pace. \r\nLearned a lot of musics and compositions are fun.  Course staff also cares a lot about students. Beaudoin and Trevor were awesome.","it's a lot of fun.","It's a good introduction with an engaging professor, and not difficult at all.","Amazing! Best and most well ORGANIZED class at Harvard! If you are dealing with a lot of flaky professors in a semester, take this class as it will be the highlight of your schedule and give you no headaches.","There's a reason this class is so popular. Professor Beaudoin is an extremely kind and interesting guy and taking this course will teach you so much about tonal music in just a short period of time. Definitely has to be one of the best classes out there, and doesn't require much work, but you'll most likely spend lots of time on your compositions because they're enjoyable.","AWESOME class.  One of the best I've taken at Harvard.  Beaudoin is the Malan of the Music department - makes composing entertaining, approachable, and utterly cool.  If you get the opportunity, I'd save the gen ed category for this class!","This class is the best gen-ed I have taken so far at Harvard. Professor Beaudoin is an extremely engaging lecturer with a lot of attention to detail. If you haven't taken a music class before, this class may change your way of perceiving music.","It's awesome! It's not much work, but you learn a ton (more than anything, you learn to think about music; you go beneath the surface). At the beginning of the semester I didn't know how to read notes on a staff; at the end, I composed a piece of tonal music. That pretty much tells you how great the course is!","This class is a rare find in easiness combined with genuine interest that is generated by the class.  It is not just easy, it also instills knowledge and enjoyment in an academically very constructive way, better than courses that strive for difficulty and rigor.","Definitely take this class if you have ever thought about trying to compose - the fail-proof formula of tonality will guarantee your piece sounds good! Also, if you have already taken you Aesthetic and Interpretive requirement, there is a good change that you are not going to get into this class since there are a limited number of spots and people know that it is good. Also, this class is going to make you wish there were more lectures.","Excellent class for aspiring musicians and music-enthusiasts of all levels.","great class for a gen ed if you are at all interested in music","Music 2 is incredibly fun. The composition assignments are interesting and invigorating, and Beaudoin is a fascinating lecturer - if he's still the course head, this is almost certainly the best way to fulfill Aesthetic and Interpretive Understanding for almost anyone with any interest in music (who, I guess, isn't already a music major with 51 under his\/her belt), particularly when they wish at some point to play a role in a creative musical process.\r\n\r\nHaving said that, though, a note about grading: this course does not believe in mercy. When they say that they care very little about the musical perfection of your composition, they mean that if you spend a lot of time on that, enough to lose time you could spend checking the technical aspects of the composition or pure theory parts of your assignment, your grade will suffer. Case in point (and I admit that I say this at least half angry at myself for not paying enough attention): I worked my butt off on the compositions, and I knew my stuff, as was reflected in my exam scores; but I doubt either will be reflected in my final course grade.","It is incredible. I love music and have a lot of inherent theory knowledge (as in, there are a lot of things I understand musically that I didn't know by name), but this class really helped take me to the next level in terms of musical understanding. It's really helped me to understand my songwriting and composition better which makes the process a lot easier!","BEST CLASS EVER. EXTREMELY manageable and enjoyable workload to compliment a hard Harvard schedule.","It's not as easy as it 's billed to be. The theory can be a bit confusing if you're new to music. However, it's still a great course.","Do it! You will never regret taking this class, simply impossible.","This is by far THE BEST CLASS I have ever taken at Harvard.  If you have taken music theory before in high school, don't take this course. You'll probably find it too slow.  If you have never taken music theory before and have no experience in music, TAKE THIS COURSE! You'll be taught the basics in a very accessible way.  It's very rewarding to learn music theory and then demonstrate your understanding by composing your very own piece of music!  If you have musical experience (from playing an instrument, especially a classical instrument) but have never taken a formal music theory class, TAKE THIS COURSE!  You'll be able to understand all types of music in greater depth (in addition to teaching the basics, the staff also whet the appetite of students who are more advanced) and you'll get a chance to compose your own pieces!  Professor Beaudoin is also a very passionate, funny and awesome lecturer, and he definitely makes the course worthwhile.","take this class!!! Music 2 was by far my favorite class this semester. Prof. Beaudoin's lectures were funny, smart, and memorable. He brings in live performances and recordings of everything from bluegrass to pop to classical to show the broad range of tonal (and atonal) music. The assignments were never boring and you leave feeling like you've mastered some of the foundations of music theory.","Music 2 has been the most enjoyable class I've taken. As someone with no previous musical experience, I found the class to be one of few opportunties at Harvard to try something totally new. Most of your time is spent in section, so I can't speak for the other groups, but my TF and section experience were great. The work can be time-consuming but is actually fun as long as you space it out.","Possibly the best way to learn a bit about music theory","If you already know a lot about music, this class will probably be easy for you, and you should think about taking a harder music class.  If this is your first introduction to music, you should DEFINITELY take the class.  I knew next to nothing about music coming in, and this class helped me to be somewhat proficient in discussing technical music, and I learned so much, maybe more than in any other class, by composing.  It was a different kind of learning assignment than you usually get at Harvard, and it was a breath of fresh air.","This class is so fun and easy!  Beaudoin is really funny and earnest - this class is doable for any one at any level.  I am a performer, I never composed or analyzed music before this class, and I thought the assignments were pretty fun (more challenging at the end of the class, of course) and took a reasonable amount of time for a gen-ed.  I recommend this class to anyone looking for a fun and painless AIU.","Absolutely fantastic course, can't think of a better way to satisfy A&I. Very manageable, interesting material, and amazing lectures.","Take this class, it's a ton of fun. Unless you are in VES, it is hard to be creative in most Harvard classes, and this class is a great outlet for that. Beaudoin is the man, a very energetic and engaging lecturer.","By far one of my favorite classes at Harvard. Professor Beaudoin explains concepts very well, and lectures are always a treat to attend. This was a wonderful way to fulfill a gen ed, and is probably one of the only classes I'll remember years from now.","Unfortunately, having perfect pitch doesn't really help you in this course, so if you think you're some kind of musical genius because you have it, think again. You probably don't know key signatures or the circle of fifths even. So you need to work just as hard in this class as in any other because it's not about what you might already know.","not much work, interesting, and beaudoin is awesome.  is certainly somewhat tough for people with no music background, don't let anyone tell you otherwise, but still manageable and interesting","You must take this course!!! It is so much fun and you will be very proud of yourself when you are able to compose a piece of music in just a few short months.","Professor Beuadoin is a God. If you are looking for a fun and easy course, choose Music 2!","If you're lucky enough to get into this class, congratulations! (Don't fulfill your A&I gen-ed with anything other than this class or you'll be essentially ineligible to take it!) The lectures are sensational, your section is personalized to your prior knowledge of music, the composition assignments are extremely fun and unlike anything I have had to do in college so far, and the course material is relevant to each and every day of my life. I feel really thankful that I was able to take Music 2 with Professor Beaudoin.","It's interesting material, but it's extraordinarily easy to get behind. If you get confused, go to office hours immediately. But the projects are fun!","AMAZING. I genuinely enjoyed going to class every week, and it was great for me personally to have a class that was so fundamentally different from the other classes I was taking. It was challenging, but in a wonderful way - it stretched me to think in different ways and create something so different from the work I do in other classes. The teaching staff is brilliant and supportive and funny and overall, absolutely wonderful, and the material is really fun to learn. I learned so much in this class and feel like a much more informed music-listener! \r\nI don't consider myself a terribly creative person so I was initially hesitant to take a class where I would be expected to compose actual music, but these assignments were very well structured and quite enjoyable to do if you gave yourself the time to do it right. I remember reading in evaluations that you were at a disadvantage if you didn't know how to play piano when it came to composing, but you can download free trials of composition software to help you hear the music as you compose it, so don't let that deter you from taking the class!","A refreshing journey through tonal music. You'll start from home base (no\/minimal background), modulate through the chords, ahem, homework that Music 2 assigns you, and end where you were to begin with, only with a great deal of knowledge about common practice tonality. Music 2 is one of the best classes at Harvard, and has been for a few years-- definitely take it if you are even remotely interested in music.","GREAT CLASS. Beadoin is amazing and a great lecturer. It really helps you understand tonal music and get a start with composition.","This is a really great and easy way to fulfill AIU even without any music background. Make sure you get Trevor as your TF. He is amazing and very knowledgeable, so he explains all the concepts very well. If they have Olivia back as a TF, make sure you avoid her. According to my roommate's experience with her, she was a nightmare for not teaching them anything.","Professor Beaudoin is hilarious and smart and clear. Super entertaining plus you learn why you like the music you do. Take it.","This was the perfect course; the workload was just right, the composition projects were a pleasure to do, and I learned a ton about music. I would strongly encourage anyone with the slightest interest in music to take it.","One of the best classes I've taken at Harvard, and Beaudin is one of the best lecturers I've had. Even with my relatively small theory background, I found this class quite easy, to be honest. But extremely enjoyable and with lots of room for creativity.","Its a great way to get your gen ed requirement. Enjoyable, not too much work, if you are not too intense of a musician, its great to get to learn about something completely differet - you're not doing psets or writing papers, you are writing music.","This is such an AMAZING class! Everything about it -- the material, the teaching, and even the assignments (I know, right?). This is the probably the best and most fun way to fulfill the Aesthetic\/Interpretive requirement. Also a great elective if you want to learn about tonal music. A music background is helpful but by no means necessary to do well and enjoy the amazingness of this course!","For those with music background, this is THE EASIEST AESTHETIC AND INTERPRETIVE UNDERSTANDING GEN ED YOU COULD POSSIBLY IMAGINE DO YOURSELF A BIG FAVOR AND TAKE IT","Great lectures - Beaudoin is hilarious. Overall experience varies depending on section leader. Definitely a lot harder if you've never played piano before.","Music 2 is an easy class but not a joke class. You learn so much about music and can go from not knowing how to read a single not of sheet music to writing a full composition in one semester. It's great.","Music 2 is wonderful. Take it. Please.","It is a very enjoyable, lightweight class that is a good first taste of theory and composition","You should take this class if you're interested in learning about music. Don't worry if you don't have a background in music, you can still take the course. But you'll have to work more."]},"Spring '14":{"comments":["This is a great gen ed. There are sections for people with all sorts of music backgrounds, and you need none to succeed. You'll come out being able to analyze music and thus appreciate it more. You can even compose simple melodies and harmonize them.","Take it if you really have no knowledge of music theory. I had some, so I thought the class was super easy and not very interesting.","Take this course! It's really low stress and fun. I learned so much and never felt like I was drowning in work because assignments were short and straight-forward. As a singer who had no theory background, I'm really glad I took this course and now have a whole new understanding of music.","Having played the violin for many years but never taken a music theory class, I really wanted to gain an understanding of basic music theory and learn the tools for composition. While I did accomplish that to a good extent, I was rather disillusioned by the fact that we could never be truly creative. Even the \"creative\" assignments had very strict guidelines and gave us little room for deviation or individuality; in fact, I oftentimes felt like I was being punished for taking risks, and eventually stopped taking risks altogether to play it safe and save my grade. Other than this disheartening aspect, I found the lectures really fun (Osnat is so funny in a dorky way, and passionate about music!) and learned a lot.","Look up answers on the placement exam to make sure you get a good tf.","Take this class if you think you will enjoy music theory, or if you think you can tolerate it and would prefer not to fulfill your A&I requirement with a class involving a ton of reading. That said, composing takes a surprising amount of time.","This is definitely the course for those completely unfamiliar with basic music theory. Professor Netzer is incredibly nice and engaging. Her lectures are very well thought out and entertaining. Don't come into this course expecting to analyze specific composers, time periods, or the like. It's specifically geared to understanding the fundamentals of the tonal system and acquiring skills that can be used to analyze any piece of Western music.","The class is definitely on the easy side if you have music theory experience. That said, it doesn't make the class any less fun, and if you are experienced you'll be in a section with other experienced people as well, so this is still an excellent option if you are looking to fulfill this gen ed requirement.","If you don't have a heavy music theory background and want to expand your knowledge and understanding of tonal music, take this course. It won't be easy, but that's not the point.","Absolutely do not take this mess of a course. It's taught entirely in section, which is terrible because many of the TFs do not know what they are doing (mine couldn't even play piano). The grading is completely arbitrary and harsh, and we spent way too much time doing nitty-gritty figured bass instead of learning about other parts of music theory. STAY AWAY.","amazing course! but only take if you have a previous musical background or you will be lost","This was a fantastic and very unique course. As someone with very basic music background coming in, I really grew a lot as I was guided through my first terrifying composition, a lot of singing, and otherwise learning music theory in a very hands-on manner. The flexible nature of the class and sectioning means that the course is very much a good fit for people coming from a variety of music backgrounds. The professor was great, although my section leader was a little unclear at times. Music 2 provides a fun reprieve from the normal array of classes while also leaving you feel like you learned a lot.","This class is fun, interesting, and relatively easy (if you put in enough effort and time). Prof. Netzer is a very enthusiastic teacher, and the TFs are excellent!","This class was my favorite class of my undergraduate experience. The teaching fellows are awesome, the topic is incredibly interesting, and it is taught so well! Do take this, music experience or no!","This is a wonderful course","Much more theory and far less actual \"exposure\" to music than you will expect.","If you want to learn basic music theory, it's worth taking even with its faults.  If you just want a cool elective, probably not worth the frustrations.  Sections are not divided entirely correctly in terms of ability, so it can be pretty frustrating.  Homework is often and can be tedious, but sometimes it's kind of fun.  The assignments can also be fun, but can also sometimes be frustrating because we don't always learnt the concepts and methods completely before we have to use them.","This is a good class, I assume... if you get a good section leader.\r\nDr. Netzer (the professor) was really cool, put a lot into the lectures (coming up with cool examples from around the world and adding lots of variety), clearly likes the topic and teaching it, and she also really seemed to care about the students.\r\n\r\nBut... Although my section leader was a cool guy, he just wasn't a particularly good teacher and as a result, my experience of this class wasn't great (the class is only 1\/3 dr. Netzer).\r\n\r\nTL;DR--If you're interested in this class, don't sign up until you've been to a section or two... if your section leader is bad, DO NOT take this class.","the course is good. you'll get what you put in.... lotta foreigners on the teaching staff... lotta accents to try to understand","Although I learned a fair bit about music theory, this course was not the most engaging nor the best organized.","Music 2 is a fun and pretty chill way to fulfill the A&I gen ed requirement. Composing tunes is way more fun than, say, writing response papers or doing problem sets -- the work, especially the creative projects, hardly feels like work at all. Osnat was a really cheerful lecturer too. Even if you play music, or have some experience with theory, you definitely still learn a lot, such as some of the history of where all the rules you learn come from, and just getting personalized feedback on creative assignments.","Good way to fulfill the AIU requirement if you're quantitatively oriented or paperphobic. Gives you a greater understand and appreciation for music.","The course quality depends a lot on your TF (given that the class is 2 sections, 1 lecture), which is hit or miss. You're not supposed to need any music background, but quite frankly that's not really true (maybe I was just placed in the wrong section). Piano skills are definitely a huge advantage -- half of the people in my section could instantly recognize chords, key signatures, intervals, etc. before it was covered. A few of them had perfect pitch and a lot of piano background so it wasn't clear why they were taking the course at all, but essentially in an uncurved course this is not going to be good news if you're an actual beginner.","Everyone who takes this class has a little bit of music experience. It shouldn't be a problem as long as you get a competent TF (which does NOT always happen).","If you want to learn music theory and are a beginner or kind of beginner, definitely take this class! It fulfills a gen ed, it's well structured, and you gain a (somewhat) practical skill. As a musician, this course helped me grow a lot.","If you're ready for it, you'll learn much more than basic tonal theory. What's great about this course is the deeper, philosophical meaning you get out of lectures and the structural training you get in section. You're assignments, creative project, and ultimately the take-home final focus 90% on the logistical theory you learned in section, rather than the sometimes confusing rhetoric you'll hear in lecture. This is great because it makes the bulk of your assessments objective with a little room for your subjective interpretations of the material.","This course depends a lot on you. If you love music, and want to learn more about it, it's a pretty good course for you to explore. If you play an instrument, and you're taking this class to learn more, it might be easy to slack if it's not your top-priority, because the assignments aren't that hard (but that also depends on your section, because I was placed in the wrong section due to scheduling issues). This course helped me realize I don't want to take more music classes, but it could easily do the opposite, if you're interested. I didn't particularly enjoy this course, but I think a lot of people did.","If you're the kind of person who's always wanted to deepen your understanding of music through music theory, TAKE THIS COURSE. There are practically no downsides. The lectures are really interesting, and the assignments help you practice the concepts you've learned without being too difficult or time consuming. And the TFs all seem really nice and cool.","Good way to help you understand music! Does a good job of varying the intensity by section based on your initial capability","This is a very easy and fun class if you have any background in music.","Music 2 is a great intro class for those who may play an instrument but have never taken the time to do music theory. A very painless way to do the AIU gen ed. I would recommend taking the placement test at the beginning seriously; don't cheat but also give it your best shot. The section component of this class is very large, so the difficulty level of your section can make or break the class for you.","This class was annoying in that they require section and lecture attendance. As well, the material is not presented that clearly, and standards are not laid out clearly in the beginning of the semester. I felt like I finally understood how to do well in this class the last week of class.","The materials for this course were well prepared, and a lot of effort has gone into making this course fun and educational, whether you have never studied music before, or you are a seasoned veteran. The section component was especially well taught.","Netzer is great, but this is a class that revolves largely around section. If you don't like your section, SPEAK UP. Don't sit through a bad section, it really impacts your experience in the class.","Professor Netzer was energetic and always interesting to listen to, but the course felt unstructured during sections.","Music 2 was a wonderful course. The class was well-paced, the textbook was clear and useful, the four creative projects were quite fun, and sections were a great complement to lectures. Professor Netzer's enthusiasm for the material was contagious, and her lectures were always engaging.","This year the lectures were hard to follow and there wasn't as much freedom on the creative compositions as compared to what friends who took this class in past years experienced.","It's a great Gen Ed to take, and you learn a lot about how music works. Definitely a great way to satisfy the AIU requirement if you're at all a musician.","This was a good course, though it is highly dependent on the section you are placed in.  Hopefully, the professor standardizes things across sections better next year.","It's a chill, but fun class that's great if you've never taken music theory before.","I think for what it is, this class is fine. I had serious issues with how disorganized the lectures were and how they seemed to jump from topic to topic at points. I took this class in order to better my composing and arranging of contemporary music, but the course focuses on the fundamentals of classical music and rarely addresses contemporary music, so that was a bummer. If my section leader wasn't so awesome, I would have had a much worse experience.","In the past, this course has had very high reviews, but it was with another professor. Professor Netzer is really nice, but I didn't find her lectures very helpful, and I don't think I learned a lot in this class. Lectures were definitely accessible, but not much material was covered. Important tips for composing or doing voice leading that we would have to do for homework were not emphasized or mentioned only when someone asked a question in section. I'd say it was a pretty painless way of fulfilling your A&I requirement, and you do get an introduction to music theory. One problem is that music theory can be very easy for one person to pick up, but someone else may have a lot of trouble trying to pick up the system for voice leading, chord progressions, etc. I fell into the latter group, and I still liked this class, but it was definitely frustrating.","I absolutely love music, and it's always been a huge part of my life. My life in music though has always been experiential - that is, I had never had a formal training before in music theory, even though I sing classically and with so many great musicians. I took this course hoping to get a better understanding of the discipline and activity I love so much. I am really glad that I took this course, for it has taught me a lot. But honestly I was expecting a bit of a better experience in the class. I think because of the way it was taught\/run, class just wasn't as interesting as it could have been, which is too bad, because it is so wonderful. Section sometimes confused concepts to me because it wasn't so clearly run, and I wish that lecture had been a little more interactive. It shouldn't be a discouraging factor from taking the course, but I do hope that it improves in the future!","I think that Osnat is a great lecturer, and assignments are pretty fun, but section can be hit or miss.","Music II is great for students who like music or enjoyed playing in ensembles, but want to learn more of the theory side. Great course for aspiring composers, or those who want to understand more about how melody\/harmony\/chords interact.","I've heard this class has been phenomenal under other teachers. It was terrible this go around. If you want to get into music, I suppose its a must. Hold out till the professor changes.","Really easy way to learn some basic theory. Doesn't go much beyond the basics, but I do find myself better able to interpret music now","This class has maybe been my least favorite so far at Harvard.","This course is a fun introduction to music theory.  Not too challenging but also not easy.","This is a great class for people who are interested in music but have not had any (or much) formal theory lessons.","This class is really only for people who have NEVER taken theory.","Not a lot of work every week. Didn't even open the textbook one time.","Music 2 is a great introduction to engaging with music on a level beyond instinct and exposes you to commonalities in great works of art that set the students up with tools for creating such works of their own.","Good course, well taught. Would have been nice to have a bit of experience musically beforehand but I learned a lot."]}},"mostRecentQ":{"overall":"3.80","workload":"1.60","difficulty":"2.60","recommendation":"3.80","enrollment":"100","response rate":"91.00","QCourseOverall":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"2","2s":"7","3s":"22","4s":"37","5s":"21"},"QDifficulty":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"8","2s":"31","3s":"42","4s":"8","5s":"1"},"QWorkload":{"number":"MUSIC 2","course_id":"3613","cat_num":"0645","1s":"38","2s":"46","3s":"6","4s":"0","5s":"0"}},"success":true}