{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"1.90","difficulty":"2.70","recommendation":"4.10","enrollment":"19","response rate":"84.21","QCourseOverall":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"0","3s":"3","4s":"6","5s":"7"},"QDifficulty":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"6","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"6","2s":"6","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"VES 72","cat_num":"6997","course_id":"5177","year":"2013","term":"2","id":"7ee315cd84690f3848f0513bb2565bb9","first":" Laura A.","last":"Frahm","InstructorOverall":"4.60","EffectiveLecturesorPresentations":"4.50","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.60","GivesUsefulFeedback":"4.40","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '12":{"course_score":{"overall":"4.05","workload":"1.86","difficulty":"2.55","recommendation":"4.23","enrollment":"26","response rate":"84.62","QCourseOverall":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"0","3s":"3","4s":"6","5s":"7"},"QDifficulty":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"6","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"6","2s":"6","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"VES 72","cat_num":"6997","course_id":"5177","year":"2011","term":"2","id":"4c5d829ed3e7ef5a2ff4d73d7aece084","first":"Rebecca Anne","last":"Sheehan","InstructorOverall":"3.91","EffectiveLecturesorPresentations":"3.86","AccessibleOutsideClass":"4.06","GeneratesEnthusiasm":"4.18","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '10":{"course_score":{"overall":"3.64","workload":"1.77","difficulty":"2.59","recommendation":"3.77","enrollment":"27","response rate":"81.48","QCourseOverall":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"0","3s":"3","4s":"6","5s":"7"},"QDifficulty":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"6","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"6","2s":"6","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"VES 72","cat_num":"6997","course_id":"5177","year":"2009","term":"2","id":"afcab0b47c477447ba01a06e5127d544","first":"Ted","last":"Barron","InstructorOverall":"3.50","EffectiveLecturesorPresentations":"3.33","AccessibleOutsideClass":"4.11","GeneratesEnthusiasm":"3.57","FacilitatesDiscussionEncouragesParticipation":"3.57","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '09":{"course_score":{"overall":"4.03","workload":"2.37","difficulty":"3.42","recommendation":"3.84","enrollment":"44","response rate":"86.36","QCourseOverall":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"0","3s":"3","4s":"6","5s":"7"},"QDifficulty":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"6","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"6","2s":"6","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"VES 72","cat_num":"6997","course_id":"5177","year":"2008","term":"2","id":"675f4024601c18c29f7a2b9d9d85bb27","first":"J.D.","last":"Connor","InstructorOverall":"4.43","EffectiveLecturesorPresentations":"4.57","AccessibleOutsideClass":"4.47","GeneratesEnthusiasm":"4.56","FacilitatesDiscussionEncouragesParticipation":"4.10","GivesUsefulFeedback":"4.30","ReturnsAssignmentsinTimelyFashion":"4.29"}]},"Fall '07":{"course_score":{"overall":"4.00","workload":"2.09","difficulty":"3.36","recommendation":"4.09","enrollment":"39","response rate":"58.97","QCourseOverall":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"0","3s":"3","4s":"6","5s":"7"},"QDifficulty":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"6","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"6","2s":"6","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"VES 72","cat_num":"6997","course_id":"5177","year":"2007","term":"1","id":"675f4024601c18c29f7a2b9d9d85bb27","first":"J.D.","last":"Connor","InstructorOverall":"4.41","EffectiveLecturesorPresentations":"4.55","AccessibleOutsideClass":"4.53","GeneratesEnthusiasm":"4.64","FacilitatesDiscussionEncouragesParticipation":"3.45","GivesUsefulFeedback":"4.43","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '07":{"course_score":{"overall":"3.62","workload":"2.56","difficulty":"3.60","recommendation":"3.58","enrollment":"57","response rate":"71.93","QCourseOverall":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"0","3s":"3","4s":"6","5s":"7"},"QDifficulty":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"6","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"6","2s":"6","3s":"3","4s":"1","5s":"0"}},"instructor_scores":[{"number":"VES 72","cat_num":"6997","course_id":"5177","year":"2006","term":"2","id":"675f4024601c18c29f7a2b9d9d85bb27","first":"J.D.","last":"Connor","InstructorOverall":"4.08","EffectiveLecturesorPresentations":"4.16","AccessibleOutsideClass":"4.46","GeneratesEnthusiasm":"4.18","FacilitatesDiscussionEncouragesParticipation":"3.81","GivesUsefulFeedback":"4.08","ReturnsAssignmentsinTimelyFashion":"3.86"}]}},"comments":{"Fall '07":{"comments":["I would recommend this course for VES concentrators, but not for those looking to fulfill a core requirement. It was a little too in depth for someone with no prior experience with film courses.","A tough class to do well on but interesting and a great way to get introduced to a number of different films and genres. Also a very good course to provide interesting contextualisation tools for uderstanding films in general.","It's a very interesting class, a little tricky and likely to be a bit confusing if you don't know anything about film history. Overall, it was very enjoyable and I learned a lot.","The class was a lot more involved than I expected...there's a lot more to it than just \"watching movies for homework.\"  It's a fairly substantial time commitment, with the extra screenings taking up an extra 4-5 hours per week, and sometimes there is a lot of reading assigned.  Still, it's a very interesting class, and I got a lot out of it.  Some parts of it were really depressing...much of cinematic history involves unhappy endings...but I highly recommend this class for anyone who's interested in how movies became what they are today.","An interesting course even if you are not planning on being a VES major, but some background in film studies would be helpful","If you are choosing between Art of Film and Sound Cinema, take Sound Cinema (no midterm, better lectures, easier). Except, beware because Prof Connor can be a bit cryptic and erudite. And it is clear that some of these films, he has a really great grasp on (cannot stress how good the Blue Angel lecture was), while others he doesn't know as well.","Go to the screenings because once you fall behind, it is hard to catch up.","I thought it was a great class! It inspired me to think more about doing some future work in film studies. Also, it is a great way to complete a Lit B core. The material is interesting and it is a class I would have taken as an elective.","As long as you are passionate about film, this course is about as good as it can get.","That it is really hard, but worth the work.","This class is harder than it seems.  You should definitely do the readings, as it saves you lots of time when the final comes.  The final is hard.","This is a great class that really opens your eyes on a subject you may realize you actually didn't know that much about. The films are really interesting, and there's a great variety in which you can find something that captivates you. But they weren't lying when they said this was a departmental course, and is therefore a lot more intense than what you might have bargained for. Be prepared to really work to understand and analyze the material, but still have a lot of fun at the same time.","This course flourishes when dealing with the industry. If you are interested in criticism, look elsewhere.","You really have to be interested in film history to enjoy the class."]},"Spring '10":{"comments":["It is a good class but definitely shop it first to see if it is something that will keep your interest.","Watch the movies. It's worth it.","This is a great class. You will learn a ton about the advent of sound in cinema, you will watch terrific films--if you are lucky enough to have Barron teach it again.","You probably won't like the films, but they will be very helpful in your understanding of the material.","The lectures are a bit boring but the sections are really fun, interesting, and engaging.","Interesting material, the lectures can be sort of dry and don't always have to do with sound cinema.","If you're interested in film, there are more interesting classes. If you are interested in filling the core, there are more interesting classes. If you like video, then take a studio course. Point is, you should not take this course unless you are actually passionate about film studies.. otherwise you will fight sleep with every.single.class.","class gives a great, comprehensive view of the world of cinema and how it changed with the addition of sound","Don't read the theory if you don't want to. Read other film things that actually interest you and then write your papers about those."]},"Spring '14":{"comments":["Sound cinema is an amazing class. Required introductory concentration\/secondary requirement courses can be hit or miss, but this class is amazing. The VES department is small and Professor Frahm is an amazing professor. The class this semester was small enough that each lecture was essentially a section with discussion built in. The films covered in this course are diverse and range from the popular (like West Side Story) to the niche films (Sweetgrass). The class is structured around sound and its intertwined history with film; this framework provides a totally new way to think about film and life in general.","Take it if you need to, or if you're interested in music in cinema. I think you'd get a lot more out of this class than I did if you make the effort to listen during lectures, take notes (the slides are not very helpful), try not to fall asleep during screenings, and do the readings. Prof. Frahm is a real sweetheart and a genuinely nice person, but her lectures still seem a bit scattered and it still seems like she's reading out a paper as opposed to actually teaching. Kate was an amazing TF and helped me with the class a lot, so you'll be lucky if she's still TF-ing the class.","It's a fairly good course, could use a little tinkering to structure it in a way more useful to students but it offers a lot to learn about sound and film history. It can be a bit time consuming to do the readings and the weekly blog post (essentially a more casual response paper), but the instructors are really kind and always looking to help.","It's good if you want a more complex understanding of the art of film.","This course, although quite interesting and at times pretty entertaining, has its moment of difficulty, such as a copious amount of readings, as well as assignments that get evaluated with much attention. The course was very fun to take part in, and I surely learned a lot about sound production in film, and will never be able to watch a movie the same; meaning, without criticizing the film's sound design, etc. Take this course if interested in: 1) VES film\/theory course 2) film and sound design 3) you are able to take on a good amount of reading for the end-goal of learning a great deal of interesting facts about movies and sound design that you otherwise probably would not learn, or 4) all of the above. PS: Both the professor and Tf are very helpful, approachable, and amazing\/friendly people so nothing to worry about there.","You have to appreciate film to appreciate a class dedicated to such a niche technical aspect of cinema. The class is not too difficult and the workload is definitely manageable. I would just stress that you really have to like film to truly appreciate the course. That being said, it is incredibly interesting to craft a class just on how we perceive sound in cinema.","Take this class. Professor Frahm is incredibly kind and you will leave with a whole new appreciation for film.","This class is phenomenal. Professor Frahm is wonderful, and it is a nice continuation from the Art of Film, even for non-film concentrators.","If you have any interest in film studies academically or are just a movie fan, this is a great class to look into. While not every film is something you've heard of and they can sometimes be not terribly exciting, you definitely learn a ton and get a great sense of a discipline that most people have little exposure to. Professor Frahm is very knowledgable and always available to her students. Kate is an absolutely amazing TF. Section discussions are fantastic and she's really passionate and helpful when it comes to assignments.","If you like the films, go for it. They're fun to examine, though a part of me wishes I'd taken a more focused class on film.","This is a very interesting class. Professor Frahm gives great lectures and Kate was a wonderful TF. The movies are all pretty cool as well. However, be prepared for quite a bit of reading and a moderate workload. There is a weekly 300 word blog post that actually does require some thinking, and there were 3 major assignments that required a lot of effort. However, what you learn about film is super interesting and I would definitely recommend taking this class.","Pay attention in lecture and go to all the film screenings. Sections are largely based on these screenings.","A great introduction to film analysis, particularly with reference to the usage of sound. Doing the readings is challenging at first but gets easier over time."]}},"mostRecentQ":{"overall":"4.20","workload":"1.90","difficulty":"2.70","recommendation":"4.10","enrollment":"19","response rate":"84.21","QCourseOverall":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"0","3s":"3","4s":"6","5s":"7"},"QDifficulty":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"0","2s":"6","3s":"9","4s":"1","5s":"0"},"QWorkload":{"number":"VES 72","course_id":"5177","cat_num":"6997","1s":"6","2s":"6","3s":"3","4s":"1","5s":"0"}},"success":true}