{"scores":{"Spring '13":{"course_score":{"overall":"3.71","workload":"1.55","difficulty":"2.27","recommendation":"3.92","enrollment":"87","response rate":"85.06","QCourseOverall":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"0","2s":"3","3s":"11","4s":"32","5s":"26"},"QDifficulty":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"6","2s":"19","3s":"41","4s":"5","5s":"1"},"QWorkload":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"30","2s":"32","3s":"10","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SCI-LIVSYS 17","cat_num":"6581","course_id":"2007","year":"2012","term":"2","id":"032515693bb0d1956b9c884a3202c50d","first":" Joseph D.","last":"Brain","InstructorOverall":"4.05","EffectiveLecturesorPresentations":"3.98","AccessibleOutsideClass":"3.90","GeneratesEnthusiasm":"4.16","FacilitatesDiscussionEncouragesParticipation":"4.05","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.10"},{"number":"SCI-LIVSYS 17","cat_num":"6581","course_id":"2007","year":"2012","term":"2","id":"05c8c5ba886d3b3205c4dedfccca25b5","first":" Stephanie A.","last":"Shore","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.09","AccessibleOutsideClass":"3.75","GeneratesEnthusiasm":"4.10","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '12":{"course_score":{"overall":"4.12","workload":"1.72","difficulty":"2.67","recommendation":"4.19","enrollment":"78","response rate":"93.59","QCourseOverall":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"0","2s":"3","3s":"11","4s":"32","5s":"26"},"QDifficulty":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"6","2s":"19","3s":"41","4s":"5","5s":"1"},"QWorkload":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"30","2s":"32","3s":"10","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SCI-LIVSYS 17","cat_num":"6581","course_id":"2007","year":"2011","term":"2","id":"032515693bb0d1956b9c884a3202c50d","first":"Joseph D.","last":"Brain","InstructorOverall":"4.22","EffectiveLecturesorPresentations":"4.22","AccessibleOutsideClass":"3.89","GeneratesEnthusiasm":"4.22","FacilitatesDiscussionEncouragesParticipation":"4.07","GivesUsefulFeedback":"4.13","ReturnsAssignmentsinTimelyFashion":"4.06"},{"number":"SCI-LIVSYS 17","cat_num":"6581","course_id":"2007","year":"2011","term":"2","id":"05c8c5ba886d3b3205c4dedfccca25b5","first":"Stephanie A.","last":"Shore","InstructorOverall":"3.89","EffectiveLecturesorPresentations":"4.06","AccessibleOutsideClass":"3.97","GeneratesEnthusiasm":"3.89","FacilitatesDiscussionEncouragesParticipation":"3.78","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.18"}]},"Spring '11":{"course_score":{"overall":"3.96","workload":"1.67","difficulty":"2.58","recommendation":"4.12","enrollment":"55","response rate":"94.55","QCourseOverall":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"0","2s":"3","3s":"11","4s":"32","5s":"26"},"QDifficulty":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"6","2s":"19","3s":"41","4s":"5","5s":"1"},"QWorkload":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"30","2s":"32","3s":"10","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SCI-LIVSYS 17","cat_num":"6581","course_id":"2007","year":"2010","term":"2","id":"032515693bb0d1956b9c884a3202c50d","first":"Joseph D.","last":"Brain","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.26","AccessibleOutsideClass":"3.88","GeneratesEnthusiasm":"4.29","FacilitatesDiscussionEncouragesParticipation":"4.47","GivesUsefulFeedback":"4.22","ReturnsAssignmentsinTimelyFashion":"4.36"},{"number":"SCI-LIVSYS 17","cat_num":"6581","course_id":"2007","year":"2010","term":"2","id":"05c8c5ba886d3b3205c4dedfccca25b5","first":"Stephanie A.","last":"Shore","InstructorOverall":"3.63","EffectiveLecturesorPresentations":"3.81","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"4.17","ReturnsAssignmentsinTimelyFashion":"4.14"},{"number":"SCI-LIVSYS 17","cat_num":"6581","course_id":"2007","year":"2010","term":"2","id":"7eda77935d995b6af71caccdd5ee1d76","first":"Nancy C. Long","last":"Sieber","InstructorOverall":"3.88","EffectiveLecturesorPresentations":"4.07","AccessibleOutsideClass":"3.79","GeneratesEnthusiasm":"3.92","FacilitatesDiscussionEncouragesParticipation":"3.90","GivesUsefulFeedback":"4.14","ReturnsAssignmentsinTimelyFashion":"4.00"}]}},"comments":{"Spring '11":{"comments":["If you are a humanities concentrator and you are looking for a decent SLS to get out of the way, this is NOT the course to take.","This is an interesting anatomy\/physiology course. Not the most exciting class, but if you like a public health perspective, it is a nice way to get in an SLS.","you probably will not learn all that much, but it's incredibly easy","It's interesting, well-organized, and doesn't require much work at all.","Very helpful class if you want to learn the basics of human biology and public health. Great class for seniors","A very worthwhile class if you have little training in biology and would like to learn about the human body\/common knowledge that all should know. Might be a little challenge when medical terms are being thrown around as though you've breathed them for the past 20 years of your life, but take advantage of the resources available (textbook + TF), and you'll be glad to have learned so much by the end","This is a great physiology course for students who want to gain an understanding of the human body without taking an extremely intense pre-med class. Be prepared for a lot of emphasis on public health.","The course teaches you very important things in a fairly painless way.  More importantly than anything though, the course staff truly cares about your success, which makes the course that much more enjoyable.","It is really interesting and laid back. You will learn a lot but not be overwhelmed by minute details. The teaching staff is really nice and interesting. The things you learn will be relevant to your life and the work is not very strenuous. The labs are fun, the topic sections are really awesome, the work is not busy work and it is generally an enjoyable experience.","The course provides some interesting and useful insights into the human body and does not require more work than any other Core\/Gen Ed.","This is a great and painless class! The public health components of the course are really interesting! Definitely take it if it fits into your schedule!!!!","The labs and p-sets are easy and fun, but the exams can be graded surprisingly hard. A good gen-ed for humanities students.","It's awesome. Take it.","If you work reasonably hard, you'll do really well. The faculty is terribly approachable. The sections are amazing. The psets are interesting and the labs are actually fun!","There isn't a ton of work, and the guest lecturers for section aren't tested so you can just sit back and enjoy the material.","take it!! great course to learn about human body! very easy and relaxed","This class is great! The information is relevant and interesting. You will never fall asleep in lecture or section. Basically, it is similar to AP Bio with a public health twist. Joe Brain is a great lecturer and always makes lectures captivating. The professors are eager to help students. The assignments are challenging, but not overly time-consuming.","Professor Brain is great and the material is very relevant. This is a great General Ed. class.","This class is ridiculously easy. The flipside is you will not learn much unless you are very self-motivated.  Good senior spring class for ocial science\/humanities types.","If you like biology, this class will be too easy for you. If you don't like biology, you won't like the subject matter, but you won't struggle with it. It's one of those in-between classes.","This class is absolutely amazing--the professors and TFs really care about making sure you learn, and the section topic leaders go out of their way to help.  The labs are amazing and low pressure, and the faculty is almost over-qualified to teach undergraduates.  I really enjoyed writing the research paper at the end; we had so much help, and the experience was very personal.  I HIGHLY recommend this class, especially if you just want to know and be able to talk about the important issues in public health and medicine today.","This class is a painless way to fulfill a GenEd. The professors will throw a lot of material at you (This is a physiology course after all), but rest assured that you're not required to know a lot of details for the exams. I think sections are pretty interesting too since you get to ask questions about cool things you care about.","Very well-taught class with very interesting material","It's a pretty easy way to satisfy the Science B (or SLS) requirement. The material is interesting, useful, and very relevant to life in general! It's not quite a science class, but a public health class in which you learn about some science. I found this focus on public health a bit frustrating and detracting from the science, though other might feel differently. For exams, focus primarily on lecture notes and lecture slide! Don't bother buying the textbook. You won't ever need it.","Really fun, very easy, especially if you had any science background in high school! Awesome class because you learn the material because you're interested, not because you're forced to.","This was an awesome class- definitely take it!"]},"Spring '12":{"comments":["You learn so much about the human body in one course, it's incredible.  I'm a Gov major and just took this to fulfill SLS requirement, but I found the course absolutely fascinating!","Great physiology course with a taste of public health","Surprisingly, there are a lot of premeds that take this class.","This is a great course! For the amount of time you have in a semester, you learn a fascinating amount of material with out having to kill yourself. It is definitely an easy to manageable course load and the lectures are pretty engaging actually. Dr. Brain is the man.","Great gen-ed, essentially AP biology through a public health lens.  Nice way of applying biological concepts to larger social problems.  Teaching is excellent and coursework is reasonable.","This is a good opportunity to learn about the horrible illnesses that result from an interuption of the body's homeostasis.","really cool way to fill sls","Great class. Just the right blend of physiology with public health. Take it if you want an understanding of the human body, how diseases work, and how policy can be implemented to deal with public health problems.","This is a GREAT science Gened to take. Although some of the lectures might sound intimidating, often with a lot of bio and chem jargon, you will NOT need to know all of those details for the exams, which are extremely reasonable and only test basic concepts. This is a great introduction to the human organism, and what you learn is actually useful to daily life.","Really manageable way to learn a lot about how the human body works - I hadn't taken biology since 7th grade, so I really loved understanding the nervous system, cardiovascular system, reproductive system. Very practical, and accessible to people without science backgrounds.","Best teaching staff ever. Material is easy.","It'd be a nice senior spring class without all the premeds in the class.","This class was very interesting and a great overview of the human body, but at the end of the semester I feel that I didn't get the chance to go into very much depth.","This class is a good introduction to the human body and all its complexity, and the lab assignments are fun and engaging.","Very light gen ed. You learn a lot. I loved the public health aspect of the class (applying biological knowledge to solve societal problems). The paper lets you explore a problem of your interest.","There is some work that goes along with it, but it is a very good, through course where if you do all the work given to you, you will do well in the class.","great class!","An alright course, but you can get by easily without learning too much.","This course is very especially, especially if you're from a biology\/life sciences background. A lot of the material will be review. The topic sections and section leaders are really interesting and make this class worthwhile if nothing else. The lectures are very boring though, and completely stopped going after the midterm.","If you need a science course, take this class. If you don't need a science course, still take this class. The TFs are accessible and will go above and beyond the call of duty to really listen to what YOU need and to make sure that you succeed in the course. Professor Brain genuinely cares about how you are doing in the course and will stop and talk to his students before and after he lectures. Professor Shore's lectures were always so well articulated and so easily understood. I think EVERYONE would benefit from understanding the human body, disease, and public health and this course is the one to take if you believe the same-- especially if you are trying to escape those pre-med classes but still enjoy biology and public health. This class is also an awesome way to fulfill your SLS17 credit.","This is a tough class for people who didn't take bio in high school or have forgotten the bio they learned in high school.  Most of the students who take this class have either taken other bio classes at Harvard or took AP Bio in high school.  That being said, the course staff are great and very accessible.  The topic sections are interesting, and there is little work to do for the class.","Great course.","Study hard for the midterm!","The professors are absolutely wonderful. They love engaging with their students and really take the time to explain different topics. I LOVED the labs! This class is a wonderful integration of anatomy and public health","Dude this class is awesome. Prof Brain is the most adorable, sweetest man and gives hilarious lectures. This class may seem scary at first, with all these pre-meds and 2 hour sections, but it's the easiest thing ever. FInal and Midterm both took under 30 minutes, lecture is optional, section gives you free food, tons of resources to study from, and you learn stuff that you actually should probably know for life","The subject matter of the course is great, and it's a relatively low work load! However, it is a gen ed, and with that comes a bunch of logistical bologna that can be irritating. In light of that, I would still recommend it!","This is an extremely interesting and applicable class, however, does require a substantial amount of time and work.","There are a ton of premed students taking this class (WHY??) and they seem to already know everything, so you, a humanities concentrator, are left sitting over there wondering what is going on. The midterm was hard. The p-sets - expect a 90\/100 regardless of whether you spent 20 minutes or 2 hours on it. There's a \"quota\" for how many 100s they give out and when you ask what you could have done better, they don't know either! Otherwise, the section leader is very helpful and Jenny is super nice, but the overall experience is frustrating and stressful.","This is an easy class for people who have taken lots of science classes already. Humanities concentrators be warned, this class is filled with pre-meds who have already gone through this material several times in much more detail so they may ruin the curve for a class you thought was going to be a breeze.","this class will give you a good base of knowledge about the human body, but is harder than it looks!","Really interesting class, and not that hard, but definitely require studying time (since it's physiology, and there are people in this class who know almost everything already given their background, so the curve is to your disadvantage if you are looking for A).","This course was a great way to fulfill the SLS gen ed. I gained a lot of useful knowledge about the way the body works and was allowed to pursue something of interest to me in the topic section.","An interesting course for your general education requirement.","Take this class for a good SLS gen ed... But be wary, there is a lot more to it than what the syllabus says. You basically need to attend all lectures in order to understand things. And what they teach you in lecture is only just the beginning... They don't test you on the physiology but rather the worldly affects... Plus 2 hour sections and three 2 hour labs and psets and a research paper. It gets to be a lot... Just be warned.","take it if you like biology","This is a super easy gened, but it's a very boring class. The class staff is darling, but the material is just presented in a pretty boring fashion.","It is a fun way to learn about your own body, and the labs are amazing.","Really, REALLY interesting class! The teaching staff is great, and they relate the hard science to the current and useful very well!","don't study too much in detail about the physiology. think about the main ideas.","Even if you're not a science person, take this class!!! One of the best classes I took at Harvard, the material is really thorough for those that are not science people, and the professors are incredible lecturers. Also, I came out of this class having learned so much about health, the state of health around the world, and how our body works. Definitely useful knowledge, and such a great class! Take it!"]},"Spring '13":{"comments":["Especially if you are not getting your degree in a hard science this class is a good way to learn about important public health issues and information one should know to live healthier and longer.","I think this is a great class that gives you a good overview of biology and anatomy, but also the applications of that knowledge. The labs are really fun and interesting! In general, it's great for those who don't have a strong science\/biology background; however, there are definite advantages to those that do.","Easy. Learned a lot of really relevant biology. Tests are pretty easy.","human biology course, with a focus on public health. Labs and section can be a nuisance, but weren't difficult.","This is a wonderful class! It's easy, the course instructors are awesome and kind (unfortunately, Joe Brain is leaving, but Nancy Long Sieber and the other professors are good too!). It's a great sampling of all the body systems and also has public health components. The course is: lectures on Monday and Wednesday, 2-hour section once a week (one hour is to review lecture material, the other is for a specific topic -- mine was on sleep, for example), problem sets only every few weeks, and only two 2-hour labs, which were fun and easy.","this class is fairly easy but if you don't go to lecture then you'll have to really cram before the tests. The 2 hour sections aren't bad (don't be intimidated) and the labs are super easy and interesting. Nothing in this class is too hard, it just occasionally requires some effort. The sleep watches are awesome.","Make sure to get an early start on your final paper. Everything else is very straightforward.","It seems like as long as you went to lectures (or watched the videos) and did your assignments, you'd do fine.","Great class. Especially if you've already studied the human body in high school, this will be a very pleasant review. The lecturers and lectures are engaging, the labs are fun and interesting, the psets are easy, interesting, and fairly graded. The sections are divided by topic and taught by specialists in their field. Basically the perfect gened.","Great course to supplement an interest in health, anatomy, and physiology. Low stress and high reward. The teaching staff are very supportive and the class gives a great foundation for important topics.","This course (although no one will tell you until it's too late to drop it) is full of pre-meds taking the class as a joke elective. If you are not pre-med, DO NOT TAKE THIS COURSE. If you are pre-med, go ahead but I mean why would you waste your time like that...anyway, spare yourself. There are (maybe) less painful ways to fulfill the SLS GenEd than this course. The material is far too complicated if you're not in the sciences already.","Great course, really interesting lectures.  Problem Sets are fair.  Labs are fun.  Term paper not so much, but it seems important.","You definitely learn all those things that you were always curious about.","The information provided was interesting and useful, especially as a pre-med.  The class is extremely boring, though.","This is a great way to knock off sls. Prof Brain is an excellent lecturer, there is little work, good material, interesting labs, overall just solid.","This class is incredibly lightweight - I spent ~15 hours in total doing all of the work assigned throughout the semester. It's fun, but you won't learn a lot. Do take it, though, if you are looking for a lightweight class.","I loved learning about health and myself! One of the best gen eds I've taken. Make sure you're interested though since I know people who really didn't like the material in the class. The course staff, however, is undeniably one of the best.","Too bad professor Brain is retiring because this was a great class. Not too difficult, very convenient as lectures were video-recorded, and I learned a lot in a fun way.","Great way to fulfill SLS gen ed. Fun and helpful for everyday life.","Sections were a waste of time, but interesting material.  Good way to fulfill SLS requirement.","It was more of a commitment than I would have liked. 2 hours of section a week in addition to 2 hours of lecture a week. Lectures were interesting, but to a point. If you're like me, you'll be annoyed when they cover in depth systems of the body and then spend less time on more interesting practical matters like public health\/ policy. As a non-science concentrator, it was hard to learn technical names for things and be expected to know body systems.","It's not too hard and not a lot of work, but can get boring because a lot of the material you probably learned already. But perioidically something really cool comes up that you may not have heard before, but you have to sit through the boring stuff to pick up on these things.","brain is superbly familiar with teaching!","This is a great course!","Its a pretty straightforward course and I think the topic sections are great. You get to learn indepth about one issue in the topic section. I think the lectures are a little dry so watch out for that. Overall, though you learn a great deal of important science concepts and public health concepts-all the material is definitely very useful.","This is a great class.  It is my understanding that Professor Brain will no longer be teaching next year (too bad he isn't a neurologist), but I believe the co-professor will take responsibility next year.  She was also great, and I would give it a try if you want to complete a low key science requirement.","The class is interesting and I learned a lot of information, even as someone with a biology background. Labs were really fun and interesting. The workload was low.","Everything you look for in a perfect gen-ed: stress-free, applicable to real life, and fun.","The course is an amazong overview of human physiology. Unlike other anatomy\/physiology course out there, I think this one emphasizes more on the more practical aspects of human physiology and has a public health component. I learned a great deal in a short period of time and I can proudly say that I now know how the human organism works. Joe, Nancy and Stephanie are amazing lecturers. It was a pleasure listening to them speaking about these matters.","I took this class to fulfill a Gen Ed requirement and was a little disappointed. I didn't feel like it was challenging enough and I think there were many missed opportunities to learn more. The labs are super cool and enjoyable and the teaching staff is so kind and helpful.","The class teaches you a lot of material that is relevant to life.","Good introduction to the human anatomy with some integration of public health concerns, but its a typical gen ed - you can't teach a really great class to a room full of people with such differing backgrounds; some people are bored senseless, some people have to try in order to master the material, and the some students just don't really care.  However, if you need an SLS, this is a good one to take.","This was the best science class I took at Harvard! I loved section especially because there was so much good food provided during section :D","This was an enjoyable SLS gen ed. It helps coming into the class with some previous science background but its not necessary. Its easy to do well in the class as long as you just keep on top of the material. The second half of the course throws a lot at you, so be prepared at the end during finals studying.  Overall, a painless way to do the SLS gen ed.","Not a big fan of this class. Lectures were dreadfully boring. Professor Brain was the only good thing about them but he's done teaching this course. Other two ladies, including the one that is taking over, made me fall asleep. Problem Sets are a joke. Exam was extremely difficult. Combination of review\/section is helpful and interesting but completely draining. Two hours is too long for a section. If you're a pre-med, this class will be a joke for you. For everyone else unfamiliar with biology, don't take it.","Great class - labs are a little pointless but overall a gem."]}},"mostRecentQ":{"overall":"3.71","workload":"1.55","difficulty":"2.27","recommendation":"3.92","enrollment":"87","response rate":"85.06","QCourseOverall":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"0","2s":"3","3s":"11","4s":"32","5s":"26"},"QDifficulty":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"6","2s":"19","3s":"41","4s":"5","5s":"1"},"QWorkload":{"number":"SCI-LIVSYS 17","course_id":"2007","cat_num":"6581","1s":"30","2s":"32","3s":"10","4s":"0","5s":"0"}},"success":true}