{"scores":{"Spring '14":{"course_score":{"overall":"4.30","workload":"1.70","difficulty":"2.30","recommendation":"4.50","enrollment":"17","response rate":"88.24","QCourseOverall":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"0","2s":"0","3s":"1","4s":"8","5s":"6"},"QDifficulty":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"0","2s":"10","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 18","cat_num":"4588","course_id":"2035","year":"2013","term":"2","id":"e73bb627243d65bf7cb295f3e556ea3c","first":" Mary D.","last":"Lewis","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '13":{"course_score":{"overall":"3.79","workload":"1.86","difficulty":"2.57","recommendation":"4.07","enrollment":"17","response rate":"82.35","QCourseOverall":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"0","2s":"0","3s":"1","4s":"8","5s":"6"},"QDifficulty":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"0","2s":"10","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 18","cat_num":"4588","course_id":"2035","year":"2012","term":"2","id":"e73bb627243d65bf7cb295f3e556ea3c","first":" Mary D.","last":"Lewis","InstructorOverall":"3.79","EffectiveLecturesorPresentations":"3.79","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.69","FacilitatesDiscussionEncouragesParticipation":"3.91","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.43"}]},"Fall '09":{"course_score":{"overall":"3.72","workload":"2.21","difficulty":"3.02","recommendation":"3.83","enrollment":"58","response rate":"91.38","QCourseOverall":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"0","2s":"0","3s":"1","4s":"8","5s":"6"},"QDifficulty":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"0","2s":"10","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 18","cat_num":"4588","course_id":"2035","year":"2009","term":"1","id":"e73bb627243d65bf7cb295f3e556ea3c","first":"Mary D.","last":"Lewis","InstructorOverall":"3.69","EffectiveLecturesorPresentations":"3.77","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.96","FacilitatesDiscussionEncouragesParticipation":"3.62","GivesUsefulFeedback":"3.45","ReturnsAssignmentsinTimelyFashion":"3.42"}]}},"comments":{"Fall '09":{"comments":["Great fun.","The subject matter is more interesting than you think. Very painless way to do a core requirement.","I would tell future students to be aware that a prior knowledge of history such as having taken AP History is almost required for this course, in my opinion.","Only take this if you really need a European history class, which I did.  It will fulfill it in a relatively easy way, much easier than say Ferguson's class, but it is very painful and not enjoyable at all.","This is a great class. The TFs are really good and nice. The reading was generally pretty interesting and there was a pretty light reading load for a history class. The professor is very dedicated and gets personally involved in running the course (she doesn't delegate everything to the TFs). She even knows most people's names. Her lectures were pretty good.","It's a great class for anyone who does not know modern European history very well, and would like to learn.","Do the reading, particularly the two main books. You can pick and choose through the other readings. Also, the grading, especially on the papers, is quite tough.","While this course presented a fascinating insight into postwar Europe, it still requires further efforts to restructure the contents into more presentable and comprehensible styles.","It is a period of history that has implications for today.  It is also a geographical region that shares a broadly overlapping history with ours.","If you just want to fulfill a core, there are other better cores to choose","Would prefer from a European professor. Discussions guided by first hand experience is a much more interesting and example filled account of Europe.","Very good material. You'll enjoy learning European history from Professor Lewis. Keep up with the readings and going to lecture and the exams will be fine. But, be prepared to work hard on your essays because they are graded pretty hard.","Definitely take this course if you are interested in having a general understanding of 20th century European history! It is not much work and readings are extremely interesting and well-chosen!","This class is amazing. The professor gives outstanding lectures that generate a ton of enthusiasm for the subject. The course material is all very interesting and is, of course, all very pertinent to what is happening today in Europe. The class is fairly-writing and reading intensive, but the professor and section leaders are 100% available to help you at anytime.","Keep up with the readings, and liberally wiki terms\/people. The workload is manageable, so long as you keep up with it and don't let it pile up.","They grade a bit harshly in this class, especially for it being a GenEd. Be sure to do the readings for a good discussion\/section participating grade.","This is a great class with engaging readings and an excellent professor.  Because it is Post-WWII, it is an interesting mix of history and of issues that are directly applicable to modern geopolitics in Europe and the world.  Professor Lewis does a good job of presenting conflicting, or at least varying, interpretations of the events covered in the course, especially with an eye towards long term trends and movements.","Really interesting time period and very relevant to today.","That it is amazing how much you can learn in such a short period of time. I can say with confidence that I know a lot about the last 70 years of European history after having taken this course.","This course is not like regular history classes where you memorize dates and read boring textbooks. Here, you get to watch movies and read interesting texts (most of which are from memoirs so you get a first-hand perspective from real people who lived through the events you discuss in class). This course is great for anyone wishing to learn a bit more about a very powerful continent.","If you want to keep up with the class material you need to do the readings.","I knew very little about this subject matter to begin with, so this course taught me tremendous amount. In fact, I would say I learned more in this course than in any of my other courses.","This course's material was rather dry, and section was particularly unenjoyable. The professor and TFs assume everyone in the class has a strong passion for European history, which is unlikely considering that it's a Core and only students with non-history backgrounds are required to take it.","Material good. Presentation weak.","Great overview of a deceptively interesting historical period, with strong implications for today.","This class covers a variety of interesting historical topics that remain very relevant to current world events.  The professor is thoughtful, considerate, and carefully selects readings and lecture material.  However, this is not a class you can skip: lecture slides are not posted online, and if you don't go to lecture, you probably won't know what you're doing when you get to the exams.","A great introduction to modern European history.","Take it if you're really interested in the material. The reading is not THAT light for a non-humanities concentrator."]},"Spring '14":{"comments":["A solid SW course. If you want to augment your understanding of recent history, its wonderful. I've continually found the material relevant and helpful outside of class. Readings\/movies\/and other materials for the course stay pretty interesting. Lectures can occasionally seem a bit slow.","This class is a phenomenal way to immerse yourself in European History and critically look at the post-WWII period. If you have extensive background I would not take it because it is more of an introduction to a variety of topics that an in-depth look at specific events. The trials provide a unique guide to understanding the period and fascinating way to explore the variety of social and political changes occurring during this period. Also make sure you enjoy \"creative\" assignments because there are many in the course such as a magazine article, map blog post, etc.","Do the reading and take good notes in class.","This was my last gen Ed, and it was the best one I took at Harvard. It was fascinating, I learned a lot, and the staff values learning much more than rote memorization or arbitrarily difficult assignments. I feel much more prepared to address not only questions and issues about european history, both past and present, but history in general (in a practical rather than theoretical way). Prof Lewis is fantastic and could make me interested in just about any topic, and it's clear she cares about the same things we do as students.","It's very interesting, especially for a gen ed class","The theme of reassessing the past is very interesting.  The workload is very light. There were few projects, but basically around the time they were due the workload increased greatly.  The lectures and section could be more engaging in my mind, and some of the readings were confusing, but I think that that could be solved by tying it better to the theme of retrials. It certainly is an interesting period to study, and by the end of the course, it is easy to see why it is important to know that stuff. You learn a lot, that's for sure; I feel I know a lot more about Europe in general!","This is a great survey course with the interesting spin of the trials. Definitely take if you want to better understand modern Europe. Professor Lewis really cares about your well-being and the projects are usually creative and fun.","The class is low-key and not stressful at all. There is no memorization, and no rigorous papers aside from the essay-based exams.","Good if you want a general overview of history to fulfill this requirement rather than focus on a specific country. Fun, creative assignments. Some of the lectures could've been a bit more focused.","I would tell them that this course gives a great overview of the crucial moments in Europe after the Second World War, which are often forgotten in courses on European history that focus strongly on the two World Wars. The material is all very related to today's current affairs and politics.","Professor Lewis cares a lot about making this course fun and engaging for everyone.  She constructed a nice thread (sometimes a little artificial-seeming) which was really helpful in making history feel very relevant and thematic. The course material is really interesting and not overwhelming at all.  The style of the assignments is a little bit middle-school-project-esque in structure, but I appreciate the effort to switch things up from the academic papers.","This is by far the best Gen Ed I have ever taken. It had a great professor and TF, and the material was taught in a way that was interesting, engaging, and served a greater overall purpose. If you're at all interested in Europe\/postwar politics, take this class. If you want a fun Gen Ed, take this class. The assignments aren't particularly difficult, and they do a great job of finding fun spins on things so that it's not your typical, boring, history-paper-writing class. I can't imagine a better choice to fulfill this Gen Ed. I loved this class."]}},"mostRecentQ":{"overall":"4.30","workload":"1.70","difficulty":"2.30","recommendation":"4.50","enrollment":"17","response rate":"88.24","QCourseOverall":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"0","2s":"0","3s":"1","4s":"8","5s":"6"},"QDifficulty":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"0","2s":"10","3s":"5","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 18","course_id":"2035","cat_num":"4588","1s":"6","2s":"8","3s":"1","4s":"0","5s":"0"}},"success":true}