{"scores":{"Spring '14":{"course_score":{"overall":"4.30","workload":"3.00","difficulty":"3.20","recommendation":"4.00","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"0","3s":"0","4s":"6","5s":"3"},"QDifficulty":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"2","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"1","2s":"2","3s":"3","4s":"2","5s":"1"}},"instructor_scores":[{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2013","term":"2","id":"f9e470e9e16b5cba5bff76493fce6fc2","first":" Conor L.","last":"Evans","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.30","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '13":{"course_score":{"overall":"4.71","workload":"3.14","difficulty":"3.29","recommendation":"4.86","enrollment":"8","response rate":"87.50","QCourseOverall":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"0","3s":"0","4s":"6","5s":"3"},"QDifficulty":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"2","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"1","2s":"2","3s":"3","4s":"2","5s":"1"}},"instructor_scores":[{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2012","term":"2","id":"742cad7ce131838c7a132626aa8440ef","first":" Giuliano","last":"Scarcelli","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"4.86","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"},{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2012","term":"2","id":"f9e470e9e16b5cba5bff76493fce6fc2","first":" Conor L.","last":"Evans","InstructorOverall":"5.00","EffectiveLecturesorPresentations":"5.00","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"5.00","ReturnsAssignmentsinTimelyFashion":"5.00"}]},"Spring '12":{"course_score":{"overall":"4.33","workload":"3.60","difficulty":"3.33","recommendation":"4.30","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"0","3s":"0","4s":"6","5s":"3"},"QDifficulty":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"2","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"1","2s":"2","3s":"3","4s":"2","5s":"1"}},"instructor_scores":[{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2011","term":"2","id":"742cad7ce131838c7a132626aa8440ef","first":"Guiliano","last":"Scarcelli","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.10","AccessibleOutsideClass":"4.25","GeneratesEnthusiasm":"4.60","FacilitatesDiscussionEncouragesParticipation":"4.44","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.67"},{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2011","term":"2","id":"f9e470e9e16b5cba5bff76493fce6fc2","first":"Conor L.","last":"Evans","InstructorOverall":"4.20","EffectiveLecturesorPresentations":"4.60","AccessibleOutsideClass":"3.40","GeneratesEnthusiasm":"4.40","FacilitatesDiscussionEncouragesParticipation":"4.33","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '11":{"course_score":{"overall":"4.00","workload":"3.70","difficulty":"3.70","recommendation":"4.00","enrollment":"13","response rate":"76.92","QCourseOverall":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"0","3s":"0","4s":"6","5s":"3"},"QDifficulty":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"2","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"1","2s":"2","3s":"3","4s":"2","5s":"1"}},"instructor_scores":[{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2010","term":"2","id":"3bf590fb170fc19dafeadc2133fd00d2","first":"Timothy A.","last":"French","InstructorOverall":"3.90","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"3.70","FacilitatesDiscussionEncouragesParticipation":"3.71","GivesUsefulFeedback":"3.40","ReturnsAssignmentsinTimelyFashion":"3.50"},{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2010","term":"2","id":"eea607f04678ffae277c1e4b4f216b83","first":"Cynthia","last":"Friend","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"4.11","GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":"4.00"},{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2010","term":"2","id":"f9e470e9e16b5cba5bff76493fce6fc2","first":"Conor L.","last":"Evans","InstructorOverall":"4.30","EffectiveLecturesorPresentations":"4.30","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.38","GivesUsefulFeedback":"3.25","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '10":{"course_score":{"overall":"4.53","workload":"2.93","difficulty":"2.93","recommendation":"4.33","enrollment":"15","response rate":"100.00","QCourseOverall":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"0","3s":"0","4s":"6","5s":"3"},"QDifficulty":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"2","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"1","2s":"2","3s":"3","4s":"2","5s":"1"}},"instructor_scores":[{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2009","term":"2","id":"3bf590fb170fc19dafeadc2133fd00d2","first":"Timothy A.","last":"French","InstructorOverall":"4.87","EffectiveLecturesorPresentations":"4.86","AccessibleOutsideClass":"4.73","GeneratesEnthusiasm":"4.87","FacilitatesDiscussionEncouragesParticipation":"4.92","GivesUsefulFeedback":"4.67","ReturnsAssignmentsinTimelyFashion":"4.75"},{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2009","term":"2","id":"eea607f04678ffae277c1e4b4f216b83","first":"Cynthia","last":"Friend","InstructorOverall":"4.53","EffectiveLecturesorPresentations":"4.33","AccessibleOutsideClass":"4.62","GeneratesEnthusiasm":"4.53","FacilitatesDiscussionEncouragesParticipation":"4.38","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"3.00"}]},"Spring '09":{"course_score":{"overall":"4.57","workload":"2.57","difficulty":"3.00","recommendation":"4.57","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"0","3s":"0","4s":"6","5s":"3"},"QDifficulty":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"2","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"1","2s":"2","3s":"3","4s":"2","5s":"1"}},"instructor_scores":[{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2008","term":"2","id":"eea607f04678ffae277c1e4b4f216b83","first":"Cynthia","last":"Friend","InstructorOverall":"4.86","EffectiveLecturesorPresentations":"4.86","AccessibleOutsideClass":"4.57","GeneratesEnthusiasm":"4.57","FacilitatesDiscussionEncouragesParticipation":"4.43","GivesUsefulFeedback":"4.14","ReturnsAssignmentsinTimelyFashion":"4.00"}]},"Spring '07":{"course_score":{"overall":"2.67","workload":"2.67","difficulty":"3.67","recommendation":"3.33","enrollment":"5","response rate":"60.00","QCourseOverall":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"0","3s":"0","4s":"6","5s":"3"},"QDifficulty":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"2","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"1","2s":"2","3s":"3","4s":"2","5s":"1"}},"instructor_scores":[{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2006","term":"2","id":"615c57e96bf584bc0d33ddb46b4f4726","first":"Heather","last":"Tavernier","InstructorOverall":"1.67","EffectiveLecturesorPresentations":"2.00","AccessibleOutsideClass":"3.33","GeneratesEnthusiasm":"3.00","FacilitatesDiscussionEncouragesParticipation":"3.67","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"2.00"},{"number":"CHEM 165","cat_num":"0667","course_id":"501","year":"2006","term":"2","id":"eea607f04678ffae277c1e4b4f216b83","first":"","last":"","InstructorOverall":null,"EffectiveLecturesorPresentations":null,"AccessibleOutsideClass":null,"GeneratesEnthusiasm":null,"FacilitatesDiscussionEncouragesParticipation":null,"GivesUsefulFeedback":null,"ReturnsAssignmentsinTimelyFashion":null}]}},"comments":{"Spring '09":{"comments":["This is a fun and more physical-chemistry oriented way to fulfill the lab requirement of chemistry. If you don't particularly like organic lab, then take this course. You won't be swamped with work and you'll still get some great lab experience.","Exposure to really cool lab equipment and procedures, great teaching, no unnecessary or \"pointless\" work, a fantastic way to fill the advanced lab requirement for the chem concentration."]},"Spring '10":{"comments":["A great group.","Perhaps my favorite chemistry class I've taken at Harvard. The lab hours are reasonable and the teaching staff is amazing. The course is well-organized and fun. You will learn useful skills like designing your own procedures, troubleshooting, and practicing scientific writing. The independent project at the end of the course is a great learning experience.","This is a great class! You will learn a lot and have a great time. But it is a lot of work, so be ready for that. Still, all the work is worthwhile and you will learn a lot.","This is a great class that stresses the understanding of theory by applying it to interesting experiments.","Great teaching staff, cool experiments, and practical for those who want to learn how to write effectively in the sciences.","It's a great class.  Wonderful people.  It's a shame that some TFs are leaving.","if you are not interested in physical chemistry, you will probably not get much out of the course","Some long lab reports but a great class.","This is a great class. You get to play around with some interesting experiments without requiring an insane amount of time or work."]},"Spring '11":{"comments":["This class is awesome, in theory. In practice however, you should expect to put a lot of work into the lab write-ups. And know that you may not get the best feedback from the professors.","Awesome class if you're interested in chemistry.  Labs are terrific.","A lot of work, but no tests or final makes it worth it for the first few months of hard labor.","This is a fun and rewarding way to fulfill your student lab credit. Great teaching staff.","This is definitely a work-intensive class - make sure your schedule is in well-balanced enough that you can devote time to it. It was worth it in the end, though. You get very close to the class and the teaching fellows (Dr. Friend and Dr. Evans are both incredible teachers and mentors) and the material is some of the most directly applicable that I've learned in the Chemistry department.","The lab reports are longer and harder than they seem. Don't underestimate them. Make sure you ask for specifics about what is expected from you for each assignment. The teaching staff tends to give unclear grading rubrics and your grade is often a surprise. Overall, decent learning experience, but the class could really be better organized and more clearly presented.","Its hard, long, and a rough ride.","This class provides a good introduction to experimental physical chemistry techniques, but requires a lot of time in order to effectively understand the experiments and write up the lab reports."]},"Spring '12":{"comments":["If courses were NBA players then Chem 165 would be Kobe Bean Bryant. MVC AKA Most Valuable Class. You can't beat the Mamba. Great to take in the last or second-to-last spring of your time here, because it's just as clutch as Kobe in the 4th quarter.","The lab reports can be extremely time-consuming, but this class is rewarding in the end. Make sure you have enough time in your schedule to really get the most out of this class. Although the material is challenging and abstract at times, all of the course staff are very knowledgeable and willing to offer guidance and assistance. I highly recommend this course!","This class is a good opportunity to apply physical chemistry concepts from class to lab experiments. It's much less time-consuming than Chem 135 lab. Be prepared to put up with some disorganization and unclear expectations for lab reports and other assignments.","Its a great class, you'll learn a lot more in this class than you will in a lecture based class, but be prepared for some moments of frustration.","This class was really great. Definitely more fun and more interesting than Chem 161. It's also pretty painless--even in senior spring. The labs never take too long, and the reports in my opinion are better than slaving over problem sets and midterms. At the end of the term, you've also produced a really cool final project and I definitely felt like I had something of which to be proud.\r\n\r\nThe constant scientific writing also really helps with thesis stuff.","This class may be the best class you'll ever take in college! The course staff is phenomenal--you will absolutely love them. You do a variety of really interesting labs, so you learn pretty in-depth theory about a lot of p-chem techniques, and also get a hands-on experience with these techniques that could be the starting point of later research. The independent project is also a fantastic experience--you can research essentially whatever you want with the techniques of physical chemistry, so it is a very singular opportunity to build your own project from the ground up (that is, without bending to the will of a PI, etc). The course staff is super accessible and will provide great feedback throughout the semester on your work. I have taken a lot of really awesome courses in college, but this has been the best. Take it!","Be prepared for long hours, tough grading, and lots of walking to and from Northwest. But if you have the time to do all the work, it's very rewarding. If not, I'd imagine it's very stressful.","This is an incredible class that uses labs to hit at the core of chemical principles. It gives students a precise understanding of what is possible with spectroscopic methods. The project component is complicated, but a welcome change from other lab classes. It is entirely dependent on self-motivation. While the teaching staff is around, the ideas for the projects are student generated. Be wary of taking on too many weekly problem set classes in conjunction with 165 because the weekly labs take some time to process. There is a good balance between formal and informal report types so some weeks are lighter, but just be prepared for that.","This class is awesome. Seriously, take it, it will reinforce and synthesize everything you've learned in the department  prior."]},"Spring '13":{"comments":["This class is the best class I have been in at Harvard, for real! The lectures (only 1 hr\/week!) are very well done, and in the second half of class they turn into group discussions, which are really productive, not just journal discussions like some other class. The labs are \"bleeding edge\" (i.e. might not work because they are actually legit labs) and you will learn a lot. There is no normal physical chem class at Harvard, so you learn a lot of important things in this class that strangely aren't addressed in the required chem curriculum. The independent project is also very challenging but rewarding.","Great class!  You learn a lot in physical chemistry. The teaching staff is amazing and explain everything you need to know.  Being able to do hands-on things with the instruments and laser set-ups helps you understand the physical chemistry concepts, and of course once again the teaching staff in the labs will explain anything you might have questions about.\r\nThe independent project experience is very dependent on the project and how invested you are, I feel.  For one, take the project proposal seriously!  Know details and specifics for what you are trying to do, know all relevant literature, etc.  My group didn't really have a good idea of what we were trying to do (we had a concept but weren't sure what to do. The paper we tried to base our project on had used a technique that requires training that would take several weeks, and we didn't have that time.  after some suggestions from the teaching staff, we went in a certain direction but were always kind of unclear as to where we were trying to go and where were actually heading).  Be absolutely sure you are invested and interested in the project you do.  I was not really on board with my project until well into it and I was always stressed and felt out of the loop.  Know where you are trying to go and how you plan to get there.","It's an awesome course. Building the lab setups, trying to get intuition out of results, and then finally analyzing the quantitative data will really help you solidify what you've learned in earlier chem courses. The small course size is also a great way to get to know the teaching staff and learn what you want. Just be sure to start thinking about final projects early on and at least thinking about the proposal. Saving it for the last day really is brutal.","Absolutely phenomenal class. Prof. Evans and the rest of the teaching staff care so deeply about your learning. It is such interesting material and with such great support - definitely take, especially for a physical chemistry requirement for chem concentrators.","TAKE THIS CLASS. or just listen to your friends have a great time taking an amazing class and be jealous all semester. the only thing I regret about this course is not taking it with my friends. Other than that it was literally the perfect Harvard experience."]},"Spring '14":{"comments":["Quite a difficult course in which you'll learn a lot but the papers and the final write up for the independent project may destroy you.","One of the best lab classes I've taken at Harvard.","If you enjoy physical chemistry, you're interested in graduate school\/research, and you have 8-14 hours each week to commit to being in lab (during the independent project portion of the course), TAKE THIS CLASS! You'll learn a lot and in the end there is nothing more rewarding than proposing, carrying out, and presenting a project you developed. This is an ideal senior spring class, but you will learn a lot during it and in the end, the experience will prove rewarding","This course appears to be the easiest way to fulfill the Chem lab course requirement. The labs are short and the independent project is kinda fun.","Great lab class to take! The amount of time it takes is deceptive though--be prepared to spend ~10 hrs a week in lab during the group project. The teaching staff really cares though.","This is a great class for those with a strong interest in chemistry, especially in the lab, and curiosity.","This is a great upper level laboratory course that is a great way to learn physical chemistry lab techniques. The time commitment is not too bad!"]}},"mostRecentQ":{"overall":"4.30","workload":"3.00","difficulty":"3.20","recommendation":"4.00","enrollment":"12","response rate":"75.00","QCourseOverall":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"0","3s":"0","4s":"6","5s":"3"},"QDifficulty":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"0","2s":"2","3s":"4","4s":"2","5s":"1"},"QWorkload":{"number":"CHEM 165","course_id":"501","cat_num":"0667","1s":"1","2s":"2","3s":"3","4s":"2","5s":"1"}},"success":true}