{"scores":{"Spring '10":{"course_score":{"overall":"4.65","workload":"2.06","difficulty":"2.71","recommendation":"4.82","enrollment":"18","response rate":"94.44","QCourseOverall":{"number":"PSY 1853","course_id":"4290","cat_num":"0615","1s":"0","2s":"0","3s":"1","4s":"4","5s":"12"},"QDifficulty":{"number":"PSY 1853","course_id":"4290","cat_num":"0615","1s":"0","2s":"5","3s":"12","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1853","course_id":"4290","cat_num":"0615","1s":"3","2s":"10","3s":"4","4s":"0","5s":"0"}},"instructor_scores":[{"number":"PSY 1853","cat_num":"0615","course_id":"4290","year":"2009","term":"2","id":"47715861cd999e1ec1e0af43c83c9894","first":"Matthew K.","last":"Nock","InstructorOverall":"4.82","EffectiveLecturesorPresentations":"4.94","AccessibleOutsideClass":"4.62","GeneratesEnthusiasm":"4.76","FacilitatesDiscussionEncouragesParticipation":"4.53","GivesUsefulFeedback":"4.93","ReturnsAssignmentsinTimelyFashion":"4.67"}]}},"comments":{"Spring '10":{"comments":["IT IS AMAZING! NOCK IS AMAZING!  REALLY IMPORTANT AND INTERESTING MATERIAL!","This class provides a gentle overview of some heavy topics in psychology","Matt is an awesome teacher and great guy in general.  He's very accessible, cares about his students, and structures assignments so that they are relevant regardless of which field you end up pursuing (e.g. in-class presentation, final grant proposal, etc.).  If you want to learn to read psych studies with a more critical eye, take this course.  What I took away most was a deeper understanding of research methods, and it was enjoyable too.  A great course if you're considering the field of clinical psych.","Much of the class time consists of student presentations.","Very interesting material, amazing professor who truly cares about students, very fair workload","This is the best psychology elective I have taken at Harvard. Prof. Nock is organized, funny, and engaging, and he makes you want to do good work because he does, both as a teacher and a psychologist himself. I would highly highly highly recommend this course.","This class is outstanding.  Great academic setting, thoughtful discussion, interesting assignments, knowledgeable professor.","This course is the perfect mix of engaging topics and required work. However, Prof. Nock makes all the work as painless as possible and truly is focused on our learning.","This class is very interesting, has fun and flexible assignments, and teaches you very practical information about psychopathology and suicide risk.","Professor Nock is fabulous and teaches a rather somber topic with as much enthusiasm as possible.","If you are interested in self-destructive behavior, especially NSSI, you should take this course. Professor Nock is one of the leading researchers in this field and is extremely knowledgeable on the subject.","Don't expect tons of videos like Abnormal Psychology-it's all article reading, but you will learn a lot from it."]}},"mostRecentQ":{"overall":"4.65","workload":"2.06","difficulty":"2.71","recommendation":"4.82","enrollment":"18","response rate":"94.44","QCourseOverall":{"number":"PSY 1853","course_id":"4290","cat_num":"0615","1s":"0","2s":"0","3s":"1","4s":"4","5s":"12"},"QDifficulty":{"number":"PSY 1853","course_id":"4290","cat_num":"0615","1s":"0","2s":"5","3s":"12","4s":"0","5s":"0"},"QWorkload":{"number":"PSY 1853","course_id":"4290","cat_num":"0615","1s":"3","2s":"10","3s":"4","4s":"0","5s":"0"}},"success":true}