{"scores":{"Spring '14":{"course_score":{"overall":"3.80","workload":"2.60","difficulty":"3.50","recommendation":"3.80","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"1","2s":"1","3s":"2","4s":"5","5s":"4"},"QDifficulty":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"6","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRENCH 70b","cat_num":"6720","course_id":"4389","year":"2013","term":"2","id":"8a5c0427496442fd9ebecde474ce1896","first":" Janet L.","last":"Beizer","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.90","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"3.40","GivesUsefulFeedback":"3.70","ReturnsAssignmentsinTimelyFashion":"3.50"}]},"Fall '12":{"course_score":{"overall":"3.75","workload":"2.88","difficulty":"3.25","recommendation":"3.75","enrollment":"8","response rate":"100.00","QCourseOverall":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"1","2s":"1","3s":"2","4s":"5","5s":"4"},"QDifficulty":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"6","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRENCH 70b","cat_num":"6720","course_id":"4389","year":"2012","term":"1","id":"8a5c0427496442fd9ebecde474ce1896","first":"Janet L.","last":"Beizer","InstructorOverall":"3.88","EffectiveLecturesorPresentations":"4.12","AccessibleOutsideClass":"4.25","GeneratesEnthusiasm":"4.00","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"3.57"}]},"Fall '11":{"course_score":{"overall":"3.61","workload":"2.78","difficulty":"3.28","recommendation":"3.72","enrollment":"19","response rate":"94.74","QCourseOverall":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"1","2s":"1","3s":"2","4s":"5","5s":"4"},"QDifficulty":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"6","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRENCH 70b","cat_num":"6720","course_id":"4389","year":"2011","term":"1","id":"8a5c0427496442fd9ebecde474ce1896","first":"Janet L.","last":"Beizer","InstructorOverall":"3.72","EffectiveLecturesorPresentations":"3.56","AccessibleOutsideClass":"3.79","GeneratesEnthusiasm":"3.78","FacilitatesDiscussionEncouragesParticipation":"3.47","GivesUsefulFeedback":"3.73","ReturnsAssignmentsinTimelyFashion":"3.90"}]},"Fall '10":{"course_score":{"overall":"4.11","workload":"2.53","difficulty":"3.17","recommendation":"4.26","enrollment":"21","response rate":"90.48","QCourseOverall":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"1","2s":"1","3s":"2","4s":"5","5s":"4"},"QDifficulty":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"6","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRENCH 70b","cat_num":"6720","course_id":"4389","year":"2010","term":"1","id":"8a5c0427496442fd9ebecde474ce1896","first":"Janet L.","last":"Beizer","InstructorOverall":"3.84","EffectiveLecturesorPresentations":"3.95","AccessibleOutsideClass":"3.72","GeneratesEnthusiasm":"3.95","FacilitatesDiscussionEncouragesParticipation":"3.62","GivesUsefulFeedback":"4.00","ReturnsAssignmentsinTimelyFashion":"4.33"}]},"Fall '09":{"course_score":{"overall":"3.65","workload":"2.30","difficulty":"3.13","recommendation":"3.87","enrollment":"26","response rate":"88.46","QCourseOverall":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"1","2s":"1","3s":"2","4s":"5","5s":"4"},"QDifficulty":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"6","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRENCH 70b","cat_num":"6720","course_id":"4389","year":"2009","term":"1","id":"652b6249711e644ae28ee0b05e649062","first":"Verena","last":"Conley","InstructorOverall":"4.22","EffectiveLecturesorPresentations":"4.18","AccessibleOutsideClass":"4.19","GeneratesEnthusiasm":"4.17","FacilitatesDiscussionEncouragesParticipation":"4.05","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"2.60"}]},"Fall '08":{"course_score":{"overall":"4.09","workload":"2.45","difficulty":"3.45","recommendation":"4.14","enrollment":"30","response rate":"76.67","QCourseOverall":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"1","2s":"1","3s":"2","4s":"5","5s":"4"},"QDifficulty":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"6","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRENCH 70b","cat_num":"6720","course_id":"4389","year":"2008","term":"1","id":"8a5c0427496442fd9ebecde474ce1896","first":"Janet L.","last":"Beizer","InstructorOverall":"3.86","EffectiveLecturesorPresentations":"4.09","AccessibleOutsideClass":"3.50","GeneratesEnthusiasm":"3.95","FacilitatesDiscussionEncouragesParticipation":"3.91","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.33"}]},"Fall '07":{"course_score":{"overall":"3.44","workload":"2.33","difficulty":"3.07","recommendation":"3.60","enrollment":"23","response rate":"69.57","QCourseOverall":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"1","2s":"1","3s":"2","4s":"5","5s":"4"},"QDifficulty":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"6","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRENCH 70b","cat_num":"6720","course_id":"4389","year":"2007","term":"1","id":"8a5c0427496442fd9ebecde474ce1896","first":"Janet L.","last":"Beizer","InstructorOverall":"3.27","EffectiveLecturesorPresentations":"3.21","AccessibleOutsideClass":"3.27","GeneratesEnthusiasm":"2.93","FacilitatesDiscussionEncouragesParticipation":"3.50","GivesUsefulFeedback":"3.29","ReturnsAssignmentsinTimelyFashion":"3.33"}]},"Fall '06":{"course_score":{"overall":"3.87","workload":"2.33","difficulty":"2.93","recommendation":"3.93","enrollment":"22","response rate":"68.18","QCourseOverall":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"1","2s":"1","3s":"2","4s":"5","5s":"4"},"QDifficulty":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"6","3s":"6","4s":"1","5s":"0"}},"instructor_scores":[{"number":"FRENCH 70b","cat_num":"6720","course_id":"4389","year":"2006","term":"1","id":"8a5c0427496442fd9ebecde474ce1896","first":"Janet L.","last":"Beizer","InstructorOverall":"3.87","EffectiveLecturesorPresentations":"3.67","AccessibleOutsideClass":"3.93","GeneratesEnthusiasm":"3.80","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"3.57","ReturnsAssignmentsinTimelyFashion":"3.86"}]}},"comments":{"Fall '07":{"comments":["a great survey of 19th and 20th century french literature!","This is a really good class if you've never taken a French lit class before. Most of the books are easy to read and they are not too long.","The lectures were not particularly helpful in my understanding of the books that we read.","Does not provide a sufficient survey of 19th and 20th century French literature","You will thoroughly enjoy the readings!","if you like literature a good option","Good survey course, writing assignments are pretty hard, but overall an interesting course.  Intimidating professor though!","Make sure you really enjoy reading french literature, otherwise the comprehensive reading list will probably feel like a burden.","Some might find this class difficult, I wonder how some people did it.","I was required to take this class by my concentration; I think there are probably more enjoyable, balanced alternatives for those with just a passing interest in French literature."]},"Fall '09":{"comments":["The best French class I've taken at Harvard.","Take this class if you're interested in getting little tastes of a lot of authors, not if you are looking for an intense immersion into the works of any particular author.","French 70b is an interesting course (great readings!) with enthusiastic instructors and a manageable work load.  Definitely a great way to fulfill a Lit&Arts A and to brush up on French at the same time.","There is a lot of writing involved, and the class is pretty big for a language class.","This class gives one the opportunity to learn about, read and analyze fantastic literature. The fact that there aren't many requirements brings the texts to the level of pleasure reading, which makes them extremely enjoyable.","This class is an excellent survey of 19th and 20th century French literature. Doesn't go into depth, but gives a clear, broad idea about the current of aesthetics, etc.","While a solid french will prove incredibly helpful, it is still possible to do well on this course without it.","It is a really fun relaxed and interesting class, as long as you do the readings of course!","As taught by Verena Conley, for being a survey class, this course has a very manageable workload.","Great class! The texts are very interesting. There is variety and overall it is a great introduction to some of the most important French writers.","This is a really interesting course with a wonderful selection of texts. The lectures are very engaging and I learned a lot about not just the stories, but also the ideas the authors were exploring.","Enjoyable overview of French literature, great professor!","Be ready to read a lot.","It is important to be comfortable reading and writing a lot in French.","I took this course the semester I declared Romance Languages as my concentration, and for the first time since I started taking French at age 11, I doubted whether I could actually continue taking French literature courses.  This class was, to put it simply, boring.  I spent every lecture contemplating jumping out the first-floor window.  This course's lectures are the only ones I have ever skipped simply because I could not bear to sit through another one.  I love French literature, I found the professor and TF both very nice and knowledgeable by the end of the semester, and I did enjoy most of what we read, but I hated this class.","Professor Conley is an excellent Professor. Though I had a few criticisms of this course (the literature was a little bit disjointed, and section sometimes a little slow), I generally enjoyed the course a lot. Professor Conley talked with us about what we thought some of the strengths and weaknesses of the readings were, and we all agreed that perhaps the list was a little bit too ambitious at times (reading 350 pages of \"Swann's Way\" in 3 days, for example). Given that, I think this course (which was new this year) will be even better next time.","If it is taught by the same staff, I would highly advise against taking this course. I can tell you that this course has resulted in me not wanting to take future French courses at Harvard simply because there is a chance that other courses might be like this one. Lectures are disparate, Readings are dull. Just don't take this.","Great introduction to French literature"]},"Fall '10":{"comments":["This class is great if you are interested in reading French literature. This is not the class for you if you want to talk a lot, however, because it is lecture based and one can only really talk substantially in section. One should be prepared to read a book a week.","Go talk to the professor and the TF about books and the papers. The assignments are very open-ended, and they can help give you guidance.","TAKE IT","This was my favorite class of my semester. I absolutely loved almost everything we read and I really enjoyed the insights Madame Beizer gave. I would definitely recommend this class to anyone and everyone.","It's a great course.  Assignments are well balanced (readings and writing assignments).  Expectations of students are reasonable.   All of the work is do-able.  It's neither too-much work nor too-little work.  If a student takes the time to do all the readings and is prepared for class and section, he\/she can get a lot out of this course and really improve their comprehension of French and of French literature during the 19th and 20th centuries.","This was a decent class, but it has the potential to be an awesome one. It could have been much better were it actually organized in a coherent way.","If you are at all interested in French literature, or in concentrating in French, then this class should not be missed.  Although it can feel rushed at times due to the sheer amount of material that it is necessary to cover, taking this course taught me how to write in French even though I had almost no prior experience with writing.","This was without a doubt my favorite class this semester. The reading material was (almost without exception) engaging and interesting, both Janet and Katherine were exceptionally relatable, nurturing, and kind, and the workload was completely reasonable. TAKE THIS CLASS! You will not regret it.","The workload is formidable, but the course is great!","Great selection of literature, well-taught. Not too much work, but not an \"easy\" class either.","There is undoubtedly a lot of reading, but it is worth it to get through it.","This class is a great introduction to French literature and an amazing chance to read some of the books you've always wanted to.  This is the best French class I've taken at Harvard, and I highly recommend it."]},"Fall '11":{"comments":["A great intro to French literature, accessible to those who don't want to take on a huge time commitment and simply enjoy French.","Incredibly interesting class that works many seminal pieces of French literature into a coherent literary timeline and deals well with their complex themes. However, be ready for what -- after a 50-level class, at least -- feels like quite a lot of reading.","Prof. Beizer and Kathryn are amazing.  I was having a tough time in the class, and they reached out to me and made me believe that I could succeed.","It is an interesting introduction to French literature and you read a lot of famous works, but it is time consuming.","This is an excellent course for someone who is interested in French literature but may not have taken a french lit class before.  It will greatly improve your reading comprehension and help you to look closely at french texts.","This class definitely requires a lot of time and dedication, especially during midterm period. However, it was still an enjoyable class, and the faculty\/staff tried hard to make us understand the material.","Readings are varied, and while some are interesting, they are inconsistent in both difficulty and interest.","A very fun, engaging class.  A background in literary theory is not required, but it is extremely helpful.","A good survey course. Readings are mostly very good and your knowledge of reading\/writing French will improve quite a bit.  Teaching staff is passionate and reasonable.  Be aware of 2 things: 1) There is at times a feminist undertone to the discussion and works in this class.  Not saying that is a bad thing.  2) Reading quizzes test names of (sometimes minor) characters and places and occur sporadically.  3) The amount and difficulty of reading every week grows throughout the course.  By midway you will be reading double what you read at the beginning, and denser material.  Take this class if you are curious about 19th 20th century French literature    \r\nand want practice writing.","Tough, and requires both better French and better analysis than a 60-level course, but rewarding if you put in the time and effort.","Make sure you keep up with the readings and that you carefully edit your papers.","It's a good class and the TF is amazing. The readings are interesting and too hard, if you have a good knowledge of French. \r\nNevertheless, a lot in this class depends on the students, and sometimes it can get boring and repetitive. And don't take this one if what you want to improve is your speaking skills. As for the writings, just make sure to talk to Kathryn a lot."]},"Fall '12":{"comments":["Take this class! It is a joy to work with such insightful people and both the prof and the TF make sure to carry you step by step through the materials and help you actually get something out of the whole experience!","The feedback I got in this course was great, and Janet and Jessica are very approachable. They'll push you to improve (on your grammar but most importantly on your ability to analyze critically) if you are receptive, and you will notice your improvement by the end of the semester. It is great that they dedicate more than one class session to most of the works -- they certainly merit them.","I took this course because I was really interested in French literature in high school, but I found out that this interest did not really carry over to college.  Professor Beizer was very nice and knowledgeable, but it seemed like discussions in class were very one-sided, with her ideas dominating.  Sometime it felt like she shot down some of the students' ideas.  If she did a better job facilitating and encouraging discussion, this class would be much better.","Solid class. The readings were interesting and got better as they became more contemporary. I would have liked to have seen a more comprehensive theme running throughout the texts that we read. I understood their connection to each other, but felt that this wasn't really touched upon much in class. Jessica, the TF, was incredible. I actually found her more helpful than the Professor. If she's still teaching this class, take it just for her. All in all it's a good introduction to French lit. The readings can be hard at times.","This is a really great class. There is a lot of reading, so I would definitely tell future students that the amount of reading was a little daunting."]},"Spring '14":{"comments":["The syllabus will change and you need to be prepared for that.","Unless this class is something you have to take or you are passionate about French Literature, I highly suggest you do not take it. It was not enjoyable, and it was highly difficult. It did, however, create a stimulating intellectual environment.","This was my first French literature course that I took at Harvard, and I loved it. Mme Beizer is fantastic and so nice- take her up on her offer to meet outside of class! Also Kathryn was a fantastic TF, and I loved all of our discussions in section.","This is a great course with truly enjoyable, interesting books and section discussions. It is more rigorous than 70a, but follows a similar format of reading a book a week and writing response papers every other week. Mme Beizer is very knowledgeable and Kathryn is a great TF.","While I enjoyed this course immensely, I would like to tell future students not to expect the same ease they may have encountered in earlier French classes.  In this class, we read a book nearly every week (which actually was my favorite part of the course), which was also very taxing.  Also, the assignments, though minimal, are taken very seriously in the grading process. Lower grades especially at the beginning are very likely in this course.  However, both Professor Beizer and Kathryn are VERY VERY VERY nice and willing to talk to their students. Also, try to speak up in class; sometimes Professor Beizer may not agree with what you're saying (because she has studied all of these works so extensively), but it is always a good idea to express your thoughts to really engage with the material in this course.","This is a great introduction to French literature. You get what you put into it. Definitely set aside enough time to go through the assigned reading each week. I would recommend this course only to those who are already confident of their French ability--you should be able to read the assigned readings without having to constantly refer to a dictionary.","This class was fantastic.  Definitely a must for any concentrators or people pursuing a secondary.  Even if you just love French, and haven't particularly had experience with French lit., it's a wonderful class.  Professor Beizer and Kathryn make a great team, and the texts chosen are a great mix of well-known classics and a little less familiar (although still great) texts.  You write 5 responses papers (1-2 pages) every other week and 2 mid length papers throughout the semester.  Lecture is mostly Professor Beizer talking with some student discussion as well--a good mix.","Professor Beizer is a fantastic professor who makes the students excited about the books we read, which are well-chosen and interesting for a beginner's French literature class. The reading can be  difficult at times and Professor Beizer is a bit of a tough grader but the class is truly excellent."]}},"mostRecentQ":{"overall":"3.80","workload":"2.60","difficulty":"3.50","recommendation":"3.80","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"1","2s":"1","3s":"2","4s":"5","5s":"4"},"QDifficulty":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"0","3s":"8","4s":"4","5s":"1"},"QWorkload":{"number":"FRENCH 70b","course_id":"4389","cat_num":"6720","1s":"0","2s":"6","3s":"6","4s":"1","5s":"0"}},"success":true}