{"scores":{"Fall '14":{"course_score":{"overall":"3.40","workload":"4.40","difficulty":null,"recommendation":"3.40","enrollment":"21","response rate":"80.95","QCourseOverall":{"number":"GOV 1010","course_id":"11359","cat_num":"8482","1s":"1","2s":"3","3s":"4","4s":"6","5s":"3"},"QDifficulty":{"number":"GOV 1010","course_id":"11359","cat_num":"8482","1s":"0","2s":"5","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1010","course_id":"11359","cat_num":"8482","1s":"1","2s":"11","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 1010","cat_num":"8482","course_id":"11359","year":"2014","term":"1","id":"eb52dcea5bf58e949d75617cf0a0a8bc","first":" Chase H.","last":"Harrison","InstructorOverall":"3.60","EffectiveLecturesorPresentations":"3.00","AccessibleOutsideClass":"4.10","GeneratesEnthusiasm":"3.40","FacilitatesDiscussionEncouragesParticipation":"3.80","GivesUsefulFeedback":"3.90","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Fall '13":{"course_score":{"overall":"4.70","workload":"1.60","difficulty":"2.30","recommendation":"4.70","enrollment":"7","response rate":"100.00","QCourseOverall":{"number":"GOV 1010","course_id":"11359","cat_num":"8482","1s":"1","2s":"3","3s":"4","4s":"6","5s":"3"},"QDifficulty":{"number":"GOV 1010","course_id":"11359","cat_num":"8482","1s":"0","2s":"5","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1010","course_id":"11359","cat_num":"8482","1s":"1","2s":"11","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"GOV 1010","cat_num":"8482","course_id":"11359","year":"2013","term":"1","id":"eb52dcea5bf58e949d75617cf0a0a8bc","first":" Chase H.","last":"Harrison","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.43","AccessibleOutsideClass":"5.00","GeneratesEnthusiasm":"5.00","FacilitatesDiscussionEncouragesParticipation":"5.00","GivesUsefulFeedback":"4.43","ReturnsAssignmentsinTimelyFashion":"4.71"}]}},"comments":{"Fall '13":{"comments":["This class will provide you with real skills in survey design. You will think critically about claims that you see in articles, and question every survey that you take from now on. It's a great class!","This is an awesome class for numerous reasons. 1) Chase is great, clearly an expert and passionate about survey methodology, and he is incredibly helpful and understanding. 2) It's a small class and you work on your survey project in a group so you will actually meet new people and get to know them. 3) If you're a stat concentrator, this is a pure gem. And it really is incredibly useful and relevant to the concentration. You should know about how data is gathered. 4) Despite the low workload, you will learn so so much.  The reason I didn't have to spend much time outside of class was because class itself was actually useful and relevant to the assignments; it wasn't useful drivel being spurt out at us like most class lectures. 5) You will never look at a survey (or data) the same way ever again.\r\nTAKE IT. (especially if you're a stat concentrator)","This was a great chance to learn more about survey research methods by actually creating and distributing a survey. It also really opened my eyes to the flaws in a lot of student-created surveys that are distributed to Harvard students.","This class is a lot of fun. You conduct a survey with a group. We were lucky this year to have very motivated teammates, but otherwise I would suggest choosing reliable team members. You spend much of your time in this class working with your teammates outside of class, so it is important that you trust everyone in your group. The class component is great because it is basically a seminar.","This class is great! It's one of those great courses where you learn a lot but the workload is very manageable, as your work is directly related to what you're learning. The readings are also very easy to follow and informative while not being too dense. Chase is a wonderful teacher and really takes the time to work with each student. Couldn't recommend this course more!"]},"Fall '14":{"comments":["DO NOT TAKE THIS COURSE. waste of a harvard semester. seriously -- not worth it at all. the material is really rudimentary & boring. professor tries, but is really frustrating. you get absolutely no valuable feedback along the way, and so your grades feel really arbitrary. i don't think i learned anything in this class that wasn't common sense that you probably should've known anyways. class turned into three hours of surfing the internet every week. STAY AWAY.","This course provides a great combination of overview and in-depth knowledge of survey and survey research topics.  I would highly recommend this course for anyone who may use surveys or survey research in their careers.","Professor Harrison and Tess are great! Take it if you are interested in learning how surveys are conducted. You won't regret it!","Lectures get a bit tedious but the material is valuable.","Keep up with the vocabulary and you will do great.","It's very useful and well-designed, but it's not the most exciting class ever.","Great, easy to manage course to learn about survey research methods. The project and final paper can take a bit of time.","Survey methods is pretty intuitive, so honestly I dont feel that I learned very much. The professor and TF are both very sweet, but lecture is incredibly dull and pretty much everyone is just reading their email or on facebook. The project component of this class is it's saving grace, but I would not recommend this class.","This course is a very low time commitment, but the material is dry and lectures are not engaging. In addition, grading is very sporadic with little explanation. While it is an easy way to fulfill a requirement, be prepared for an uninteresting semester and probably not an A.","The course is centered around an in-depth, interesting project, which was pretty cool to do. However, the lecture component is very dry.","While it is not the most interesting course I have taken, it was an easier way to fulfill a concentration requirement for Statistics.","This is the most boring class I've taken at Harvard.","GOV 1010 is a unique class in that you are able to learn about survey creation and implementation during lecture and then turn right around and try it for yourself. It is definitely important to have a good group, as you'll be working closely with them on most of the assignments. A great concentration course!"]}},"mostRecentQ":{"overall":"3.40","workload":"4.40","difficulty":null,"recommendation":"3.40","enrollment":"21","response rate":"80.95","QCourseOverall":{"number":"GOV 1010","course_id":"11359","cat_num":"8482","1s":"1","2s":"3","3s":"4","4s":"6","5s":"3"},"QDifficulty":{"number":"GOV 1010","course_id":"11359","cat_num":"8482","1s":"0","2s":"5","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"GOV 1010","course_id":"11359","cat_num":"8482","1s":"1","2s":"11","3s":"2","4s":"0","5s":"0"}},"success":true}