{"scores":{"Spring '14":{"course_score":{"overall":"4.50","workload":"1.60","difficulty":"2.40","recommendation":"4.30","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"SOC-WORLD 45","course_id":"2058","cat_num":"6134","1s":"0","2s":"1","3s":"0","4s":"4","5s":"9"},"QDifficulty":{"number":"SOC-WORLD 45","course_id":"2058","cat_num":"6134","1s":"1","2s":"6","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 45","course_id":"2058","cat_num":"6134","1s":"7","2s":"5","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 45","cat_num":"6134","course_id":"2058","year":"2013","term":"2","id":"62da2b4f7b89c047307df379cd365724","first":" Mark C.","last":"Elliott","InstructorOverall":"4.70","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.30","GeneratesEnthusiasm":"4.70","FacilitatesDiscussionEncouragesParticipation":"4.70","GivesUsefulFeedback":"4.70","ReturnsAssignmentsinTimelyFashion":"4.40"}]},"Fall '11":{"course_score":{"overall":"4.38","workload":"2.54","difficulty":"3.23","recommendation":"4.23","enrollment":"14","response rate":"92.86","QCourseOverall":{"number":"SOC-WORLD 45","course_id":"2058","cat_num":"6134","1s":"0","2s":"1","3s":"0","4s":"4","5s":"9"},"QDifficulty":{"number":"SOC-WORLD 45","course_id":"2058","cat_num":"6134","1s":"1","2s":"6","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 45","course_id":"2058","cat_num":"6134","1s":"7","2s":"5","3s":"2","4s":"0","5s":"0"}},"instructor_scores":[{"number":"SOC-WORLD 45","cat_num":"6134","course_id":"2058","year":"2011","term":"1","id":"62da2b4f7b89c047307df379cd365724","first":"Mark C.","last":"Elliott","InstructorOverall":"4.54","EffectiveLecturesorPresentations":"4.54","AccessibleOutsideClass":"3.82","GeneratesEnthusiasm":"4.23","FacilitatesDiscussionEncouragesParticipation":"3.78","GivesUsefulFeedback":"3.25","ReturnsAssignmentsinTimelyFashion":"3.50"}]}},"comments":{"Fall '11":{"comments":["Readings are a must for this class if you want to know what's going on during section.  Only problem is, weekly readings can range from 100-250 pages a week.  This is definitely a prototypical \"history class\".  Not the easiest way to fulfill the Societies of the World gen ed.","Mark Elliott is fantastic.  Follow the readings and you'll be all set!","I learned so much in this class, I'm frankly shocked. \"What is China?\" indeed. The map assignments were bothersome because I'd keep forgetting to do them before section, but in retrospect, it's really cool to see the geography of 2000+ years of history! The video project was also fun.","Great course, great professor","You will gain broad and substantive knowledge of the topic, provided you do the readings and listen attentively in class. You will enjoy Prof. Elliott's catholic knowledge and dry humor.","It is quite a challenge.  The assignments are very tricky and the expectations are not obvious.  It can certainly be an enjoyable experience but tread carefully.","This class is superb. If you have any interest whatsoever in China or Chinese history, it is an absolute must. The material is engaging, the lectures are thoughtful and often provocative, and the whole of the course will gives a really different and useful view on China and its frontier regions.","One of the best gen eds I've taken at Harvard. I came in expecting to learn about history and I came out with so much more, the way i view chinese relations and the role of China in history has changed, my opinions about chinese and inner asian relations have been reshaped (particular on the issue of Tibet), and i now have a much greater geographic awareness of Inner asia (from the google earth assignment). take it!","This is a good course for anyone who is strangely obsessed with the nomads of Eastern and Central Asia.  If you can handle lots of reading and are interested in Asian nomadic peoples, go ahead and take this course.","As a student with no background in Chinese history, this course taught me the basics of Chinese history without ever feeling like a survey course. As a non-history concentrator, this course exposed me to what I thought were fairly substantive historical questions and gave me the opportunity to engage with them. Professor Elliott organizes his lectures well and teaches clearly.  All in all, this is one of the best classes I've taken at Harvard without a doubt."]},"Spring '14":{"comments":["A wonderful course that will change your understanding of China.","Exceptionally interesting course; you will learn a lot.  If you would like to take a Gen-Ed course in which you will actually learn something substantive, take this course.","This is an excellent class. Professor Elliott is an affable, skilled, and extremely knowledgeable lecturer, and his presentations incorporate visual materials and handouts to convey the course material as well as possible. The readings are very interesting, and you'll learn enough about the histories of both China and Central Asia to have a solid background on both. Highly recommended.","This class offers a very different and enlightening way of approaching China and its history. It really helps me to understand not only historical China but also the challenges that China is facing today.","Professor Elliott is an engaging lecturer, and does a good job relating history to the present--which is crucial when dealing with ancient history, as much of this class does. I came away from this class feeling I knew a fair amount about both the specifics and the general trends of Inner Asia's interactions with China.","Go to lectures and you won't need to study at all.","The history of China is rich and richly complicated. By using the nomadic peoples surrounding China as a lens through which to study China itself, a particular historical strain can be isolated with surprising results. The course is low-stress and genuinely interesting. I would highly recommend it as a way to satisfy Societies of the World, and\/or as a way to deepen one's knowledge of China in ways that remain significant into the 21st century.","If you have no previous experience with Chinese history, you will still be able to do well in the course, but you will feel like you are missing out on subtle details.","I really wanted to like this class, but I just found it difficult to engage.  I think partly it was too broad, so because it tried to cover so much I ended up not getting that much out of it.  Lecture was generally good, but the readings were just not up my alley.","If you are interested in Chinese history, you should take this class. Lecture is engaging, both Prof. Elliot and Devin made an effort to get our feedback on what we wanted out of this class and section was based around this; there was also plenty of opportunity to ask questions about the course material in lecture. This course gives a basic overview of Chinese history through a lens which you don't usually get to see. It does not require much work (two short essays, a few quizzes, a video project and final) and is a great Gen Ed!"]}},"mostRecentQ":{"overall":"4.50","workload":"1.60","difficulty":"2.40","recommendation":"4.30","enrollment":"15","response rate":"93.33","QCourseOverall":{"number":"SOC-WORLD 45","course_id":"2058","cat_num":"6134","1s":"0","2s":"1","3s":"0","4s":"4","5s":"9"},"QDifficulty":{"number":"SOC-WORLD 45","course_id":"2058","cat_num":"6134","1s":"1","2s":"6","3s":"7","4s":"0","5s":"0"},"QWorkload":{"number":"SOC-WORLD 45","course_id":"2058","cat_num":"6134","1s":"7","2s":"5","3s":"2","4s":"0","5s":"0"}},"success":true}