{"scores":{"Spring '14":{"course_score":{"overall":"4.60","workload":"2.40","difficulty":"2.80","recommendation":"4.60","enrollment":"35","response rate":"60.00","QCourseOverall":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"0","3s":"1","4s":"5","5s":"14"},"QDifficulty":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"8","3s":"10","4s":"0","5s":"2"},"QWorkload":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"3","2s":"10","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"CHNSE 140b","cat_num":"6844","course_id":"770","year":"2013","term":"2","id":"be30d6c2deffd62a03e22aa8d5c77845","first":" Lei","last":"Yan","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.90","AccessibleOutsideClass":"4.90","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.80","GivesUsefulFeedback":"4.80","ReturnsAssignmentsinTimelyFashion":"4.80"}]},"Spring '13":{"course_score":{"overall":"4.25","workload":"2.75","difficulty":"3.42","recommendation":"4.04","enrollment":"32","response rate":"75.00","QCourseOverall":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"0","3s":"1","4s":"5","5s":"14"},"QDifficulty":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"8","3s":"10","4s":"0","5s":"2"},"QWorkload":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"3","2s":"10","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"CHNSE 140b","cat_num":"6844","course_id":"770","year":"2012","term":"2","id":"197a7d30cffec1e259c20789394ae8e9","first":" Xinyi","last":"Zhang","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"4.13","AccessibleOutsideClass":"4.48","GeneratesEnthusiasm":"3.74","FacilitatesDiscussionEncouragesParticipation":"4.24","GivesUsefulFeedback":"4.25","ReturnsAssignmentsinTimelyFashion":"4.76"}]},"Spring '12":{"course_score":{"overall":"4.73","workload":"2.55","difficulty":"3.00","recommendation":"4.85","enrollment":"36","response rate":"91.67","QCourseOverall":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"0","3s":"1","4s":"5","5s":"14"},"QDifficulty":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"8","3s":"10","4s":"0","5s":"2"},"QWorkload":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"3","2s":"10","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"CHNSE 140b","cat_num":"6844","course_id":"770","year":"2011","term":"2","id":"7598a7eabe5e6ea16fbb312f15538b1f","first":"Miaomiao","last":"Wang","InstructorOverall":"4.88","EffectiveLecturesorPresentations":"4.91","AccessibleOutsideClass":"4.82","GeneratesEnthusiasm":"4.85","FacilitatesDiscussionEncouragesParticipation":"4.61","GivesUsefulFeedback":"4.55","ReturnsAssignmentsinTimelyFashion":"4.87"}]},"Spring '11":{"course_score":{"overall":"4.54","workload":"2.71","difficulty":"3.04","recommendation":"4.71","enrollment":"34","response rate":"82.35","QCourseOverall":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"0","3s":"1","4s":"5","5s":"14"},"QDifficulty":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"8","3s":"10","4s":"0","5s":"2"},"QWorkload":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"3","2s":"10","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"CHNSE 140b","cat_num":"6844","course_id":"770","year":"2010","term":"2","id":"7598a7eabe5e6ea16fbb312f15538b1f","first":"Miaomiao","last":"Wang","InstructorOverall":"4.75","EffectiveLecturesorPresentations":"4.89","AccessibleOutsideClass":"4.89","GeneratesEnthusiasm":"4.86","FacilitatesDiscussionEncouragesParticipation":"4.58","GivesUsefulFeedback":"4.55","ReturnsAssignmentsinTimelyFashion":"4.77"}]},"Spring '10":{"course_score":{"overall":"4.56","workload":"2.72","difficulty":"3.03","recommendation":"4.41","enrollment":"38","response rate":"84.21","QCourseOverall":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"0","3s":"1","4s":"5","5s":"14"},"QDifficulty":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"8","3s":"10","4s":"0","5s":"2"},"QWorkload":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"3","2s":"10","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"CHNSE 140b","cat_num":"6844","course_id":"770","year":"2009","term":"2","id":"7598a7eabe5e6ea16fbb312f15538b1f","first":"Miaomiao","last":"Wang","InstructorOverall":"4.81","EffectiveLecturesorPresentations":"4.81","AccessibleOutsideClass":"4.74","GeneratesEnthusiasm":"4.78","FacilitatesDiscussionEncouragesParticipation":"4.77","GivesUsefulFeedback":"4.56","ReturnsAssignmentsinTimelyFashion":"4.85"}]},"Spring '09":{"course_score":{"overall":"4.59","workload":"2.59","difficulty":"3.00","recommendation":"4.45","enrollment":"52","response rate":"84.62","QCourseOverall":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"0","3s":"1","4s":"5","5s":"14"},"QDifficulty":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"8","3s":"10","4s":"0","5s":"2"},"QWorkload":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"3","2s":"10","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"CHNSE 140b","cat_num":"6844","course_id":"770","year":"2008","term":"2","id":"7598a7eabe5e6ea16fbb312f15538b1f","first":"Miaomiao","last":"Wang","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.75","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.66","GivesUsefulFeedback":"4.64","ReturnsAssignmentsinTimelyFashion":"4.93"}]},"Spring '08":{"course_score":{"overall":"4.42","workload":"2.68","difficulty":"3.24","recommendation":"4.44","enrollment":"33","response rate":"75.76","QCourseOverall":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"0","3s":"1","4s":"5","5s":"14"},"QDifficulty":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"8","3s":"10","4s":"0","5s":"2"},"QWorkload":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"3","2s":"10","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"CHNSE 140b","cat_num":"6844","course_id":"770","year":"2007","term":"2","id":"7598a7eabe5e6ea16fbb312f15538b1f","first":"Miaomiao","last":"Wang","InstructorOverall":"4.71","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.96","GeneratesEnthusiasm":"4.72","FacilitatesDiscussionEncouragesParticipation":"4.62","GivesUsefulFeedback":"4.59","ReturnsAssignmentsinTimelyFashion":"4.91"}]},"Spring '07":{"course_score":{"overall":"4.21","workload":"2.48","difficulty":"3.30","recommendation":"4.35","enrollment":"49","response rate":"55.10","QCourseOverall":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"0","3s":"1","4s":"5","5s":"14"},"QDifficulty":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"8","3s":"10","4s":"0","5s":"2"},"QWorkload":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"3","2s":"10","3s":"5","4s":"1","5s":"1"}}}},"comments":{"Spring '08":{"comments":["Become more familiar with the teachers, participate in class","It is somewhat difficult in terms of workload, but very rewarding","If you haven't learned some Chinese yet, what are you waiting for?","There is a lot of work on a daily basis, but it is a very rewarding class and probably one of the few classes where you will really feel like you are friends with your classmates and teachers.","The energy and dedication of the teaching staff are incredible, and you will certainly leave the class with a noticeably higher level of reading and writing!","it's challenging but worthwhile","If you are a heritage speaker, expect big improvements in listening, speaking, and writing. The reading portion was weak because we tried to cover a lot of text.","If you're willing to work hard, you will learn a LOT in this class","It's a wonderful class. You will learn a lot of Chinese, but be prepared for a fair amount of work every single day. That being said, your grade is easier to control, due to the amount of work that you have.","make sure you really want to learn Chinese before you take this course, as you will be contributing significant energy and time to the course.","I would only recommend this course if the student has a genuine love of Chinese.  140 is the only option to continue Chinese after 130 (Except for 142 which is only conversational and is not known to be a rigorous, stimulating class).  However, 140 truly frustrates students who have been in the Chinese classes from the beginning (Ba\/Bb or Aab), and it is truly unfortunate because these are the students who love the language and love the department and who have put forth immense effort to reach 140 only to be severely disappointed, frustrated and discouraged.","Wang Laoshi is great! You'll love her.","The class focuses on teaching how to use Chinese instead than examining the language by itself. It would benefit students intending to use Chinese in business or research or whatever other profession than students who want to deeply understand the language. \r\n\r\nA major problem with the class is that it does not discern between good writing and bad writing. It teaches clumsy and even awkward sentence structures. Some academic articles we read in class are written so terribly that they should never be examined and picked to represent Chinese writing.","Fun and useful class. Be prepared to be challenged but it's worth it in the end.","Greatly improves ability to read and understand Chinese.","it is difficult and time consuming, but it is an excellent class for improving chinese language skills"]},"Spring '09":{"comments":["High return to effort put in.","It's a great way to learn Chinese","The teachers are super nice and it's easy to get an A.","Study the texts closely; they are the best way to prepare for exams and improve reading and writing ability. Prepare in advance for the debates; not only will you do better, but you will get more out of them.","this class is aaaaawesome!!!!","Take it to further your mastery of Mandarin. But make sure you take the smaller classes!","This course is totally awesome.","Be aware that there are native speakers in this class, and the workload is therefore extremely uneven depending on your background and how much time you can commit to your Chinese studies. Otherwise, the teaching staff is excellent and you will learn an incredible amount in a relatively short amount of time.","Absolutely fantastic course! You will learn so much Chinese with a good balance between read, written and spoken Chinese. Although the intensity may not be that high there is work to do for this course almost every day. Be prepared to put in a lot of small but regular effort every day.","You should be really interested in Chinese affairs if you're going to take the class.","only people interested in Chinese for its own sake (i.e. not just for language requirement or international business) should apply","Jia You.","So much fun DO IT","This is one of the best classes I have taken at Harvard.  The instructors do a great job.","A great course with a lot of work, but that definitely helps one improve his\/her Chinese. Also that Wang Laoshi is a great instructor.","A superb class, but like all language courses, you get out of it what you put in.","This isn't a hard class. But you have to work constantly. The work never stops.","listening to the CD that comes with the textbook helps a lot","This course is helpful for improving reading and writing skills.   However, there are two drawbacks:: 1) it is less helpful in maintaining conversational fluency, and 2) it requires students to wade through some unhelpful and time-consuming material in order to glean the useful parts.","it's a lot of work, but you'll get a lot out","This is a great course to learn some sophisticated phrases while still being able to be easily understood if you only know colloquial Chinese.","You definitely learn a lot in this class regarding both Chinese language and culture. The preceptors are wonderful and can easily explain any questions you may have. They do a great job teaching and are wonderful people to meet with outside of classes too."]},"Spring '10":{"comments":["If you've stuck with it this long, I'm sure you will love Chinese 140b as much as the rest of us.","Take it if you feel dedicated to Chinese language and culture.","It's definitely one of my most enjoyable classes this year!","The preceptors are very enthusiastic and makes the class really fun!","It's a lot of daily preparation and work, but it's a great class. The teachers are enthusiastic, assignments are very useful, and you come out with a lot more than you went in with.","comfort in formal speech is necessary","Professors are wonderful!","Wang Laoshi and Feng Laoshi are great! I'm so sad that Feng Laoshi won't be around next year!","This is a great way to improve your Chinese skills. Wang Laoshi is one of the best teachers I've ever had at Harvard. She is so caring and effective - it makes all the difference in a class with a heavy workload.","Like any language course, Chinese 140 is a lot of medium-intensity work.  The workload never gets terribly high, but it's always there.  You definitely get as much out of the course as you put in.  Chinese 140 definitely helps you a TON with reading and writing.  You'll be able to read essays or articles written in Chinese a whole lot better after this class.","You will learn a lot!  \r\nThe course is similar to Chinese 130x, but a little lighter in workload.\r\nThe course focuses on formal writing, with one chapter on vernacular\/slang.  The vocabulary and sentence patterns learned in the course are not ones you will use extremely often in casual, everyday speech, but rather in either slightly formal, or very formal, contexts.","Seniors may not want to take this class, as the time commitment is signficiant and the workload, while not difficult, can be annoying to deal with","Read the feedback you get for your homeworks and essays! And speak a lot (go to office hours, ask questions) That's the best way you'll improve your Chinese. Memorize chengyus!","You will learn a lot of Chinese and have a lot of fun in this class; prepare to be blown away by how hardworking some of your peers can be1"]},"Spring '11":{"comments":["Wang Lao Shi is amazing and friendly and super helpful. The class if great and will give you a great grasp of the vocab\/sentence forms.","There are many small assignments and requirements for this course, but they are not at all hard to complete, and will definitely improve your Chinese. Also, it's very fun and lax in the sections, those were my favorite.","There might be a lot of work but the teachers keep the students engaged and make the class really enjoyable.","Best year of Chinese I've ever taken.","This class, along with all the other chinese classes, will really prepare you to be a chinese speaker. the teachers are really devoted, and help you out a ton. Also, this is one of the few classes at harvard where if you do your work every night, and do it well, you will undoubtedly earn an A.","Take it! Wang Laoshi is the best-- very talkative and fun. Unfortunately Wu Laoshi, the section leader, will be leaving after this term, but she is very special and nice. åˆ«é”™è¿‡è¿™é—¨å®Œç¾Žæ— ç¼ºçš„è¯¾ï½ž è°¢è°¢è€\u0081å¸ˆä»¬ï¼\u0081","Be prepared to work hard if you are not a native speaker!!!","This course is especially useful if you want to improve your reading and writing. If your focus is speaking, look elsewhere.","Definitely make the most of it. There is a lot of information. You can get a lot out of it if you choose to work hard.","Come with a positive attitude and willingness to learn, and you will enjoy the course!  You will get out of the course as much as you put in; the instructors are also very eager to help so do not fear.  In addition, paying attention in class, preparing for dictations, and taking the homework seriously will allow you to stay on top of course material.","This class really ends up giving out as much as you are willing to put in. It is definitely possible to skate by in this class and end up doing fine (which is extremely tempting with all the stress during the school year), but doing so means that little will actually be learned and most things will probably be forgotten by semester's end."]},"Spring '12":{"comments":["Take it with Wang Lao Shi and Zhao Lai Shi!! They are the best and are very caring.","It is a tad harder than 140a, but still very similar in format and content.","You still have class every day, but you only have to turn in homework once a week! Every week you either have a test or an essay, but it's not bad at all and really helps you learn the material.","The teachers are very thorough in explaining nuances of grammar and denotative meanings of new vocabulary. If you practice by doing readings out loud and writing your vocabulary words as you study them, you will improve your Mandarin Chinese greatly. I feel more confident about speaking and reading now.","a well-taught course expanding language and culture knowledge.","A lot of work, but well worth it.","This class includes a lot more Chinese literature than the previous Chinese classes, but it's still just as fun and engaging.","If you go to class, put in the effort, you will do fine.","great teachers","If you took Chinese 140a, this half is more of the same so you'll already have a good feel of what to expect.","Great class.","very helpful, especially the individual sections","Another great continuation of Chinese at Harvard. If you're not Chinese, though, it is very hard to keep up in the class and you have to work a lot harder.","This is a WONDERFUL course! The teaching staff is awesome and you learn so much over the course of a semester. As a continuation of Chinese 140a, you build upon what you learn and that's really important."]}},"mostRecentQ":{"overall":"4.60","workload":"2.40","difficulty":"2.80","recommendation":"4.60","enrollment":"35","response rate":"60.00","QCourseOverall":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"0","3s":"1","4s":"5","5s":"14"},"QDifficulty":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"0","2s":"8","3s":"10","4s":"0","5s":"2"},"QWorkload":{"number":"CHNSE 140b","course_id":"770","cat_num":"6844","1s":"3","2s":"10","3s":"5","4s":"1","5s":"1"}},"success":true}