{"scores":{"Spring '14":{"course_score":{"overall":"4.50","workload":"2.60","difficulty":"3.40","recommendation":"4.60","enrollment":"25","response rate":"64.00","QCourseOverall":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"2","4s":"4","5s":"10"},"QDifficulty":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"9","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"COMPSCI 152","cat_num":"6841","course_id":"1237","year":"2013","term":"2","id":"ee479778e183acc835de097457884530","first":" Stephen","last":"Chong","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"4.50","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.50","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.60"}]},"Spring '13":{"course_score":{"overall":"4.39","workload":"2.86","difficulty":"3.43","recommendation":"4.30","enrollment":"28","response rate":"82.14","QCourseOverall":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"2","4s":"4","5s":"10"},"QDifficulty":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"9","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"COMPSCI 152","cat_num":"6841","course_id":"1237","year":"2012","term":"2","id":"ee479778e183acc835de097457884530","first":" Stephen","last":"Chong","InstructorOverall":"4.82","EffectiveLecturesorPresentations":"4.78","AccessibleOutsideClass":"4.80","GeneratesEnthusiasm":"4.78","FacilitatesDiscussionEncouragesParticipation":"4.42","GivesUsefulFeedback":"4.50","ReturnsAssignmentsinTimelyFashion":"4.75"}]},"Spring '11":{"course_score":{"overall":"3.60","workload":"3.10","difficulty":"3.50","recommendation":"3.60","enrollment":"12","response rate":"83.33","QCourseOverall":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"2","4s":"4","5s":"10"},"QDifficulty":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"9","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"COMPSCI 152","cat_num":"6841","course_id":"1237","year":"2010","term":"2","id":"0b5f907fda26e4b941d3ffc3fcc68937","first":"Daniel J","last":"Grossman","InstructorOverall":"4.00","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"3.67","GeneratesEnthusiasm":"4.30","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"3.33","ReturnsAssignmentsinTimelyFashion":"4.20"}]},"Spring '10":{"course_score":{"overall":"4.56","workload":"3.00","difficulty":"3.22","recommendation":"4.33","enrollment":"9","response rate":"100.00","QCourseOverall":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"2","4s":"4","5s":"10"},"QDifficulty":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"9","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"COMPSCI 152","cat_num":"6841","course_id":"1237","year":"2009","term":"2","id":"ee479778e183acc835de097457884530","first":"Stephen","last":"Chong","InstructorOverall":"4.89","EffectiveLecturesorPresentations":"4.78","AccessibleOutsideClass":"4.78","GeneratesEnthusiasm":"4.56","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.62","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '09":{"course_score":{"overall":"2.00","workload":"2.25","difficulty":"3.25","recommendation":"2.00","enrollment":"4","response rate":"100.00","QCourseOverall":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"2","4s":"4","5s":"10"},"QDifficulty":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"9","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"COMPSCI 152","cat_num":"6841","course_id":"1237","year":"2008","term":"2","id":"94066f541dfba128e451a9793d40c772","first":"David F.","last":"Bacon","InstructorOverall":"2.25","EffectiveLecturesorPresentations":"3.25","AccessibleOutsideClass":"4.75","GeneratesEnthusiasm":"3.00","FacilitatesDiscussionEncouragesParticipation":"4.00","GivesUsefulFeedback":"4.75","ReturnsAssignmentsinTimelyFashion":"4.75"}]},"Spring '08":{"course_score":{"overall":"4.40","workload":"3.60","difficulty":"4.60","recommendation":"4.00","enrollment":"10","response rate":"60.00","QCourseOverall":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"2","4s":"4","5s":"10"},"QDifficulty":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"9","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"COMPSCI 152","cat_num":"6841","course_id":"1237","year":"2007","term":"2","id":"0d385eae518092ada5b41e8c64bb0f13","first":"John Gregory","last":"Morrisett","InstructorOverall":"4.80","EffectiveLecturesorPresentations":"4.80","AccessibleOutsideClass":"3.80","GeneratesEnthusiasm":"4.80","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"3.00","ReturnsAssignmentsinTimelyFashion":"2.33"}]},"Spring '07":{"course_score":{"overall":"4.38","workload":"3.75","difficulty":"3.38","recommendation":"4.38","enrollment":"13","response rate":"61.54","QCourseOverall":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"2","4s":"4","5s":"10"},"QDifficulty":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"9","3s":"5","4s":"1","5s":"1"}},"instructor_scores":[{"number":"COMPSCI 152","cat_num":"6841","course_id":"1237","year":"2006","term":"2","id":"22431f62e9d332916032008ca92b0849","first":"Norman","last":"Ramsey","InstructorOverall":"4.50","EffectiveLecturesorPresentations":"4.38","AccessibleOutsideClass":"4.67","GeneratesEnthusiasm":"4.88","FacilitatesDiscussionEncouragesParticipation":"4.14","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"3.00"}]}},"comments":{"Spring '08":{"comments":["Difficult concepts, but you learn some cool things about languages and language design.","This is a really wacky, difficult course - it's perhaps not the best way to learn the material presented, which is actually very interesting.  You will encounter programming errors you've never seen before when working in Coq, and it will really, really frustrate you.","Be willing to work, but you'll also learn a lot. Make sure you want to really learn about language design before taking this class.","You need to lobby Prof. M to teach this course again because it was amazing."]},"Spring '09":{"comments":["In its present manifestation, this class should not be taken. It was disorganized and mismanaged, and did not convey the subject in a particularly cohesive manner.","The material covered in the course is very interesting, but even the most interesting material, when taught poorly, can result in a painful experience.","Thinking about this course would often make me too angry to concentrate."]},"Spring '10":{"comments":["This is the most well-taught class that I have taken at Harvard. Professor Chong is a good lecturer and is very helpful outside of the classroom. The lecture notes are excellent if you prefer to learn from written material. The problem sets are not too hard, and they do exactly what they're supposed to--teach you the material. You'll definitely find the material interesting if you have a mixed interest in real-word engineering and theory or if you have a passion for making your programs correct.","Manageable, rewarding and fun. You learn a lot. Steve is one of the most personable professors in the CS department. Definitely take this class if you can.","Be prepared to work hard... this material is challenging","Wonderful professor. Feel a lot more comfortable with certain CS concepts (typing, induction, records). Generally seems a bit academic though, so I'm still not sure how to apply the skills I've learned."]},"Spring '11":{"comments":["The course requires a strong background in proof-based math. The material is interesting but highly mathematical and questionably useful.","If you like functional programming and want to learn more about the formal foundations behind different ways of programming, this class is very eye-opening. It's almost a logic class in that the main concern is \"how can you logically encode this concept\", \"what does this term really mean\", and \"can you prove that this property always holds\". You also get to write lots of fun interpreters and type checkers.","It was a lot of fun! Take it if you liked CS50 and CS51. Word of caution: for those of you that don't like programming, you'll have some trouble with the class. For those of you that don't like proofs and the mathematical part of Cs, you'll have some trouble with the class. Luckily if you are good at either, you'll have time to work on the other. Would definitely recommend you take this class before CS121 if you aren't too comfortable with proofs.","The class is not fun unless you are actively in love with Programming Languages Research. It requires a ton of obscure work that doesn't matter too much to the rest of Computer Science.","Material is quite theoretical (a lot of proofs, building models to reason abstractly). If you like that, you'll love the course, but at times it can leave one wondering what the point is (i.e. real world application). Not altogether sure what learning this helps me do practically."]},"Spring '13":{"comments":["The course is more math-focused than most computer science courses (more than 121 or 124), and more CS-focused than most math courses. Students should be aware that the class is very difficult, and while I absolutely loved it and strongly recommend it, it may be a good idea to take it pass\/fail even if that means not getting course credit.","This course is among the best I have ever taken. Prof. Chong is great, the entire course is well organized, and I have no real complaints about anything. In terms of prereqs, it's good to have some OCaml knowledge and mathematical maturity coming in. The material can be frustrating if you've never done logic before (I hadn't), but it's so rewarding when it clicks. This class should be required for all CS concentrators.","A good introduction to an obscure but interesting topic.","This class is very useful because you learn to program in a lot of different programming languages. I feel very comfortable now with Java, Javascript, Python, Jython, Ruby, and FORTRAN, to name a few!\r\n\r\nJust kidding. This class is more about the theoretical aspects of programming languages, which is hard to describe in one sentence. This was a very good class. It was flawless in terms of organization. Assignments were always returned in a timely manner. The material was interesting. The problem sets are very good at making you learn the material. I thought the midterm was hard, though I know there were a number of people who got good scores.","This is a proofs-based class.  If you're not comfortable with proofs, think twice about taking this class.  I'm also not really sure how the proofs are graded, so that's something else to keep in mind.","Take this class, it is a bit theoretical but really helps with understanding better 51 material and in general how programming languages work. CS121 is not really a prereq and all you use from 121 is structural induction. Also, prof Chong and the TFs are awesome","It's a great course. Programming doesn't start until the latter half of the course (the first three psets had no programming, the last 3 had significant programming parts), but the programming was one of the best parts of the course. The lecture notes are also amazing.","The problem sets are very good -- difficult but well specified. If you liked OCaml in CS51, the OCaml problem sets are entertaining.","Make sure that your proofs are done well and formally.","Awesome course. Steve Chong is really clear and builds up the material bit-by-bit, adding understanding about interesting and relevant features as the course progresses. You will have to be careful that you don't just learn the material by rote application; while this is certainly possible, you will have missed the point.\r\n\r\nDon't come in expecting to learn a bunch of programming languages. Expect instead to gain an understanding and appreciation for how various programming languages features and paradigms work, so that you can *pick up * any programming language you want with much greater ease.\r\n\r\nOverall, great class, highly recommended.","Great material, take if you are interested in intersection of mathematics and computer science.  Some experience with functional languages is helpful to have, for both the theory and application components of the course.  When learning about how languages are formed, being able to translate the abstract representation into a known language is helpful for thinking about the concepts.  Though an intro to OCaml and Haskell are provided in the section and resources of the course, for the programming assignments, it is definitely useful to be familiar with at least one of the languages.","The class is very fun and straight-forward.  The lectures are fun and Professor Chong is an incredible teacher.  He really views the course as a way to get people involved and excited about PL research, and the effort he puts into the course really makes it worthwhile.","Its a very tough course that is very well run. Although I didn't find the topic to be the most interesting, Prof Chong is one of the best lecturers I have ever taken a class with. The structure of the course is very well done. The content is very difficult.","Good class. The lack of practice problems for the exams makes them more difficult than they would be otherwise."]},"Spring '14":{"comments":["This is a rare course where the work never feels forced or pointless. That alone is enough to recommend it. Past that, the instructor is great, the course materials are incredibly thorough, and the material-- at least in my opinion-- is consistently interesting. Really a very good course.","152 is a fantastic course for those who are interested in programming languages.  Be warned though, this course is highly theoretical in nature, unlike its counterparts at many other universities.  Prof Chong is a wonderful professor who does a good job of presenting the material in a variety of ways.  The encyclopedic lecture notes are fantastic!  I thoroughly recommend this course for anyone who is interested in learning more about PL theory.","Professor Chong is one of the most invested CS professors in the Harvard department. Having taken 121, 124, and 127, I felt that the material in 152 was pretty straightforward. The course is well-organized and expectations are clear. Overall, if you're remotely interested in programming languages (specifically, what goes into the creation of a programming language) and have interests in math and CS theory, definitely shop it! Because Professor Chong is so engaging, I would try to take advantage of his openness, and done more out-of-classroom reading of current literature in PL and ask him questions about it.","The material is quite interesting and Chong is a very capable instructor. Be warned of the difficulty of the assignments, however; the later problem sets that include code implementations can take an eternity.","Very well organized class covering a wide array of analytical techniques for programming languages. Professor Chong is a great lecturer.","One of my favorite CS classes here. The first few weeks (right about up to the add-drop deadline actually) are pretty slow and not terribly interesting (though important to learn), which makes it hard to tell if you'll like the course. But lambda calculus and beyond is very very cool. So suck it up for the first couple inductive proofs and the inevitable complaints the TFs have with them, and get ready to learn very cool material.\r\n\r\nIt's hard to describe what the course is about, since PL is a specific topic in computer science (akin to algebra or analysis in math). But needless to say it has nothing to do with learning a lot of programming languages ;)\r\n\r\nMaterial is pretty tough but presented extremely well in both lectures and lecture notes.","Very good; challenging.","This is a fantastic class if you're interested in the formal mathematics of and the reasons behind the design choices in programming languages.  However, especially in the latter half of the semester, the practical applications are harder to see, so I'd recommend this course more for those who are interested in the material for its own sake.","This was an extremely well-run course. Professor Chong's enthusiasm for the material is very evident and contagious, the course notes are fantastic, and the assignments serve as great complements to the lectures. In addition, the course staff is helpful and accessible.","A marvelous introduction to the theory behind programming languages.","This class is excellent! Chong is a superb teacher and I think seeing lectures in person was worth it. The class was one of the most well-run in the CS department I've seen so far... problem sets are doable but informative, the lecture notes are great, and you get good feedback on your assignments. Programming languages is really fun!","The course is simply awesome. It is not about learning a bunch of different programming languages, but rather a theoretical approach to the topic. Prof. Chong is an incredibly good lecturer and his lecture notes are excellent. The most important thing is that for enjoying this course is that you need to be comfortable with discrete math style proofs (nothing extreme, but if you hate mathematical proofs and have always had trouble understanding induction then I'd be reluctant to recommending this course to you). The first half of the course had almost no programming, in the second half there was more of it. If you're ok with a bit of math, then I most definitely recommend taking this class - it was the best decision I could have made this semester. It is tempting not to go to class, because lecture videos are all online, but I do recommend going, otherwise prof. Chong will be sad.","This was an interesting class. Prof. Chong is a great guy, and I really enjoyed the problem sets. With that being said, you should probably only take the class if you're really interested in programming languages, not just as a random CS elective."]}},"mostRecentQ":{"overall":"4.50","workload":"2.60","difficulty":"3.40","recommendation":"4.60","enrollment":"25","response rate":"64.00","QCourseOverall":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"2","4s":"4","5s":"10"},"QDifficulty":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"0","3s":"11","4s":"4","5s":"1"},"QWorkload":{"number":"COMPSCI 152","course_id":"1237","cat_num":"6841","1s":"0","2s":"9","3s":"5","4s":"1","5s":"1"}},"success":true}