{"scores":{"Spring '11":{"course_score":{"overall":"4.31","workload":"1.56","difficulty":"2.28","recommendation":"4.53","enrollment":"76","response rate":"89.47","QCourseOverall":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"0","2s":"1","3s":"8","4s":"28","5s":"31"},"QDifficulty":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"8","2s":"34","3s":"25","4s":"1","5s":"0"},"QWorkload":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"33","2s":"32","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1017","cat_num":"1197","course_id":"958","year":"2010","term":"2","id":"807212da7d87a599335786ed90be70d5","first":"Jeffrey","last":"Miron","InstructorOverall":"4.49","EffectiveLecturesorPresentations":"4.61","AccessibleOutsideClass":"4.42","GeneratesEnthusiasm":"4.64","FacilitatesDiscussionEncouragesParticipation":"4.18","GivesUsefulFeedback":"4.22","ReturnsAssignmentsinTimelyFashion":"4.38"}]},"Spring '09":{"course_score":{"overall":"4.21","workload":"1.36","difficulty":"2.06","recommendation":"4.49","enrollment":"308","response rate":"86.36","QCourseOverall":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"0","2s":"1","3s":"8","4s":"28","5s":"31"},"QDifficulty":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"8","2s":"34","3s":"25","4s":"1","5s":"0"},"QWorkload":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"33","2s":"32","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1017","cat_num":"1197","course_id":"958","year":"2008","term":"2","id":"807212da7d87a599335786ed90be70d5","first":"Jeffrey","last":"Miron","InstructorOverall":"4.43","EffectiveLecturesorPresentations":"4.56","AccessibleOutsideClass":"4.17","GeneratesEnthusiasm":"4.51","FacilitatesDiscussionEncouragesParticipation":"3.92","GivesUsefulFeedback":"3.30","ReturnsAssignmentsinTimelyFashion":"3.98"}]},"Spring '07":{"course_score":{"overall":"3.76","workload":"1.10","difficulty":"2.17","recommendation":"4.13","enrollment":"197","response rate":"48.73","QCourseOverall":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"0","2s":"1","3s":"8","4s":"28","5s":"31"},"QDifficulty":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"8","2s":"34","3s":"25","4s":"1","5s":"0"},"QWorkload":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"33","2s":"32","3s":"3","4s":"0","5s":"0"}},"instructor_scores":[{"number":"ECON 1017","cat_num":"1197","course_id":"958","year":"2006","term":"2","id":"807212da7d87a599335786ed90be70d5","first":"Jeffrey","last":"Miron","InstructorOverall":"4.17","EffectiveLecturesorPresentations":"4.42","AccessibleOutsideClass":"4.51","GeneratesEnthusiasm":"4.34","FacilitatesDiscussionEncouragesParticipation":"4.24","GivesUsefulFeedback":"3.35","ReturnsAssignmentsinTimelyFashion":"4.37"}]}},"comments":{"Spring '09":{"comments":["interesting subject, not alot of coursework","Take it! The workload is reasonable, the lectures are good, and the material will blow your mind.","This class is amazing and will change the way you look at the U.S. Government and economic policy in general.","very interesting, low course requirements","It's easy to take, and the lectures are not boring.","Easy way to fulfill econ requirement.  Actually is thought-provoking as well.","Interesting, not hard, a good way to apply economics in all aspect of the society, and a good opportunity to understand the libertarian views (wether you agree with them or not)","It's a fun senior spring class - a minimum amount of work and interesting material.","Its easy but Miron is not a good teacher.","It's a fun course. You will learn a lot, but it is not well structured.","This is a painless, interesting, and thought-provoking class taught by a brilliant professor that will literally change how you think about policy.  However, beware what some call \"easy,\" because grading on the exams can be a little rough.","Miron is a phenomenal professor.  Don't let your Ec1010a impressions of him keep you from taking this class.","I would absolutely recommend this course. One of the best courses I took at Harvard. Fun, easy, entertaining, and relevent to the real world!","Interesting and painless as they say.","It is easy and interesting.","Interesting and straightforward","it's a very interesting class and will make you think of concepts in a totally new light. i've learned to evaluate things more carefully.","Interesting introduction to a useful topic.","Easy course. Fun material.","This class was really enjoyable and painless.  Professor Miron's lectures were great, and it was nice that he talked practically about whether policies could actually be implemented.","It's very easy and requires minimal work and is actually interesting.","This class is very interesting and applicable to many of the important contemporary debates in economics and politics.","Painless way to fulfill Econ requirement.","It's moderately easy with very little number of assignments.","No work required.","I did not find the topic very interesting at the end.","Awesome class.  Not terribly demanding and extremely important (in terms of policy issues, etc.)","This class has a light workload, but very important to keep up considering your whole grade comes from only a midterm and final.","This class will give you a great perspective on libertarianism and get you to think about many topics in a new light.","Take it only if you want to start thinking critically about economics and the economist's way of thinking.","this course might alter your future life\/ political views significantly","its itneresting","There is pretty much zero workload in this class.","very educational, you learn a lot about economics and politics","Very interesting, compelling lectures and not too much work","TAKE THIS CLASS! An AWESOME class!","So easy. Best class. Interesting","Painless class and interesting.","Easy, painless class!","interesting and easy!","Really great class, interesting, easy, only a little work. Take it pass\/fail and write the paper if you need to fulfill a writing requirement.","Not much work, but even if you memorize everything you may not do well (it's kind of a crapshoot)","you just have to read the lecture slides in preparation for exams.","This course is a great way to put economic theory learned in previous courses to use in considering how an economist might run (or scale back) the government.","Interesting approach to policy, very easy","You will learn a new perspective on life!","This was a good course taught by someone well-versed in the subject matter and enthusiastic","Interesting topics, well-taught by enthusiastic professor, not difficult.","Best and most useful economics class at Harvard!","This class is a lot of fun, doesn't take much time, and will teach you the most important things.","it gives you a whole new and refreshing perspective on public policy","Take it basically for a senior class.","Professor Miron is one of the best lecturers that I've had in my four years at Harvard, and you can tell that he's passionate about libertarianism and the policy issues that he discusses. His arguments have the effect of making you think about current issues in a totally different light.","An easy but still very interesting class.  While it teaches you how to think from a libertarian perspective, it is perhaps even more useful for simply exposing you to all of the various economic\/political\/moral issues of our time.","It's great to hear the Libertarian perspective and be challenged by it.  It's usually correct, but it's great cause all the liberal kids who have never been challenged on their views get super uncomfortable","Great class, learn a lot, manageable courseload, very enjoyable","This class is interesting with a light workload. It serves as a great introduction to Libertarian thought and is pertinent to modern political and economic debates.","its a good class, take it","Professor Miron is very enthusiastic about the material, which is really refreshing.","Keep up with the lecture notes, and try to go to class. It's interesting.","Painless way to fulfill requirement, and you learn interesting material along the way.","Take this class!! You will not regret it. Very interesting and thought provoking.","Best class I have taken","Be careful, you'll end up a libertarian for the most part by the end of the course!","Take it!","Learn REAL economics. Take this class.","It is sweet\/worthwhile.","You will learn to how think economically.  You will see the role of government very differently.","Great way to see many issues in a different light. It is always good to challenge your notions and try and evaluate them on cost benefit grounds. I  will forever think differently about many issues. You win Miron.","It is a great way to gain exposure to the economic analysis of government policies.","Easy class, interesting.","Yes","Its fun to discuss topics you know from an entirely different perspective.","The lack of sections and regularly scheduled work make this course pretty easy to take lightly.  If you're looking for an easy senior spring elective, this would be a good choice, particularly if you're at all interested in libertarianism and the intersection of economics and public policy.  On the other hand, this is definitely not the most fulfilling or challenging intellectual experience I have had here.","Great class!","Just don't take it. Worst class I've ever been in; boring, frustrating, with an ass for a professor.","super easy and super interesting, jeffrey miron is GREAT","Ec1017 is a very interesting class if you want to be exposed to political\/social thought that runs contrary to anything you may have encountered before. Miron is intelligent but not overbearing in his viewpoint.","Don't bother attending lecture unless you have time to do so. The lecture notes are great and there are only 2 exams.","The course is very interesting but does not require much effort.","This class prepared me, more than any other class I've taken at Harvard, to be a conscientious voter.","It's a very easy course, but it also requires you to argue things you might disagree with.","Very easy-going professor. Both midterm and Final make up your entire grade, but both are relatively straightforward if you've been to lecture and done the work. Definitely a good class to take here at Harvard.","Ask Prof. Miron questions in class...it makes it more interesting and he actually enjoys conversations and challenges. If you don't mind feeling a little like a slacker, this is a great course.","This is a very, very good class.","This is a very easy course. It strikes me more as a moral reasoning\/core class for cost-benefit analysis than an Economics Department class.","GReat class. Interesting and easy. As good as it gets.","Really interesting to learn about, not a lot of work.","This is a good, low work, highly didactic course.","This class is exceptionally easy and also enjoyable - Miron is a great lecturer and you should actually take advantage of coming to class (which few people do).","Lectures are worth attending, Miron is enthusiastic and knowledgeable.","Easy econ elective. Period.","you will not regret this decision","This course is extremely interesting from the stand point of understanding the intersection between policy and economics. I think you have to be aware that Professor Miron is an obvious Libertarian, but he does a pretty good job separating his opinions from the other arguments. He uses basic economic terms and concepts, but most of it just learning how to critically think about policy and its positive and negative effects.","It is a fantastic elective if the libertarian perspective has ever interested you.","It is an incredible course that will change your way of thinking about politics and important Economics issues. I would recommend doing most of the readings as they are a great complement to the lectures.","This course may seem easy because of the lack of assignments, but if you're really trying to learn, go to every lecture and actually attempt the readings.","It was a fantastic course. It made me seriously consider reshaping my views on both economic and social issues and made me more thoughtful and informed when discussing political and social issues with others.","It's a painless way to learn a lot about many very relevant issues today.","manageable workload, very, very interesting.","One of the most interesting economic classes I have taken at Harvard.","no feedback"]},"Spring '11":{"comments":["You don't have to class. The class would be more effective if the papers and section were based on the lectures (they have the same theme, but you can do the papers and section work without going to class).","A thought-provoking, manageable, and interesting class. Terrrific in every sense of the word!","GREAT CLASS! One of my favorite courses at Harvard. An ec elective gem!","Professor Miron is a terrific lecturer and passionate instructor.  He knows the material well and engages in thoughtful and deliberate debate.  I wish he was keeping up his blog in the future!","It is a fairly easy, straightforward class in terms of concepts though there is a lot of work.  Be prepared to have a few big assignments.","fun and easy","Most college students these days are libertarians, they just don't know it yet.  If you're unfamiliar with the libertarianism, Ec1017 is a really good way to start thinking about some of the main issues.","You will learn a lot about Libertarianism in this class. You may not agree with this approach, but you will learn about a very interesting viewpoint nonetheless.","The class is very easy, but the papers to require some work. There are only three so really that's only three weekends out of the semester that will be spent on a paper, and no assignments otherwise. Just going to class and listening to him talk. His ideas are pretty interesting too. He's probably right about a lot","This class is interesting and gives a very different logical view about the government. While not everyone may agree with the conclusions drawn, the discussions during the lectures are very informative and lively.","Even if it doesn't make you a libertarian, this class will change the way you see the world. Miron is a genius and is fun to listen to. The papers are actually fun to right and go by really quickly. You get a ton of guidance on them.","Broadens your views on common topics. Makes you a smarter person, honestly.","Fantastic class. The lectures are interesting, insightful, and actually useful. You will talk about Miron's lectures with your friends, family, etc. Definitely worth taking.","Great way to complete the economics writing requirement.  Easy economics elective.","Awesome!","It's a lot of fun, you get to learn about a lot of important current issues from a different perspective.","The lecture slides are great and you can learn everything from just reading them but you should go to the class because Jeff Miron is awesome","One of the best classes ever. Prof. Miron is a great, engaging lecturer. Even if you don't agree with libertarian viewpoint, you should totally take this class- it's great getting to know this particular point of view. Painless and fun but informative -- maybe not the greatest eye opener, but if you need a class that's kind of a break, you should definitely take it.","Go to office hours with Miron! He's awesome.","Hands down one of my top 3 favorite courses at harvard. Miron is the best","amazing class. amazing professor. amazing subject. work may be a little bit intense when essays are due, but other than that, fantastic.","Super interesting class","The course is definitely worth taking to gain an overview of current American social and economic policies as well as rethink many of these policies. You don't have to agree with libertarianism at all to rethink a lot of government intervention. Grading system was a little arbitrary with little weight placed on attending lecture and understanding libertarian perspective- most is placed on writing ability.","This is the perfect capstone class in every sense of the term: comprehensive, clear, accessible, and not too taxing. You'll walk away feeling like you spent your time well.","This course is great. The material is very insightful and relevent to ongoing debates. The papers are tad bit long; however, after the first paper, the following ones become easier to write.","This is a great class to get you thinking like an economist and consider policies in a different way","This class is laid back and very engaging. The lectures all follow the same format so it is easy to follow and the lecture notes are very detailed, which makes reviewing for the final a little bit easier.","Papers can be a pain, but all in all a decently interesting class that is completely manageable.","This course gives you a very interesting perspective on many hot-topic issues.  This is a great economics elective.","very low day-to-day commitment"]}},"mostRecentQ":{"overall":"4.31","workload":"1.56","difficulty":"2.28","recommendation":"4.53","enrollment":"76","response rate":"89.47","QCourseOverall":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"0","2s":"1","3s":"8","4s":"28","5s":"31"},"QDifficulty":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"8","2s":"34","3s":"25","4s":"1","5s":"0"},"QWorkload":{"number":"ECON 1017","course_id":"958","cat_num":"1197","1s":"33","2s":"32","3s":"3","4s":"0","5s":"0"}},"success":true}