{"scores":{"Fall '13":{"course_score":{"overall":"4.00","workload":"1.30","difficulty":"2.10","recommendation":"4.10","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 49y","course_id":"10850","cat_num":"4686","1s":"0","2s":"0","3s":"3","4s":"5","5s":"3"},"QDifficulty":{"number":"FRSEMR 49y","course_id":"10850","cat_num":"4686","1s":"1","2s":"8","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 49y","course_id":"10850","cat_num":"4686","1s":"9","2s":"1","3s":"1","4s":"0","5s":"0"}},"instructor_scores":[{"number":"FRSEMR 49y","cat_num":"4686","course_id":"10850","year":"2013","term":"1","id":"ef8dd6205fc4f0d91a44b7c65bf603ad","first":" Harry R.","last":"Lewis","InstructorOverall":"4.10","EffectiveLecturesorPresentations":"3.80","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.20","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"3.60","ReturnsAssignmentsinTimelyFashion":"4.10"}]}},"comments":{"Fall '13":{"comments":["If you're interested in sports, especially college sports, and would like to learn about the past, present, and perceivable future of amateur athletics, this is a rocking good time.","If you are interested in college sports, this is a good class to take. The majority of the class revolves around the morality of college sports and its history. The class is mostly discussion-based, so you'll hear a lot of different opinions from the people around you. Be ready to participate, but there's not too much of a workload.","If you have any interest in the business of sports or behind the scenes of college sports or just college sports in general, this is a great seminar. I don't really encourage taking a seminar because you could be taking something just as interesting to actually fulfill a concentration or GenEd requirement, but if you are going to take a seminar and you have an interest in college sports, this one is for you.","Requires a lot of focus","This class was really fun! It was extremely low stress, as most seminars are, and I became good friends with most of my class. If you like sports I would definitely consider taking this course. It gives a whole new perspective to the meaning of college athletics. I never would have thought this topic was so extensively argued, but there's a lot of people who have a lot to say about it!","It's an interesting topic, and if you like that kind of stuff some of the work (the part that isn't esoteric readings from 100 years ago) doesn't seem like work at all","This is a really great freshman seminar. The topic is thought-provoking and relevant to the lives of college students, and it was really cool to be able to talk about it with Professor Lewis and our guest speakers who have so much experience thinking about sports."]}},"mostRecentQ":{"overall":"4.00","workload":"1.30","difficulty":"2.10","recommendation":"4.10","enrollment":"11","response rate":"100.00","QCourseOverall":{"number":"FRSEMR 49y","course_id":"10850","cat_num":"4686","1s":"0","2s":"0","3s":"3","4s":"5","5s":"3"},"QDifficulty":{"number":"FRSEMR 49y","course_id":"10850","cat_num":"4686","1s":"1","2s":"8","3s":"2","4s":"0","5s":"0"},"QWorkload":{"number":"FRSEMR 49y","course_id":"10850","cat_num":"4686","1s":"9","2s":"1","3s":"1","4s":"0","5s":"0"}},"success":true}