{"scores":{"Spring '14":{"course_score":{"overall":"4.20","workload":"2.60","difficulty":"3.60","recommendation":"4.30","enrollment":"16","response rate":"75.00","QCourseOverall":{"number":"BE 125","course_id":"1219","cat_num":"3169","1s":"0","2s":"0","3s":"2","4s":"5","5s":"5"},"QDifficulty":{"number":"BE 125","course_id":"1219","cat_num":"3169","1s":"0","2s":"0","3s":"6","4s":"5","5s":"1"},"QWorkload":{"number":"BE 125","course_id":"1219","cat_num":"3169","1s":"2","2s":"4","3s":"4","4s":"1","5s":"1"}},"instructor_scores":[{"number":"BE 125","cat_num":"3169","course_id":"1219","year":"2013","term":"2","id":"a4f240a0860801ed6a9b7db522115864","first":" David","last":"Mooney","InstructorOverall":"4.40","EffectiveLecturesorPresentations":"4.20","AccessibleOutsideClass":"4.20","GeneratesEnthusiasm":"4.50","FacilitatesDiscussionEncouragesParticipation":"4.20","GivesUsefulFeedback":"4.10","ReturnsAssignmentsinTimelyFashion":"4.50"}]},"Spring '13":{"course_score":{"overall":"4.33","workload":"2.67","difficulty":"3.44","recommendation":"4.44","enrollment":"10","response rate":"90.00","QCourseOverall":{"number":"BE 125","course_id":"1219","cat_num":"3169","1s":"0","2s":"0","3s":"2","4s":"5","5s":"5"},"QDifficulty":{"number":"BE 125","course_id":"1219","cat_num":"3169","1s":"0","2s":"0","3s":"6","4s":"5","5s":"1"},"QWorkload":{"number":"BE 125","course_id":"1219","cat_num":"3169","1s":"2","2s":"4","3s":"4","4s":"1","5s":"1"}},"instructor_scores":[{"number":"BE 125","cat_num":"3169","course_id":"1219","year":"2012","term":"2","id":"a4f240a0860801ed6a9b7db522115864","first":" David","last":"Mooney","InstructorOverall":"4.67","EffectiveLecturesorPresentations":"4.67","AccessibleOutsideClass":"4.00","GeneratesEnthusiasm":"4.56","FacilitatesDiscussionEncouragesParticipation":"4.25","GivesUsefulFeedback":"3.88","ReturnsAssignmentsinTimelyFashion":"4.12"}]}},"comments":{"Spring '13":{"comments":["The lab component of the course is a LOT of work, especially toward the end, when you are responsible for designing your own experiment. For the rest of the class, though, the work is consistent but definitely do-able. Expect to learn to think critically about papers and to question procedures and results that come from research. Also expect to become much more knowledgeable about current research techniques and demands. Be ready to give presentations in class about papers and\/or project proposals.","Excellent course. Prof. Mooney is a great professor and you will learn a lot from this course","The class can be demanding at times, and there is usually always something due, but it is manageable, interesting, and rewarding.","Prof Mooney is an awesome teacher, learning feels organic and mature. The lab component of the class is a lot of work, but is very rewarding and prepares you well for an internship or job in tissue engineering. the class is mostly project based, so some weeks are a lot more work than others, but the week to week work is minimal and overall the class is definitely more manageable than other es course."]},"Spring '14":{"comments":["This course will give you the opportunity to explore Tissue Engineering with one of the leaders of the field. This has been among my favorite classes at Harvard, especially because of its incorporation of recent research in this area.","The course is really interesting and you learn a lot of fascinating material. However, it is difficult to know how well you understand the material because there are no practice problems to work on.","This is an excellent course. Dave Mooney is a FANTASTIC professor, being extremely knowledgable and helpful with feedback. The lab component is very demanding, but other than that there is not too much of a workload.","This is a good chance to get to know a professor well and have some fun with lab work!","this is a great class, at least when Prof. Mooney is teaching it.  The material is interesting and not too difficult, but there is a lot of work. Don't underestimate the lab component - we ran often ran late, had to repeat experiments, and you will have to come in for a short period of time on some days to maintain the cells. From the journal club assignments, lab\/proposal presentations, and the midterms, you really come out of the class with skills as well as the knowledge","The material presented in the course is very exciting, and Mooney is an awesome instructor. \r\nI took the course mainly to gain experience in the lab and gain biological intuition. I've got what I came for, but often times it felt meaningless.","This is a great course, and although it is not exceptionally difficut, it is very time consuming.  Choose wisely during the beginning of the semester whether to do the lab or the proposal.  The lab requires a lot of extra hours during the week, but is less intense during the final weeks of the semester, while the proposal is more spread out work-wise but gets intense at the end.  Make sure to do the journal club responses carefully and thoroughly because it will really help you n preparing your own journal club presentation and for the exams.","The journal clubs are really interesting to read. Doing the proposal is very worthwhile and it's interesting to see how much you learn and how much you learn about your field and how much your proposal over the course of the semester. Working with two other people is very worthwhile and you learn a lot when bouncing ideas off each other.","Be prepared to put in time, not just for the assignments, but also to approach issues in a new way (more like a lab\/grad school than a regular class)","This course is probably the best class ive taken at Harvard. Mooney is a very effective lecturer and while he doesnt stand for nonsense hes very good at pinpointing the missing link in your understanding. The format of this class really made me interact with thr whoe world Of tissue engineering instead of just the maetrial presented in class"]}},"mostRecentQ":{"overall":"4.20","workload":"2.60","difficulty":"3.60","recommendation":"4.30","enrollment":"16","response rate":"75.00","QCourseOverall":{"number":"BE 125","course_id":"1219","cat_num":"3169","1s":"0","2s":"0","3s":"2","4s":"5","5s":"5"},"QDifficulty":{"number":"BE 125","course_id":"1219","cat_num":"3169","1s":"0","2s":"0","3s":"6","4s":"5","5s":"1"},"QWorkload":{"number":"BE 125","course_id":"1219","cat_num":"3169","1s":"2","2s":"4","3s":"4","4s":"1","5s":"1"}},"success":true}